{
    "foundational": true,
    "admin": "CS",
    "Overview": "Introduction to Health Informatics (CS 6440) is designed so that students with a variety of backgrounds can gain basic proficiency in health informatics. Health informatics encompasses the application of computing to: healthcare delivery; population and public health; community-based clinical research; and the potential for big data and analytics to transform the field. This is distinct from the related field of bioinformatics, which explores the role of computing in understanding the genomic and proteomic processes within cells.",
    "Sample Syllabus": "Sample syllabus(PDF)",
    "Course Videos": "You can view the lecture videos for this coursehere.",
    "Before Taking This Class...": "Students must have a basic computer science background and be proficient in modern programming languages. Most of the tools utilized in the course are Java or Python based, with one lab working in TypeScript using React. All lab code is simplified and does not require advanced knowledge in one particular programming language, with the focus on the healthcare applications and data standards. Labs and tools may utilize Docker for deployment, though advance knowledge is not required. Team projects can vary significantly, with students often allowed to work in their strengths or learn new libraries/frameworks (e.g., React, Angular, Python APIs, etc.). While not required, familiarity with web application deployment may be beneficial for projects. No previous knowledge of health informatics is required. Any student qualified enough to be admitted to OMSCS—and willing to put in the necessary time for course work—should be prepared for this course.",
    "Suggested Background Knowledge": "Students must have a basic computer science background and be proficient in modern programming languages. Most of the tools utilized in the course are Java or Python based, with one lab working in TypeScript using React. All lab code is simplified and does not require advanced knowledge in one particular programming language, with the focus on the healthcare applications and data standards. Labs and tools may utilize Docker for deployment, though advance knowledge is not required. Team projects can vary significantly, with students often allowed to work in their strengths or learn new libraries/frameworks (e.g., React, Angular, Python APIs, etc.). While not required, familiarity with web application deployment may be beneficial for projects. No previous knowledge of health informatics is required. Any student qualified enough to be admitted to OMSCS—and willing to put in the necessary time for course work—should be prepared for this course.",
    "Technical Requirements and Software": "Georgia Tech's Office of Student Computer Ownership issuesminimum hardware requirementsto incoming undergraduates; you should meet or exceed these guidelines.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}