{
    "course-name": "cs-6210-advanced-operating-systems",
    "foundational": true,
    "admin": "CS",
    "Overview": "Advanced Operating Systems is a graduate-level course that addresses a broad range of topics in operating system design and implementation, including:\n- Operating system structuring\n- Synchronization, communication and scheduling in parallel systems\n- Distributed systems, their communication mechanisms, distributed objects and middleware\n- Failures and recovery management\n- System support for Internet-scale computing",
    "Preview": "",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Suggested Background Knowledge": "CS 2200offers a good preparation for the pre-requisites assumed in this course. To access Prof. Ramachandran's on-campus lecture recordings for CS 2200, visit theGT Computing Youtube channel for CS 2200.",
    "Technical Requirements and Software": "\n- Hardware RequirementsYou will need a machine which supports VT-X or AMD-V.  i.e. machines that run on i3, i5 or, i7 and later Intel processors ORAthlon 64 X2, 64 FXand later for AMD processors. Apple M1/M2 is currently not supported.You will need a minimum of 8GB RAM.\n- You will need a machine which supports VT-X or AMD-V.  i.e. machines that run on i3, i5 or, i7 and later Intel processors ORAthlon 64 X2, 64 FXand later for AMD processors. Apple M1/M2 is currently not supported.\n- You will need a minimum of 8GB RAM.\n- Software RequirementsBrowser and connection speed: An up-to-date version of Chrome is required. We use proctoring software Honorlock for our examinations and it currently only supports Chrome. 2+ Mbps is recommended.Operating system:PC: Windows 10 or higher with latest updates installedMac: OS X 10.9 or higher with latest updates installed. We do not support M1/M2 Macs.Linux: any recent distribution that has the supported browsers installedMS Teams will be used for office hours.\n- Browser and connection speed: An up-to-date version of Chrome is required. We use proctoring software Honorlock for our examinations and it currently only supports Chrome. 2+ Mbps is recommended.\n- Operating system:PC: Windows 10 or higher with latest updates installedMac: OS X 10.9 or higher with latest updates installed. We do not support M1/M2 Macs.Linux: any recent distribution that has the supported browsers installed\n- PC: Windows 10 or higher with latest updates installed\n- Mac: OS X 10.9 or higher with latest updates installed. We do not support M1/M2 Macs.\n- Linux: any recent distribution that has the supported browsers installed\n- MS Teams will be used for office hours.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}