{
    "course-name": "cs-6310-software-architecture-and-design",
    "foundational": true,
    "admin": "CS",
    "Overview": "Software Architecture and Design will provide students with the principles and concepts involved in the analysis and design of large software systems. The learning objectives for the course are the following:\n- Understand and apply object-oriented design techniques\n- Develop and evaluate software architectures\n- Select and use appropriate architectural styles\n- Select and use appropriate software design patterns\n- Express the specifications and design of an application using UML\n- [Time Permitting] Discuss related issues (e.g., formal design language with OCL)",
    "Course Goals": "This course teaches the principles and concepts involved in the analysis and design of large software systems. After completing this course, a student should have obtained the skills and knowledge necessary to accomplish the following:\n- Express the analysis and design of an application using UML\n- Specify functional semantics of an application using OCL\n- Specify and evaluate software architectures\n- Select and use appropriate architectural styles\n- Understand and apply object-oriented design techniques\n- Select and use appropriate software design patterns\n- Understand and perform a design review",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Videos": "You can view the lecture videos for this coursehere.",
    "Suggested Background Knowledge": "If you answer \"no\" to any of the following questions, it may be beneficial to refresh your knowledge of this material prior to taking CS 6310:",
    "Technical Requirements and Software": "\n- You will be provided a virtual container to setup locally and use while in this course.\n- In addition, you are expected to have screen and voice capture software available to you for submitting demo materials. The class resources page provides suggested tools.\n- Browser and connection speed: An up-to-date version of Chrome or Firefox is strongly recommended. We also support Internet Explorer 9 and the desktop versions of Internet Explorer 10 and above (not the metro versions). 2+ Mbps is recommended; the minimum requirement is 0.768 Mbps download speed.\n- Operating system:PC: Windows XP or higher with latest updates installedMac: OS X 10.6 or higher with latest updates installedLinux: any recent distribution that has the supported browsers installed\n- PC: Windows XP or higher with latest updates installed\n- Mac: OS X 10.6 or higher with latest updates installed\n- Linux: any recent distribution that has the supported browsers installed",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}