{
    "foundational": true,
    "admin": "CS",
    "Overview": "Software Architecture and Design will provide students with the principles and concepts involved in the analysis and design of large software systems. The learning objectives for the course are the following:",
    "Course Goals": "This course teaches the principles and concepts involved in the analysis and design of large software systems. After completing this course, a student should have obtained the skills and knowledge necessary to accomplish the following:",
    "Sample Syllabi": "Summer 2023 syllabus and schedule(PDF)Spring 2023 syllabus and schedule(PDF)Fall 2022 syllabus and schedule(PDF)",
    "Course Videos": "You can view the lecture videos for this coursehere.",
    "Before Taking This Class...": "To undertake this course you should either have successfully taken an undergraduate software engineering course or CS 6300. Alternatively, if you have significant experience actually developing industrial software, you should be fine. You will be required to implement some of your designs using Java, so this course assumes competence with Java programming and knowledge of object-oriented techniques. There are videos available on the class resources page to refresh your knowledge of these two topics.",
    "Suggested Background Knowledge": "To undertake this course you should either have successfully taken an undergraduate software engineering course or CS 6300. Alternatively, if you have significant experience actually developing industrial software, you should be fine. You will be required to implement some of your designs using Java, so this course assumes competence with Java programming and knowledge of object-oriented techniques. There are videos available on the class resources page to refresh your knowledge of these two topics.",
    "Technical Requirements and Software": "Though the absolute minimum requirements are shown above, we highly recommend that you use an Operating System and Web Browser that are relatively recent, to ensure that your experience while working with the various software applications in the course (e.g., Integrated Development Environments, Virtual Machines) is as smooth as possible.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}