{
    "course-name": "cs-6475-computational-photography",
    "foundational": true,
    "admin": "CS",
    "Overview": "More information is available on theCS 6475 course website.",
    "Course Goals": "This class explores how computation impacts the entire workflow of photography, which is traditionally aimed at capturing light from a (3D) scene to form an (2D) image. Over the span of the semester, students will learn:\n- To think about images as multi-dimensional arrays on which mathematical operations can be performed to generate interesting artifacts\n- The technical aspects of image capture and rendering, and exploration of how such a medium can be used to its maximum potential\n- To mathematically model a camera as a device that maps a 3D space onto a 2D plane\n- How the traditional camera pipeline can be transformed by changing the sensor, illumination, lens, etc.",
    "Preview": "",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Technical Requirements and Software": "\n- Internet connectivity\n- Camera (preferably one with granular control over aperture, shutter speed, and ISO)\n- Operating system:PC: Windows 8 or higherMac: OS X 10.15 or higher with latest updates installedLinux: any recent distribution will work so long as you can install Python and OpenCV bindings\n- PC: Windows 8 or higher\n- Mac: OS X 10.15 or higher with latest updates installed\n- Linux: any recent distribution will work so long as you can install Python and OpenCV bindings\n- Anaconda",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}