{
    "course-name": "cs-6476-computer-vision",
    "foundational": true,
    "admin": "CS",
    "Overview": "In general we will not make use of image and vision libraries until first understanding (and often coding) the basic methods. You should be comfortable writing code that reflects mathematics, coding a variety of data structures, and comparing them to evaluate different hypotheses.",
    "Preview": "",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Suggested Background Knowledge": "\n- Students should have a working knowledge of Python for doing mathematical programming. All assignments will be in Python using the OpenCV system as the backend. For those familiar with programming in general, they should be able to pick it up on their own. However, it should be emphasized that this course is not about learning to program, but using programming to experiment with Computer Vision concepts.\n- This course has more math than many CS courses: linear algebra, vector calculus, linear algebra, probability, and linear algebra. (Get the hint?)\n- No prior knowledge of vision is assumed. Some experience with programming with images is helpful. Experience with any image/signal processing will also be informative.",
    "Technical Requirements and Software": "\n- At least 32GB of available disk space and ability to install additional (free) software. For course projects, you will need to install the Oracle VirtualBox VM and run a Linux virtual machine that contains the setup for the project. Although it is possible to install the software for the projects natively in Linux, such a setup will not be supported.\n- Browser and connection speed: An up-to-date version of Chrome or Firefox is strongly recommended. We also support Internet Explorer 9 and the desktop versions of Internet Explorer 10 and above (not the metro versions). 2+ Mbps is recommended; the minimum requirement is 0.768 Mbps download speed.\n- Operating system:PC: Windows XP or higher with latest updates installedMac: OS X 10.6 or higher with latest updates installedLinux: any recent distribution that has the supported browsers installed\n- PC: Windows XP or higher with latest updates installed\n- Mac: OS X 10.6 or higher with latest updates installed\n- Linux: any recent distribution that has the supported browsers installed",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}