{
    "course-name": "cs-6291-embedded-systems-optimization",
    "foundational": true,
    "admin": "CS",
    "Overview": "Part I: Embedded Processor Architectures",
    "Course Goals": "\n- To understand the tight coupling and synergies that exist between hardware and software in embedded processors and that are exposed through the abstraction of instruction sets including DSPs, VLIWs, etc.\n- To understand machine specific features (such as data paths, register and memory banks) of the underlying processor and machine specific code optimizations based on them for high performance, compact code and low energy.",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Suggested Background Knowledge": "It is recommended that students who take this course have previously taken at least an undergraduate-level course in computer architecture. In addition, students must have a strong background in C and/or C++. A basic to intermediate understanding of Python, and basic knowledge of git, are required.",
    "Technical Requirements and Software": "\n- Browser and connection speed: An up-to-date version of Chrome or Firefox is strongly recommended. 2+ Mbps is recommended.\n- Operating system:PC: Windows 7 or higherMac: OS X 10.10.5 or higherMinimum of 2 GB free spaceDual-core 2.4 GHz CPU or betterWebcam resolution of 800x600 or betterWorking microphone\n- PC: Windows 7 or higher\n- Mac: OS X 10.10.5 or higher\n- Minimum of 2 GB free space\n- Dual-core 2.4 GHz CPU or better\n- Webcam resolution of 800x600 or better\n- Working microphone\n- Virtual Machine: You will be using Vagrant along with Virtualbox to provide a consistent environment for development and grading which every assignment uses. Details for downloading and installing the Vagrant system are located on the course github.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}