{
    "course-name": "cs-6262-network-security",
    "foundational": true,
    "admin": "CS",
    "Overview": "Topics to be covered in CS 6262 include:\n- Introduction and review of networking and security basics\n- Large-scale attacks and impactsDDoSMalware-based attacks, phishing/frauds, underground economy/infrastructures\n- DDoS\n- Malware-based attacks, phishing/frauds, underground economy/infrastructures\n- Penetration testing and security assessmentsBasic techniques and toolsSocial engineering and human factors\n- Basic techniques and tools\n- Social engineering and human factors\n- Security in Internet protocols: IP, TCP, DNS, and BGPVulnerabilities in TCP/IPDNS cache poisoning and DNSSECBGP Security\n- Vulnerabilities in TCP/IP\n- DNS cache poisoning and DNSSEC\n- BGP Security\n- Advanced web securityWeb security modelDefenses against attacks on web applicationsHTTPS: goals and pitfallsContent security policies and web workers\n- Web security model\n- Defenses against attacks on web applications\n- HTTPS: goals and pitfalls\n- Content security policies and web workers\n- Advanced malware analysisEvasive malware, APTMobile malware\n- Evasive malware, APT\n- Mobile malware\n- Advanced network monitoringBotnet detection (BotHunter and BotMiner)\n- Botnet detection (BotHunter and BotMiner)\n- Internet-scale threat analysisMapping the Internet, e.g., Z-mapDomain/network reputation\n- Mapping the Internet, e.g., Z-map\n- Domain/network reputation\n- Bitcoins and crypto-currenciesBasics of blockchains and bitcoinsNew/emerging technologies\n- Basics of blockchains and bitcoins\n- New/emerging technologies\n- Big data and securityBig data for security: applying machine learning to security analytics, e.g., building detection modelsSecurity of big data, in particular, adversarial machine learning: poisoning of input/training data and evasion of learned modelsExamples in malware analysis as well as web searches\n- Big data for security: applying machine learning to security analytics, e.g., building detection models\n- Security of big data, in particular, adversarial machine learning: poisoning of input/training data and evasion of learned models\n- Examples in malware analysis as well as web searches\n- Cloud security“Property-preserving” encryption: goals and pitfallsOblivious RAMVirtual-machine security\n- “Property-preserving” encryption: goals and pitfalls\n- Oblivious RAM\n- Virtual-machine security\n- Attack-tolerant systemsSecret-sharingByzantine fault-tolerant systemsAttack tolerance via diversification\n- Secret-sharing\n- Byzantine fault-tolerant systems\n- Attack tolerance via diversification",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Suggested Background Knowledge": "It is recommended that you have taken CS 6035: Introduction to Information Security, or an equivalent class.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}