{
    "course-name": "cs-6400-database-systems-concepts-and-design",
    "foundational": true,
    "admin": "CS",
    "Overview": "We believe in learning-by-example and learning-by-doing. This course presents an example of applying a database application development methodology to a major real-world project. All the database concepts, techniques, and tools that are needed to develop a database application from scratch are introduced along the way when they are needed. In parallel - slightly delayed - learners in the course will apply the database application development methodology, techniques, and tools to their own major class team project. Students will also learn the Extended Entity Relationship Model, the Relational Model, Relational algebra, calculus and SQL, database normalization, efficiency, and indexing. Finally, techniques and tools for metadata management and archival will be presented.",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Suggested Background Knowledge": "Learners should be familiar with at least one scripting or programming language, e.g., PHP, Python, Java. Some familiarity with software engineering concepts and Git/source control will be helpful. Willingness to learn basic system administration tasks is necessary. Flexibility and readiness to work remotely with team members is a must.",
    "Technical Requirements and Software": "See theCollege of Computing's technical requirements.​",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}