{
    "foundational": true,
    "admin": "CS",
    "Overview": "Students should be familiar with college-level mathematical concepts (calculus, analytic geometry, linear algebra, and probability) and computer science concepts (algorithms, O notation, data structures). In addition to this, students should have working knowledge of computer programming; the course will focus on using Python for its programming assignments.",
    "Sample Syllabi": "Fall 2024 syllabus(PDF)Spring 2024 syllabus(PDF)Fall 2022 syllabus",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Before Taking This Class...": "You should have completed undergraduate computer algorithm and data structures courses that cover O notation, time and space constraints. You should have working knowledge of college level mathematics such as calculus, probability, and linear algebra. You will also need to be familiar with Python and be comfortable making modifications to large programs.",
    "Suggested Background Knowledge": "You should have completed undergraduate computer algorithm and data structures courses that cover O notation, time and space constraints. You should have working knowledge of college level mathematics such as calculus, probability, and linear algebra. You will also need to be familiar with Python and be comfortable making modifications to large programs.",
    "Technical Requirements and Software": "Your system must be able to install the latest release of Python 3.7. Please check theofficial documentationfor more information.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}