{
    "foundational": true,
    "admin": "CS",
    "Overview": "Cognitive science is an interdisciplinary study of mind and intelligence lying at the intersection of artificial intelligence, psychology, neurobiology, education, linguistics, anthropology, and philosophy. In this course, students are introduced to the basic concepts, hypotheses, models, methods, issues, and debates in cognitive science. The course will cover the main information-processing paradigms in cognitive science as well as the main critiques of the paradigms. The knowledge and understanding acquired through this course will inform students' subsequent work in human-centered computing, information system design, digital media, educational technology, design computing, human-robot reaction, and more.",
    "Course Goals": "Cognitive science is an interdisciplinary study of mind and intelligence. The core question is how does the mind work? Cognitive science lies at the intersection of computer science (especially artificial intelligence), psychology, biology (especially neurobiology), education, linguistics, anthropology, and philosophy. The main learning goal of the course is an introduction to the basic concepts, hypotheses, models, methods, issues, and debates in cognitive science.",
    "Sample Syllabus": "Fall 2024 syllabus(PDF)Summer 2024 syllabus(PDF)Spring 2024 syllabus(PDF)",
    "Before Taking This Class...": "This class does not have significant prerequisites before participation. In lieu of readiness questions, the following bullet points describe the tasks you will complete as part of this class; you may use this description of tasks to evaluate your readiness to take this class.",
    "Suggested Background Knowledge": "This class does not have significant prerequisites before participation. In lieu of readiness questions, the following bullet points describe the tasks you will complete as part of this class; you may use this description of tasks to evaluate your readiness to take this class.",
    "Technical Requirements and Software": "Browser and connection speed: An up-to-date version of Chrome or Firefox is strongly recommended. We also support Internet Explorer 9 and the desktop versions of Internet Explorer 10 and above (not the metro versions). 2+ Mbps is recommended; the minimum requirement is 0.768 Mbps download speed.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}