{
    "foundational": true,
    "admin": "CS",
    "Overview": "This is a graduate Machine Learning Series, initially created by Charles Isbell (University of Wisconsin-Madison) and Michael Littman (Brown University) where the lectures are Socratic discussions on the material. The course is lead by TJ LaGrow (Georgia Tech) with significant refactoring and refurbishment.",
    "Preview": "",
    "Course Overview": "",
    "Sample Lesson": "",
    "Sample Syllabus": "Fall 2024 syllabus(PDF)Summer 2024 syllabus(PDF)Spring 2023 syllabus(PDF)",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Before Taking This Class...": "An introductory course in artificial intelligence is recommended but not required. To discover whether you are ready to take CS 7641: Machine Learning, please review ourCourse Preparedness Questions, to determine whether another introductory course may be necessary prior to registration.",
    "Suggested Background Knowledge": "An introductory course in artificial intelligence is recommended but not required. To discover whether you are ready to take CS 7641: Machine Learning, please review ourCourse Preparedness Questions, to determine whether another introductory course may be necessary prior to registration.",
    "Technical Requirements and Software": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}