{
    "course-name": "cs-7643-deep-learning",
    "foundational": true,
    "admin": "CS",
    "Overview": "CS 7643, originally created at Georgia Tech five years ago, was rebuilt with the support of Facebook for on-campus students in Spring 2020.",
    "Course Goals": "\n- Describe the major differences between deep learning and other types of machine learning algorithms.\n- Explain the fundamental methods involved in deep learning, including the underlying optimization concepts (gradient descent and backpropagation), typical modules they consist of, and how they can be combined to solve real-world problems.\n- Differentiate between the major types of neural network architectures (multi-layered perceptions, convolutional neural networks, recurrent neural networks, etc.) and what types of problems each is appropriate for.\n- Select or design neural network architectures for new data problems based on their requirements and problem characteristics, and analyze their performance.\n- Describe some of the latest research being conducted in the field and open problems that are yet to be solved.",
    "Sample Syllabus": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Suggested Background Knowledge": "It is recommended that students have a strong mathematical background (linear algebra, calculus especially taking partial derivatives, and probabilities & statistics) and at least an introductory course in Machine Learning (e.g. equivalent to CS 7641). This shouldnotbe your first ML class, and self-study (e.g. online Coursera/Udacity courses) do not count.Strongprogramming skills (specifically Python) are necessary to complete the assignments.",
    "Technical Requirements and Software": "\n- Computer Hardware and SoftwareHigh-speed Internet connectionLaptop or desktop computer with aminimumof a 2 GHz processor and 4 GB of RAMCUDA compatible GPU is helpful for assignments but not necessaryUNIX-like OS experience is recommended (Linux/iOS)Windows/Linux for PC computers OR Mac iOS for Apple computersComplete Microsoft Office Suite or comparable and ability to use Adobe PDF software (install, download, open and convert)Mozilla Firefox, Chrome browser, and/or Safari browsers (Chrome required for on-boarding quiz)\n- High-speed Internet connection\n- Laptop or desktop computer with aminimumof a 2 GHz processor and 4 GB of RAM\n- CUDA compatible GPU is helpful for assignments but not necessary\n- UNIX-like OS experience is recommended (Linux/iOS)\n- Windows/Linux for PC computers OR Mac iOS for Apple computers\n- Complete Microsoft Office Suite or comparable and ability to use Adobe PDF software (install, download, open and convert)\n- Mozilla Firefox, Chrome browser, and/or Safari browsers (Chrome required for on-boarding quiz)\n- CanvasThis class will use Canvas to deliver course materials to online students. ALL course materials and quiz/discussion assessments will take place on this platform. Gradescope will be used for submission of assignments and the project.\n- This class will use Canvas to deliver course materials to online students. ALL course materials and quiz/discussion assessments will take place on this platform. Gradescope will be used for submission of assignments and the project.\n- Proctoring InformationIn order to verify the identity of all GT online students, all online students are required to complete the onboarding quiz that uses Honorlock. Honorlock is utilized for student identity verification and to ensure academic integrity. Honorlock provides student identity verification via facial and ID photos. You may also be asked to scan the room around you. The onboarding quiz will be a practice quiz that will not affect your grade in the course. You can take the onboarding quiz as many times as you want. All potential violations are reviewed by a human. The Honorlock support team is available 24/7. While Honorlock will not require you to create an account, download software, or schedule an appointment in advance, you will need Google Chrome and download the Honorlock Chrome Extension. Information on how to access Honorlock and additional resources are provided below. You can also access Honorlock support athttps://honorlock.com/support/.\n- In order to verify the identity of all GT online students, all online students are required to complete the onboarding quiz that uses Honorlock. Honorlock is utilized for student identity verification and to ensure academic integrity. Honorlock provides student identity verification via facial and ID photos. You may also be asked to scan the room around you. The onboarding quiz will be a practice quiz that will not affect your grade in the course. You can take the onboarding quiz as many times as you want. All potential violations are reviewed by a human. The Honorlock support team is available 24/7. While Honorlock will not require you to create an account, download software, or schedule an appointment in advance, you will need Google Chrome and download the Honorlock Chrome Extension. Information on how to access Honorlock and additional resources are provided below. You can also access Honorlock support athttps://honorlock.com/support/.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}