{
    "course-name": "cs-7642-reinforcement-learning",
    "foundational": true,
    "admin": "CS",
    "Overview": "The ability to run Docker locally or utilize a cloud computing service is strongly recommended. The instructional staff will not provide technical support or cloud computing credits.",
    "Preview": "",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Course Content": "To access the public version of this course's content, clickhere, then log into your Ed Lessons account. If you have not already created an Ed Lessons account, enter your name and email address, then click the activation link sent to your email, then revisit that link.",
    "Suggested Background Knowledge": "Successful completion of “CS 7641: Machine Learning” is strongly recommended, especially understanding neural networks. Students should also be familiar with or willing to learn:\n- Linear Algebra, Calculus, and Statistics\n- Scientific computing on Python using NumPy\n- Training and evaluating neural networks using PyTorch\n- Using Jupyter notebooks to experiment with algorithms\n- Using MatPlotLib or other visualization software to create graphs",
    "Technical Requirements and Software": "\n- Browser and connection speed: An up-to-date version of Chrome or Firefox is strongly recommended. We also support Internet Explorer 9 and the desktop versions of Internet Explorer 10 and above (not the metro versions). 2+ Mbps is recommended; the minimum requirement is 0.768 Mbps download speed.\n- Operating system:Ubuntu Linux 20.04 or higher is recommendedPC: Windows XP or higher with the latest updates installed, or Mac: OS X 10.6 or higher with the latest updates installed will be required for the final exam\n- Ubuntu Linux 20.04 or higher is recommended\n- PC: Windows XP or higher with the latest updates installed, or Mac: OS X 10.6 or higher with the latest updates installed will be required for the final exam\n- CPU: An x86-64 CPU (Intel or AMD) is strongly recommended, as specific scientific computing packages may not have ARM native code. It will be up to you to set up a suitable environment to conduct your experiments if you use an ARM-based processor, which may require obtaining a cloud instance with enough compute power to run these experiments at your sole cost.\n- (Optional but strongly recommended) We will provide you with a Dockerfile that contains a suitable setup to do RL research. To run this environment, you will need at least 50GB of open hard disk space, 8GB of RAM. A CUDA-compatible GPU is recommended. The teaching staff will provide this file during the course.",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}