{
    "course-name": "cs-7400-quantum-computing",
    "foundational": true,
    "admin": "CS",
    "Overview": "Quantum computing promises exponential speedups for a class of important problems. Quantum computers with dozen(s) of qubits have already been demonstrated, and qubit counts expected to cross hundred in the next few years. Quantum Computing is an interdisciplinary field with topics ranging from physical devices (ion trap, superconducting, spin etc.) to error-correction codes (surface code or Shor code) to system & architecture (memory/microarchitecture) to compiler and tools (simulation and programming), to algorithms and applications. The goal of this course is to provide students in CS and ECE with the fundamental background on quantum computing and equip them with the skills to write code and optimize quantum programs on real quantum computers. This course will focus more on the “computing” aspects of quantum computing and will be cover the architecture, compiler, and applications of quantum computing for both the near-term (NISQ model of computation) and long-term (fault tolerant quantum computing).",
    "Course Goals": "By the end of this course students will:\n- Become familiar with 1-qubit and 2-qubit gate operations and gain the ability to build simple quantum circuits\n- Become familiar with the concepts of superposition and entanglement and be able to analyze quantum state transformations\n- Understand quantum algorithms (Deutsch-Jozsa, Bernstein Vazirani, Grover, and Shor) and compare effectiveness versus classical algorithms\n- Understand the problem of noise and analyze the effectiveness of simple error correction codes\n- Become familiar with NISQ model of computation, and perform intelligent qubit mapping and error mitigation",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Technical Requirements and Software": "\n- Browser and connection speed: An up-to-date version of Chrome or Firefox is strongly recommended. 2+ Mbps is recommended.\n- Operating system:PC: Windows XP or higher with latest updates installedMac: OS X 10.6 or higher with latest updates installedLinux: any recent distribution\n- PC: Windows XP or higher with latest updates installed\n- Mac: OS X 10.6 or higher with latest updates installed\n- Linux: any recent distribution",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}