{
    "course-name": "cse-6742-modeling-simulation-and-military-gaming",
    "foundational": false,
    "admin": "C",
    "Overview": "This course is not foundational and does not count toward any specializations at present, but it can be counted as a free elective.",
    "Course Goals": "Upon successful completion of this course, you should be able to:\n- Demonstrate the ability to formulate specific study questions concerning international events and formulate hypothesis that can be tested through experimentation with computer simulation tools.\n- Develop an understanding of the capabilities and limitations of modern modeling and simulation techniques as applied to the analysis of strategic international events.\n- Demonstrate an understanding of accepted methodologies and practices concerning the creation and use of computer simulations to study international events to derive reasoned and justifiable conclusions.\n- Demonstrate an understanding of the underlying models, abstractions, and software realizations used in modern wargame simulations.\n- Demonstrate an understanding of the basic software architecture and elements of modern wargame simulations.\n- Demonstrate the ability to communicate complex concepts to multidisciplinary teams including students from computing and international affairs backgrounds.\n- Demonstrate the ability to understand and incorporate concepts from a different discipline and integrate them in the development and use of wargame simulations.\n- Demonstrate the ability to collect and incorporate data from historical and other records for use in wargame simulation tools.\n- Students will be proficient in basic mathematical skills and be able to formulate problems in international affairs mathematically if appropriate. Use software, process and analyze information, quantitative and qualitative methods.",
    "Sample Syllabi": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Technical Requirements and Software": "To participate in this class, you need the following computer hardware and software:\n- Broadband Internet connection\n- Laptop or desktop computer with aminimumof a 2 GHz processor and 2 GB of RAM\n- Windows for PC computers or Mac iOS for Apple computers.\n- Complete Microsoft Office Suite or comparable applications and ability to use Adobe PDF software (install, download, open and convert)\n- Mozilla Firefox, Chrome and/or Safari browsers",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}