{
    "course-name": "isye-6669-deterministic-optimization",
    "foundational": false,
    "admin": "A",
    "Overview": "This course is not foundational and does not count toward any specializations at present, but it can be counted as a free elective.",
    "Course Goals": "\n- Learn modeling skills for formulating various analytics problems as linear, convex nonlinear, and integer optimization problems.\n- Learn basic optimization theory including duality theory and convexity theory, which will give the students a deeper understanding of not only how to formulate an optimization model, but also why.\n- Learn fundamental algorithmic schemes for solving linear, nonlinear, and integer optimization problems.\n- Learn computational skills for implementing and solving an optimization problem using modern optimization modeling language and solvers.",
    "Sample Syllabus": "Note: Sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Suggested Background Knowledge": "\n- Linear Algebra\n- Multivariate Calculus\n- Basic Probability\n- Familiarity with programming in Python",
    "Technical Requirements and Software": "\n- Internet connection (DSL, LAN, or cable connection desirable)\n- PuLP optimization software (free download; seehttp://www.coin-or.org/PuLP/-- Windows version and (for Mac users) a Linux version)\n- CVX in Python: CVXOPT, CVXPY software (available athttp://cvxopt.organdhttps://www.cvxpy.org)\n- CVX in MATLAB: CVX software (available athttp://cvxr.com/cvx/)\n- Python programming language (free download; seehttp://www.python.org). Preferably use the Anaconda distribution (http://www.anaconda.com)\n- Adobe Acrobat PDF reader (free download; seehttps://get.adobe.com/reader/)",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}