{
    "foundational": false,
    "admin": "A",
    "Overview": "Digital Marketing has evolved from traditional marketing channels (radio, print, television, etc.) to include the online/internet channel and has grown significantly over the past ten years. The pace of new technology development and the ways consumers are interacting with various technologies has also been growing rapidly. Marketing executives are faced with new challenges to determine creative, cost effective ways to create brand awareness, engage their audience, and establish strong brand reputations. Social media and mobile have established new positions in the marketing arsenal alongside more mature online components such as email and search advertising. Assembling the right mix of tactics to support an organization’s overarching marketing strategy while also maximizing efforts through integrated marketing communications poses great opportunities and challenges for large and small businesses alike.",
    "Course Goals": "The primary goals of this course are to provide awareness of the various marketing strategies and tactics available within the digital channel and an understanding of how they can be applied to achieve strategic business objectives. This course has been designed to be an active learning experience that strikes a balance between providing established frameworks and factual information while also exploring innovative, creative solutions that do not necessarily have a “right” answer or method. The purpose of this approach is to engage you in a way that builds upon your learning in a practical manner that can be applied in real-world business situations.",
    "Sample Syllabi": "Fall 2024 syllabus(PDF)Summer 2024 syllabus(PDF)Spring 2024 syllabus(PDF)",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}