{
    "foundational": false,
    "admin": "C",
    "Overview": "This course introduces students to the policy and management aspects of cybersecurity. It is based on the idea that cybersecurity policy can be sorted into three “layers” representing different levels of social organization: individual organization, the national level, and the transnational level. The course is divided into four modules: the first exposes students to basic concepts and definitions regarding policy, governance, and threats; the second deals with cybersecurity policy at the organizational level; the third deals with cybersecurity public policy at the national level; the fourth deals with cyber conflict, policy, and diplomacy at the transnational level. This course situates cybersecurity in the overall Internet ecosystem. Student deliverables include small group projects as well as individually completed quizzes, discussions, and a final term paper. This is a required core course for all tracks in the Online MS in Cybersecurity.",
    "Course Goals": "Upon successful completion of this course, students should be able to:",
    "Sample Syllabi": "Fall 2024 syllabus(PDF)Summer 2024 syllabus(PDF)Spring 2024 syllabus(PDF)",
    "Before Taking This Class...": "Students will be expected to have a basic understanding of computers and data networking and will be exposed to some technical material regarding internet protocols, vulnerabilities, exploits and incident response, but the primary focus of the course is on the public policy, management and international relations aspects of cybersecurity. As such, prior coursework on institutional or transaction cost economics would be helpful, as would courses or readings on public policy processes and public administration. Students should be able to blend and integrate economic, technical and political modes of analysis. A helpful overview of related issues is provided in the following:",
    "Suggested Background Knowledge": "Students will be expected to have a basic understanding of computers and data networking and will be exposed to some technical material regarding internet protocols, vulnerabilities, exploits and incident response, but the primary focus of the course is on the public policy, management and international relations aspects of cybersecurity. As such, prior coursework on institutional or transaction cost economics would be helpful, as would courses or readings on public policy processes and public administration. Students should be able to blend and integrate economic, technical and political modes of analysis. A helpful overview of related issues is provided in the following:",
    "Technical Requirements and Software": "To participate in this class, you need the following computer hardware and software:",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}