{
    "course-name": "pubp-6725-information-security-policies",
    "foundational": false,
    "admin": "C",
    "Overview": "This course is not foundational and does not count toward any specializations at present, but it can be counted as a free elective.",
    "Course Goals": "Upon successful completion of this course, students should be able to:\n- Recognize the different governance structures used to promote cybersecurity\n- Identify key cybersecurity policy frameworks and standards (e.g., NIST framework)\n- Write a cybersecurity policy for an organization\n- Analyze and assess the effects of existing and proposed cybersecurity laws and regulations\n- Identify the geopolitical dimension of cyber conflict\n- Recognize the intersections of cybersecurity governance with the governance, standards and operations of the Internet",
    "Sample Syllabi": "Note: sample syllabi are provided for informational purposes only. For the most up-to-date information, consult the official course documentation.",
    "Suggested Background Knowledge": "National Research Council. 2014. At the Nexus of Cybersecurity and Public Policy: Some Basic Concepts and Issues. Washington, DC: The National Academies Press.https://doi.org/10.17226/18749",
    "Technical Requirements and Software": "To participate in this class, you need the following computer hardware and software:\n- Broadband Internet connection\n- Laptop or desktop computer with aminimumof a 2 GHz processor and 2 GB of RAM\n- Working webcam (to complete the onboarding module/quiz which is required to access the course; there is no workaround for this)\n- Windows for PC computers or MacOS for Apple computers\n- Complete Microsoft Office Suite or comparable applications and ability to use Adobe PDF software (install, download, open, and convert)\n- Edge, Firefox, Chrome, and/or Safari browsers",
    "Academic Integrity": "All Georgia Tech students are expected to uphold theGeorgia Tech Academic Honor Code. This course may impose additional academic integrity stipulations; consult the official course documentation for more information."
}