{
    "props": {
        "pageProps": {
            "course": {
                "isDeprecated": false,
                "isFoundational": true,
                "syllabus": {
                    "file": {
                        "asset": {
                            "_ref": "file-6986b86273f0f6f8ea3e1a4c2d0f6fa801f52c86-pdf",
                            "_type": "reference"
                        },
                        "_type": "file"
                    }
                },
                "slug": "introduction-to-health-informatics",
                "tags": [
                    "IHI"
                ],
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/6986b86273f0f6f8ea3e1a4c2d0f6fa801f52c86.pdf",
                "reviews": [
                    {
                        "rating": 5,
                        "_id": "6fR00wtLQO0Glm9dfeeRwJ",
                        "id": "6fR00wtLQO0Glm9dfeeRwJ",
                        "created": "2024-05-02T17:36:37Z",
                        "_rev": "6fR00wtLQO0Glm9dfeeRrf",
                        "difficulty": 2,
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "authorId": "wc47puUJlSq+XS5YuXA5hw==",
                        "_createdAt": "2024-05-02T17:36:37Z",
                        "_type": "review",
                        "workload": 8,
                        "course": null,
                        "body": "Expected grade in this class is an A.\n\nPretty easy labs and quizzes in the first half, then a practicum project for the second half. I learned a lot, and it’s a good GPA booster. The TAs are some of the best in the program. ",
                        "_updatedAt": "2024-05-02T17:36:37Z"
                    },
                    {
                        "_rev": "15LObVWVOp4hWufnQbfHAy",
                        "authorId": "3AEzatThriEmmXTyhdFFqQ==",
                        "_type": "review",
                        "body": "** This review is for Spring 2024: **\n\nThis class runs well and the workload felt just right and rewarding. I learned a lot about the healthcare domain, including frameworks like FHIR. We had engaging discussions with classmates and did several labs that introduced us to different technologies, all building up to a practical final project. Lab 1 had a bit of writing, but it wasn’t too much.  TAs were informative, supportive, and did an exceptional job setting up the labs. There are no exams, just quizzes that are reasonably set. The lectures were fun to watch. Dr. Duke keeps you engaged. You can do the final project alone or in a team and you get a mentor. I chose to do it solo to challenge myself with the MERN stack, and it turned out great. The labs and the final project are good practice in software development.\n\nTaking this class is ideal if you're interested in learning about the healthcare domain or adding another area of expertise. I definitely recommend this course if you're into healthcare, want to try out various technologies, and work on a real-world project that's useful in a real job setting.",
                        "_id": "15LObVWVOp4hWufnQbfHBr",
                        "_updatedAt": "2024-05-02T06:42:13Z",
                        "id": "15LObVWVOp4hWufnQbfHBr",
                        "_createdAt": "2024-05-02T06:42:13Z",
                        "course": null,
                        "semester": {
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z"
                        },
                        "difficulty": 3,
                        "workload": 12,
                        "created": "2024-05-02T06:42:13Z",
                        "rating": 5
                    },
                    {
                        "_id": "Pm4H4xdFhHJgzHn4Z02Lfi",
                        "difficulty": 2,
                        "rating": 4,
                        "course": null,
                        "body": "I took this course concurrently with another and it was the best out of the two (the other being SDP). It was course 4 out of 10 for me.\n\nOverall, I think it was a great course, especially for those who would like to have a career in the healthcare industry. The lectures could be modified to improve the experience of the course (i.e. adding more engagement) and the labs could be improved on to focus on course topics rather than spending too much time on setup. The quizzes were a bit too easy as you usually have two attempts. There are no exams in this course. The Forum Participation aspect of the course seemed like more of a chore than a learning opportunity.\n\nThe best part of the course happened during the second half, which was the Final Project. Having the ability to pick/scout your own team gives you a lot of freedom on what technologies can be used for the final project. I learned A LOT from the Final Project and it made the class feel fulfilling, especially since it used topics that were discussed in the course. The most hours (around 12 hours a week) were spent during this part of the course but only because of the research and development required for the Final Project. My only suggestion is to add an extra week for the Final Project as the last week felt a bit rushed.",
                        "_createdAt": "2023-12-12T17:31:28Z",
                        "authorId": "71mtit++6oWQpVDyILLbjA==",
                        "_updatedAt": "2023-12-12T17:31:28Z",
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "_rev": "Pm4H4xdFhHJgzHn4Z02LcK",
                        "_type": "review",
                        "id": "Pm4H4xdFhHJgzHn4Z02Lfi",
                        "created": "2023-12-12T17:31:28Z",
                        "workload": 9
                    },
                    {
                        "workload": 8,
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "authorId": "n70rALB3Re1J2WuKho9B4A==",
                        "id": "Yvrt5QbpFnNxZsotx0naFF",
                        "_createdAt": "2023-12-12T07:04:06Z",
                        "_rev": "Yvrt5QbpFnNxZsotx0na8p",
                        "created": "2023-12-12T07:04:06Z",
                        "course": null,
                        "body": "Overall a great class. The first half of the semester were lectures, quizzes and labs. As someone new to healthcare, I found the content and assignments interesting and engaging. Workload was manageable. The second half of the semester was a solo or group project. I chose a subject that interested me and did it by myself. No exams.\nTAs were responsive on Ed discussion, and very generous in terms of extra credit opportunities and deadline extensions upon student requests.",
                        "_type": "review",
                        "_id": "Yvrt5QbpFnNxZsotx0naFF",
                        "_updatedAt": "2023-12-12T07:04:06Z",
                        "difficulty": 2
                    },
                    {
                        "id": "PN0LsucFHRjXEo6GpGl36q",
                        "_type": "review",
                        "authorId": "lgSVrZ6cNPkcWP7JsDkMcQ==",
                        "body": "Full disclosure I will most likely make an A in this class now that final grades are out. \nThe first half of the course contains a Quiz and a Lab due every week/ every other week. The quizzes are not timed and are open book with reasonable questions without any trick questions. The Labs are reasonably decent amount of work as well. Most labs and quizzes were extended.\nThe second half is project based, in the beginning you pick 3 of your preferred projects and the TAs assign one based on availability. I waited last minute to find a team. But I still lucked out with our project choice and team mates. So you ideally want to start this as early as possible to leave room for error. The scope of the project and the work you need to do is entirely self driven making this an easy A but also a place where if you get lazy you can lose a lot of points.\nOverall I would definitely recommend this class.",
                        "rating": 5,
                        "_id": "PN0LsucFHRjXEo6GpGl36q",
                        "difficulty": 4,
                        "_rev": "PN0LsucFHRjXEo6GpGl35S",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z"
                        },
                        "created": "2023-05-01T00:34:08Z",
                        "_createdAt": "2023-05-01T00:34:08Z",
                        "workload": 8,
                        "_updatedAt": "2023-05-01T00:34:08Z"
                    },
                    {
                        "_createdAt": "2022-04-21T13:34:36Z",
                        "rating": 4,
                        "workload": 6,
                        "body": "Like other reviewers were saying, the workload on this course was very uneven. The first week was very light (just use a pre-made program, screenshot a few things). The next 5 weeks were HEAVY. You have to watch 2 lecture videos, along with a quiz every week along with the lab projects. The quizzes themselves were actually very reasonable - far more reasonable with less \"gotcha\" questions compared to the tests from Joyner's classes. But combined with the labs, it was quite an unexpected workload. The lab assignments after the first one tended to be very vaguely worded, and there isn't a lot of well written documentation on the material it's on. I now hate FHIR's official documentation with a passion. The only thing that saved me was the ed Discussion forums where other students were extremely helpful, and the TAs during office hours and on the forum were very helpful as well. It's pretty much a necessity to hang out on the forums for the labs.\n\nIf you can get over the hump of the first several weeks of class (where you have the tough labs and quizzes every week that included essay questions), the workload of the second half of the class lightens up to almost nothing. The second half of class completely removes the weekly quizzes, labs, and lectures, and has you only focus on working on your class project. This workload probably depends on what mentor you get and what project you get, but for this semester, they were highly encouraging people to just choose their own projects and work individually. This is honestly so much better, because you can choose a project that you know you can handle and complete. If you toss out a bunch of project ideas that seem fun or doable to you (and are related to healthcare is some way), your mentor will most likely pick one. The mentor I got was very easygoing and helpful, and I chose a project I knew I could complete.\n\nThe lecture videos for this course were clear and easy to watch - I thought Dr. Duke was very easy to understand when he talked about the material. If you watch the lectures and take good and very detailed and searchable notes, you should be fine for the quizzes. For participation, it's kind of vague how you'd get most of your participation credit, but I managed to get the full score for it by commenting a lot and helping to answer questions on the ed Discussion forums about the lab problems. I highly recommend doing this, because your opportunities to get participation credit in the last half of the class dwindles to almost nothing after the required labs are finished and everyone is just working on their projects.\n\nI'd recommend this class if you don't mind having a heavier workload in the beginning and want a light workload later in the semester. ",
                        "id": "external-import-53580180-e468-4e8f-8917-e7583c8405c5",
                        "created": "2022-04-21T13:34:36Z",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "difficulty": 1,
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-53580180-e468-4e8f-8917-e7583c8405c5",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "created": "2021-09-28T04:02:30Z",
                        "body": "Class was a breeze. Don't recall much new information, but I have worked a couple of jobs in IT Healthcare already, so some of the information was more of a refresher. But still, I think most folks who took this class online for this semester would agree that the workload was extremely light.",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "id": "external-import-e067df5a-0aa0-4207-a173-827c30b55e07",
                        "_createdAt": "2021-09-28T04:02:30Z",
                        "workload": 5,
                        "_id": "external-import-e067df5a-0aa0-4207-a173-827c30b55e07",
                        "difficulty": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "created": "2021-08-23T02:36:12Z",
                        "_createdAt": "2021-08-23T02:36:12Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-48bc742a-1b7e-4d37-9748-630434accccf",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-48bc742a-1b7e-4d37-9748-630434accccf",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "workload": 5,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "body": "I think this course is underrated.\nThe workload might not be even, video lectures are only somewhat aligned with the course material, but I didn't struggled at all with this course.\nIt's a great complimentary course that you might want to take with something else a bit more complex to get relatively easy A.\nThere's something to learn in this course, and couple of projects were very interesting, for example where I used ML techniques on COVID-19 data. Given that I never used any of these it wasn't that hard to learn it from scratch given that lab didn't required in depth knowledge of the tool.",
                        "difficulty": 2
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "created": "2021-08-19T17:09:02Z",
                        "_id": "external-import-839ad1fc-496f-4c33-a1ce-7322853616a5",
                        "difficulty": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_createdAt": "2021-08-19T17:09:02Z",
                        "workload": 30,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "I'll echo what other unsatisfied students have said: Stay away from this course. Here is what you can expect:\n\n* Vague requirements\n* Assignment due dates pushed back at the last minute when TAs / profs realize that too much of the class will be unable to grok the vague requirements in time to get anything meaningful done\n* Assignments pushed back because of broken links that don't get fixed until days are left to complete them\n* Little help from snarky TAs (Be ready to be told to go to Google)\n* Poor assignment design (Ex: There was a project where students could self select out of around ten or so topics. Spots in each topic were limited, and when they filled up none were added. Here's the problem: Different topics had WILDLY different levels of effort. So, if you aren't one of the first 50 students to snag a spot in one of the two easy topics -- ex: make a basic web UI that calls an API - you may find yourself stuck with one of the unnecessarily difficult ones - ex: launch a poorly documented service, a web server, a database, seed dummy data, interact with the service through an API that requires expansive data models and provides little help when you get something wrong, AND create a web UI that calls the API -- ie: Easy topic + loads of extra work)\n* Content that is taught and thrown away (Our first week we learned terms like \"Primary Care Provider\" -- and then we never used them again)\n\nThis class just isn't worth the headache. If you're interested in this topic, follow the TA's advice and just Google it on your own.\n\nEdit: I rated this course as very hard. That rating comes mostly from the terrible design (the course doesn't have to be difficult; a little more help from TAs, a little more clarity in the requirements, and equal workloads for topic based projects would go a long way). Students who don't get shunted into the difficult assignments will find the class much easier. But, that's luck of the draw.",
                        "id": "external-import-839ad1fc-496f-4c33-a1ce-7322853616a5"
                    },
                    {
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "course": null,
                        "workload": 20,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "id": "external-import-6a76c275-2e4c-4e06-905d-2d5ed2bc6072",
                        "created": "2021-04-07T02:45:27Z",
                        "_id": "external-import-6a76c275-2e4c-4e06-905d-2d5ed2bc6072",
                        "body": "** A lot of work, but not that hard **\n\nIf you are not a full-stack developer, or have full-stack experience, you will probably suffer.  \n\nThe philosophy seems to be to teach background in high-level health informatics concepts during lecture, and then hurl you deep into the weeds on labs.  Very little support in between.\n\nBUT, some of the assignments were fun and open-ended.  No tests.  Completing the assignment within the parameters is pretty easy (only one is auto-graded), you basically just have to turn something in that works.\n\nSome of the non-stop complaining is warranted, but TBF half the people in the class struggled with simple shit the whole semester and whined in the forums rather than figuring it out or using Google.\n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "_createdAt": "2021-04-07T02:45:27Z"
                    },
                    {
                        "created": "2021-04-04T21:47:53Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "body": "Never take this course, except idiot. \nIf all other OMSCS courses are similar with CS6440, then OMSCS will be the worst program in the solar system.\n1. Too much assignment, and TAs don't give the grade of assignments .\n2. No useful lecture, and TAs think you understand everything.\n3. No fast and helpful responses on Ed, because TAs also don't know how to do it.\n\nBTW, students can't post questions on Ed freely, it must be approved by TAs. They delete all posts which are about deadline question or complaint. Do we take this course in North Korea???\n\nIn a word, please remove this course from OMSCS program!",
                        "difficulty": 4,
                        "_createdAt": "2021-04-04T21:47:53Z",
                        "id": "external-import-7ffebace-594d-44f1-877f-d5f11d7b3f75",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 1,
                        "course": null,
                        "workload": 30,
                        "_id": "external-import-7ffebace-594d-44f1-877f-d5f11d7b3f75",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "course": null,
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 30,
                        "_id": "external-import-a38af39a-26ae-4020-b4cf-da0f58b1dcbe",
                        "body": "This course is the ideal example of a mismanaged and badly structured course. The content quality is poor, the assignments are vague at best, the primary lesson of this course is- go to the internet to find the knowledge and then build something on your own. Except when you don't take this course, you won't have to spend extra time and money. Avoid this course!",
                        "difficulty": 4,
                        "id": "external-import-a38af39a-26ae-4020-b4cf-da0f58b1dcbe",
                        "created": "2021-03-29T07:26:02Z",
                        "_type": "review",
                        "_createdAt": "2021-03-29T07:26:02Z",
                        "rating": 1
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 1,
                        "_type": "review",
                        "course": null,
                        "body": "This. Class. Is. Horrible. AVOID AT ALL COSTS. \n\nAs a former TA in another program, I understand them wanting to make the class more challenging, but it has been revamped in the worst way possible. It's a 'do as much work as you can!' philosophy right now, not \"finish these assignments with valuable skills\". The assignments are poorly written, and everyone can tell. They're very open-ended with a \"figure out something cool to do\" feel to them, which is fine, but there was a lot of turbulence. \n\nOne assignment was a free 100% on 8% of our grade, and two assignments are being dropped at the end of the semester. I believe 4 assignments have been delayed/moved for one reason or another. \n\nThis is my 8th class and this is the absolute worst I have taken in the program. 1/10. Despite having a 97.5% right now 3/4 of the way through, I haven't learned much. ",
                        "_createdAt": "2021-03-28T03:45:58Z",
                        "_id": "external-import-dbdef8b1-df04-4ff4-be94-64081dee0040",
                        "workload": 20,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "difficulty": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-dbdef8b1-df04-4ff4-be94-64081dee0040",
                        "created": "2021-03-28T03:45:58Z"
                    },
                    {
                        "_id": "external-import-cc30c78f-9abc-4152-93e7-80faeee197c3",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "body": "Just to emphasize all of the recent reviews - do NOT take this course, at least until you've seen some other people go first and report that things have gotten better. The (at least currently) relatively low hours estimate is no longer accurate, as the course has been re-modeled recently to add a ton of extra work.\n\nAs someone who currently works in healthcare, I'd say just based on my own experience that the majority of the content in this class is largely irrelevant in the industry today, which is disappointing. So unfortunately even if you are interested in going into healthcare, I don't even think it's worth taking it for the learning aspect. \n\nThe structure of the class is very poorly designed, as others have noted. Assignments have vague instructions that are largely learn on your own. Expectations for the assignments are too high I would argue for an introductory class, often asking students to find and solve real world healthcare problems with very little direction. This has resulted in multiple assignments getting cancelled, postponed or re-written. \n\nI found several TAs to be very helpful, and I certainly don't want this to sound like an individual attack on any of them. But the course is extremely poorly structured and I can't think of any scenario where I'd recommend someone take this in its current state",
                        "_createdAt": "2021-03-28T00:32:23Z",
                        "rating": 1,
                        "course": null,
                        "difficulty": 4,
                        "id": "external-import-cc30c78f-9abc-4152-93e7-80faeee197c3",
                        "created": "2021-03-28T00:32:23Z",
                        "workload": 19,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "rating": 1,
                        "course": null,
                        "_createdAt": "2021-03-20T15:38:59Z",
                        "id": "external-import-a97bcc96-e79c-48f1-8057-10be199fb864",
                        "created": "2021-03-20T15:38:59Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 5,
                        "body": "This class sucks. TAs have a stick up their ass and will tell you to go fuck yourself if you ask for their help. The content is garbage and you will have 5 assignments due every week",
                        "_type": "review",
                        "workload": 25,
                        "_id": "external-import-a97bcc96-e79c-48f1-8057-10be199fb864"
                    },
                    {
                        "_createdAt": "2021-03-12T03:24:49Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_id": "external-import-51b2b535-22d6-4592-bd41-3cfbd995b3f4",
                        "body": "This course is a mismanaged disaster.\n\nSo far, over the course of this semester, we have had 6 assignments (3 were 2 part assignments, so 9 assignments depending on how you count). 1 of those assignments was canceled because students overloaded a demo server. 1 assignment was postponed because so many students complained about how disjointed the various steps of the assignment were. Another assignment was just postponed because basically the entire class has complained that the instructions are so vague as to be unusable. After the assignment was postponed, it took the instructional staff more than 24 hours to make any comment acknowledging that they had done so.  It seems as though these assignments were created without any proofreading, and without anyone considering a view outside of a TA or professor\n\nWhenever anyone tries to raise a complaint in a public way on the class forum, the instructor (Tia Pope), responds claiming that they are being unprofessional and divisive, and then ignores all their comments. In response to multiple posts criticizing the class, the instructional team has required that all student posts be approved by the instructional staff before than become public. The instructional staff only reviews the post queue once per day, so students who have questions must wait a minimum of 24 hours before anyone will respond to them.",
                        "id": "external-import-51b2b535-22d6-4592-bd41-3cfbd995b3f4",
                        "_type": "review",
                        "rating": 1,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "course": null,
                        "workload": 20,
                        "created": "2021-03-12T03:24:49Z"
                    },
                    {
                        "body": "Stay away from this course, it is easily one of the most poorly managed courses in the program and will ruin your experience.\n\nLectures for this course are completely irrelevant to the actual work you will be asked to do. A bulk of the lab assignments, and even a few of the mini projects, consist of pointless busywork. One of the directions for the second mini projects explicitly states \"Get the Data [from a PDF] into Excel (without the use of a scraper). Describe in detail how you put the data into Excel and how you cleaned it\". Keep in mind that this is a graduate level foundational course for an MSCS program.\n\nIf you ask the TAs clarifying questions on most assignments, they can become defensive and will try to answer your question as vaguely as possible. You will often get told to scour poorly written documentation on the web for answers, since the TAs will not provide any themselves. On top of that, at some point you will be expected to complete 4 assignments in a single week, two of which are extremely arduous coding assignments, not due to their difficulty but due to the level of of \"hunting\" you have to go through to understand what is actually being asked of you.\n\nIf you complain about the lack of time to complete these back-to-back assignments (keeping in mind that most students are also working full-time jobs), the TAs will respond with \"Please keep in mind that the assignment has been open a very long time now, and the intended pacing of the course would allow plenty of time for students to complete everything with only an average graduate course level time investment per week. It is ultimately up to students to manage their time against the schedule appropriately\".\n\nThis course single-handedly killed any desire I had to work in the healthcare industry after the program. If working in the healthcare IT field is anything like this course, with vague project requirements and unhelpful mentors, I am glad I took this course.",
                        "course": null,
                        "workload": 30,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "_id": "external-import-1bb1b3a1-4cc8-4808-8757-1ce737e49e9d",
                        "difficulty": 5,
                        "_createdAt": "2021-03-08T16:26:29Z",
                        "id": "external-import-1bb1b3a1-4cc8-4808-8757-1ce737e49e9d",
                        "created": "2021-03-08T16:26:29Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review"
                    },
                    {
                        "created": "2021-02-14T00:57:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 1,
                        "body": "**tl;dr - Don't take this course.**\n\nIt starts off easy. Only a few hours a week of doing boring, repetitive, very easy assignments and listening to low quality lectures while navigating through the disorganized mess that is this course.\n\nThen suddenly it ramps up and you have 20+ hours a week of work doing boring, repetitive but difficult assignments where you're forced to bounce around half a dozen different areas (Data science in excel and  Python, writing programs in Java and Javascript etc.)\n\nCourse deliverables are extremely vague so you have no idea how much effort you need to put in the assignment and asking questions on the forum is usually taken as a sign of criticism and met with very defensive responses and things are a disorganized shit-show (Assignments get cancelled, due dates get shifted, deliverables get re-worked because no one actually tries to do the labs ahead of time and you frequently need to sift through multiple communication channels to find out information you need to do the work)\n\nI guess I should also mention the lectures are garbage but they are literally completely unrelated to the work you're doing so it seems fine to just stop watching them altogether.\n\nThe worst part after all is said and done, you don't actually learn anything of value. You just spend 10 hours figuring out how some random healthcare API works by referencing docs, googling terms and brute forcing solutions and then repeat the process another 2 or 3 times to complete all the assignments for a week.\n\nugh.",
                        "_type": "review",
                        "course": null,
                        "workload": 25,
                        "id": "external-import-7f42c920-03dd-417c-b8ee-30f361c90998",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-7f42c920-03dd-417c-b8ee-30f361c90998",
                        "_createdAt": "2021-02-14T00:57:44Z",
                        "difficulty": 3
                    },
                    {
                        "workload": 7,
                        "rating": 1,
                        "body": "I normally don't review classes until I'm done but I might drop this class due to its absurdity.  The class is poorly run, the lectures don't correlate to the assignments, and most assignments are basically at a 100 level undergraduate level (fill in the blank).  As Tyler Perry movies state, \"I can do bad my myself.  \n\nI can appreciate the easy course here and there, but this is not even on the scale.  This course is a waste of money and I could have read the boring professor's blog over a weekend.  I'm actually thinking about transferring to UT-Austin's Master's program.  No bullshit classes and things aren't served in reverse.  Why am I taking my electives first?!",
                        "id": "external-import-51f66599-b361-4273-96d1-841aa7aa8f2e",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "difficulty": 1,
                        "_createdAt": "2021-02-13T23:15:45Z",
                        "_type": "review",
                        "created": "2021-02-13T23:15:45Z",
                        "_id": "external-import-51f66599-b361-4273-96d1-841aa7aa8f2e",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "id": "external-import-525ad6eb-974e-4aa1-abff-8ac6437ac0fb",
                        "_createdAt": "2020-12-28T08:19:56Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1,
                        "created": "2020-12-28T08:19:56Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "workload": 25,
                        "_id": "external-import-525ad6eb-974e-4aa1-abff-8ac6437ac0fb",
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "body": "TLDR: The course has been revamped compared to previous semesters: significantly higher workload (busywork), irrelevant lectures, hit-or-miss support. This is my 8th course and I received a high A in this course. \n\n## Overview\n1 group project, 1 individual project, 3 labs (which are each multiple parts, so it's more like 6-8 assignments with multiple subparts each), and 3 mini project. There are \"stretch\" (aka extra credit) assignments offered at the end of the course. Lectures are assigned for the 1st half of the course but are irrelevant to the material and can easily be skipped, as can assigned readings. There are no tests or quizzes. \n\n## Pros\nSome of the TAs are helpful. If you get a good TA and a good group for the group project, the 2nd half of the course is very easy and a very light workload.\n\n## Cons\nUnfortunately, there are many. This was by far my least favorite OMSCS course, for the following reasons:\n- The workload is very poorly distributed. The first half of the course consists of lectures and homework assignments, which can easily take 40-60 hours of work a week, largely due to poor documentation and bugs in the interfaces. The second half of the course is the group and individual projects, which can take 2-5 hours of work per week. This has been brought up in previous semesters and was a huge sticking point this semester, but the instructors refuse to address it. I believe it is unlikely to change in future semesters.\n- The homework assignments deal with obscure APIs and libraries that are in early development, at best. There is little to no documentation; because of this, these assignments are extremely time consuming and frustrating, while offering no learning or benefit. For example, spending 10+ hrs writing strings to try to understand how an API is parsing input, because there is no documentation. These assignments are busy work at best and frustrating/exhausting at worst. Again, the TAs are aware of the situation but do not know how the API works themselves and cannot help. \n- Assignment descriptions are littered with errors, contradictions, and lack of documentation. This requires additional follow-up on Piazza, where TA's often contradict one another as to the correct answer or questions go for days without answers.\n- Some of the TA's are great. The TA I had for my project was extremely helpful and communicative. However, others are not and, specifically, the lead TA has an attitude that is dismissive and unprofessional. Shaming student questions and concerns, shutting down discussion on Slack, and more were constant throughout the semester, until students gave up trying to ask for help. I was very disappointed in the course culture created by these interactions.\n- Lectures and assignments focus solely on FHIR and do not explore any of the other amazing areas of Health Informatics. I was genuinely interested in this course for the subject matter, and was let down by the extremely narrow scope which will not be applicable to most people IRL.\n\n## Parting Words\nPossibly the biggest condemnation of the course is that I came out of it having learned nothing. The course is not difficult, but is frustrating and time-consuming because of the busywork assignments. I would not suggest this course unless you are very interested in FHIR and have a flexible schedule to work 40-60 hours some weeks and 2-5 hours other weeks. "
                    },
                    {
                        "course": null,
                        "workload": 10,
                        "body": "## Content\nThis is my 8th class of the program and the first I've felt compelled to write a review for. I needed a final elective for the II specialization, and after reading the reviews for this course as well as the scant others I could have opted to take online I decided this would be the class I'd be (more) interested in.  \nThis class will only be remotely interesting if you intend to enter the healthcare field or already have experience in that realm. The lectures you'll watch for this class are a bore, at best. Getting insight into the technological advances of the healthcare industry and the aspirations to house medical data in the digital world were the most interesting parts of the course. Beyond that, the lectures wholly focused on key buzzwords or systems which don't have much meaning beyond their use in that industry. The good part is that there are no exams, so you aren't necessarily going to have to watch the lectures, although I recommend it to at least get a leg up on the concepts mentioned in the work done for the class.  \nThe class seems to be very frontloaded, with many of the deliverables being due within the first month or two of the course. The latter half of your time in the course will be spent working with your teammates on your team project and also developing your individual project.\n\n## Workload\nThe work - the multitude upon multitude of assignments thrown at you that you're expected to research, balance, develop, and complete. I didn't enter a master's degree program expecting things to be easy or lax, but this class truly does just overwhelm you with busywork. If you read other reviews from this semester you can get an exact breakdown, but overall there are three labs (with multiple parts), three \"mini\" projects, an individual project, and a team project:  \n1. The labs expose you to different systems that you'll hear about in the lectures, whether by having you write code to interface with one or simply by visiting five or so different websites to perform queries for data. Some were interesting while some were drawn out to frustrating ends (you really don't need to look up a code for 10 different ailments, some of which are very intricately named but incidentally sharing much of a name with *another* ailment in the system). The labs are extremely easy; following the directions should net you a perfect score, but they're so drawn out that you'll often find yourself asking what the point of the work is.\n\n2. The mini projects are definitely not mini, nor are they full-fledged projects which should require a ton of work. Each of the mini projects focuses on one of the three domains that is taught in the class. You're encouraged to come up with any ideas you can to fulfill the project requirements, but these assignments can be frustrating in the level of open-endedness to them. The instructors (TAs) are expecting you to come up with some solution that has a level of novelty to it, although they explicitly state that the solution does not necessarily have to be something never-before-seen. If you aren't looking to revolutionize the US healthcare industry in 8 pages or less, you may end up having a few points docked from your score depending on the TA of the day.\n\n3. The individual project tasks you with developing some sort of solution which could be used in a healthcare setting. You aren't given any sort of guidance on what to build and design is up to you, which could be a good or bad thing depending on what kind of student you are. The first few deliverables for the individual project are meant to flesh out the initial proposal and design of your application, but I'd suggest reaching out to a TA or discussing on Piazza different ideas to make sure what you want to do is within the scope of the project. I personally didn't have any issue with it, but I noticed that others did. This part of the course seems like a great fit for web development skills, so I'd try to have a little bit of knowledge or expertise in that area before you're ready to take this course.  \n\n4. The team project is... a team project. I typically do not enjoy team projects in an academic setting, especially as I am already established in a career and have to work in those sort of dynamics in my day-to-day. You have the option to request certain teammates if you know anyone else in the course, but you aren't guaranteed to be grouped with them; additionally, your team's first deliverable will be ranking the top 10 choices you all have of a list of available projects that you'd like to work on. If you're lucky like me, your team will be saddled with a project nobody wanted to do and nobody chose. That definitely brings the excitability of the course down to a 1 out of 10. Thankfully I was grouped with a team of competent people, but I think that since none of us wanted to do the project we were assigned, nobody really seemed to have any initiative to try to get work done. Ultimately I think we did a good job with what we created and turned in, but just having to manage a semester-long group project on top of all the other nonsense in this course imposed undue stress.\n\nAt the beginning of the semester, you're slowly working your way through the lectures and doing the first labs. This graduates into some weeks having a lab and a mini-project due... which, OK. A week or two after that, you're doing labs and also working with your team to do initial research for the team project. No biggie. Then you get to the point where you're working a mini-project, creating some code or recording a presentation for your team project, and writing up a paper for your individual project. Maybe one week you have the last lab thrown in for good measure. All due on Sunday. :~)  \nReal life isn't easy, for sure, but pretending that having to juggle three or four deliverables all due on the same day with a professional job, potentially another class, trying to prioritize at least a **smidgen** of personal time for your mental health, and basically all other routine maintenance we have to do as living human beings is ridiculous. The grading at least seems *very* lenient and the work isn't difficult, but this course can take a huge toll on your life when you may not find much worth in it.\n\n## Instruction\nThis is a TA-run course. None of the TAs seemed all that horrible, but of all the courses I've had to reach out to TAs on this has to have been the worst. I've had a question or two just go unanswered by anyone of authority on Piazza on important topics related to different systems we're expected to use for the class. Feedback for grading is at times inconsistent or opaque. One of the mini projects I had two points taken off for presenting a solution to a problem but not explaining how it was any different from X product, which I clearly delineated in the paper written about the subject. Our internal mentor for the team project was helpful at times, but unavailable at typically all times other than the prescribed meeting time each week (Sunday mornings, which coincidentally was the same day most things were due!). It was also frustrating to be told that we were expected to put in a certain level of work with the team project but not seeing that same sort of effort from our TA mentor, who I would also reasonably expect to help us as much as possible given we were working with an outside entity/company and likely affecting their perception of the class or program as a whole.\nLaughably, there seemed to be a dust-up halfway through the semester when someone anonymously posted on Piazza about being frustrated or exhausted due to the sheer amount of work expected during a period of time in the class. It seemed to catch on and I was grateful to see that I wasn't just whining to myself that this seemed like a lot. The head TA ended up locking the thread and mentioning that we should expect to have work to do in a master's level course, which is kind of a BS way to sidestep valid criticism and shutting down discussion. We're expected to give feedback in course reviews, but it's *too distracting* when we discuss amongst ourselves the issues we're having keeping up.\n\n## Conclusion\nThis is definitely an easy class if you look at it only from the expected deliverable perspective. There isn't a ton of work you need to produce, and most of that work should be fairly straightforward and is subject to a lax grading policy. However, you will run yourself ragged if you don't ensure you have enough time to do it all. I've gotten by this semester by the grace of COVID as I'm working from home, and my work is very understanding when it comes to my pursuit of a higher degree and training. I paired this with another course and expected this to be the course I spent less time on, but I ended up spending much more time keeping busy with this class than anything else I've taken thus far, even Machine Learning. I encourage you to take this course if you're interested in or work in the healthcare industry; otherwise, maybe just take EduTech.\n",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "id": "external-import-a5aafef9-bfde-4212-90e3-40089232f7ce",
                        "created": "2020-12-10T20:54:31Z",
                        "_createdAt": "2020-12-10T20:54:31Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1,
                        "_id": "external-import-a5aafef9-bfde-4212-90e3-40089232f7ce",
                        "difficulty": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        }
                    },
                    {
                        "created": "2020-12-04T18:44:04Z",
                        "_id": "external-import-1f7d4d0c-be2e-41be-a11b-14bd6da82734",
                        "course": null,
                        "id": "external-import-1f7d4d0c-be2e-41be-a11b-14bd6da82734",
                        "workload": 10,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_createdAt": "2020-12-04T18:44:04Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "rating": 2,
                        "body": "There's way too much busy work in this class and I did not learn much from many of the assignments. The extra work wouldn't be a problem if I was actually learning about other new/interesting things or more about FHIR itself. \n\nAlso, while the TAs were very helpful and responsive, they grade very inconsistently for some assignments(especially the group project assignments). They tend not to answer any questions about grades which leads me to believe they do not thoroughly review assignment submissions and randomly give out grades sometimes. Assignment instructions are also way too lengthy/verbose, misleading and sometimes very confusing(likely intentionally).",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2
                    },
                    {
                        "id": "external-import-5bf7ad17-868e-441f-8a0e-1ef1dbac8bea",
                        "created": "2020-11-28T07:13:55Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 30,
                        "_createdAt": "2020-11-28T07:13:55Z",
                        "body": "A lot of this will be repeated complaints from other Fall 2020 reviews. Past reviews are not reliable anymore. Let me give you a new breakdown for this course. Keep in mind two things, the total points for this course is 100 and the \"extra credit\" is only eligible for assignments that are Labs and Mini projects and only if you submit ALL OF THEM.\n\nLabs:\n - 3 labs with 2 and 3 containing multiple parts. I found one of the labs to be useful, the others were very time consuming and not useful. Overall, they account for 15 points.\n\nMini Projects:\n - 3 mini projects. I found one of these mini projects to not be useful, the other two depend on you. The mini projects can build off of each other and may build into your individual assignment. If you manage to build them off each other and use the same topic for your individual assignment, it can be helpful and less time consuming for the first individual project submission. If not, this is also going to end up being very time consuming and not useful for the rest of the course. Overall these account for 25 points.\n\nIndividual assignment:\n - You are tasked with creating your own application that contributes in some way to the field of Healthcare (medical, psychological, etc.). You will most likely begin the actual dev work with a little more then a month left before the end of the course. You will have check-in assignments every week. Overall, all individual project related submissions will account for 25 points with 17 points coming from the final submission. You are kind of forced to follow a waterfall sort of approach with the submission requirements. (HINT: you should confirm your proposal with the TA's before you submit it.)\n\nTeam Project:\n - You will be somewhat randomly paired with a group of 5 to 6 people. You can request team members but you may not get that. You will probably get a team about 3 weeks into the semester. To pick a team project you have to pick your team's top 10 from a large list. You probably wont really start dev work until 2 months into the semester (about 2 months away from the end). You have Team Sprint assignments due every 2 weeks. Some of these involve recording a presentation. You are required to deploy your application to HDAP. Again, you are kind of forced to follow a waterfall sort of approach. Overall, accounts for 35 points with 18 coming from the final submission. Most the sprints involve a simple PDF with updates and sometimes a video presentation. The final submission involves a lot more writing as well as a video presentation. You are also assigned a mentor for your team project which seems like it can be a hit or miss. Thankfully I had a good mentor but that didn't save me from having to carry some of the team members.\n\nStretch assignments:\n - One stretch assignment that was made available about 3 weeks from the end of the semester. You could get a total of 3 points back but will only count for Labs or Mini projects and you are only eligible if you at submitted all the assignments.\n\nOverall, the assignments were not incredibly hard but they were all very time consuming and clumped together, with multiple assignments due every week. I would have enjoyed the individual assignment or the team project assignment if we didn't have both. Balancing both of those big projects within about 1.5 months was too much for my liking. If you have a good team or you are the team member that doesn't carry their own weight, then it is doable (though still incredibly time consuming). If you are the unfortunate soul that didn't get paired with a good team, then you are going to have a really rough semester and little sleep.\nThis course definitely feels like it now prioritizes quantity over quality which I don't appreciate. And other then FHIR servers, I don't think I learnt much related to Healthcare Informatics.\nFor reference, my final grade was a high A.\n\nSo, don't take this course for an easy semester :)",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "_id": "external-import-5bf7ad17-868e-441f-8a0e-1ef1dbac8bea",
                        "difficulty": 4,
                        "_type": "review",
                        "rating": 1
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-61a0b688-8847-4e45-9ec5-3c81f92dd004",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "workload": 25,
                        "_id": "external-import-61a0b688-8847-4e45-9ec5-3c81f92dd004",
                        "body": "As mentioned by other reviews for Fall 2020, this class is nothing like the previous semester reviews. Mind you that the course syllabus was changed this semester too.\n\nThe course isn't hard, but there is A LOT of busy work. At the end, you'll be faced to work on a personal project and a group project at the same time too. It's insanely hard to balance the work between both the projects. I'm working full time and only taking this 1 course and I'm barely getting good sleep.\n\nI also don't recommend this class if you are not passionate about healthcare matters or want to learn about web dev. Personally, I liked this course because it was a good eye opener to many issues in the US + taught me front and backend skills and new technologies.",
                        "_createdAt": "2020-11-20T22:02:54Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "created": "2020-11-20T22:02:54Z",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null
                    },
                    {
                        "id": "external-import-05251f71-18b4-4dea-9952-a8a675912511",
                        "created": "2020-11-08T13:30:16Z",
                        "difficulty": 3,
                        "course": null,
                        "workload": 25,
                        "body": "This is my 8th class and I must say this has been the worst.  The class is nothing like the reviews from previous semesters. This is not a class you want to take with another class, not because is hard but because there is an insane amount of busy work. They keep you busy every week, most weeks you are working on multiple things at the same time.  this is TA lead (not my favorite) so there is a lot of disorganization, last minute changes and lots of vague instructions.  The material on interoperability (couple of weeks of material) was stretched out to endless weeks.  In the end this class feels more like a web development class than a health informatics class.  Except you will be doing all the learning on your own as this is not a web development class.  I suppose the TAs assume everyone is.  They have several mini projects but don't be fool by mini, they are not and take considerable time mostly because they tools they want us to use have poor documentation.\n\nThe individual project is just a shorter version of the team project but on your own.  You get to come up with your project, and get little help form TAs about it.  So its hard to find the happy medium they are looking for not too easy, not too hard.  But most of it involved creating some sort of web app that uses FHIR.\n\nIn regards to teams. You get little control over who is in your team. Some may get lucky but most don't. There is skill matching. Almost no one in my team have frontend/backend experience.  Some drop the team, other ghosted the project and we have a couple of people doing all the work.  I think this is rampant as there have been a few announcements on free loading on the group project.  \n\nIf I had to do it again, I would have taken another class. I don't like the direction this was is going.  Needs to be redesigned.",
                        "_createdAt": "2020-11-08T13:30:16Z",
                        "_type": "review",
                        "rating": 2,
                        "_id": "external-import-05251f71-18b4-4dea-9952-a8a675912511",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        }
                    },
                    {
                        "_createdAt": "2020-10-06T02:00:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "id": "external-import-131dbdac-5937-468a-ace5-f7c73da7f463",
                        "created": "2020-10-06T02:00:02Z",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-131dbdac-5937-468a-ace5-f7c73da7f463",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 25,
                        "difficulty": 3,
                        "rating": 2,
                        "body": "I am still in this class, but I wanted to go ahead and let people know that the old reviews are not applicable for this course. Things have changed quite and bit and I wouldn't call this a cakewalk anymore.\n\nFirst I will start with the pros. \n\nYou really learn web development stuff in this class. I don't know of any other class that teaches you practical webdesign in this program. \n\nYou learn some interesting health technologies like FHIR. Great to get a general feel for this field. \n\nYou get a good feel for JavaScript in this class.  \n\nGrading has so far been quite lenient. \n\nNo tests or quizzes.\n\nNow for cons.\n\nNothing in this class is what I call hard, but you will be drowned in deliverables. You really need to keep up with the work in this class. At one point you will have to juggle a mini project, preparing your individual project, and a group project all at the same time. This class focuses on quantity over quality. \n\nEvery individual project will have vague requirements. The TA's love to use the word interoperability and just say make sure you have that. If you propose an idea they usually just say it's not enough and refuse to offer any helpful feedback. \n\nTA run course (could be a pro to some people)\n\nGenerally just a disorganized course.\n\nLectures lol don't even waste your time they are useless. Lectures are literally the most useless out of any class I have taken in this program. \n\nYou are allowed to suggest teammates to the TA's. The TA's did not honor my request and put me in with a random group, so don't bank on taking this with a friend because groups are not guaranteed. \n\nConclusion\n\nI took this class because I took an undergraduate health IT class and thought it would be cool to update my knowledge. Considering I am halfway through this course and I already dislike it I feel this is a major problem (this is my 5th class btw). \n\nThe instructors should seriously consider dropping the individual project for something else because I can already see it's just there for busy work. \n\nThis class would be so much better if it had less assignments, but the ones left were high quality and provided clear instructions on what is expected. \n\nPlease know some web development before you get into this class. Don't leave one teammate to do all the work. \n\nDO NOT TAKE THIS CLASS WITH ANOTHER CLASS!!! If you know how to develop applications then nothing here is terribly difficult, but you will not have enough time to do anything else. ",
                        "_type": "review"
                    },
                    {
                        "created": "2020-10-05T16:02:57Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_id": "external-import-7459301a-ee7c-4019-a300-a3f169127c04",
                        "_createdAt": "2020-10-05T16:02:57Z",
                        "course": null,
                        "workload": 16,
                        "id": "external-import-7459301a-ee7c-4019-a300-a3f169127c04",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 2,
                        "_type": "review",
                        "body": "### Only take this course if you are specifically interested in Healthcare \n\nIf you intend to develop an application for the healthcare industry, then take this course.\n\nIf you are taking this course just to fulfill a requirement, you will suffer. I tried to couple this course with another so that I could get done the program faster. Don't make this mistake - you should be enjoying your courses and finding value in them. Don't waste your money and time just to finish the degree faster. Some people say the courseload for this course is 4 hours a week - I don't understand how. It's a TON of busywork for things that seem extremely pointless, but are required in order to succeed. The lectures are unbelievably monotonous and irrelevant to the assignments; I think you can actually skip the lectures entirely and do fine. \n\nThere is an enormous amount of reading for clarifications on Piazza. Information overload. You will have to learn frameworks like HAPI FHIR that are not well documented and are highly specific to the healthcare industry. If you don't intend to work in healthcare, it will be a waste of time.\n\nFor the written assignments, the TAs barely skim over them. I doubt they read past the summary.\n\nThe team project is actually something I really enjoyed - you will get to work on a project that actually has real-world value, working potentially with a real industry representative. My team was highly organized, and so I was lucky to work with them. "
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "_id": "external-import-bf1478b2-95d7-43ff-ad1f-2d2b89179606",
                        "body": "IHI is an odd class that is very front loaded from the beginning of the semester with case studies, labs, an individual project, and a team based project. This was especially stressful during the first half of the semester, but since there are no quizzes or exams, things calmed down a bit in the second half when there was only the semester-long team based project left with its weekly sprint review deliverables. To be honest, the class is not as easy as previous reviews seemed to indicate, and I wonder if more assignments were incorporated to artificially add more busy work.\n\nOverall, there were 6 case studies, 10 labs, 4 deliverables for the individual project, and 10 sprint reviews for the team based project. The only coding included Java for 2 of the labs and whatever was developed in the team based project. The team based project makes up a significant amount of your grade, so it is important to make sure that you find a good group with an interesting topic since the final deliverable includes a functioning healthcare related application with a video presentation that includes parts by every team member.\n\nIn general, the class is ok but can get very technical with the healthcare industry, so if you are not very interested in healthcare analytics, I would recommend skipping this class and taking HCI and EduTech for the II specialization instead. Nevertheless, I ended up with a high A in the class, but IHI was still probably my least favorite of the 9 other courses that I have taken in the OMSCS program so far. ",
                        "workload": 15,
                        "created": "2020-05-05T23:36:08Z",
                        "rating": 2,
                        "course": null,
                        "_createdAt": "2020-05-05T23:36:08Z",
                        "id": "external-import-bf1478b2-95d7-43ff-ad1f-2d2b89179606"
                    },
                    {
                        "created": "2020-05-04T00:03:21Z",
                        "_id": "external-import-97269e35-eacd-46a6-a0a4-180cfff63bba",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-04T00:03:21Z",
                        "course": null,
                        "difficulty": 2,
                        "body": "This was the least useful course I've taken in this program. \n\nPros:\n- The assignments are easy and straightforward. \n- There are no exams.\n- The TAs and professor are responsive on piazza and slack. \n- The group project gives you the opportunity to build a full stack web application. \n\nCons:\n- There are a **lot** of busywork assignments. These include 10 labs, 6 written case studies, 1 individual project (4 deliverables), and 1 group project (10 deliverables). The labs and case studies are pretty useless, the individual project is not really worth calling a project - you just have to follow the instructions provided and write a little bit. The group project is interesting enough if you have a good group though.\n- The lectures are effectively useless. You can get through this class without really learning anything.\n\nTLDR if you want an easy A - and / or if you want to build a fullstack web app, this is the class for you. If you're looking to learn...this class isn't for you.\n",
                        "id": "external-import-97269e35-eacd-46a6-a0a4-180cfff63bba",
                        "_type": "review",
                        "rating": 1,
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "body": " This was my second class in the program. As a software engineer working on medical devices, the class met my expectations.\n\n### Tips\n\n- Take the class if you want to learn about health data interoperability, want to take a class with no quizzes/tests, and/or want to work on a modern, resume-worthy project.\n- I would _not_ recommend taking a project with an external mentor. My team's mentor was especially flaky. It's simply not worth the \"real world\" experience. If you don't want a project with an external mentor, don't put any external mentors on your preference list.\n- Extra-credit assignments generally aren't worthwhile (lack of direction & reward), but the peer reviews are pretty easy and can be pretty interesting for additional perspective.\n\n### Difficulty\n\nI rated the class \"easy\" on the merits of \"it's a guaranteed **A** if you do all the work\". That said, the class is still a decent time commitment with lots of concurrent deadlines, which creates some mental fatigue.\n\n### Prerequisites\n\n- JavaScript\n- Java\n- R (for extra credit only)\n\nThe team projects are all web apps, so you should have at least one team member with HTML/CSS/JS skills and at least one team member that can build a backend API service. I have strong web development experience and used the project as an opportunity to learn ReactJS.\n\n### Workload\n\nThe workload was poorly distributed. The first half of the class was overloaded with multiple individual assignments due weekly, while the last few weeks were nothing but the group project sprints. I estimate 12-15 hours per week average for the first half of the semester with one or two weeks easily at 20+ hours due to poor scheduling by the TAs. The writing assignments were underspecified with very loose length & detail guidelines, so it was easy to overwork many of the assignments.\n\nThe workload of the group project will depend entirely on your group. I took ownership as Project Manager and the most experienced frontend developer, so I spent at least 10 hours per week on the group project & weekly sprint deliverables.\n\n### Lectures\n\nThe Udacity lectures were marginally useful for a few labs. The live lectures from Dr. Duke were occasionally useful or interesting, especially in context of the ongoing COVID-19 pandemic, but completely optional.\n\n### Assignments\n\nMajor work consisted of:\n\n- 6 Case Studies (short writing)\n- 10 Labs (mix of long writing, short assignment, INGInious grading)\n- Individual data analytics project (4 deliverables)\n- Team Project (10x 1-week sprints, 4 video presentations)\n- Reviews (course/peer/mentor reviews)\n\nNo quizzes/exams, which is a big plus.\n\nThe written assignments are underspecified, but graded generously. One annoying lab required jumping to a bunch of public healthcare websites, creating free accounts. The autograded INGInious assignments were moderately challenging, but had 20 attempts per item with no penalties.\n\nExtra credit (\"stretch assignment\") opportunities:\n\n- Peer reviews for writing assignments\n- One case study\n- RStudio work with the individual project\n- Random points added to required assignments (above-and-beyond credit?)\n\nThe TA's won't grade any stretch assignments unless your final grade is below the 90% (**A**) cutoff and they didn't disclose how much these extra credit assignments were worth.\n\n### Individual Project\n\nThis project is a straightforward data analytics project with GT-hosted OHDSI Atlas software. The project isn't hard as long as your chosen hypothesis is viable with the given Medicare claims data. The live lectures step through the major tasks required for completing the project.\n\n### Team Project\n\nThis was a mixed bag for me. Many of my team members were simultaneously attending hard classes, so most team members weren't as invested or engaged in the project.\n\nThe project was chosen by ranking top-10 choices from a list of 44 potential projects. 15 were sponsored by external mentors. We got our rank #10.\n\nI enjoyed working on a \"real-world\" project with modern technology (ReactJS, Spring, MongoDB, Docker, Kubernetes, Drone.io). This was easily the best feature of the class.",
                        "id": "external-import-ff740c3f-0914-4290-b59c-eddf787315f9",
                        "created": "2020-04-21T04:51:56Z",
                        "difficulty": 2,
                        "_createdAt": "2020-04-21T04:51:56Z",
                        "_type": "review",
                        "_id": "external-import-ff740c3f-0914-4290-b59c-eddf787315f9",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4,
                        "course": null,
                        "workload": 15
                    },
                    {
                        "id": "external-import-2d06d9f1-4bbf-406f-bf9a-a1b53c9a03ec",
                        "created": "2019-12-18T21:26:19Z",
                        "body": "## avoid if you value your time\n\nThis course is easy. But before you jump in, understand that you'll have to be organized af to keep track of exactly what's being changed and when, and which things are due. \n\n\nWe have 7 case studies with 7 mandatory peer reviews, 7 labs, 8 extra credit assignments, 1 individual project, 1 group project.\n\nEvery single one of these things is going to feel like a pain. It's going to feel like you checking off boxes to make someone happy. \n\nThe lectures are well recorded and interesting, but completely useless to the course itself. I watched 3 videos before I decided to never watch them again, and I got an A. \n\n\nThat being said, the instructional team is AWESOME. \n\nDr. Duke is a great professor, Tia, Raj, and the other TA's are some of the most responsive and approachable people I've **ever seen**. \n\n\n\n## overall : \nGreat team, just needs to take a long look at the course and try to trim the unnecessary stuff and create more engaging projects instead of the piles of documents I found myself writing. \n\n\nP.S. ditch Inginious, it's just not helpful. Use Bonnie instead for the coding stuff, and use canvas for the medical coding assignments.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3"
                        },
                        "_id": "external-import-2d06d9f1-4bbf-406f-bf9a-a1b53c9a03ec",
                        "difficulty": 2,
                        "_createdAt": "2019-12-18T21:26:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 3,
                        "rating": 1,
                        "course": null,
                        "_type": "review"
                    },
                    {
                        "created": "2019-12-17T05:24:07Z",
                        "_createdAt": "2019-12-17T05:24:07Z",
                        "rating": 1,
                        "_id": "external-import-25bc5ba5-0de0-4e64-be65-297e974ed888",
                        "difficulty": 1,
                        "course": null,
                        "workload": 4,
                        "id": "external-import-25bc5ba5-0de0-4e64-be65-297e974ed888",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "_type": "review",
                        "body": "This was the most disorganized course out of all the 10 courses I took on OMSCS. The subject is super interesting; however the way the assignments were presented drove an unnecessary level of complication to them. The difficulty didn't come from the subject itself, but from the lack of organization overall. Save your money and pick something else. It is an easy A as there is a ton of extra credit opportunities, but even if you only care about the grade, there are other courses you can get an easy A on, but that you can actually get something more than just a grade."
                    },
                    {
                        "rating": 5,
                        "workload": 15,
                        "id": "external-import-77838f24-b3fd-4365-a52e-cb07f850895c",
                        "created": "2019-12-03T07:47:58Z",
                        "_id": "external-import-77838f24-b3fd-4365-a52e-cb07f850895c",
                        "difficulty": 3,
                        "_createdAt": "2019-12-03T07:47:58Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "body": "TL;DR - great course if interested health informatics/analytics, engaged instructional staff, more work than estimated.\n\nSince I have completed several courses, I have a reference for comparison. And I really wanted to learn about the Healthcare domain.\n\nThe instructor, Dr. Duke, was extremely active and engaged on both Piazza and Slack (course has dedicated slack), and his enthusiasm for the material was obvious. The TAs were all very active, answering questions on Piazza. The tone of these channels was excellent.\n\nThere were over 40 deliverables ranging in complexity from simple surveys through substantial projects. The progression of material made the course seem easier than the large number of assignments might suggest. Nearly every week there were 2-3 assignments due, and some weeks had 4-5 deliverables.\n\n- Case Studies (7) - these are short (2-3 page) explorations of various healthcare topics, video, slides, online research, write paper (APA citations), peer reviews\n- FHIR activities - various FHIR activities using javascript, Java, etc.\nData explorations (several) - these use various resources (LOINC, SNOMED, RXNORM, etc) to investigate and retrieve data, student gains experience/comfort with Healthcare data\n- Azure investigation (1) - explore and devise ways to use Azure services for class activities & projects\n- Analytics Labs (3) - these labs used FHIR to explore data, a guided tour of medical analytics, using Atlas, SynPUF, and R/RStudio\n- Health Analytics (1:5) - individual project in 5 parts to perform a medical analytics project patterned after the analytics labs, student designs, executes and produces an analytics project using tools learned (and understanding of Healthcare domain)\n- Team Health project (1:7) - mentor guided substantial team-based development project, many deliverables, uses CI/CD pipeline and student/teams choice of toolchain - interesting project, lots of freedom - typical team dynamics issues\n- Surveys, reviews, feedback (8) - easy, exercise in time management.\n- Stretch assignments (8) - There were a number of opportunities to explore material outside the normal graded assignments (for conditional extra credit), and some were more interesting than regular work (most were a ton of work)\n\nBased upon the peer reviews, some students were doing minimal effort."
                    },
                    {
                        "id": "external-import-2abcbe64-9579-402e-b773-77e825205248",
                        "course": null,
                        "body": "The class is relatively easy. The TAs grade very leniently. As long as you submit something for each assignment, you should be good. There are no tests, but there are group projects. It is not easy to find good group members in the forum. Working in a group with little talent was the only difficult thing about the class. Even then, its not hard to get good grades on the group project.\n\nThe technical systems used by the class are not very robust. My only advice is to finish the assignments early. Everyone seems to want to do it near the deadline which can crash the system. Sometimes, they will extend the deadline if this happens.",
                        "_id": "external-import-2abcbe64-9579-402e-b773-77e825205248",
                        "_createdAt": "2019-12-01T21:37:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "created": "2019-12-01T21:37:02Z",
                        "difficulty": 2,
                        "rating": 3,
                        "workload": 4,
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-20bad338-f7bb-4f97-90af-913a4d17f7fd",
                        "body": "I took this class hoping it was going to be easy but it ended up being an absolute nightmare because of the group project. My group members were lazy and incompetent and half dropped the class. This resulted in me coding the whole project by myself. The only upside to that was that I learned alot about Docker and Drone other technologies we used.",
                        "difficulty": 4,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "_createdAt": "2019-12-01T17:47:46Z",
                        "workload": 16,
                        "id": "external-import-20bad338-f7bb-4f97-90af-913a4d17f7fd",
                        "created": "2019-12-01T17:47:46Z",
                        "rating": 3
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "created": "2019-12-01T06:31:29Z",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 8,
                        "_id": "external-import-f76fc05e-eb8b-4de3-bff6-7784ae33b4a2",
                        "body": "There are one individual project and one group project, some case studies, and labs. No exam.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-12-01T06:31:29Z",
                        "id": "external-import-f76fc05e-eb8b-4de3-bff6-7784ae33b4a2",
                        "difficulty": 3,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "course": null,
                        "workload": 3,
                        "_type": "review",
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester"
                        },
                        "body": "Easily one of the more terrible courses I've taken.\n\nIndividual project:  This was added last minute (as revealed by instructor/TAs), and was not described well and the systems required (RStudio and Atlas) did not work well and routinely caused frustration\n\nGroup project:  dependent on project and group; I was lucky enough to have a great group, but as with any group project this has the potential to be disastrous if the group members don't work well.\n\nCase Studies:  7 case studies throughout the course; I found these to be a complete annoyance and of absolutely no value\n\nOverall:  I'm struggling to understand how this is a graduate course offering in pursuit of a MS in computer science; even more so, how did this make it to be one of 3 courses to satisfy a requirement for the Interactive Intelligence specialization?!  There is no valuable computer science related content, the case studies focus on medical conditions and the limited programming assignments are not well described nor explained.  This course is by no means graduate level and feels more like a high school level elective course.  In all a complete waste of time and waste of whatever minimal effort you put into it.",
                        "id": "external-import-084a65e0-eebf-4084-9a0e-5239553b2b31",
                        "created": "2019-11-29T14:37:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_id": "external-import-084a65e0-eebf-4084-9a0e-5239553b2b31",
                        "difficulty": 1,
                        "_createdAt": "2019-11-29T14:37:07Z"
                    },
                    {
                        "course": null,
                        "_type": "review",
                        "rating": 1,
                        "_id": "external-import-54c13527-7a60-4446-b9a5-911745bcf94b",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-11-05T09:46:04Z",
                        "id": "external-import-54c13527-7a60-4446-b9a5-911745bcf94b",
                        "created": "2019-11-05T09:46:04Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "body": "A very boring courses and not necessarily an easy A either. Lectures are completely useless. We have 7 case studies, 7 labs, 1 individual project, 1 group project.",
                        "workload": 20,
                        "difficulty": 3
                    },
                    {
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "id": "external-import-ed6fe688-fa50-4883-a9b0-f085efe4dd3d",
                        "created": "2019-10-31T04:13:47Z",
                        "difficulty": 3,
                        "_createdAt": "2019-10-31T04:13:47Z",
                        "_id": "external-import-ed6fe688-fa50-4883-a9b0-f085efe4dd3d",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "body": "I think this was a great first course to the OMSCS program.  There were lots of changing due dates that can be confusing.  But but aligning as a team and staying ahead of due dates was very helpful. The Instructors and the TA’s were awesome.",
                        "course": null,
                        "workload": 10
                    },
                    {
                        "created": "2019-10-22T14:37:25Z",
                        "_createdAt": "2019-10-22T14:37:25Z",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-d1951eb6-a39e-4724-a5b5-c8c2021499a0",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "_id": "external-import-d1951eb6-a39e-4724-a5b5-c8c2021499a0",
                        "body": "I am in my 4th semester, having completed 5 courses prior to this semester. I am pairing this class with Machine Learning to offset my workload a little bit, but still maintain 2 classes for the Fall. This semester had a group project, many small individual assignments, and no exams. I watch almost none of the videos (except for the first few, just to see how they were) and really don't feel like they add much to the content.\n\nThis semester has a lot of pain points, but it also seems like a lot of things are being changed. In terms of content, I'm not finding this course any more difficult than previous semester reviews share. Yes, the deadlines are swapped around a lot right now. Yes, I can't use the syllabus from the beginning of the semester reliably for due dates. And yes, this semester is disorganized and a lot of the systems they're giving us to work with are crashing a lot.\n\nBut through all this, the instructors are somewhat flexible and willing to work with all the students, and the homework takes almost no time to do at all (in comparison to other courses). Just don't put everything off til the last day, because other people are putting it off too and overloading some of the course's sites making it hard to get some of the data you need. \n\nI think after all the kinks are worked out with server resources and how the assignments flow, this will continue to be as easy as it was before. If you're a current student and you have qualms, DO THE COURSE SURVEYS. The instructors cannot fix what they do not know about!",
                        "workload": 5,
                        "difficulty": 1
                    },
                    {
                        "created": "2019-10-20T17:12:59Z",
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_id": "external-import-f7712cdc-2d93-4eb2-bfff-f2c3ec36c7e6",
                        "id": "external-import-f7712cdc-2d93-4eb2-bfff-f2c3ec36c7e6",
                        "_createdAt": "2019-10-20T17:12:59Z",
                        "course": null,
                        "workload": 7,
                        "body": "Please stay far away from this class! This is my 8th course taken in this program and this is the most disorganized course I've ever taken at any point in my academic career. The tools that you use for labs rarely ever work and are frequently down. Extensions are given to certain assignments and not others. There's an individual project that was thrown in at the last minute which was poorly thought out and adds zero value to the course. There are a million announcements made on Piazza throughout the week, good luck keeping up with that. Labs provide poor instructions, FHIR assignment provides no instruction, case studies provide no substance and there's something due every week. This course is absolutely horrible! Stay away!"
                    },
                    {
                        "_id": "external-import-50c53c60-4b7c-4c21-a625-d20295970cc9",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 1,
                        "course": null,
                        "workload": 10,
                        "id": "external-import-50c53c60-4b7c-4c21-a625-d20295970cc9",
                        "created": "2019-10-15T05:07:39Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "_createdAt": "2019-10-15T05:07:39Z",
                        "body": "One of the worst course ever. Poorly organized and way too much noisy communication over Piazza.  Totally disappointed with the course organization. \nThe content boring and if you don't have enough of web development or software engineering experience you would have to struggle a lot.",
                        "difficulty": 4
                    },
                    {
                        "_type": "review",
                        "workload": 10,
                        "_createdAt": "2019-08-10T15:24:13Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "The project is actually quite hard. If you don't have great teammates, or if no one in your team has experience in web development, the project would be very challenging. Most of the content in this class is about the health system. I don't recommend this class.",
                        "_id": "external-import-8be66825-c3cb-48c4-84f6-ae83e9eb90bf",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 3,
                        "course": null,
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-8be66825-c3cb-48c4-84f6-ae83e9eb90bf",
                        "created": "2019-08-10T15:24:13Z"
                    },
                    {
                        "created": "2019-07-13T05:44:38Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-07-13T05:44:38Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "body": "Easy but boring course.",
                        "id": "external-import-bccadf62-4457-45a5-91b4-8b1edac78fdc",
                        "_type": "review",
                        "workload": 5,
                        "_id": "external-import-bccadf62-4457-45a5-91b4-8b1edac78fdc",
                        "difficulty": 2,
                        "rating": 2
                    },
                    {
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 2,
                        "workload": 8,
                        "_id": "external-import-d8917fa9-62c3-46d4-80c2-abe4b5fa3fcb",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-d8917fa9-62c3-46d4-80c2-abe4b5fa3fcb",
                        "_createdAt": "2019-05-14T13:35:55Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "This is my 8th course and the first that I didn't like.\n\nThe course content is composed by several parts, I'll comment them bellow:\n- Udacity Lessons:\n - They are well recorded, featured an interesting content and videos length are reasonable.\n- YouTube Live Lectures:\n - Although Professor Jon Duke is a nice guy and very excited about the subject, these lectures were lengthy and featured little content. There were 2 lectures of 1 hour each per week. The real content of each lecture could've been delivered in 10 minutes or less. I understand they were live, i.e., unedited. But requiring us to waste 2h per week for almost no content is too much.\n- 6 case studies:\n - These cases had little correlation to informatics. They were too dense in the medical context  and too shallow in the informatics side.\n- Activities in INGInious:\n - Auto-graded **super** simple activities. We had to write very simple programs or answer simple 'googleable' questions.\n- 2 exams:\n - Super shallow quizzes. \"Fill in the blanks\" like tests. You basically have to watch the lectures and complete the **exact** sentences said in the videos.\n- Group project:\n - This is the core of the course: a big open project that you must do in group. You have to join a 4-6 people group and develop a solution for a real problem in Health Informatics. I've spent more than half of the time in this project. Although the intention is good, working in groups is always stressful. Some members of my group were completely absent, and some did little to help. You always learn developing a piece of code but the learning had little to do with Health Informatics, instead I had to learn a new language/framework chosen by the group.\n\nIn the end, the subject is interesting and has a lot of room for Informatics, but my learning outcome was little (despite scoring A).\n\nPS.: the weirdest thing is this course being an elective for the 'Interactive Intelligence' specialization.",
                        "created": "2019-05-14T13:35:55Z"
                    },
                    {
                        "_createdAt": "2019-05-06T08:21:28Z",
                        "course": null,
                        "id": "external-import-a3e545b5-596e-4801-bd2d-07d9a96205f5",
                        "_type": "review",
                        "workload": 10,
                        "_id": "external-import-a3e545b5-596e-4801-bd2d-07d9a96205f5",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-05-06T08:21:28Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 4,
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "Introduction to healthcare informatics is good course if want to understand how informatics works. I found it fun course and learnt about FHIR.\n\nContent:\n- Provides overview about informatics and how complex the field is. Also, includes guest lectures from industry practitioners. \n- Introduction to FHIR with activities on  INGInious.\n- Check your understand to test how will you resolve case study topics\n- Group Project where you will develop a app using Git, Docker, Jenkins, Rancher,..\n- Stretch assignments on different topics (Django, ANSI, FHIR, ...)\n\n\nWhat is good about the course?\n\nInformatics as topic is vast. Anyone who has worked on HL7 in past will appreciate the ongoing efforts with respect to FHIR.\nThe course teaches you how to use FHIR resources.\nGroup project for me was fun. Again, depends on your team and mentor.\n\nPlenty of stretch assignments to improve your score.\n\nWhat may disappoint?\nIf you are expecting lot of ML, DA, AI,  assignments then you will be let down.\n\nThings to take care:\nGroup projects can easy if your team plans all the activities well in time. Requires team effort so be willing to contribute don't wait try to finish things at the earliest.\n\nThis is one of the courses which can combined with other courses."
                    },
                    {
                        "_createdAt": "2019-05-04T10:19:49Z",
                        "rating": 3,
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-60fb4048-8f1d-4620-b449-7031d2d5dffe",
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "body": "**Rating:** If you are  **deeply interested in medical services and the idea of making your own data driven medical app,** then this is a great class.\n\nAny interest level less than the above and this class will be **deathly boring**!!!!!\n\nThe people complaining about how boring it is have the wrong expectations.  Ask yourself: \"do I wan to learn 15 new standards and tools for fetching disease and medication types in a clinical setting?\"  If that makes you gag, run away.\n\n**In terms of difficulty:** it is easy to get an A in this class *but that does not make it easy.*\n\nAn aim of the class is that students learn to use a real-world medical data standard and apply that to real problems.\n\nThe APIs for the data standard and many of the exercises are difficult because they are either hard to understand or comprise a large amount detail.\n\nThe team project, which spans most of the course, is made difficult by the infrastructure set up required (i.e. there was not standard infrastructure provided).\n\nSo understanding the standard and getting an app to work can be hard.\n\nWhat makes getting a grade easy is that a) the exams are open book and can be re-taken once; b) there numerous extra credit assignments; c) extra credit is available for doing an especially good job on some component or another; d) most points outside of the project can be re-tried until you get a perfect score.\n\n**How to succeed:**\nMost of your effort will be on the team project, where you make your own app as a team.\n\nMake sure and know Java (as the APIs require it) and whatever front end language you prefer.  The tech setup involves docker and rancher.  The data standard is FHIR.  Get familiar with any of those as you see fit.  Or make sure your team has a mix of people used to docker setup, using complex APIs and doing decent front ends.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "id": "external-import-60fb4048-8f1d-4620-b449-7031d2d5dffe",
                        "created": "2019-05-04T10:19:49Z"
                    },
                    {
                        "rating": 3,
                        "course": null,
                        "workload": 10,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-04-28T19:39:32Z",
                        "_createdAt": "2019-04-28T19:39:32Z",
                        "_type": "review",
                        "body": "Contentwise this class is really easy. But unfortunately there are many moving parts: \"case studies\" (either directly on canvas or to be submitted as PDFs), \"activities\" (on inginious), assessments (quizzes on canvas), surveys, stretch-assignments and a group project with multiple deliverables. The professor is a bit present on piazza, but mostly it's TAs - they are doing their best to keep everything on track and everybody informed about upcoming deadlines for all these types of assignments.\n\nThe video lectures are completely useless and do not seem connected to anything else in this course. The professor (Dr. Duke) does very interesting live lectures on youtube... but unfortunately it's not the same as udacity lectures, it is an hour long live stream with a couple of slides.\n\nThe group project is... interesting. They pair you up with \"external mentors\" - we did a project together with a researcher of another university. For these external people at times it feels like we are code monkeys to them... which is strange - I would usually charge for this exact type of work.\nThe deliverables are mostly adding unnecessary overhead (e.g. they ask for an updated gantt chart all the time... I have not seen a small-scale agile project being managed with gantt charts in quite some time). Bottom line: although the class is really light, the group project can be interesting but you could also spend a lot of time on it.\n\nOverall, take it if you need an easy A and want a light pairing for another class. Or if the group project with an external \"mentor\" in the medical space sounds intriguing.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 1,
                        "id": "external-import-2d2a5e96-951c-4c02-99fd-03b9b1adafcb",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "_id": "external-import-2d2a5e96-951c-4c02-99fd-03b9b1adafcb"
                    },
                    {
                        "id": "external-import-96b3e7b8-3cf6-46ec-adaa-b621d09116a7",
                        "difficulty": 2,
                        "course": null,
                        "body": "This is my second course in the program, and I took it alongside ML4T. \n\nAs far as work, there are several lectures on Udacity, live lectures on YouTube, 6 case studies, activities in INGInious, 2 open-book/open-note exams, and a large group project.\n\nI strongly disliked this course. The Udacity lectures consisted of one of the professors sitting at a table and talking about various topics for an hour. They were extremely dry and I found it hard to maintain interest. Instead of picking 3 or 4 main topics related to healthcare informatics, I felt like he talked about 15 or so different things without going into any particular depth. I ended up finding the content confusing, and came out of the course feeling like I didn't really learn anything.\n\nThe INGInious activities were extremely frustrating. Some of them had you go to healthcare informatics related websites and search around for answers, but the questions were sometimes vague, so you would just copy and paste various answers until you got the right one. And the coding problems were even worse. Your code could work locally, but then you would submit your answer and it would be wrong. But you wouldn't get a helpful error (usually just an NPE). You also couldn't see the unit tests, so you have no idea what INGInious is expecting, and you can't debug your code in INGInious, so good luck figuring out what was wrong. A lot of people were very frustrated with that whole thing.\n\nAnd then... the group project. I am very biased towards the negative because my group was absolutely useless. I literally coded the entire project while they pretended to do research and did some slides (which all needed correcting). This is why I hate group projects - I ended up doing a crazy amount of work to make sure I got an A, which is completely unfair. I would much rather the project be individual so my grade is entirely reflected on my work, and my work alone. Then I don't have to waste time and frustration with useless group meetings and trying and failing to get any work out of my teammates. Now, if you have a good group, maybe the project is enjoyable, but I hated it, and it turned me off of this class even more-so than I already had been.\n\nDespite coming out with an A, I would definitely NOT recommend this class.",
                        "_createdAt": "2019-04-28T15:28:27Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "created": "2019-04-28T15:28:27Z",
                        "_type": "review",
                        "rating": 1,
                        "workload": 12,
                        "_id": "external-import-96b3e7b8-3cf6-46ec-adaa-b621d09116a7",
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "difficulty": 2,
                        "_type": "review",
                        "_createdAt": "2019-04-27T21:12:56Z",
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "_id": "external-import-9fd76371-5449-4826-97b8-5d41bc76e380",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-9fd76371-5449-4826-97b8-5d41bc76e380",
                        "created": "2019-04-27T21:12:56Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "rating": 4,
                        "workload": 9,
                        "body": "More so than any other course, I was looking forward to this one the most when I first joined the OMSCS program, given my interest in both health and technology. Overall, it wasn’t a difficult course and I think that IHI has some good aspects going for it, but for various reasons it falls short on executing as a whole when compared to other courses in the program. For example, I lucked out on finding a great team (by joining one early with other motivated individuals) and landing an interesting project topic that I was passionate about; the project also promised to integrate industry-standard tools, including not just GitHub, but Docker, Jenkins, and Rancher, in addition to FHIR, a developing standard library in the HI world. Unfortunately, devops assistance from the TAs in integrating all of these tools was inconsistent at best, and despite our hard-working team we only got it all working in the final week.\n\nThe project was by far the most interesting part of the course, but besides the 5 deliverables grades also come from case studies, activities, and short assessments. Despite being interesting on their own case studies only somewhat resembled what we were learning, and while activities were very relevant to learning objectives the auto-grader had some issues that at one point were just never fixed and the grade was replaced with another assignment. One of the most frustrating things was navigating often vague instructions for assignments, and only after receiving grade feedback realizing that we were supposed to read the grader’s mind on what they were looking for. Though most of the Udacity lectures were dull with minimal visual learning tools and core concept emphasis, I did appreciate the frequent interviews with industry professions which painted a picture of the current state of HI. Having access to the in-person course lectures was interesting too, but maybe not necessary.\n\nI think that there is some self-awareness that they need to improve the course - there were 5 surveys and 4 “Check Your Understanding”s graded on completion. If you are interested in the subject matter, I’d say throw yourself into the team project, because the more you're left alone to learn how to integrate FHIR and build something interesting the better the result will be."
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 6,
                        "id": "external-import-eeb65bd0-c974-4347-9033-e243e13b8200",
                        "created": "2019-04-26T16:04:30Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "_id": "external-import-eeb65bd0-c974-4347-9033-e243e13b8200",
                        "body": "This class was one of the most boring and seemingly useless classes I've taken. The only learning benefit i got was from the group project since I had never done front-end development before and had to learn React super fast. Video lectures were absolute trash, and it seemed like they were just giving you busy work the entire semester. They just want to seem like they matter as a class. Anyway... it's an easy A and you can double up on classes in a semester if you do this one. Have fun...",
                        "_createdAt": "2019-04-26T16:04:30Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2
                    },
                    {
                        "difficulty": 2,
                        "workload": 5,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv"
                        },
                        "_id": "external-import-05abe2de-3610-400f-8945-dec3f4b42fc0",
                        "id": "external-import-05abe2de-3610-400f-8945-dec3f4b42fc0",
                        "created": "2019-04-26T15:42:48Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "body": "This class was one of the most boring and seemingly useless classes I've taken. The only learning benefit i got was from the group project since I had never done front-end development before and had to learn React super fast. Video lectures were absolute trash, and it seemed like they were just giving you busy work the entire semester. They just want to seem like they matter as a class. Anyway... it's an easy A and you can double up on classes in a semester if you do this one. Have fun...",
                        "_createdAt": "2019-04-26T15:42:48Z",
                        "rating": 1
                    },
                    {
                        "difficulty": 2,
                        "workload": 4,
                        "id": "external-import-0892516b-b5ac-4345-9b56-6b66d87e853a",
                        "_createdAt": "2019-04-25T07:12:29Z",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-0892516b-b5ac-4345-9b56-6b66d87e853a",
                        "body": "YIKES!! Well here we go.....This course is probably one of the worst courses I've take. The video lectures are so dry that I've fallen asleep to them, no exaggeration. You're not going to learn much from the course except that the IT of US healthcare companies / hospitals is more rickety than a Windows 98 machine and the tech feels like it's a Windows 98 machine. The homework assignments about how well you can Google an answer. The two \"tests\" are really just about regurgitating the info from the videos (if you're lucky someone will post the notes on piazza and you'll be set). The group project is always a mess, because they will somehow pair you with people all over the world in different times zones and actually get a sponsor to work with you. Typically your project sponsor has the notion that they now have 4/5 full time software engineers which is never the case so I hope you're good at tempering expectations. Oh and regardless of what your project sponsor actually needs, there are a whole host of check boxes you have to tick from the course instructors / TAs about course material. This is regardless if your sponsors projects need it. You can certainly get an easy A in this course if you want, but you'll hate yourself the entire time.",
                        "created": "2019-04-25T07:12:29Z",
                        "rating": 1,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "body": "This was my last course in OMSCS, and when compared to all of the other courses which I have taken, this was by far the easiest.  Though, this course was really fun, primarily because Dr. John Duke, MD makes it so.  I really enjoyed the case studies in this course, you will learn a lot about medical conditions, and you are free to think of creative ways in which technology can be applied to help treat these conditions.  This course reminds me of Educational Technology, given its open ended nature.  There is a group project at the end of the course, so you better try and land in a good team.  My team was great, everyone pulled their own weight until the end.",
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "_id": "external-import-d963c988-c726-4173-afbf-fc1bd023371e",
                        "_createdAt": "2019-04-25T04:00:41Z",
                        "created": "2019-04-25T04:00:41Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 1,
                        "rating": 4,
                        "id": "external-import-d963c988-c726-4173-afbf-fc1bd023371e"
                    },
                    {
                        "_type": "review",
                        "workload": 6,
                        "_id": "external-import-e2e8c639-aa53-4d21-b8f5-757415e9fd57",
                        "_createdAt": "2019-03-30T05:48:43Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "id": "external-import-e2e8c639-aa53-4d21-b8f5-757415e9fd57",
                        "created": "2019-03-30T05:48:43Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "body": "Pros:\n--\n*This class should pair well with almost any course if you're determined to take more than one class.  It was nice to not have to worry about exams.\n\n*You're exposed to a wide range of different health informatics applications.\n\n*You get to work with real industry mentors on the group project.\n\nCons:\n--\n*The lectures and homework have very little depth.  You won't leave the class with any new skills you can apply.\n\n*The group project topics were pretty varied in terms of depth and skills required.  It's hard to tell what (if anything) you'll get out of the experience.  The project seemed overly focused on the process and checking rubric boxes rather than applying course material Personally I would have preferred a more consistent experience focused on applying FHIR in depth.\n\n*There were several times on the homework assignments where the autograder for the assignments had bugs or the intended answers to the questions required guessing on which specific word or phrase was the answer.  You'll definitely need to use multiple submissions to make pointless tweaks to get to the acceptable answers.  The TAs seemed to know this from the beginning of the course and would announce that they would be making manual grade adjustments for these items.  Clearly, these were recurring items from previous semesters, but fixes were never made.  On a more fundamental level, the assignments just weren't designed well to increase or assess knowledge.\n\n*Grade release was pretty slow for the auto-graded assignments, especially considering that there were relatively few students in the course.\n\n*When the group project was going on, the course could be a bit of a time-suck depending on your external mentor, teammates, and topic.",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 3
                    },
                    {
                        "body": "I'm just getting around to reviewing a class I took 3 years ago.  I have seen many complaints that this class was too easy and not worthy of the program.  I enjoyed this class.  Although the workload was very light it was a great insight into how the data flows (or sometimes, doesn't) in the medical field.  When I took it in 2016 the material was not difficult at all.  There were reading assignments, multiple choice quizzes and a group project.  I learned a lot about data standards in the field and how FHIR works.  I worked with a great group and we turned out a grade A project.  The videos were easy to understand and  well organized.  No complaints here.",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester"
                        },
                        "_id": "external-import-b8c855cb-ea8f-4796-90ed-d74dbc6c7d5f",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-b8c855cb-ea8f-4796-90ed-d74dbc6c7d5f",
                        "created": "2019-03-13T03:12:41Z",
                        "_createdAt": "2019-03-13T03:12:41Z",
                        "course": null,
                        "workload": 5
                    },
                    {
                        "id": "external-import-bf120cf6-5bb0-453d-b21c-7b7177e7e69b",
                        "created": "2019-02-26T06:33:01Z",
                        "_type": "review",
                        "_createdAt": "2019-02-26T06:33:01Z",
                        "_id": "external-import-bf120cf6-5bb0-453d-b21c-7b7177e7e69b",
                        "body": "This is what they call a real useless course. If you're \"over it\" when it comes to the program, and just want a low-effort course for an easy A, this is for you!\n\nPeople in my project group were stressing for no reason; we created a crappy website and got over 100% on the project.\n\nPractically every homework or quiz can be done over multiple times; with the auto-grading there is no excuse for not getting close to 100% on practically everything.\n\nThe quality of lectures is the lowest in the program, and I'm told that they were redone recently? Every quiz was a regurgitation of inconsequential facts. Even as somebody who has worked in health informatics, I would say this course was pretty useless.",
                        "difficulty": 1,
                        "workload": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 1,
                        "course": null
                    },
                    {
                        "body": "Overall good course, what can make it difficult or easy is the group project.",
                        "difficulty": 3,
                        "rating": 4,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-02-08T01:51:04Z",
                        "_type": "review",
                        "created": "2019-02-08T01:51:04Z",
                        "semester": {
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-723bae46-161c-4022-8bd9-5e30f093e594",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "id": "external-import-723bae46-161c-4022-8bd9-5e30f093e594"
                    },
                    {
                        "difficulty": 3,
                        "id": "external-import-bacde0ea-0341-406a-817b-55dcaca89d61",
                        "created": "2019-01-16T10:09:01Z",
                        "_type": "review",
                        "workload": 10,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        },
                        "_id": "external-import-bacde0ea-0341-406a-817b-55dcaca89d61",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-01-16T10:09:01Z",
                        "rating": 2,
                        "body": "Boring class, but I was not at all interested in searching through health databases; I thought we were going to use NLP algos and do something fun. Nothing fun in this class but easy(at least when I took it) class to pair with a harder one.\n\nMy only real complaint as far as difficulty was the Java assignment: it came out of nowhere and it was 20% of the grade. Very sneaky way of getting students to drop out of fear. They gave us a chance to re work on it after but we didn't know that initially; I almost lost my entire group after that assignment as some students freaked out.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "id": "external-import-1c990820-e4fc-43fd-8b82-1886b2a4e98f",
                        "created": "2019-01-07T14:03:52Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "workload": 10,
                        "body": "Well, this is most certainly an easy course but definitely not an unimportant one. Despite being a course where the amount of content covered is typically only half as much as you would cover in any other course the course has its strong points. This is probably the best introductory course for Java language, and also a very good introductory course for a number of industry level projects particularly those that deal with interoperability of legacy systems and legacy data and standards. The course covers some finer aspects of how to approach interoperability something which other areas of computer science can readily make use of and that is one important outcome of the course.",
                        "_type": "review",
                        "course": null,
                        "_createdAt": "2019-01-07T14:03:52Z",
                        "semester": {
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-1c990820-e4fc-43fd-8b82-1886b2a4e98f"
                    },
                    {
                        "_id": "external-import-c178943f-939e-40c5-b5cb-7968f92e08fc",
                        "body": "Nice GPA booster course, not a very fulfilling one.\n\nThis course was easier than most of my undergraduate courses.  The course was structured as follows:\n- 7 or 8 quizzes\n- 5 or so homeworks\n- 1 group project\n- \"stretch assignments\" for extra credit\n\nPersonally don't think I learned much about anything, besides that the healthcare industry needs some serious tech overhaul.  The assignments are not released up front so you cannot front-load the work, and need to go with the slow pace for the lackluster material.\n\nPros: probably the most helpful TAs I've experienced in OMSCS; course site was extremely informative and kept up to date; TAs posted weekly threads of what was due that week which helped keep pace appropriately.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-c178943f-939e-40c5-b5cb-7968f92e08fc",
                        "created": "2018-12-28T16:54:04Z",
                        "rating": 2,
                        "course": null,
                        "workload": 2,
                        "difficulty": 1,
                        "_createdAt": "2018-12-28T16:54:04Z",
                        "_type": "review",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "id": "external-import-91dcbe47-5d54-433c-94ab-3390df529f52",
                        "created": "2018-12-13T14:20:16Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "rating": 3,
                        "difficulty": 2,
                        "_id": "external-import-91dcbe47-5d54-433c-94ab-3390df529f52",
                        "course": null,
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-12-13T14:20:16Z",
                        "_type": "review",
                        "body": "Course was well done in terms of assignments, lectures, etc., I just didn't really like the topic much. It's very specific to health care standards and APIs and not really at all about analysis, which was what I was hoping for. If you are interested in health care standards, it's a great choice though.\nThere is a group project and we got to form our own teams which was good. We had a mentor from the CDC and she was awesome, meeting with us weekly and providing input on our project.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-08T16:43:34Z",
                        "_id": "external-import-f09a3cdf-8c1c-433c-9de6-36475badf0e7",
                        "body": "This was a very easy course. We were taught various industry standards for health informatics and worked on a group project building something that utilized the standards we learned about. The class was useful as an overview of the tools and current state of the industry. The project was also well structured and gave everyone the chance to contribute.",
                        "id": "external-import-f09a3cdf-8c1c-433c-9de6-36475badf0e7",
                        "created": "2018-08-08T16:43:34Z",
                        "_type": "review",
                        "workload": 4,
                        "difficulty": 1,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        }
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "_id": "external-import-f478415f-c83b-4302-aa9f-055d23da6d70",
                        "workload": 5,
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 4,
                        "id": "external-import-f478415f-c83b-4302-aa9f-055d23da6d70",
                        "created": "2018-08-08T15:57:10Z",
                        "_createdAt": "2018-08-08T15:57:10Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "body": "Really interesting material, the lectures have been revamped. I really feel like the material covered is up-to-date, although alot of subjects werecovered throughout the course of the semester. The professor does a good job of explaining the content pretty clearly.  Most of the grade will come form one group project(35%) and individual assignments(40%). Topics that are taught: FHIR API, Overall healthcare system and how technology fits in, SNOWMED, Data Standards, LOINC code etc..."
                    },
                    {
                        "_createdAt": "2018-07-29T22:46:55Z",
                        "id": "external-import-bfcb4e88-aad3-44e4-947e-06dbabac4148",
                        "created": "2018-07-29T22:46:55Z",
                        "body": "I learned a great deal about health informatics.  The course had a few challenging moments, however, it was a pretty easy course.  There was 1 group project and I feel the team I was on made the assignment very simple.",
                        "difficulty": 2,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv"
                        },
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 12,
                        "_id": "external-import-bfcb4e88-aad3-44e4-947e-06dbabac4148"
                    },
                    {
                        "_createdAt": "2018-05-07T20:37:41Z",
                        "rating": 3,
                        "id": "external-import-a65e3bbd-c5e9-43ad-bcb0-f3b758f2e94c",
                        "created": "2018-05-07T20:37:41Z",
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "body": "Pros: Overall well run. I work in Healthcare IT and found class useful. Easy workload, makes a good candidate to pair up with another class.\nCons: Subject matter is very boring and videos are dry.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_id": "external-import-a65e3bbd-c5e9-43ad-bcb0-f3b758f2e94c",
                        "_type": "review",
                        "workload": 6
                    },
                    {
                        "body": "This is one of my first courses. I really liked the course. The professor was so full of energy in the videos. The essays were fun to write. I spent a lot of time reading, and rereading, and reading the external material. Spend the time to watch the videos and write well-crafted essays. TA's will reward you with extra credit. I think they read so many essays, they can tell the difference between those who spent the time learning the stuff and who's just bs-ing their way through. I highly recommend the course!",
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "_createdAt": "2018-05-03T05:58:28Z",
                        "course": null,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-b0325e7c-6298-449d-bdc6-8e3fd349862d",
                        "created": "2018-05-03T05:58:28Z",
                        "_id": "external-import-b0325e7c-6298-449d-bdc6-8e3fd349862d",
                        "difficulty": 3,
                        "_type": "review"
                    },
                    {
                        "_type": "review",
                        "body": "The Health Technology background is useful, the class has minimal technology training, the real-world project is the saving grace that made the class worth taking.\n\nThe lecture videos are the worst of any OMSCS class I've taken.  They are mostly the instructor speaking with no use of visual aids or poorly edited interviews with people in the health field.  The class was very disorganized with many poorly communicated corrections and changes through the semester.  There is almost no teaching on the actual technology beyond basic concepts and logical architecture of FHIR.  The activities are rudimentary and don't provide much benefit other than following directions and using trial and error to get things working.  The essays focused more on references than content.\n\nThe workload week to week was very inconsistent.  One week would be 10+ hours and the next might be 3.\n\nThe real-world group project for the class was rewarding and I learned a lot from that.  I would have preferred to start it much earlier and remove a lot of the extra unneeded lectures / interviews.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-04-30T11:55:19Z",
                        "rating": 3,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "workload": 8,
                        "id": "external-import-62f108b5-866b-423c-b085-26cc49628396",
                        "_id": "external-import-62f108b5-866b-423c-b085-26cc49628396",
                        "difficulty": 2,
                        "_createdAt": "2018-04-30T11:55:19Z"
                    },
                    {
                        "body": "One of the worst courses in this program even after the complete remake in Spring 2018. I would say the course is over ambitious in terms of scope. It attempts to cover many subjects within the area or US health system and standardization for interoperability. It feels like fitting 20 pounds of stuff into a 5 pounds bag. In the end, I did not get much out of it. In addition, the course lectures include many interview videos which are often lengthy but do not provide much academic values to the topic. The only reason I took it is because it is mandatory for the II specialization. Instructors may re-evaluate their choice of using HL7 v3 standard for the FHIR activity because there are limited examples available online.",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv"
                        },
                        "_id": "external-import-d7c89639-366f-4de2-9a81-fcd2a11e8bab",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-d7c89639-366f-4de2-9a81-fcd2a11e8bab",
                        "created": "2018-04-29T20:01:48Z",
                        "difficulty": 1,
                        "rating": 2,
                        "workload": 5,
                        "_createdAt": "2018-04-29T20:01:48Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review"
                    },
                    {
                        "_type": "review",
                        "workload": 3,
                        "body": "Extremely easy class. Virtually no work, but also no information.",
                        "created": "2018-04-29T19:08:03Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        },
                        "_id": "external-import-14feb982-ddfd-4024-bcbc-39eb40883669",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-04-29T19:08:03Z",
                        "id": "external-import-14feb982-ddfd-4024-bcbc-39eb40883669",
                        "rating": 2,
                        "course": null,
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "workload": 7,
                        "id": "external-import-29d2969c-a41f-40f0-9a96-bbb9470c6609",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_id": "external-import-29d2969c-a41f-40f0-9a96-bbb9470c6609",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "rating": 4,
                        "body": "Pros: Interesting material! Since it's a domain-specific course (focused on healthcare), we're constantly exposed to real-world applications of the technology. This includes current and historical challenges, and new opportunities. The course incorporates a fun group project working with an external mentor (from the healthcare industry) to create a FHIR app that might actually turn into something. (I cringe at all the throwaway code I write for an OMSCS course, so this was a refreshing change.) The TAs are super responsive and I was delighted how fast the assignment grades came back!\n\nCons: This semester the course has been significantly reworked. The lectures are new and autograded activities have been created from scratch. There were a few hiccups with the activities, but the TAs were always quite responsive and graded generously in these situations.\n\nMisc.: Students are expected to write numerous short-form essays (200-400 words), citing sources using APA format. This was new to most of us, and the TAs were helpful in getting us familiar with it. The autograded activities required Java code written to interface with a FHIR server. If you're learning Java while also learning the FHIR API, expect a few weeks of pain.",
                        "_createdAt": "2018-04-03T19:14:05Z",
                        "created": "2018-04-03T19:14:05Z",
                        "semester": {
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring"
                        }
                    },
                    {
                        "course": null,
                        "difficulty": 2,
                        "_type": "review",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        },
                        "body": "I loved this course because it offered a view into a huge field that I was unfamiliar with, and showed just how much of the field could stand to benefit from technology. The essays were a bit high level considering they have a low word count requirement, and the group project can be hit or miss depending on the team sponsor/mentor, but this is one of those courses where a student can get a lot out of it if they are curious about the healthcare industry and willing to put in extra effort.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 5,
                        "workload": 8,
                        "id": "external-import-2443c20a-9985-4846-8b12-45e07b78f886",
                        "created": "2018-03-09T02:49:01Z",
                        "_id": "external-import-2443c20a-9985-4846-8b12-45e07b78f886",
                        "_createdAt": "2018-03-09T02:49:01Z"
                    },
                    {
                        "created": "2017-12-24T16:59:02Z",
                        "course": null,
                        "body": "Really easy class. I didn't watch any videos. Essay and assignment take 1 hour to finish. The group project is a simple demo. A good class to pair with the hard ones.",
                        "_type": "review",
                        "rating": 4,
                        "workload": 2,
                        "id": "external-import-1dedd10b-7d46-4606-b5a3-b1a14d7fe810",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 1,
                        "_createdAt": "2017-12-24T16:59:02Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_id": "external-import-1dedd10b-7d46-4606-b5a3-b1a14d7fe810"
                    },
                    {
                        "body": "This class is very very easy. The lectures themselves are extremely boring, and I did not learn very much from them. I did have to do most of the development work on our group project BUT, since I did most of the work, I also feel like I learned the most about the FHIR API and how to use it and how some of the health data is structured. That was all really interesting to me. My biggest gripe about this course is that I feel the instructors are focused on assignments and grades... rather than students. Maybe it's because I was taking EduTech at the same time, but I felt like the instructors just LOVED taking points off for things like \"video was 30 seconds too long\" or \"Essay was too long\" (the essays are maximum 800 words - it is hard to sufficiently answer the questions without going over) or \"Wrong format submitted\" (even if the assignment guidelines were modified before the due date), etc.\n\nWe worked with an external mentor (a doctor in Atlanta, Georgia) on our project and he was very helpful and very responsive. It seems most of the External Mentors were really good. I wasn't a fan of our TA Mentor (for the aforementioned reasons), though.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 4,
                        "workload": 5,
                        "course": null,
                        "created": "2017-12-18T23:33:33Z",
                        "_id": "external-import-4e68e491-954c-45bf-b742-4954c3fdb540",
                        "difficulty": 1,
                        "_type": "review",
                        "_createdAt": "2017-12-18T23:33:33Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "id": "external-import-4e68e491-954c-45bf-b742-4954c3fdb540",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        }
                    },
                    {
                        "created": "2017-12-18T23:19:24Z",
                        "_type": "review",
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "workload": 2.5,
                        "_id": "external-import-4485cc9d-fce3-4e33-b898-5cf22ea6cdda",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-4485cc9d-fce3-4e33-b898-5cf22ea6cdda",
                        "body": "This course was very easy , to me,it  didn't meet the expectations of a grad level class. It felt more like a freshman level class in undergrad. We were provided with basic level exercises that were somewhat tricky but doable without too much effort. You do get to learn the high level  concepts in  health IT through lectures,and we have to write three essays through out the course. Lastly,  the course project is the main part of the class,which is somewhat interesting, but risky because you might get teamed up with students around the world,with varying time zones making it really difficult to collaborate.",
                        "difficulty": 1,
                        "_createdAt": "2017-12-18T23:19:24Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 3,
                        "course": null
                    },
                    {
                        "body": "This is definitely one of the easier courses in the program in its current format. You work on a number of quick assignments, as well as 3 essays, but the bulk of the course is spent on a group project. Lectures are good but light on content, you're finished with them halfway through the course. The group project is teams made up of 4-6 people working on mostly pre-defined projects in the healthcare field. In most projects you work with a mentor who is in the healthcare field. As long as you're with a competent team the group project should be fairly manageable. This course would pair nicely with another course as its workload is light and you can balance around a lot of the work to fit your schedule.",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "created": "2017-12-11T22:10:03Z",
                        "_createdAt": "2017-12-11T22:10:03Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "id": "external-import-fd2f9aa8-7cf8-4bfc-b6da-672fb9350dc9",
                        "workload": 5,
                        "_id": "external-import-fd2f9aa8-7cf8-4bfc-b6da-672fb9350dc9"
                    },
                    {
                        "_type": "review",
                        "body": "The material is very interesting. The professor and TA Team are passionate and helpful. Class Piazza Participation is great. As mentioned in the previous reviews, the FHIR activities were pretty interesting and provide hands on knowledge on using APIS accessing FHIR database. The recommended readings provide good background on the topics covered. Would have been better if the team project weight is reduced from the current 35% because the team performance matters a lot in delivering a quality project.",
                        "rating": 5,
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "_id": "external-import-8bb85db8-fa7d-4bee-886d-210dd7d340dd",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 15,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-8bb85db8-fa7d-4bee-886d-210dd7d340dd",
                        "created": "2017-11-03T19:39:51Z",
                        "_createdAt": "2017-11-03T19:39:51Z",
                        "course": null
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 3,
                        "workload": 2.5,
                        "course": null,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-d574b062-5fe3-485f-b33e-2b7e8169d55c",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "_createdAt": "2017-10-31T19:47:00Z",
                        "id": "external-import-d574b062-5fe3-485f-b33e-2b7e8169d55c",
                        "created": "2017-10-31T19:47:00Z",
                        "body": "This course has a lot of small activities (every week there is something to do). The programming activities are interesting but not challenging (the difficulty was mostly understanding the question, other than that they were very straightforward). There are 3 essays with a max of 800 words which does not allow to go deep into the subjects. \n\nIt also has a project which will depend mainly on who is in your group (so you do not end up doing most of the work) and the selected project (you can create your own one but it is preferred that you choose one from a list). \n\nHonestly with a good group of people on your project team and dedicating a short time every week you can get a good grade easily. \n\nBeing this my 7th course I can say that this has been the easiest so far.",
                        "_type": "review"
                    },
                    {
                        "_type": "review",
                        "_createdAt": "2017-10-29T23:55:50Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_id": "external-import-c396b0ca-32e6-4fad-be9d-78b1140a32a1",
                        "body": "***This review is for Fall 2017***\n\nI really do not like this class. I regret taking it. Half of the class consists of short assignments, quizzes, and three essays which all have a hard word limit of 800 words, so you can't really go into depth for any of them. I felt like I didn't learn much through writing them because of this--I just scratched the surface of the topics. The only assignments that I feel like I benefitted from were a series of FHIR activities where we had to work with Java and perform various tasks with a FHIR database. It was a good crash corse in actually using FHIR. You could probably learn more from this course if you spend more time and did all the optional readings, but you could learn just as much independently, using google to find articles and information. I got 100% on everything so far, and I'd be surprised if anyone didn't. \n\nThe second half of the class is a group project. You form groups or 4-6 and then can choose projects from a list provided. You rank your choices in order of preference and then you get what you get. You *are* allowed to think up your own project, but it is discouraged. Our group got one of our last choices, and it wasn't one I was even interested in, which made it very difficult to dedicate a lot of time to it. The project also ended up being quite different than we originally thought. You work with external \"mentors\" from various places like medical institutions, the CDC, etc, on the project. Many of the mentors are busy and don't have as much time to dedicate to the project as your group may need, so it can be difficult to get feedback from them or schedule phone calls. The group project also requires weekly status reports and quite a few powerpoint presentations, which took time to put together. I felt like this time could have been better used actually working on the project. Your grade is basically determined by how you do on the project, which highly depends on which project you end up with.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "id": "external-import-c396b0ca-32e6-4fad-be9d-78b1140a32a1",
                        "created": "2017-10-29T23:55:50Z",
                        "rating": 1,
                        "semester": {
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z"
                        },
                        "course": null,
                        "workload": 4
                    },
                    {
                        "difficulty": 3,
                        "_createdAt": "2017-05-05T18:42:59Z",
                        "id": "external-import-f2bcb1da-514d-4a19-9c62-d75780e40b12",
                        "created": "2017-05-05T18:42:59Z",
                        "_type": "review",
                        "semester": {
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-f2bcb1da-514d-4a19-9c62-d75780e40b12",
                        "rating": 4,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "body": "This class was fairly straightforward when I took it, but I ended up spending so much time on the class project due to my teammates not pulling their weights. Content wise, it was very light, and so I decided to buy two books authored by the professor and read them from cover to cover because I was interested in health informatics. I would suggest picking up the books to maximize your learning in this class, and pick your group members wisely.",
                        "course": null,
                        "workload": 25
                    },
                    {
                        "id": "external-import-e5aa1a89-0c96-4825-85e0-9e174d1d4f61",
                        "created": "2017-01-03T15:26:07Z",
                        "difficulty": 3,
                        "body": "Okay, so this class had some great things and some really bad things. The professor was enthusiastic and presented some interesting material. He not having a CS background had a tendency to spend to much time explaining fairly simple concepts. This was reflected in the early assignments too. Generally, people are correct that this can be an easy A. However, if you end up with a bad group this class can be extremely time consuming. I ended up spending an enormous amount of extra time coding this as a few team members did very little and one did absolutely nothing until the day it was due. Due to it, our project ended up being way less than it should have been and felt that our TA was pretty nice to us given the circumstances. With that said I put a ton of hours into it and was very frustrated with how it turned out because of this. Still did get an A which makes me feel a bit better about this but in some ways not happy that the guy who did almost nothing probably also got an A. The last four weeks I was putting in 20+ hours a week.",
                        "_id": "external-import-e5aa1a89-0c96-4825-85e0-9e174d1d4f61",
                        "_createdAt": "2017-01-03T15:26:07Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "rating": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22"
                        },
                        "workload": 16
                    },
                    {
                        "workload": 5,
                        "body": "This class was the worst class I've ever taken in person or online. The only redeeming factor was getting an A. However, if this was my first course in the program I probably would not have continued. It is very easy, but if your group project isn't an enjoyable experience, you will probably hate this class. If you're not planning on the Interactive Intelligence specialization, don't take this class. Even if you are in II, you may want to wait and take Computational Journalism.",
                        "id": "external-import-df177807-a9cb-4c86-b23e-be5e16077331",
                        "_type": "review",
                        "difficulty": 1,
                        "_createdAt": "2016-12-21T11:51:24Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 1,
                        "created": "2016-12-21T11:51:24Z",
                        "course": null,
                        "_id": "external-import-df177807-a9cb-4c86-b23e-be5e16077331",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22"
                        }
                    },
                    {
                        "created": "2016-12-06T21:09:21Z",
                        "body": "The only redeeming quality of this class was the lectures. Everything else was trying to fit 20 lbs of work into a 5 lb bag. The lead TA for the class, deliberately or not, has a habit of talking down to everyone. For a graduate level course, it's really uncalled for and, outside of a kindergarten classroom, not conducive to learning. \n\nAssignments were a mess, with deadlines sometimes jumping, but always being very short (sometimes in the course of less than 4 days). If you are expecting a class where you can get caught up on weekends, this is not the course to take. It also didn't help for early assignments that the FHIR server used for the class would get overloaded, especially on weekends, preventing students from getting work done. \n\nTack on to that \"engagement\" exercises that were really more like busy work. If you like taking HR engagement surveys, there will be quite a few of them in this course. You also need to provide weekly status updates (which aren't too bad). These aren't as much of a hassle once you've gotten through all the lectures, but it's a pain to juggle early on in the course. \n\nI'm not surprised this course is not being offered in the near future - logistically it is a nightmare, and with the new presidential administration, healthcare in the US will be changing. The topics this course covers now could be ancient history a year from now.",
                        "_id": "external-import-09ce6043-7279-40f9-bb71-650ba1a87311",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 5,
                        "id": "external-import-09ce6043-7279-40f9-bb71-650ba1a87311",
                        "semester": {
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z"
                        },
                        "_createdAt": "2016-12-06T21:09:21Z",
                        "_type": "review",
                        "rating": 2,
                        "course": null
                    },
                    {
                        "difficulty": 2,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_createdAt": "2016-07-18T19:40:51Z",
                        "workload": 3,
                        "_type": "review",
                        "rating": 3,
                        "course": null,
                        "_id": "external-import-69825d93-361e-4ba5-9b0c-94827230de1c",
                        "id": "external-import-69825d93-361e-4ba5-9b0c-94827230de1c",
                        "created": "2016-07-18T19:40:51Z",
                        "semester": {
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "body": "As others have stated very easy class with interesting lectures. If you want to gain something from this class it will be either from the lectures or from the project you decide to work on with your group. That being said it wouldn't be far fetched for this class to receive some sort or rework or restructure in the future"
                    },
                    {
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review",
                        "workload": 10,
                        "created": "2016-05-12T02:17:38Z",
                        "difficulty": 1,
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester"
                        },
                        "_createdAt": "2016-05-12T02:17:38Z",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "id": "external-import-c760e774-4546-435c-9408-e0683999acb3",
                        "rating": 5,
                        "body": "Yes, this class is an easy A. Yes, this class had some major communication problems. \n\nThat said, I loved this class. I have many, many years in the informatics field. This course exposed me to many amazing ideas and technologies I'd never heard of. \n\nI also had an amazing team; our group project could easily be turned into a startup. \n\nI certainly understand why many folk may not like this class. In my case, it was an absolute joy that greatly boosted my self-confidence and had a substantial impact on my career.",
                        "_id": "external-import-c760e774-4546-435c-9408-e0683999acb3"
                    },
                    {
                        "_id": "external-import-7a017ec1-95c7-4b9b-b688-15e04a5b17bd",
                        "id": "external-import-7a017ec1-95c7-4b9b-b688-15e04a5b17bd",
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review",
                        "course": null,
                        "body": "What a disaster. I can't even. This class had no rigor whatsoever and the course stuff ran it extremely poorly. Just for example - a major project of the class (The \"FHIR Activity\") was supposed to be a programming project. It ended up being 10 question, open-book quiz on t-square (that we could take as many times as possible and receive the highest grade), that was worth 15% of our grades. I took it 4 times in about 30 minutes with the reading material in front of me and got a 100% on it. \n\nI don't think even one assignment avoided having its due date changed. The course stuff repeatedly promised assignment materials by a certain date, and then consistently released them a week+ later and then changed the due date to compensate (and consequently acted like they were doing everybody a favor). \n\nThe lecture material was somewhat interesting, but there was literally only several hours of lectures total. \n\nThis class was an easy A at least. Don't bother with it unless that's what you're looking for or if you already have a great project idea that you want to explore with a group.",
                        "difficulty": 1,
                        "_createdAt": "2016-05-10T15:33:25Z",
                        "created": "2016-05-10T15:33:25Z",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "rating": 1,
                        "workload": 1.5,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester"
                        }
                    },
                    {
                        "workload": 4,
                        "_type": "review",
                        "rating": 3,
                        "_id": "external-import-00a1ab8f-eef5-40ea-8f53-9a7af083773d",
                        "_createdAt": "2016-05-10T13:00:03Z",
                        "course": null,
                        "body": "As many others have stated, this class is poorly run with bad communication and inadequate assessment. I had the benefit of a great group for the project, but without that bonus I would have found this class highly frustrating. That said, the basic HIT concepts under discussion are important and interesting. I'm glad I was exposed to them, even in such a suboptimal fashion.",
                        "difficulty": 2,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "id": "external-import-00a1ab8f-eef5-40ea-8f53-9a7af083773d",
                        "created": "2016-05-10T13:00:03Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2016-1"
                        }
                    },
                    {
                        "body": "Unfortunately, this class is pretty much a failure. \n\nOne major problem (and certainly not the least of the problems) is that the course staff is completely disorganized. Nearly every single assignment due date has been revised once or twice. The staff acts as if this is a favor to the students to keep pushing out the dates, but it makes it extremely hard to know what's going on with the course. On top of that, they promise that assignments and documents will be released by certain dates and VERY consistently actually release them several days later (and often push the due dates out in response). \n\nThe lectures are fine. They do a pretty good job of covering the current healthcare situation in the US and different IT solutions/problems to these. Every 2-3 weeks another little quiz is due that tests whether or not you've watched the lectures - I can mostly ignore these until they're due, watch the group of lectures on fast forward in less than an hour, and then take the (open book/notes) quiz using the lecture transcripts for reference. The amount of useful knowledge I feel like I gain from the lectures is minimal. \n\nThe project is ill-defined and we have been able to receive little useful feedback from the assigned TA. It doesn't help anything that the grades and feedback for each assigned deliverable is extremely late (you get feedback from the last assignment nearly by the time the next one is due) and not-at-all detailed. It's hard to know if the project is going in a reasonable direction for a solid grade. *shrug* I guess we'll see. \n\nThere was supposed to be some interesting programming exercises for working with FHIR. This was updated to be some quizzes instead. Apparently, they thought the Masters Computer Science students were too incompetent to figure out some programming exercises. \n\nGaTech really needs to reevaluate this one... Take this one if it's required or if you need easy credits. Don't expect that you'll get much out of it though.",
                        "_id": "external-import-75337300-aff2-4eb0-91cd-b6c8de09d739",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "difficulty": 2,
                        "id": "external-import-75337300-aff2-4eb0-91cd-b6c8de09d739",
                        "_type": "review",
                        "course": null,
                        "_createdAt": "2016-04-04T18:03:02Z",
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "created": "2016-04-04T18:03:02Z",
                        "workload": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "created": "2015-12-11T17:18:39Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor"
                        },
                        "_id": "external-import-345bc5f9-1bc9-4bfc-82a5-62ad0dd4a1cf",
                        "difficulty": 3,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review",
                        "workload": 3,
                        "id": "external-import-345bc5f9-1bc9-4bfc-82a5-62ad0dd4a1cf",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "_createdAt": "2015-12-11T17:18:39Z",
                        "course": null,
                        "body": "This class had some serious issue for me. The lectures were easily the best part. They were well presented and I learned a lot from them. The quizzes were open book so you could easily download the transcripts and ack through them to get the answers easier. \n\nThe group project was easily the worst aspect of this class. My group was very unequal in the amount of work done by each member and the TAs did nothing to remedy this throughout the semester. Furthermore the TAs were often late to respond and not helpful. I had one occasion where I asked a question 3 days prior to deadline for a major project and the TA responded 2 days after the project was due. If you already have a group of people for your project this class could be good and easy, but with the unequal work amongst the group it can be very hard for the people who are doing all the work on the project."
                    },
                    {
                        "rating": 3,
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "difficulty": 1,
                        "_createdAt": "2015-12-07T15:22:55Z",
                        "body": "- 30% Quizzes\n- 20% Activities\n- 50% Project\n\nThe course is about a group project that delivers an app built on top of healthcare data accessible through RESTful FHIR APIs. Make sure to pick your group members carefully instead of randomly. With the right group members, your experience will be positive. With the wrong group members... well, you get the idea. \n\nThe quizzes and activities are open-book. Each multiple-choice/multiple-select quiz tests material from two lectures (10 lectures total). The two activities test your ability to interact with RESTful FHIR APIs and the FHIR data model. If you have any database experience or can think logically, they are a breeze.",
                        "id": "external-import-6f267903-a946-4561-bf60-c9a2e45ca455",
                        "created": "2015-12-07T15:22:55Z",
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester"
                        },
                        "_id": "external-import-6f267903-a946-4561-bf60-c9a2e45ca455",
                        "course": null
                    },
                    {
                        "created": "2015-11-30T16:16:36Z",
                        "workload": 5,
                        "_createdAt": "2015-11-30T16:16:36Z",
                        "_type": "review",
                        "course": null,
                        "id": "external-import-02831225-f941-482d-b811-ee056380083c",
                        "_id": "external-import-02831225-f941-482d-b811-ee056380083c",
                        "body": "Overall, I regret taking this class. The material is relevant to the job and research market, but it is terribly presented. Still, I would be able to appreciate the time and effort the videos and organization of material must have taken, but there is nothing to back this learning up. The assignments and quizzes are a joke - just testing rote memory from the lectures - and the phrasing is terrible. There is very little guidance provided for the open ended group project, and instructors and TAs are slow to respond, if at all. I enjoyed my group and learned from the process because we took initiative to push ourselves. It's an easy 3 credits, but I'd rather have spent my money on a better run class and read up on these topics on my own.",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "difficulty": 2,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3"
                        }
                    },
                    {
                        "id": "external-import-1e39b82d-4eee-4cae-815d-6921d94fb58f",
                        "difficulty": 2,
                        "_createdAt": "2015-11-16T15:15:50Z",
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "body": "This is an easy class if you have a good group for the final project that is worth 50% of your grade. Quizzes are pretty easy if you take good notes for the lectures. Double check to make sure the answers are correct. Several answers on several quizzes were counted wrong but they were correct.",
                        "_type": "review",
                        "workload": 5,
                        "created": "2015-11-16T15:15:50Z",
                        "course": null,
                        "_id": "external-import-1e39b82d-4eee-4cae-815d-6921d94fb58f",
                        "semester": {
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:16Z"
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2015-1",
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20"
                        },
                        "_id": "external-import-0a99587e-00e0-43d2-9925-0c5482048f2a",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "course": null,
                        "body": "This course is a pretty easy 3 credits in my opinion, assuming that you're in a decent group for the project. The lectures are intended for a broad audience and are not very technical. They are also shorter and less numerous than the other courses I've taken. They include lots of interviews with industry people which is somewhat refreshing. Although the prof. often writes somewhat strange/debatable mutliple choice questions, the quizzes are generally easy if you watched the corresponding lectures recently. The project was open-ended (and initially somewhat undefined) and we were tasked with forming our own teams. The projects are either web or mobile apps so it's important that some of your team members have those skills. Upfront work identifying a good team and project will result in a smooth semester.",
                        "id": "external-import-0a99587e-00e0-43d2-9925-0c5482048f2a",
                        "created": "2015-11-05T06:00:00Z",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_type": "review",
                        "workload": 5,
                        "difficulty": 2
                    },
                    {
                        "id": "external-import-226f962c-3cc4-47c7-a0af-f0966376521b",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "_type": "review",
                        "workload": 3,
                        "_id": "external-import-226f962c-3cc4-47c7-a0af-f0966376521b",
                        "created": "2015-11-05T06:00:00Z",
                        "difficulty": 2,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "body": "In terms of content, the course gives a good introduction to the topics without assuming any previous experience but still getting into a lot of the technical and logistical issues of US health IT systems. In this semester, there were no exams and in their place were a set of timed quizzes. The quizzes are open notes/lectures and follow the lecture content very closely, so for the most part the questions can be answered if the student watches and understands the lecture material. Most of the more challenging work in the course has to do with the semester-long group project, which involves creating a web application that uses heatlh data records. The very start of the semester and project was somewhat disorganized, because many changes were made at the last minute to switch from the previous version of the group project to a new group project involving FHIR web services. Originally the course material stated that groups could use any web platform/framework/programming language, then after many groups formed around experience with particular technologies it was announced that all groups needed to use Java/Tomcat in order to deploy to particular machines at Georgia Tech that have access to the proprietary health data. The final deployment machines and data are not accessible to students during development, and at the end of the semester students will submit their completed WAR app which will be run on the machines with the full data for the first time without giving students the opportunity to fix any bugs or issues related to deployment and using the new data. Other than those issues (which my group avoided by requesting and being granted approval to use our own servers and data) the project is a straight-forward web application group project. Groups are required to use the health data in some way but aside from that the project is very open-ended in terms of what students can focus on for their app. As with any OMSCS group project, the previous experience of students varies greatly within the class, with some students having almost no web development experience on one end of the spectrum and some having worked in the industry for 10+ years on the other end. The groups are self-selected rather than assigned by the instructors so the overall experience level of the groups can vary as well. The instructors are active on Piazza with regular announcement posts and answers to questions from students, although sometimes basic details of assignments such as length or format of presentations are announced close to the deadline. For students with no web development or Java experience at all, I would suggest learning some basic skills before taking this course, and the CS 6300 course in the OMSCS program is the closest in terms of an intro to those sorts of development skills. Otherwise any student should be able to succeed in this course and I recommend it to anyone who has interest in the topics.",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "semester": null
                    },
                    {
                        "difficulty": 2,
                        "body": "It's hard to make a call on the class because there's only a midterm, final and project. The 'lecture activities' are 5 minutes, tops. It's a cursory examination of the material and is interesting, especially if you've had no exposure to HIT and the problems of interoperability and data formats. The lectures have a fair number of interviews with industry leaders, which is nice to see. I scored nearly perfectly, but the Mid term grading upset a lot of people (1/4 of the questions were thrown out for being poorly written). It was probably one of the worst designed tests I've taken in terms of judging a student's grasp of the material. It's also hard to predict how well you will do, given that 50% of your grade is unknown until the final week of the course (a semester-long group project with VERY loose specifications). If you are interested in HIT and maybe a bit of an exploratory fun project, it's not bad. The workload is minimal outside project work, and it pairs pretty well with a harder course in the same semester. I went many weeks doing no work at all beyond lecture watching.",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "id": "external-import-29b28b07-2106-4003-ab19-bd8f04e1a39a",
                        "created": "2015-11-05T06:00:00Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Ikdq",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2014-3",
                            "_updatedAt": "2022-07-22T00:49:37Z",
                            "startDate": "2014-09-02"
                        },
                        "_id": "external-import-29b28b07-2106-4003-ab19-bd8f04e1a39a",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_createdAt": "2015-11-05T06:00:00Z"
                    },
                    {
                        "difficulty": 2,
                        "id": "external-import-56e2451f-f54f-449d-ab20-88f47b931b5c",
                        "created": "2015-11-05T06:00:00Z",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_id": "external-import-56e2451f-f54f-449d-ab20-88f47b931b5c",
                        "body": "Agree completely with entry 2 (except there was no final) and Kyle (entry 5). Off-camera I found prof frustrating, illogical, error-prone, even dishonest about these, and i wil complain again when semester is over.",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_type": "review",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:49:37Z",
                            "startDate": "2014-09-02",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Ikdq",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2014-3"
                        }
                    },
                    {
                        "_id": "external-import-5c8658ef-2342-4603-89c4-5160edd2d7c4",
                        "body": "For spring 2015 this was a fairly easy course, and the principal factors in getting a good grade were memorizing content from the lectures to answer the obtuse quiz questions, and actually creating a healthcare web app with little to no requirements/guidance/criteria. I found it useful for understanding some basic health terms I didn't understand before. There is also huge potential for healthcare/tech startups, which the course did a good job of introducing.",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "created": "2015-11-05T06:00:00Z",
                        "workload": 5,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_type": "review",
                        "id": "external-import-5c8658ef-2342-4603-89c4-5160edd2d7c4",
                        "course": null,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2015-1",
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 2
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "created": "2015-11-05T06:00:00Z",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2015-1",
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_id": "external-import-608e9479-3f0c-465d-b4ad-7476152b1799",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "id": "external-import-608e9479-3f0c-465d-b4ad-7476152b1799",
                        "_type": "review",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "body": "Definitely an easy course if you're familiar with web development and fluent in at least any web based language (preferably JavaScript, HTML for client and Java for server). The lectures are really good and include lectures. You shouldn't have a problem with that. There was no Midterm nor Final this semester but I can't say it will happen again. Just make sure to read quiz questions carefully and watch lectures thoroughly and start your team project earlier and stay organized with it. This should be an easy A if you're team works well together.",
                        "difficulty": 2
                    },
                    {
                        "_id": "external-import-67a04e84-b61e-45ff-8478-c5d65c40e832",
                        "body": "I do not recommend this class. Piazza boards are flooded with people looking for clarification, and very few will receive answers. The quizzes are filled with ambiguous questions. The professor expects the class to run on autopilot. This semester we used the FHIR api. FHIR is a living nightmare to work with.",
                        "course": null,
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "id": "external-import-67a04e84-b61e-45ff-8478-c5d65c40e832",
                        "created": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor"
                        },
                        "_updatedAt": "2022-07-11T19:08:12Z"
                    },
                    {
                        "course": null,
                        "body": "This is hands down the worst class I have ever taken including undergrad, other online courses, and other post graduate classes. This course should not be in a graduate program let alone a top 10 one. \n\nIf you enjoy watching videos of someone slowly reading jargon about bureaucratic red-tape off a teleprompter, busy work with instructions so vague and undirected you'll want to gouge your eyes out, an absent teacher and TA presence, and not actually learning anything of substance then this is the course for you. This comes from someone who is very interested in health informatics and lucked out and got a good group! I am upset I paid money for this course. Do yourself a favor and skip the potentially easy grade and take a course that actually teaches you something. The program is full of them and its well worth it.",
                        "difficulty": 2,
                        "_type": "review",
                        "id": "external-import-72a896a9-6ce6-45e4-9efe-05a5b08b38d9",
                        "created": "2015-11-05T06:00:00Z",
                        "semester": {
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z"
                        },
                        "_id": "external-import-72a896a9-6ce6-45e4-9efe-05a5b08b38d9",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI"
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_id": "external-import-84d67fbf-17dd-4b66-bb4f-5005ad025932",
                        "body": "I will reiterate what others said, in that the course is good if you get a good group. The lectures are easy to understand and the quizzes are really quite easy if you have viewed the lectures and have the transcripts readily available. Group selection was a disorganized and chaotic process with no real guidance from the instructors. Having lucked into a very good group, I would definitely advise you look for the obvious technical skills, java and html/js/css, but also given the large volume of presentations involved and the open-ended requirements, I would also seek out members with project management and technical writing experience so that you have presentation quality that adequately reflects the quality of your application.",
                        "course": null,
                        "created": "2015-11-05T06:00:00Z",
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2015-1",
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20"
                        },
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_type": "review",
                        "id": "external-import-84d67fbf-17dd-4b66-bb4f-5005ad025932"
                    },
                    {
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "body": "Agree with the comments above. Not too much instructor involvement.",
                        "created": "2015-11-05T06:00:00Z",
                        "_id": "external-import-89e54722-9682-43af-b4e3-dd35de0e4eff",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17"
                        },
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "id": "external-import-89e54722-9682-43af-b4e3-dd35de0e4eff"
                    },
                    {
                        "_type": "review",
                        "_id": "external-import-908e369d-7e5b-4fec-9a8a-3444752eb458",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "id": "external-import-908e369d-7e5b-4fec-9a8a-3444752eb458",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "course": null,
                        "body": "Take this class when you need a breather, but do not expect it to be well organized :)\n\nThey setup a database for us to run queries against and answer quiz questions, but did not make it readonly. Some of the tasks required us to make updates to it, which ruined it for future test takers. They eventually figured it out, but it caused issues for several students. We are supposed to sent an email through Microsoft HealthVault and the receiving inbox only works some of the time. There was supposed to be Peer Feedback, but that requirement has been removed. 50% of the class grade is a group project to which you receive only very scarce feedback. Make sure to find a group with somebody who makes awesome Power Points! I have been writing code off and on for about 8 weeks and the only things that we have turned in are Power Points. They are only now asking for a 'tiny' demo, so I am skeptical as to how much of the code and or functionality they will actually review. None-the-less, I want to make sure my group has a somewhat functional program. \n\nP. S. You do *NOT* need to buy the supplemental reading in order to score high on the quizzes. The subject material is completely based off the lectures and transcripts are available to download for free.",
                        "difficulty": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17"
                        },
                        "created": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI"
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Ikdq",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2014-3",
                            "_updatedAt": "2022-07-22T00:49:37Z",
                            "startDate": "2014-09-02",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-a6be8b2e-01fa-43f8-9b53-8441bca31042",
                        "difficulty": 2,
                        "_type": "review",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "body": "I agree with the gist of the previous comments but I found the midterm only mildly hard. I did find it annoyingly ambiguous and not consistent with what it was supposed to cover but I still scored nearly perfect before many of the questions were dropped. The project was VERY unrestricted and not too tough if you are either a web developer or are in a team w/ 1 or 2 strong web devs. The work load was light, even including the project work, as long as you do not have to learn the platform(s) your team chooses to write it in. The text book was helpful but at nearly $90 after shipping costs, not worth the money. If I did not get reimbursed by my employer for it, I would have been very annoyed with the cost vs. value.",
                        "id": "external-import-a6be8b2e-01fa-43f8-9b53-8441bca31042",
                        "created": "2015-11-05T06:00:00Z"
                    },
                    {
                        "id": "external-import-aa7fbf86-5020-4355-9e09-d0b93bf318b6",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_id": "external-import-aa7fbf86-5020-4355-9e09-d0b93bf318b6",
                        "difficulty": 2,
                        "course": null,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "created": "2015-11-05T06:00:00Z",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_type": "review",
                        "body": "I'm actually enjoying covering the material in this class because I had no previous knowledge of what is going on behind the scenes in the healthcare industry. The group project is kind of a nightmare though as I'm not too good with open-ended projects and my lack of topic knowledge is a bit of a barrier. The class could be run a bit better, but it is not all bad. I see lots of interaction on Piazza between the students and the TA's. Also, the professor does pop in the forum from time to time. I think the problems this class is experiencing stem from the fact that the prof is trying to keep the class up to date, so there is some churn in the material. Not a bad class at all. Assignments are spread out over the semester, so some weeks there is nothing to do (well, we are supposed to be working on our project). When there is an assigment, reading or otherwise takes a few hours in addition to the quizzes. This semester, we had one (1) try at taking each quiz. You do have to think/know the material to get it right. Oh, and be careful if you know healthcare already, because your definitions might not match those presented in the class and using your definitions on the quizzes will be counted wrong (this happened to several people). So, make sure you study!"
                    },
                    {
                        "id": "external-import-b7220d55-5301-4b41-aa83-f4bc1ff0112d",
                        "course": null,
                        "_id": "external-import-b7220d55-5301-4b41-aa83-f4bc1ff0112d",
                        "body": "The class lectures are informative and are generally an overview of the various topics presented throughout the course. No lectures really go all that in-depth on a particular subject though so it's more of a generalized view of informatics in the healthcare industry. There was a quiz every two weeks up until about 2/3 of the way through the course. At that point you're expected to work on the group project. The quizes questions for the most part were not very difficult if you paid attention to the lectures and used common sense; however, some of the questions were ambiguous at best and others downright confusing. \n\nWhat I found to be the most disappointing was the group project. Spring 2015 was the first semester they tried to use the GT FHIR server and it did not go well. Between the server constantly being under development, server connectivity problems, VPN problems, and a whole lot of other issues the project was a real pain for many groups. Our group decided fairly early on to abandon the GT FHIR server in favor of the more stable, public SPARK FHIR server and that turned out to be a good idea looking back on all the issues other groups were having. I felt our issues that we had to work through with our chosen server were relatively minor in comparison. \n\nGroup selection was an annoying issue with the course too. It look a couple weeks for everyone to find a group to join. The group I formed had a couple people express interest in joining only to find out they were apparently 'shopping' for the best group. The TAs sent out multiple requests trying to find groups for people to join as well. Also we didn't get to peer review our group members which was disappointing. The reason I say this class is Somewhat Easy is because the issues with the group project made it harder than it should have been.",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "created": "2015-11-05T06:00:00Z",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_type": "review",
                        "workload": 2,
                        "difficulty": 2,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2015-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:12Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-be424151-98a7-47e9-85a5-3d0619cd4070",
                        "body": "Agree with entries #2 and #5 (Kyle's). Here are some addtional thoughts:\n\n1) Because the midterm only covered lessons 1 through 5 (out of 10 lessons) and there was no final, there was little motivation to learn the content from lessons 6 through 10 (other than a 5-minute activity from lesson 7). There was also no real motivation to read all the suggested extra material. We were never tested on any of it. \n\n2) TEXT BOOK : I purchased the 'text BOOK ', which the professor DOES say is optional. It was VERY overpriced ($79. 95, even though the professor mistakenly says that students will be able to get the discounted price of $64. 95, which is STILL overpriced). For the price, it’s closer to the size of a PAMPHLET than a text BOOK !! I was very shocked when it came in the mail!\n\nDespite being overpriced, the lectures ARE based on the book content, so the book does indeed provide a solid foundation to the videos. It helped me a LITTLE with the midterm, but after the unfair/ambiguous/subjective questions on the midterm I probably would have done fine without the BOOK. \n\nDespite these kinks, I will say that Prof. Mark and TA Shan are very knowledgeable and responsive to concerns.",
                        "created": "2015-11-05T06:00:00Z",
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:49:37Z",
                            "startDate": "2014-09-02",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Ikdq",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2014-3"
                        },
                        "id": "external-import-be424151-98a7-47e9-85a5-3d0619cd4070"
                    },
                    {
                        "id": "external-import-d91afb0f-859b-42b6-899d-aa96990b4c3c",
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "course": null,
                        "_id": "external-import-d91afb0f-859b-42b6-899d-aa96990b4c3c",
                        "body": "This class could have been awesome. The content as presented in the lectures was very interesting. I really liked the idea of the group project, but I didn't like how loosely defined the grading rubric was. What troubles me most was the midterm. (Full disclosure, I scored an A on the mid term prior to curving it... this is not sour grapes. ) The midterm questions were poorly written and did nothing to test understanding. Instead they were multiple choice/choose all the apply type questions dealing with trivial details. It was stated prior to the test that it would only be over the first 5 lessons... but there were at least two topics that were covered in later sections that appeared on the test. Another disappointing aspect of this course was the 'Activities. ' There were 3 or 4 actions that students were expected to do using a 3rd party application. Halfway through the course, it was revealed that the instructors were not receving confirmation of our actions. So we had to go back, do the activities again, and provide screenshots. This was somewhat annoying, but I would not have minded as much if the activities contributed at all to my learning (which I felt they did not. ) Bottom line: Great content... poor class.",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "created": "2015-11-05T06:00:00Z",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2014-3",
                            "_updatedAt": "2022-07-22T00:49:37Z",
                            "startDate": "2014-09-02",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Ikdq"
                        },
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "body": "Very busy the last month or so of class and around the mid-term. Found the videos enjoyable. If you are interested in learning more about US Healthcare and how IT is becoming more involved then you will find the material enjoyable. I was able to confidently talk to my doctor and family friends who are doctors about healthcare in general after taking this class.",
                        "created": "2015-11-05T06:00:00Z",
                        "difficulty": 3,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_id": "external-import-e4ab9229-8cde-4649-83c9-36512b9845f0",
                        "workload": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Ikdq",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2014-3",
                            "_updatedAt": "2022-07-22T00:49:37Z",
                            "startDate": "2014-09-02",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-e4ab9229-8cde-4649-83c9-36512b9845f0",
                        "_updatedAt": "2022-07-11T19:08:12Z"
                    },
                    {
                        "_type": "review",
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "id": "external-import-f8e5b998-1fed-44cb-88ba-0ced67184047",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2015-1",
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20"
                        },
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_id": "external-import-f8e5b998-1fed-44cb-88ba-0ced67184047",
                        "created": "2015-11-05T06:00:00Z",
                        "body": "This course is not hard if you get a good group. The instruction though is disjointed so thats why I say somewhat easy What you are supposed to be working on is not 100% clear. Not everything works. They put a VPN on a server and then noone was able to access it to finish projects. Very confusing Course and not in a good way. Didnt learn too much and was just frustrating",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "workload": 5
                    },
                    {
                        "difficulty": 2,
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2015-1",
                            "_updatedAt": "2022-07-22T00:49:28Z",
                            "startDate": "2015-01-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1zli",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "This class was an embarassment, completely inappropriate for an MS program. At first the videos were annoying, as the guy talks at around 5 wpm. Then I realized you can run it on fast-forward. Even 2x feels slow. Then I realized there is no need to watch the videos at all. \n\nEvaluation is based on 10 open- BOOK quizzes. Simply searching the transcripts for keywords is sufficient. You have to be careful, as they try to trick you with double and triple negatives, but there's no real difficult questions\n\nThe only other evaluation is the final project. A touch of HTML and a JS template, total of about 3 hours of work. \n\nThere were many other problems in the class, from the absent Professor to varying requirements, but no real learning happened here. \n\nThe Professor did send out a couple emails strongly suggesting people buy his $80 ' BOOK ' (really just a pamphlet), but it is completely unnecssary for the course, feels like just a money grab.",
                        "id": "external-import-fe7491ea-dc14-4eac-97f8-aad7619c9e1d",
                        "created": "2015-11-05T06:00:00Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "_id": "external-import-fe7491ea-dc14-4eac-97f8-aad7619c9e1d"
                    }
                ],
                "_updatedAt": "2022-08-25T21:41:03Z",
                "_createdAt": "2022-07-05T23:23:15Z",
                "creditHours": 3,
                "created": "2022-07-05T23:23:15Z",
                "_id": "external-import-CS-6440",
                "officialURL": "https://omscs.gatech.edu/cs-6440-intro-health-informatics",
                "name": "Introduction to Health Informatics",
                "_type": "course",
                "id": "external-import-CS-6440",
                "textbooks": [
                    {
                        "name": "Contemporary Health Informatics",
                        "_key": "5fb8b3956a31cc2325347693786f3343",
                        "url": "https://amzn.to/3pIkNdG"
                    }
                ],
                "codes": [
                    "CS-6440"
                ],
                "description": "A broad review of the US health system and the application of informatics to the clinical practice of medicine, digital imaging, public health and bioinformatics.",
                "_rev": "959qsafI8uoLDPJeciuT1J",
                "programs": [
                    {
                        "acronym": "CS"
                    }
                ],
                "rating": 2.6931818181818183,
                "difficulty": 2.279279279279279,
                "workload": 10.106060606060606
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "introduction-to-health-informatics"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "gsp": true,
    "scriptLoader": []
}