{
    "props": {
        "pageProps": {
            "course": {
                "isFoundational": true,
                "tags": [
                    "VGD"
                ],
                "_id": "external-import-CS-6457",
                "programs": [
                    {
                        "acronym": "CS"
                    }
                ],
                "_createdAt": "2022-07-05T23:23:15Z",
                "syllabus": {
                    "file": {
                        "asset": {
                            "_ref": "file-d951660c2c282238f2de5196fae791c7fd4c3768-pdf",
                            "_type": "reference"
                        },
                        "_type": "file"
                    }
                },
                "textbooks": [
                    {
                        "name": "Game Design Workshop: A Playcentric Approach to Creating Innovative Games, Fourth Edition",
                        "_key": "34ba68ebee606d66878316fcef8b7c34",
                        "url": "https://amzn.to/3Ra5vKA"
                    },
                    {
                        "_key": "226c00382de81058f747467e935bed56",
                        "url": "https://amzn.to/3KlCVDH",
                        "name": "Game Feel: A Game Designer's Guide to Virtual Sensation, 1st Edition"
                    }
                ],
                "_updatedAt": "2023-08-11T18:32:16Z",
                "description": "Techniques for electronic game design and programming, including graphics, game engines, animation, behavioral control for autonomous characters, interaction, social and interface issues of multi-user play.",
                "name": "Video Game Design and Programming",
                "reviews": [
                    {
                        "_createdAt": "2024-08-12T20:11:41Z",
                        "rating": 5,
                        "_type": "review",
                        "created": "2024-08-12T20:11:41Z",
                        "_updatedAt": "2024-08-12T20:11:41Z",
                        "semester": {
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester"
                        },
                        "_id": "ZVF5g2r3sx3JsqcHFhPNdk",
                        "id": "ZVF5g2r3sx3JsqcHFhPNdk",
                        "body": "Strongly recommend this class if you are interested in how to make video game in Unity. Basic Java/C# will be good enough. I got an A from this class.\n\nThe first 5 individual assignment will walk you thru the key features of Unity to build up a video game, then it will be up to your team to create your own game. The project is really open ended and a TA will be assigned to your team to play your game, listen to your presentation and give you detailed feedback on your game. Every team will deliver a 3D video game and a trailer in the end, and the trailer will be published for the entire team to watch. You can literally see that every team did an awesome job and created incredible game within a few months. Strongly recommend to check out the trailers from previous semesters when you start taking this class. That will give you an idea how great the final game you can make. Of course, it all depends on how much time and efford your team want to spend on this game, but it really paid back once you see your own game being built up. ",
                        "difficulty": 2,
                        "_rev": "ZVF5g2r3sx3JsqcHFhPNct",
                        "workload": 20,
                        "course": null,
                        "authorId": "riOMki32eNBpb+1jBCtpOQ=="
                    },
                    {
                        "_id": "YQbtAjHNhbUPaALKu1efMJ",
                        "created": "2024-06-14T09:42:00Z",
                        "difficulty": 1,
                        "_createdAt": "2024-06-14T09:42:00Z",
                        "_rev": "YQbtAjHNhbUPaALKu1efJc",
                        "id": "YQbtAjHNhbUPaALKu1efMJ",
                        "_type": "review",
                        "workload": 3,
                        "body": "It is a simple course, which teaches u how to use unity to create a game. All assignments are easy to finish, but the final project counts for 50%...\n\nSo it is important to join a good group to complete the project, bag group only can give u B for this course.",
                        "_updatedAt": "2024-06-14T09:42:00Z",
                        "course": null,
                        "authorId": "szFGSy34W3OiXNupCVHubw==",
                        "rating": 4,
                        "semester": {
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05"
                        }
                    },
                    {
                        "id": "NHkDo57DVwEA8qM8ThrjUq",
                        "authorId": "Y6IfTIqcyJL13rn1t2pNWw==",
                        "_createdAt": "2024-05-07T22:24:06Z",
                        "_id": "NHkDo57DVwEA8qM8ThrjUq",
                        "_updatedAt": "2024-05-07T22:24:06Z",
                        "_type": "review",
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "body": "Great course I actually felt like I learned something useful/fun with a very doable/easy workload. You will get out of this class what you put into it. The homework and final group project are based around fulfilling very simple and specific technical specifications/functions. The homework is really simple and gives you a good intro to working with unity with decent tutorials and fair grading. The final project can be as complicated or as simple as you want. Grading is very generous even if you have bugs. The goal is to get you to be familiar with unity and how to implement very general features in a unity game.  You can be as creative as youd like with this or just fulfill the bare requirements. I recommend this to anyone wanting a course with creative outlet potential or anyone who loves gaming and wants to know what its like to collaborate on a creative project. There are a plethora of tutorials online to accomplish various things in unity so actual programming/scripting skills won't be challenged as much as your creativity/ambitions will. Have fun with this class and I recommend being ambitious making use of online tutorials and the very helpful TA's. ",
                        "_rev": "NHkDo57DVwEA8qM8ThrjR4",
                        "workload": 10,
                        "created": "2024-05-07T22:24:06Z",
                        "course": null,
                        "difficulty": 2,
                        "rating": 5
                    },
                    {
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "created": "2024-04-27T16:56:44Z",
                        "authorId": "SSSOP28ZCXJKKGVI/KdIhg==",
                        "difficulty": 1,
                        "_createdAt": "2024-04-27T16:56:44Z",
                        "_updatedAt": "2024-04-27T16:56:44Z",
                        "id": "TkbJzK0vW4Wob0w970k6Aa",
                        "workload": 5,
                        "_id": "TkbJzK0vW4Wob0w970k6Aa",
                        "_rev": "TkbJzK0vW4Wob0w970k67X",
                        "_type": "review",
                        "rating": 2,
                        "body": "This was easier than most of my undergrad CS classes.\n\nThe course is more of an exercise in organization and project management than it is in making a video game.\n\nFrom day one create GitHub issues and a sprint board. Meet up every week and create/assign tasks. As long as everyone puts in a small amount of effort it's pretty easy to create a game that meets the expectations of the course.\n\nThe milestone projects are fun and were where I did most of my learning in the course. Get good grades on these so that you can stress less about the team project.\n\nThe lectures are absurdly long and drawn out, and have little relevance to your grade. They're useful at the beginning for understanding the milestones, but they are quickly irrelevant. I would skip most of the lectures and went straight to the quizzes.",
                        "course": null
                    },
                    {
                        "authorId": "HEgP3uohxFl0KsOLnijblg==",
                        "difficulty": 2,
                        "_type": "review",
                        "created": "2023-12-19T06:14:54Z",
                        "_id": "Pm4H4xdFhHJgzHn4Zo0Cqs",
                        "id": "Pm4H4xdFhHJgzHn4Zo0Cqs",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "_createdAt": "2023-12-19T06:14:54Z",
                        "rating": 5,
                        "body": "This is an excellent class. I would recommend it with no doubt.\nThe course is pretty much team-project based, with some tutorial exercises in the beginning. Therefore the product is open-ended and you can really make some good projects if you opt to. If you don't, there are also clear guidelines to make sure you get all the points.\nProf Jeff Wilson is enthusiastic and the lectures are really fun to watch. He goes into allot of trivial about games and gamming culture in general. While they are not directly related to the assignments or your projects, they interesting and engaging. The TAs are usually helpful and encouraging.\nOne thing to note is that I feel like you do need to find a good team, since you will be hanging out with them for most of the semester and making the team-project together. Aligned expectation and concepts will make your semester a blast!",
                        "_rev": "Pm4H4xdFhHJgzHn4Zo0CnU",
                        "course": null,
                        "workload": 12,
                        "_updatedAt": "2023-12-19T06:14:54Z"
                    },
                    {
                        "_id": "1iGxZpbv2uESlZ562AdJT9",
                        "id": "1iGxZpbv2uESlZ562AdJT9",
                        "workload": 6,
                        "_updatedAt": "2023-10-20T07:12:02Z",
                        "course": null,
                        "created": "2023-10-20T07:12:02Z",
                        "rating": 5,
                        "authorId": "cxsbENgcaJBmChUNzOSxRg==",
                        "_createdAt": "2023-10-20T07:12:02Z",
                        "_rev": "1iGxZpbv2uESlZ562AdJSA",
                        "difficulty": 3,
                        "body": "Take it. It gives you a great intro to Unity. You will not be a C# expert, but you will add few lines of codes here and there for the assignments. They are very well written out and all you need to do is follow the instructions. The instructions will tell you what functions to use (just do some basic search on the functions and on how they're usually implemented).\n\nThe main project is a group video game project. \n\nTips: Get a good group. Well, although it seems like you do not have control over your group, you can get up your chances of landing good members by being proactive at searching for a group. The best talents tend to be the first to look for a group.",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr"
                        },
                        "_type": "review"
                    },
                    {
                        "_createdAt": "2023-09-25T18:25:39Z",
                        "_rev": "86vawedVb4YeKdtj4N6EdX",
                        "_id": "86vawedVb4YeKdtj4N6Ef9",
                        "_type": "review",
                        "course": null,
                        "created": "2023-09-25T18:25:39Z",
                        "semester": {
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "difficulty": 2,
                        "workload": 20,
                        "body": "This class provides a decent overview of what seem like a core set of fundamentals for making 3-D games with an engine.\n\nI was a little disappointed with this class because it really doesn't dive too deeply into how engines actually work, but rather touches on a lot of surface-level stuff that are fairly obvious/well-known to anyone who plays a lot of games and has a computing background. The lectures are very long, and you can usually do well on the quizzes without even watching them.\n\nThe project is most of the work - you'll 4-ish warmup projects (\"milestones\") that are just small Unity projects that'll take 1-5 hours each. Then you'll work on the final project, your own Unity Engine game, for the rest of the semester. How this project goes is entirely decided by how good your group is.\n\nI was, again, kind of disappointed with the final project. It was oddly restrictive in many ways (MUST be 3-d, they REALLY want you to use things like root motion and inverse kinematics) but oddly loose in other ways. My group spend an inordinate amount of time dealing with things like finding assets and fixing textures, which are really unrelated to the class and not something many of us were interested in learning. Blender skills are good to have, unfortunately.\n",
                        "rating": 3,
                        "_updatedAt": "2023-09-25T18:25:39Z",
                        "id": "86vawedVb4YeKdtj4N6Ef9",
                        "authorId": "ex/+WEggftoEEjwISXXHLg=="
                    },
                    {
                        "course": null,
                        "id": "meCCLzRK2zIBL5FIKYGdPD",
                        "created": "2023-08-01T14:28:35Z",
                        "body": "I've always played video games so this course was one of the ones I really wanted to take. It was cool understanding concepts of video games because I've seen it being used in games I've played. The quizzes are a little hard because the answers are not as clear as it could be in the videos or slides. The individual assignments weren't bad, but somewhat time consuming. The group project is hard because it requires a lot of time and some members might not do as much work as you or put in that much effort. It was worth taking. This class took the most time out of my previous class I've taken but I'm glad I took it. It's probably a little more rushed in the summer sessions also. TDLR: Worth taking if you like video games, pick good group members who will do work",
                        "rating": 4,
                        "semester": {
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z"
                        },
                        "authorId": "zIh1gxYgpvOfkPc3Cs0F2g==",
                        "workload": 12,
                        "_createdAt": "2023-08-01T14:28:35Z",
                        "_id": "meCCLzRK2zIBL5FIKYGdPD",
                        "difficulty": 3,
                        "_rev": "meCCLzRK2zIBL5FIKYGdLq",
                        "_updatedAt": "2023-08-01T14:28:35Z",
                        "_type": "review"
                    },
                    {
                        "difficulty": 2,
                        "semester": {
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15"
                        },
                        "_updatedAt": "2023-08-01T11:44:54Z",
                        "workload": 12,
                        "body": "The class had a few key issues that diminished its effectiveness. The individual milestones, though intended as stepping stones, felt disconnected from the main group project, seeming more like distractions than useful learning opportunities.\n\nThe group project's success is a lottery, depending greatly on the luck of the draw with your group. \n\nI created the group on the first day of the semester and our group shrunk from five to two by the time that all groups were formed. The teaching staff cannot do anything if that happens\n\nHowever, the grading curve adjusted for these variables, providing some relief as long as the necessary game elements were included.\n\nLastly, the lectures were long and monotonous, making it challenging to remain engaged and absorb the content effectively.\n\nOverall, the class had potential but It still has room for improvement",
                        "rating": 3,
                        "id": "meCCLzRK2zIBL5FIKXPGni",
                        "created": "2023-08-01T11:44:54Z",
                        "_id": "meCCLzRK2zIBL5FIKXPGni",
                        "_rev": "meCCLzRK2zIBL5FIKXPGkL",
                        "_createdAt": "2023-08-01T11:44:54Z",
                        "_type": "review",
                        "course": null,
                        "authorId": "5za5QUnNTEC7jIRDoBPQ9g=="
                    },
                    {
                        "id": "AnVLGnCOep77YjL1sz6Cp7",
                        "rating": 5,
                        "_id": "AnVLGnCOep77YjL1sz6Cp7",
                        "_type": "review",
                        "created": "2023-05-10T20:11:11Z",
                        "course": null,
                        "_createdAt": "2023-05-10T20:11:11Z",
                        "_rev": "AnVLGnCOep77YjL1sz6CoG",
                        "body": "I love this class. The lectures are long, but entertaining and you can watch them on 2x speed. The instructor gives you a ton of context on the homework assignments and how to complete them, so I always felt supported. The instructor and TAs are also super active in the ED forum. The material is comprehensive and resulted in a lot of neat student projects. Overall, fun class and an aasy A as long as you stay on top of the material.",
                        "difficulty": 3,
                        "_updatedAt": "2023-05-10T20:11:11Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "workload": 10,
                        "authorId": "yOszeyzTORRG9LepsvJifA=="
                    },
                    {
                        "difficulty": 3,
                        "created": "2023-05-06T18:40:56Z",
                        "_type": "review",
                        "workload": 12,
                        "_id": "3KqS0NOF6YxT8AZtWc2fj4",
                        "authorId": "E+YLEsDrlLWYqvO7Wg1Viw==",
                        "course": null,
                        "_createdAt": "2023-05-06T18:40:56Z",
                        "_updatedAt": "2023-05-06T18:40:56Z",
                        "id": "3KqS0NOF6YxT8AZtWc2fj4",
                        "body": "This is a really good class if you want an introduction to Unity. I really learned a lot from this class and Dr. Wilson was an amazing prof. The assignments(milestones) are pretty straight forward and they have walkthroughs on how to complete them though there are parts you need figure out on your own. The last milestone (AI) was probably the hardest one but is easily doable. The group project is the main component in this class. Find a group early on. I was very lucky to get a good group and we did really well on the final project. Only thing I didn't like was the quizzes, they are a bit difficult if you don't pay attention to the lectures. I finished with a high A and I'm soo happy that I took this class.",
                        "_rev": "3KqS0NOF6YxT8AZtWc2fgR",
                        "semester": {
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z"
                        },
                        "rating": 4
                    },
                    {
                        "difficulty": 2,
                        "_type": "review",
                        "_id": "izKdQKGWKnehyWbkvtnPjX",
                        "_updatedAt": "2023-05-01T02:32:58Z",
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "body": "This class was absolutely AMAZING. Dr. Wilson provides great information and lectures. I watched on 1.75-2x speed and it made things a little faster. You can tell that he actually genuinely cares about the success of his students. The TAs were also wonderful. They provided helpful and encouraging comments on each project submission.\n\nI'm not a regular gamer but have dabbled. It's so cool to learn more about the work that goes into video game dev. I have a genuine appreciation for the beauty of video games now.\n\nThe individual milestones were at the perfect difficulty level. They weren't too easy but definitely not too hard. Grading is very fair. There are open lecture/note quizzes with no time limit. There are no exams in this course.\n\nMy team was awesome! I could see where having a bad team would ruin the class for some as most of the coursework is dependent on team success. \n\nI found my team within the first day or two of classes being opened. This is the BEST approach because you're pairing up with people that are ready to get started. \n\nIt is best for teams to focus on functionality and project criteria before getting too ambitious with complex game concepts. My team had great success with keeping expectations aligned with the rubric. We expanded on additional features closer to the end of the semester (post Alpha).\n\nTLDR: Great course, would recommend to anyone. Very dependent on teamwork and success. Find your team early for better luck.",
                        "id": "izKdQKGWKnehyWbkvtnPjX",
                        "rating": 5,
                        "authorId": "Ojl0MXcRXugZ07N2iC5wNA==",
                        "_rev": "izKdQKGWKnehyWbkvtnPfw",
                        "_createdAt": "2023-05-01T02:32:58Z",
                        "workload": 10,
                        "created": "2023-05-01T02:32:58Z",
                        "course": null
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN"
                        },
                        "_updatedAt": "2023-04-11T15:30:16Z",
                        "_createdAt": "2023-04-11T15:30:16Z",
                        "body": "9 classes in, and this has been my least favorite class by far. I can understand why some people love it though. If you really really REALLY like video games, this might be worth your time, but otherwise I’d say skip it. \n\nFirst, the lectures are extremely long and pretty boring. Hours and hours of the professor speaking at a snails pace, reading off of PowerPoint slides. Even on 2x speed the lectures were just way too tedious and I ended up giving up on watching them entirely. \n\nSecond, this class is a TON of work for what it is. Lots of lecture quizzes, individual milestones due every couple of weeks, and a group project that spans the semester with milestones due every few weeks. The individual milestones were fun-ish and I didn’t mind those as much, but the sheer volume of work and deliverables was too much IMO.  I honestly felt more overwhelmed in this class than I did in ML or DL. \n\nAlso, your experience in the class will be entirely dependent on your group, which unless you group with people you know you can’t really plan for. I had a team of driven people who all did their fair share of the work, but a few people who are too aggressive about their video game opinions made the group dynamic miserable. \n\nOverall, I regret taking this course. I’m not a serious gamer though, I only game a few times per year. So maybe if I was more passionate about the subject I’d have enjoyed this more. I think there are some good Unity tutorials out there for someone who wants to learn Unity, which may be a better use of time than spending a semester on this. \n\n\n\n",
                        "_rev": "GwvFL8R3QHQn27j3sQeSmK",
                        "_type": "review",
                        "course": null,
                        "rating": 2,
                        "created": "2023-04-11T15:30:16Z",
                        "_id": "GwvFL8R3QHQn27j3sQeSn8",
                        "authorId": "xjELL5pznt0QI6i07TV3Sg==",
                        "id": "GwvFL8R3QHQn27j3sQeSn8",
                        "workload": 12,
                        "difficulty": 2
                    },
                    {
                        "_id": "sv9JCrQ2mN7v1oIbvq0h1l",
                        "authorId": "dqyOcZsXe36mVXTr80sgLg==",
                        "id": "sv9JCrQ2mN7v1oIbvq0h1l",
                        "_createdAt": "2023-01-09T01:51:27Z",
                        "course": null,
                        "rating": 4,
                        "created": "2023-01-09T01:51:27Z",
                        "_rev": "sv9JCrQ2mN7v1oIbvq0h0l",
                        "workload": 10,
                        "_type": "review",
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "For the incredibly high ratings this course has received, I honestly expected more. This is a good class, but it really could be a GREAT class with some tweaks.\n\nThe good:\nIf you've taken Game AI there won't be many surprises here: the lectures are ridiculously jam packed with good information, and Jeff is always enthusiastic and fun to watch. Similar to Game AI, Jeff talks really, really slow. I watched most of the lectures on 2x speed. Sometimes on 2.5x speed by hacking the JavaScript to speed it up even more. There are a LOT of lectures to watch compared to other courses in this program, but they are fun and you'll learn quite a bit. Huge props to Jeff for his ability to synthesize so much information into well laid out, watchable lectures. You will not dislike this course because of the lectures.\n\nThe bad:\nThe one, huge, group project. Most of this course is an almost-all-semester-long group project. I had a great team! The fact that this is a group project is not the problem with this course. The fact that most of the hands on learning in this course is for a single project done with 4 other folks. Many of the most important topics in this course you learn nearer to the end, at which point you are way too far into your game to actually implement them. If you get a good team (like I did) this group project will likely still be somewhat stress inducing. It's just the nature of coordinating 5 peoples schedules week after week, let along hoping you all have the same expectations and standards. MY SUGGESTION FOR THIS COURSE: Like Game AI, this course would be much better if every week you did a solo project, learning a new skill based on that weeks lectures. This way you would build your skills up, and by the END of the course you would likely have the skills needed to actually make a game that doesn't suck. This course should be split into two: Video Game Programming (part I) where you learn HOW to build a game and Video Game Design (part II) where you build a game. There is simply too much to learn and not enough time to make the group game project fun and or successful, IMHO. That said, again, I had a good team, and we did get an A.\n\nOverall this is a good course, it's not very difficult, plus you will learn a lot and enjoy the lectures. Could it be better? Yes. Did I enjoy taking it? ... some weeks yes, some weeks no. All that said, this is still likely one of the more \"fun\" courses in this program, which is all the more pertinent because you will also learn a lot. Big shout out to Jeff for increasing the quality and enjoyment of OMSCS, and for sharing his love of video games with us all.",
                        "_updatedAt": "2023-01-09T01:51:27Z",
                        "difficulty": 3
                    },
                    {
                        "id": "U9ZzFJ5gHcgcMd0pI8P9Nm",
                        "_createdAt": "2022-11-14T20:27:25Z",
                        "body": "This is a great course, by far the best of the 5 I've been in so far in OMSCS.\n\nMost of the course is geared around a group project, but don't let that spook you. I had a great group, so my experience was awesome. Find a group early and you'll probably end up with go-getters and have a better time.\n\nQuizzes are only 10% of the course (no midterm), so most of the importance is placed on coding. This is such a relief.\n\nI'd suggest doing a crash course in Unity on YouTube / Pluralsight before taking this course. You'll have a better time and get more out of it if you aren't fighting the program. There isn't a ton of teaching of Unity in the course materials, which is a huge downside. The \"teaching\" of Unity is done through the individual assignments, which I didn't love. If you don't get it, your grade suffers. And since they're graded, it's trickier to ask questions without giving away solutions. The assignments also fall short of teaching intuition in Unity (ex - paste this code block here rather than teaching how things work).\n\nOverall the course would benefit from having less on video game history and more on Unity tutorials.",
                        "created": "2022-11-14T20:27:25Z",
                        "course": null,
                        "workload": 23,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16"
                        },
                        "authorId": "+rlO22mv1WfHSZ5PuZEMhQ==",
                        "_rev": "U9ZzFJ5gHcgcMd0pI8P9KP",
                        "_id": "U9ZzFJ5gHcgcMd0pI8P9Nm",
                        "difficulty": 3,
                        "rating": 5,
                        "_type": "review",
                        "_updatedAt": "2022-11-14T20:27:25Z"
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf"
                        },
                        "_rev": "0kZz7Az4RiQ90dWCPGJFzX",
                        "_type": "review",
                        "_id": "0kZz7Az4RiQ90dWCPGJG1a",
                        "_updatedAt": "2022-09-12T01:59:52Z",
                        "difficulty": 2,
                        "rating": 4,
                        "id": "0kZz7Az4RiQ90dWCPGJG1a",
                        "body": "Overall, I enjoyed this course. It is CLEAR that the prof and TAs all love the content and want to help you succeed. This is always good to see. Overall the individual homework was not too difficult, most had videos walking you through the content and even sometimes telling you what to do. On top of this, TAs and Prof were very active on Ed Discussions and questions were usually answered promptly. The group project can be hit or miss... I got a good group so we were able to meet deadlines and work together mostly without a hitch. I did hear of some groups crashing and burning with bum teammates and the like (typical group projects). Make sure to get a solid group together that has coding experience! The lectures were pretty good, I enjoyed the class. Not too difficult but finding time to meet as a group especially towards the end of the class can get dicey sometimes. I recommend this class. ",
                        "course": null,
                        "created": "2022-09-12T01:59:52Z",
                        "workload": 14,
                        "_createdAt": "2022-09-12T01:59:52Z",
                        "authorId": "aPUo+fai3Uca5eV1JXAiNw=="
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester"
                        },
                        "created": "2022-08-10T17:39:25Z",
                        "body": "Individual assignments are pretty high workload, the majority of the work coming from me being stupid and leaving it until the last minute. There is a somewhat of a walkthrough for the early assignments and for the impossible parts of the later ones, and these are not perfectly discoverable, but they usually show up on ed and stuff. However, the content of these assignments is amazing and makes you feel like youre doing magic pretty much. I've never done game design or unity before this, and I loved it. They're somewhat open ended and you can put as much as you want into perfecting them\n\nThe group project is also a large large amount of work - in particular, it's a little unclear how to work on a single unity project as a group, using Git and stuff like that, but once your group develops a work flow and merges stuff into one scene for an alpha version, the bugs and bug fixes pop up and are much easier to fix. \n\nAnyway, this is my favorite class I've taken (and the last one of my OMSCS experience). Maybe not the most usable for my real job, but I probably learned more in this class (history, modern unity, theory, formal elements, etc) than any other class all while having fun, being creative and goofy, and making a project I was really proud of (and the workload was pretty flexible too, assignments have a 24 hour grace period which I utilized upon getting super stuck late at night once or twice, and the group project allows for some people to fix other people's bugs and so on). \n\n\nThe lectures are also amazing, the instructor talks a bit slow but on 1.5 speed you get to learn the technical history of how to create fun immersive experiences with computer - what an amazing idea. I love it. The TAs were also extremely nice and helpful, and the ed forum was the best environment of any class I've had. \n\nGrading is fairly reasonable, maybe a bit of an easy A, except that I/everyone put a lot of active working hours into this class, so maybe we earned it. ",
                        "_createdAt": "2022-08-10T17:39:25Z",
                        "workload": 12,
                        "_id": "2ogZ3QfquA0Bi7ze7NrkVh",
                        "course": null,
                        "id": "2ogZ3QfquA0Bi7ze7NrkVh",
                        "difficulty": 2,
                        "_rev": "2ogZ3QfquA0Bi7ze7NrkTh",
                        "_updatedAt": "2022-08-10T17:39:25Z",
                        "rating": 5,
                        "authorId": "F0oPZPr1x08x/FdMWXkV0Q=="
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "body": "This was my last course; and they say you should leave the best for last, I am glad I listened. It was an awesome semester, the individual projects were time consuming but gave a good background into Unity and C#, and the real fun starts when the team project kicks in. Several groups had a hard time with their game and working together; ours was smoothing sailing from the start and I believe we have one of the best games made this semester. Pick your teammates wisely; the main problems I saw in other groups is they were not on the same page as far as what game they were making or kept leaving parts of the game for the last minute that ended up breaking the code. This course can easily be paired with another medium or easy course, but I recommend you take it alone if you want to focus entirely on developing an amazing game like we did. \n\nThe only thing I would change in this course is the name: it should be called Video Game Development. Yes we focused a lot on design but we worked on all aspects of game development, which included planning, -story telling, GUI and character design, lot's of coding, non playable character AI and sound design to list a few. This course gives you a great overall view of what parts are required to develop a working, fun game. You probably will not be hired as a team leader for the next Fortnite update, but you will have enough to feel confident to work at an entry level position at a game startup. Take the class, I couldn't recommend it enough.",
                        "created": "2021-12-21T06:53:41Z",
                        "rating": 5,
                        "workload": 15,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-d4ea8a1b-b70b-4c86-8bec-1919826e81c5",
                        "difficulty": 3,
                        "_createdAt": "2021-12-21T06:53:41Z",
                        "_id": "external-import-d4ea8a1b-b70b-4c86-8bec-1919826e81c5"
                    },
                    {
                        "body": "This ended up being one of my favorite classes in the program so far.  I was expecting an easy, but overall interesting course and that's exactly what I got.  \n\nThe individual projects are a great introduction to Unity.  They're a bit more open ended than other projects in the program, so a lot of students were fretting that they didn't do enough or do it correctly, but based on the grade distributions, the professor and TAs were pretty forgiving when it came to \"improvising\" and as long as you do the minimum of what is asked in each project, you'll be fine. \n\nThe exams were open book and open note and completely fair.  You can take it twice and you receive the average between the two grades.  They're also only worth 10% of the total grade, so you could theoretically do badly on both and still get an A. \n\nThe group project was a great experience. I had a super solid group where everyone contributed consistently.  We started the group under the premise of \"let's get things done early\" which worked well the entire semester.  We hosted our project on Github and used the PR system for code reviews which worked out great.  We also met weekly and distributed tasks based on availability.  \n\nFinding a good group is probably the best thing you can do for yourself in this class.  There were some horror stories from other groups, but it was smooth sailing for us. ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "created": "2021-12-20T14:41:53Z",
                        "_createdAt": "2021-12-20T14:41:53Z",
                        "_id": "external-import-559316ed-c5ff-4f3a-bd54-7d936f0b73a2",
                        "difficulty": 2,
                        "_type": "review",
                        "rating": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "id": "external-import-559316ed-c5ff-4f3a-bd54-7d936f0b73a2",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "id": "external-import-061b51a9-e8d5-4814-bff6-09e0c4caaf89",
                        "created": "2021-12-20T04:46:16Z",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "How much you'll enjoy and get out of this class greatly revolves around what group you'll get for the semester project. \n\n\nThe class consists of:\n\n* A bunch of lectures. You can skip these and just reference them as needed. There are certain lectures that correlate to the projects, watch those as you're doing the projects. \n\n* 2 Exams. They're open book, watch the lecture and search through the slides while doing this. You can take it twice, you get the average between the two attempts.\n\n* 4 Solo Projects, simple projects to get you started with Unity. Most are done for you as part of the lectures\n\n* A Semester Project and milestones to go with it. The project, alpha, and reports that go with it make up the majority of the class. \n\nThe semester project will revolve around what kind of group you get and you will get out as much as you put in. I had a horrible group so it was really an unenjoyable experience and it was clear everyone had given up after the alpha. We had a guy drop without telling anyone and another member just didn't commit anything throughout the entire semester. People would implement game-breaking changes at the 11th hour or push code that was obviously not play tested. Lots of coding over each other because people would not push code often or attend group meetings. \n\nI got an A, but honestly, I did not get nearly as much out of this course as I wanted to. It was a pretty miserable experience. I can see now that getting in the class slack channel and teaming up with other people that are also eager to find a group is the way to go, that's probably the best way to find other individuals that actually want to do work.\n\n",
                        "rating": 3,
                        "workload": 10,
                        "difficulty": 1,
                        "_createdAt": "2021-12-20T04:46:16Z",
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "_id": "external-import-061b51a9-e8d5-4814-bff6-09e0c4caaf89"
                    },
                    {
                        "_type": "review",
                        "rating": 5,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "course": null,
                        "id": "external-import-9e9ed648-46ef-4e6c-813f-89d128723e5c",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 2,
                        "_createdAt": "2021-11-30T11:00:41Z",
                        "workload": 15,
                        "_id": "external-import-9e9ed648-46ef-4e6c-813f-89d128723e5c",
                        "body": "This class was my favorite class, up there with AI4R (I have taken AI4R, ML4T, HCI, IIS, DB).\n\nThe lectures are fantastic, I wish all OMSCS lectures were of this quality. Also the professor, Jeff, is super active on Piazza which is good to see.\n\nThere are 4 milestones, 2 small quizzes, and a group project. 90% of your time will likely be in the group project. The milestones are mostly tutorials, but do a great job at teaching concepts. For example there is a physics milestone, animation, etc.\n\nThis course allows for a lot of creativity, as long as your game meets the minimum requirements (3d, has AI, root animation, etc.) you are free to build whatever you (and your group) want.\n\nI could have gotten away with maybe 10 hours a week, but I found myself wanting to spend time on group project (loved my group too). I recommend finding a group early on and being really organized from the start. We used Trello, Slack, and had weekly video conferences.\n\nThis class is definitely one that is as good as you put into it. I went in wanting to learn Unity, and left having made a really awesome game and a group of new friends. \n\nI am excited to take Game AI down the road.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-11-30T11:00:41Z"
                    },
                    {
                        "created": "2021-10-27T05:02:04Z",
                        "_id": "external-import-f05a1ca7-bfee-4615-b511-7bb7d862f55a",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "It is a fun class but it basically teach you some fundamental of Unity, but far from enough to get a job in this field. In fact, your final project won't even worth going to your resume ",
                        "id": "external-import-f05a1ca7-bfee-4615-b511-7bb7d862f55a",
                        "rating": 2,
                        "workload": 15,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester"
                        },
                        "_createdAt": "2021-10-27T05:02:04Z",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2
                    },
                    {
                        "created": "2021-10-21T23:07:40Z",
                        "rating": 5,
                        "workload": 10,
                        "_id": "external-import-9ec13b1b-884e-4b78-bc21-3a34d50dd18c",
                        "_createdAt": "2021-10-21T23:07:40Z",
                        "_type": "review",
                        "difficulty": 1,
                        "id": "external-import-9ec13b1b-884e-4b78-bc21-3a34d50dd18c",
                        "body": "This is my 7th class in OMSCS (CN, IHI, GIOS, CP, AI, KBAI). I write C# for my day job.\n\nThis class is a near-guaranteed **A** with most semesters at a proportion of >85% **A** grades. You don't need any C# or Unity experience to succeed in this class. That said, I'll repeat the words of previous reviews: you get out what you put in. This is especially true in a class that doesn't provide the external motivation of challenging assignments & exams. If you want to learn the basics of game development, this is a great opportunity to pursue that hobby while still making progress in OMSCS.\n\nI was pleasantly surprised to find that the class is great for learning practical Object-Oriented Programming principles & patterns. I believe these are essential industry skills for building maintainable applications, so this is a rare opportunity in OMSCS.\n\nIf you intend to double-up with a hard class, please be considerate of your teammates. Nobody likes _that teammate_ who invests the minimum effort because they're focused on another class.\n\nAlso, if [all of your classes have a OMSCentral difficulty rating ≤ 3](https://omscentral.com/review/-MpkVEkEz6X-tZqw4H4H), you should consider taking harder classes. Please don't use this class to find the easiest way possible through the program.\n\n## Team Project\n\nYour most important assignment in this class is finding a group of 5-6 for the team project. The quality of your group will make or break your experience here, and the project is probably too big for one student to \"carry the team\". To find good teammates, I believe the best strategy is **form a group as early as possible**. Proactive teammates tend to be very responsible teammates. Get on the [class Slack](https://omscs-study.slack.com/archives/C018C68P6SX) and ask around before the semester starts. Also, search the introduction threads for anyone with prior Unity experience, which is a huge advantage for common solutions to common Unity problems. Don't wait until the class starts talking about that team project.\n\nMy biggest complaint with the project requirements is the narrow scope of game mechanics. The game requires 3rd-person character control, so you're limited to mostly 3D platformer or 3rd-person shooter genres. To be fair, a few ambitious groups did psychological horror and puzzle games as well.\n\nWorking with a team in Unity can be a pain because Unity Scenes are a nightmare to resolve merge conflicts. My team mitigated this by using an \"exclusive lock\" system for Scenes. We also heavily used Prefabs which allowed us to create assets without modifying the Scenes.\n\nThe time commitment will likely spike on weekends when the team needs to cleanup bugs, create builds, write READMEs with code & asset attributions, complete peer assessments, and record videos (trailers or demos). The more you can spread this out, the better. Again, proactive teammates will help avoid a classic [\"crunch\"](https://en.wikipedia.org/wiki/Crunch_(video_games)) situation.\n\nThis does not require the students to create original art / sound / animations; most of those can be pulled & cited from paid or free sources. The project only requires that **all code is fully original and created by the team**. If in doubt, ask a TA and they will gladly give a thumbs-up or thumbs-down.\n\n## Milestones\n\nThe 4 individual assignments are all straightforward implementations following the instructions. I've seen more organized instructions in OMSCS, but nothing here is complicated enough to require significant help. The worst case is encountering a strange Unity behavior, but we're playing in well-documented territory in this class.\n\nThe most challenging part is just organizing the submissions. There are very specific instructions on builds, file structure, a README, and excluded files.\n\nNone of these assignments should require more than 10 hours each unless you're determined to overdo them. Even in that case, that effort might be better spent on the team project.\n\n## Quizzes\n\nThe first quiz was 26 multiple-choice questions, no proctor, open everything. They allowed 2 attempts, but the score is the average and the questions change between attempts. I felt the first quiz was very reasonable with a few tougher questions. With no time pressure, I spent almost 1.5 hours going through the lectures & lecture notes to pick up details.\n\nSecond quiz was roughly the same: 27 questions with True/False, multiple-choice, and select-all types. The difficulty was roughly the same.\n\nI don't recommend stressing over the quizzes; they're only worth 5% each. As the weight suggests, you should focus your efforts on the group project instead.\n\n## Lectures\n\nThe lectures have an unusual structure for OMSCS. These were recorded by Dr. Wilson in his office and resemble long-form lectures more than the MOOC-style lectures of most classes. This means the lectures _feel_ substantially longer, even watching on 1.75x or 2x speed. Keeping up with 3+ hours of lectures per week was an unwelcome chore when I just wanted to focus on finishing the team project.\n\nEarly lectures contain useful information from both a high-level and specific to Unity: several of the videos are walkthroughs for the individual milestones, and most concepts are required mechanics for the group project. For example, the class includes a short Audacity tutorial for processing audio clips for the game.\n\nThe later lectures (Interesting Choices, Interactive Narrative, Future of Games) aren't _bad_, but they don't feel integrated with the class except to pass Quiz 2. Lecture demos are fine, but not nearly as engaging as assigned playthroughs.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall"
                        }
                    },
                    {
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-07-31T07:04:07Z",
                        "rating": 2,
                        "body": "I only learned how to use Unity(software) to make some boring things, not very enjoy this course. \n\nIndividual Assignments, which are just time-consuming part, but easy to get 100s.\n\n2 quizzes, very difficult and tricky, you have to watch videos very carefully.\n\nGroup project, choose someone you know better than some strange and lazy team members, they never showed up when you did the project yourself, and changed everything at the last minute before the due date.",
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 25,
                        "id": "external-import-a64cbccd-d0d6-406c-b245-a1930281c16f",
                        "created": "2021-07-31T07:04:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "_id": "external-import-a64cbccd-d0d6-406c-b245-a1930281c16f"
                    },
                    {
                        "id": "external-import-5217da65-140b-403e-abbf-404f5d537b71",
                        "rating": 5,
                        "difficulty": 1,
                        "body": "You get what you put in. This class is generally extremely low stress. If you put the bare minimum of work to get an A, this can be the lowest course load out of all your OMSCS classes. But that's no fun! Video games are never really finished and you can easily put as many hours as you want into your game. \n\nWhile the milestones (homeworks) were great practice for implementing things we would need in our video game, if there was anything to complain about in this class, I wish there were either more of them, or more rigorous ones. Not so much that we would get bogged down by deliverables which is the case for many other classes (and the stress-free nature of VGD is honestly one of the biggest positives about this class), but just that there is so much to learn in Unity it would be great to have more structured learning.\n\nAll in all though, a lot of fun. Here are some [practical tips](https://jonathanlao.medium.com/omscs-video-game-design-f0ef80cd8615) for success. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_createdAt": "2021-05-13T20:56:06Z",
                        "_type": "review",
                        "created": "2021-05-13T20:56:06Z",
                        "_id": "external-import-5217da65-140b-403e-abbf-404f5d537b71",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "workload": 10
                    },
                    {
                        "difficulty": 2,
                        "_type": "review",
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "_createdAt": "2021-05-01T14:33:22Z",
                        "created": "2021-05-01T14:33:22Z",
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "I really appreciate when a course gets out of your way and lets you learn without bogging you down with quizzes, grading hassles, and minutiae. Video Game Design is such a course; it places minimal stressors on you, allowing you to get out of the course what you desire. I found this course to be greatly enjoyable in nearly all aspects, especially compared to the other OMSCS courses I've taken (this was my 7th course).\n\nThe curriculum is divided roughly into two parts. For the first ~30% of the course, you'll be doing individual assignments (4) in Unity to learn the basics in areas like animation and physics. These are the sorts of assignments where the instructions tell you pretty much exactly what to do, and you have little excuse not to make a high grade. I had never used C# or Unity, so I found them instructional. The remaining bulk of the course is taken up by the group project, in which you and four others will make a 3D \"Game Feel\" game. Now, I usually hate group projects, but I got lucky in this one and had a great group of guys who put in lots of work. Our game turned out better than expected, and I found myself putting in more work into it than in any other OMSCS course, not because it was strictly required for a good grade, but because I enjoyed it. If you get a good group, you will probably have a good time, but if you get a bad group, it will probably be hell. The groups are not randomly chosen, but instead solicited on Piazza, so if you take the course with some friends, you can pre-arrange your group. Or you can just be diligent in choosing teammates from the Piazza posts and hope for the best.\n\nThe professor was very active and helpful on Piazza. Whereas other courses felt like the professor was the Lord of All Knowledge deigning to toss some scraps to the peasant students, Professor Wilson seemed more like a helpful mentor who was always willing to point you in the right direction. The course videos were enjoyable to watch (though you should definitely watch them at 1.5x), but unless you have lots of time, I'd say skip the textbooks (they're not required at all). I can think of almost no downside to the course content or structure... the only thing might be to update some of the Unity lessons to fit with current best practices, but I understand it's difficult or impossible to keep up with that.\n\nOverall, this has probably been my favorite course in the program thus far. My ranking would go like this: VGD > KBAI > ML4T >>> HCI > SDP >>> ML > IIS",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "workload": 12,
                        "id": "external-import-e699e32a-587a-4663-b88c-dfdce3aa0b03",
                        "_id": "external-import-e699e32a-587a-4663-b88c-dfdce3aa0b03"
                    },
                    {
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "workload": 20,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "body": "4 Individual assignments (they can be time-consuming, but easy 100s if you follow the directions)\n\nThe lectures were screen recordings of Prof. Wilson going over power points. Despite the lack of Udacity-level production quality, they were still interesting. He really has a passion for interactive media and it shows.\n\n2 quizzes - \"open book\", based on the lectures. we get a 3-4 day period to take it. Very easy, though there are a few difficult questions which require you to go back through the lectures to find specific details.\n\nGroup project - Where you will spend 95% of your time in this course. My advice is to keep it a simple 3d \"game feel\" platformer as suggested in the rubric. We sank a lot of time into ambitious features that were eventually scrapped since they were too complex. There are many Unity tutorials on YT that you can follow to get a decent running game.\n\nI would say the course is pretty heavily front-loaded as we the have 4 individual assignments due back to back every week and then the alpha (which should have a majority, if not all, of the game features you have planned) due 3 weeks later, so beware if you are planning to pair it w/ another heavy/front-loaded course. The second half of the course was pretty lax and my group made small changes here and there based on alpha feedback end ended up w/ an A in the course.",
                        "_createdAt": "2020-12-14T00:30:27Z",
                        "course": null,
                        "_id": "external-import-ed5a5cf2-372a-489e-aa36-12d20db4c29e",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-ed5a5cf2-372a-489e-aa36-12d20db4c29e",
                        "created": "2020-12-14T00:30:27Z",
                        "rating": 5
                    },
                    {
                        "course": null,
                        "rating": 4,
                        "_id": "external-import-2d376b98-e172-47ba-986b-4c2e5d3dc0c6",
                        "body": "This was a surprisingly good class - especially considering that this was the first semester it was taught in OMSCS. However, it is fundamentally different from most classes in the program: it's really not designed to teach you much academic material but rather gives you time, resources, and guidelines / guardrails to learn how to develop fun 3D video games. \n\nThe class structure is very simple:\n\n- Five homework assignments. These are worth 45% of your grade and are pretty much free points. The assignments are structured more like step by step tutorials and the professor even has a couple lectures showing you exactly how to do some of the assignments. While these assignments aren't difficult, they do go through a lot of the ins and outs of Unity and are quite useful.\n- Two quizzes. These are actually pretty tricky even though they're open note. The only reason to watch the lectures is to do well on the quizzes, but they're only worth 10% of your grade so you can get an A in the class even if you do poorly on the quizzes. \n- The group project pretty much dominates the class. This project is actually very well structured - there are quite a few checkpoints (some graded and some informal) where you can get feedback to make sure you're on the right track. \n\nIt's important to note that while the course pre-reqs sound a bit scary, you really don't need to know any complex math, C#, or have any experience with game development or Unity to do well in this class. According to a class poll, >60% of students this semester were completely new to Unity. However, the class does ramp up quickly so if you're new to game development (like I was) I would highly recommend going through some of the beginner Unity tutorials like [the create with code series](https://learn.unity.com/course/create-with-code). \n\nThe TAs and professor for this course were great. They were really active on Piazza, pretty decent at getting grades back on time, and gave good feedback on the project. \n\nI think my only complaints with the class were that the group sizes were a bit too big. I would've preferred to work either alone (though it would've been difficult to get something really good together) or in a smaller group. Working in such large groups made it a bit harder to learn about all of the different aspects of Unity since each member owned smaller portions of the group project. \n\nOverall, if you're even mildly interested in learning about video game programming but never had the time to learn (or you're an old hat but want some dedicated time to try out some new stuff) I would highly recommend taking this class. ",
                        "_type": "review",
                        "created": "2020-12-12T06:11:41Z",
                        "_createdAt": "2020-12-12T06:11:41Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 9,
                        "difficulty": 3,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-2d376b98-e172-47ba-986b-4c2e5d3dc0c6"
                    },
                    {
                        "rating": 5,
                        "id": "external-import-c9465fcf-ee8e-4c44-a8e1-46c927542348",
                        "body": "This is my sixth course in the program and was by far the easiest while at the same time being the one I enjoyed the most. I learned a TON from this class and it was only easy because the professor was excellent and very passionate. I highly recommend pairing this with another class though as the workload was relatively light compared to others. By the end of this class you should be confident in making your own game in Unity. If that's what you're looking for, then go for it! ",
                        "course": null,
                        "_createdAt": "2020-12-09T23:51:12Z",
                        "_id": "external-import-c9465fcf-ee8e-4c44-a8e1-46c927542348",
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "difficulty": 3,
                        "created": "2020-12-09T23:51:12Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review"
                    },
                    {
                        "created": "2020-11-06T16:37:47Z",
                        "body": "Although the first semester of this course isn't over yet, \nI've noticed some concerns about this course considering it's newness, \nso I want to get a review out there before everyone has registered for their next class.\n\nThe grading this semester breaks down as follows:\nIndividual Milestones \t44%\nWarm-up Milestone \t1%\nTeam Project Pitch \t4%\nTeam Project Alpha \t8%\nTeam Project Playtesting \t8%\nTeam Project Final Game \t25%\nQuiz 1 \t5%\nQuiz 2 \t5%\n\nEssentially the class is 45% individual assignments\n45% a team project, and 10% quizzes.\n\nThe individual assignments are mostly focused around what can be done in Unity. They are somewhat structured, but the student has some freedom in the creative implementation\n\nThe team project is where most of the time for this class is spent. \nTeams are formed very early in the class, and deliverables are scattered throughout the semester. This is the most time consuming part of the class, but also the most fun. The project has and number of requirements such as the need to be a 3D game with some AI,\nbut how the students choose to meet those requirements is very open ended. You team has a lot of creative freedom with what they choose to create. This is why I've been describing this class to friends and family as more of an art class than a CS class. You are expected to contribute to the code/algorithms your game uses, but you won't be implementing a neural net from scratch.\n\nWith the quizzes, everyone on my team was surprised by the tickyness of the first quiz, so don't take them too lightly. They are open book with no time limit, but if you take them seriously, and you should be fine.\n\nDon't avoid this class just because it has a group project.\nThis was my third class in the OMSCS program with a group project, and I've had a great experience every time. Although I'm always nervous about group projects due to the large number of unknowns when getting\nstarted, in this program you are more likely to work with an ambitious veteran developer than a complete slacker. (It would have been four group projects if the pandemic didn't scuttle the group project portion of HCI for spring 2020)\n\nMy personal recommendation for when to take this course is after you're at least half-way done with the program. Focus on the core courses of your specialization first. If you need a change of pace,  definitely consider this class. It is a fun change from some of the other brain melting courses you may encounter here. So far, it's been great! (If all goes well, this is my last semester in the program, having already met the requirements for the ML specialization.)\n\nThe course focuses in doing development in the Unity framework.\nUnity uses C#, but you aren't expected to know anything about it until after starting the program. My experience programming in Unity so far is more about understanding how Unity wants to do things rather than how C# would prefer you do them. I'd never touch C# before this class, and no one on my team had ever used Unity before, but picking it up hasn't been a problem.\n\nWhen it comes to the lectures, don't forget to speed them up. The professor acknowledges that he talks somewhat slow, but in my opinion, if you speed them up, I think they are pretty great! Different style than the Udacity lectures, but well done.\n\nBecause this class is more fun than brain breaking, I think it's a good candidate for pairing with another course. While I never experienced an \"easy\" course in grad school, if aiming for an easy/hard pairing, this would fit in nicely as the easy course. How much time you spend really depends a lot on how ambitions your group project becomes. On my project, it can feel pretty time consuming at times, but the time is much less stressful than with other classes.",
                        "rating": 5,
                        "id": "external-import-eb289d10-607c-4a35-8453-6334f0b64812",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-11-06T16:37:47Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 15,
                        "_id": "external-import-eb289d10-607c-4a35-8453-6334f0b64812"
                    }
                ],
                "_rev": "2fGL4wLzApR3gIrnwxq6bg",
                "slug": "video-game-design-and-programming",
                "creditHours": 3,
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/d951660c2c282238f2de5196fae791c7fd4c3768.pdf",
                "id": "external-import-CS-6457",
                "created": "2022-07-05T23:23:15Z",
                "_type": "course",
                "isDeprecated": false,
                "officialURL": "https://omscs.gatech.edu/cs-6457-video-game-design",
                "codes": [
                    "CS-6457"
                ],
                "rating": 4.2,
                "difficulty": 2.2333333333333334,
                "workload": 12.466666666666667
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "video-game-design-and-programming"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}