{
    "props": {
        "pageProps": {
            "course": {
                "isDeprecated": false,
                "creditHours": 3,
                "created": "2022-07-05T23:23:15Z",
                "tags": [
                    "CPSS"
                ],
                "_createdAt": "2022-07-05T23:23:15Z",
                "isFoundational": true,
                "description": "This course provides an introduction to security issues relating to various cyber-physical systems including industrial control systems and those considered critical infrastructure systems.",
                "slug": "introduction-to-cyber-physical-systems-security",
                "name": "Introduction to Cyber-Physical Systems Security",
                "syllabusUrl": "https://rbeyah.ece.gatech.edu/classes/summer2022/cs6263/",
                "_updatedAt": "2022-08-25T21:40:43Z",
                "textbooks": [
                    {
                        "name": "Industrial Network Security: Securing Critical Infrastructure Networks for Smart Grid, SCADA, and Other Industrial Control Systems, 2nd Edition",
                        "_key": "fc9014e02b11d7be75ac4a27b93aef04",
                        "url": "https://amzn.to/3CrNqUb"
                    },
                    {
                        "name": "Applied Cyber Security and the Smart Grid: Implementing Security Controls into the Modern Power Infrastructure, 1st Edition",
                        "_key": "24090bbdf82d9c17dc6b8b508144e997",
                        "url": "https://amzn.to/3ALzN0X"
                    }
                ],
                "_type": "course",
                "officialURL": "https://omscs.gatech.edu/cs-8803-special-topics-cyber-physical-systems",
                "codes": [
                    "CS-6263",
                    "ECE-8813"
                ],
                "_id": "external-import-CS-6263",
                "reviews": [
                    {
                        "_createdAt": "2024-07-24T14:35:18Z",
                        "body": "This course is difficult to judge. Project 1 - 3 were pretty interesting but the lectures didn't really give me a deep understanding of the subject matter and were hard to sit through. The tests were fine but project 4 was not good.\n\nProject 1 (Design and Simulation of Industrial and Control systems): this was a really time consuming project (~40 hours) and I assume what led to the 36% of drops as shown on critique.gatech.edu. It used Factory I/O coupled with Control I/O to create the controls system for a water level controls system and a pallet storage system.\n\nProject 2 (PLC Programming with Ladder Logic): this project was interesting and was much quicker (~15 hours)\n\nProject 3 (Reconnaissance for Attacks on ICS Networks): Analyzing DNP3 traffic using wire shark and answering questions. This project seemed easy on the surface but I ended up spending 30+ hours analyzing the traffic data. By far the best project and I learned a ton.\n\nProject 4 (Secure System Analysis Using Machine Learning): this was the project that dropped the rating of the class for me. I completed the project in 10 hours and learned nothing about ML or security. \n",
                        "_updatedAt": "2024-07-24T14:35:18Z",
                        "rating": 2,
                        "created": "2024-07-24T14:35:18Z",
                        "_rev": "4IKFTINhZsIMAj0wzgGhxC",
                        "_type": "review",
                        "semester": {
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z"
                        },
                        "authorId": "FUkWRQlp6jbE1e8NmanAdA==",
                        "difficulty": 2,
                        "course": null,
                        "_id": "4IKFTINhZsIMAj0wzgGhzI",
                        "workload": 10,
                        "id": "4IKFTINhZsIMAj0wzgGhzI"
                    },
                    {
                        "authorId": "0QWYgDj+yUgSDg1d+JGVww==",
                        "body": "This was my 8th class in the whole degree program and it was my least favorite class so far. It wasn't because of the subject matter, it was because how the class was run and the general lack of help from the TAs.  My issues are as follows: \n1. 2 out of the 4 projects are incompatible with M1 chip computers and as far as I can tell, there was literally no warning about this issue anywhere in the class materials. \n2. When asking for help the TAs are very unhelpful. When I asked about an issue I had setting up some packages on my computer, a TA responded by suggesting I google around for an answer. When another student asked about how to compute coordinates from binary locations, the response was \"Not sure if you took a course called digital logic design. If you read about that subject, then the answer will be very straightforward.\" \n3. The prerequisites for this course are C and Python. You will have to teach yourself a PLC ladder logic and a whole new manufacturing program that has really terrible documentation. \n\nA lot of the time I spent on this class was not on learning core concepts for security and cyber physical systems but was instead used to decipher what little help the TAs, teaching myself programs that weren't prerequisites, and dealing with technology incompatibility issues I was blindsided. If you have an apple chip computer, don't take this class. The concepts aren't hard but the projects are a lot of work. If you are interested in security and have a windows machine, knock your socks off. ",
                        "semester": {
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester"
                        },
                        "rating": 1,
                        "id": "pcPTVGswHpT8MIzSn5OqOH",
                        "difficulty": 4,
                        "course": null,
                        "_rev": "pcPTVGswHpT8MIzSn5OqNN",
                        "_type": "review",
                        "_updatedAt": "2023-11-07T01:03:44Z",
                        "_createdAt": "2023-11-07T01:03:44Z",
                        "_id": "pcPTVGswHpT8MIzSn5OqOH",
                        "created": "2023-11-07T01:03:44Z",
                        "workload": 15
                    },
                    {
                        "authorId": "ijst66BuxR607kMGuOkYHQ==",
                        "_createdAt": "2023-04-28T14:53:13Z",
                        "body": "Lectures - Echoing what others have said, the lectures are incredibly dry. All fourteen weeks could have been summarized in an hour lecture. I was expecting each lesson to get more detailed and in depth, but it’s the exact same principles repeated over and over every week. All of the exam content comes from the lectures. The content is not technical and nothing that an undergrad or grad student from a non-CS background couldn’t pick up. \n\nExam - There are two exams and they’re not hard. 20-25 question multiple choice tests. You can have a note sheet but you won’t need it. The questions can be figured out by using a little bit of reasoning after watching the lectures. \n\nProjects - The projects are the core of the workload and you should start them early. There are four projects and you have about two weeks to do each. The first two projects took about 35 hours and the second two took about 20 hours. No prior coding experience is required, two of the projects are in a language you’ll learn on the fly and the other two are in very basic python with starter code. I found the projects to be tedious and a test of my ability to follow niche instructions more than an application of the course content or learning a tool/language/concept that I’ll need in the future. Most of the projects have a autograder and the ones that don’t have clear instructions for what is needed to get full marks. The projects are varied and don’t build on each other. They felt like busy work and artificial examples of very small industrial control systems. I never had any “a ha” moments where a concept clicked for me, and nothing from this course would prepare you to work at a factory securing real ICS systems. \n\nPaper Presentation - Throughout the semester you’ll have to read an academic paper, prepare slides on them, and record a video of you presenting it. It took me about 6 hours total to read the paper, come up with a script and slides, and then record and upload it. You’ll also have to watch other students videos and participate in discussions with them. \n\nWorkload - This class is not challenging but it is tedious. Start the projects early because they do take a significant amount of time. \n\nOverall - This was my first class in the program and I was disappointed in its rigor and content. The basics of securing ICS systems are pretty obvious and it never gets more complicated than what is introduced in the first two lectures. I would have preferred it go much deeper into the topics and have less trivial projects to work on. ",
                        "_id": "izKdQKGWKnehyWbkvW0i3E",
                        "created": "2023-04-28T14:53:13Z",
                        "_updatedAt": "2023-04-28T14:53:13Z",
                        "_rev": "izKdQKGWKnehyWbkvW0hzd",
                        "course": null,
                        "id": "izKdQKGWKnehyWbkvW0i3E",
                        "difficulty": 3,
                        "workload": 15,
                        "_type": "review",
                        "rating": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        }
                    },
                    {
                        "_rev": "k1if27Q2SfTAO2ctPfAxyr",
                        "workload": 8,
                        "authorId": "SlevrcVSMSULimw0GvJUag==",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "created": "2022-12-12T04:33:22Z",
                        "_createdAt": "2022-12-12T04:33:22Z",
                        "id": "k1if27Q2SfTAO2ctPfAy3i",
                        "rating": 2,
                        "_updatedAt": "2022-12-12T04:33:22Z",
                        "course": null,
                        "_id": "k1if27Q2SfTAO2ctPfAy3i",
                        "difficulty": 2,
                        "body": "This class was pretty easy/light workload (two caveats to that) but also frankly kind of bad. I wish I had taken something else.\n\nThe good: -Although lectures were very broad/high level and repetitive, I thought they were fairly clear. -I learned a good survey about industrial control systems and threats to those systems that I really knew nothing about before. Now I see attacks on ICS systems in the news and it means something to me. -It was novel to me to do functional block diagrams (which sucked, but still a new way to think) and ladder diagrams. -I learned a few cool things from having to do the paper presentation and watch other people's presentations.\n\nThe bad: -Very low quality exams worth a high percent of your score. -At some point lectures and projects completely diverge so that you are basically watching lectures solely for the exams and then on a completely separate track are doing the projects. -Lectures start to become very repetitive. -The first project felt like a (very tedious) game and wasn't clear to me what it was actually teaching me about security or ICSes. -The course VM for Project 2 was very buggy. -There was no autograder.\n\nMostly the workload was very light and the class was almost over by Thanksgiving break. The caveats about why it's maybe not easy are (1) the first 2 projects were extremely tedious and time-consuming, so that part isn't easy and (2) this class has a multiple choice midterm and a final that are together 30% of your grade. Both are very low-quality multiple-choice exams with no study guide to speak of which consist mostly of random trivia from the lectures. On top of that, the questions are often phrased very ambiguously. In other words, it is very easy to miss questions on these exams and lose a lot of points. I can imagine someone understanding the material well but not getting an A because of the weighting and quality of the exams. (Similar in quality to Computer Networks exams if I recall correctly.)\n\nWorkload estimate for the projects:\nMini Project 1 Factory I/O: 27 hours\nMini Project 2 LD: 17 hours\nMini Project 3 Modbus: 6 hours\nMini Project 4 Buffer Overflow Attack: 9 hours\n\nOne last note: They state some hardware requirements on projects 1 and 2 which were higher than what OMSCS itself suggests. This briefly freaked me out, because those requirements were not listed in the course description itself anywhere, and I had just bought a new laptop for school that didn't meet the requirements. However, my new laptop with 8GB RAM and no dedicated video card proved to be completely fine.",
                        "_type": "review"
                    },
                    {
                        "difficulty": 3,
                        "_createdAt": "2021-08-22T02:28:44Z",
                        "_id": "external-import-249416ba-a820-4e52-8eba-6ec83ffaeee0",
                        "id": "external-import-249416ba-a820-4e52-8eba-6ec83ffaeee0",
                        "created": "2021-08-22T02:28:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "workload": 20,
                        "body": "The projects were engaging and kept the class interesting. Although frustrating, you have to use trial and error to get it working correctly. Boolean logic will help with the first project, YouTube videos on how ladder logic works helps on the second. Especially the 'order of operations' in ladder logic, eg how it assigns variables can mess up your program. The third project wasn't too intensive. As soon as you know where to look for the modbus values and filtering the Wireshark, it was straight forward. The last overflow project was definitely tricky and some good GDB debugging will help find the overflow. Really look at the write up FAQ and visualize the read write registers.\n\nExams were decently challenging.  Most came from the lectures however, I recommend reading the text because the lectures are just an abbreviations of what the text covers. So, the text might reiterate a topic multiple times and the lectures hit on it once and of course, a question is on the exam of that glosses over topic from the lectures. Some questions did get into the weeds of the project and lectures so take good notes on your one/two sided paper. ",
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "created": "2021-05-12T04:44:02Z",
                        "difficulty": 3,
                        "_createdAt": "2021-05-12T04:44:02Z",
                        "rating": 4,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-6ee195b3-6237-4caf-bdad-ddaf094bc316",
                        "_id": "external-import-6ee195b3-6237-4caf-bdad-ddaf094bc316",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "workload": 15,
                        "body": "Solid class. Lectures are good. They follow the Intro to Network Security Textbook very closely. I watched all of the lectures week by week and then read the textbook chapters to review for the final. I think it was a good strategy.\n\nThe lectures combine the topics of IT/networking/cybersecurity with the topic of industrial automation. I definitely wish I had reviewed more networking material before taking the course. I hadn't taken a formal networking course and although there was a background lecture on it, I found the networking topics to be the most difficult. \n\nI really enjoyed the mini-projects. I highly recommend starting them early, since the time they take can vary drastically depending on your background knowledge in industrial controls and cybersecurity.\n\nThe paper presentation assignment would have been a lot more enjoyable if it were as well organized as the mini-projects. There wasn't a written instruction document, just a post on Piazza and the announcements section of Canvas. The way to sign up for a time slot and claim a paper to present on was also not great. It was just a big spreadsheet that everyone had edit access to. We were told that our grade on the assignment would be significantly docked if we chose a paper that someone else had already claimed or if we messed up the spreadsheet. I think there could have been some sort of form or signup webpage to do this. The spreadsheet was kind of messy and I could see how someone could accidentally mess it up or choose a paper that was already chosen. I also don't see much reason why the submission deadlines for this assignment were staggered. I would have preferred if the assignment was due at the same time for everyone.\n\nAll in all, it was an interesting course. I hope the course staff figure out a better way of handling the paper presentation assignment, but besides that I was a big fan of the material and the way the class was run. "
                    },
                    {
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "rating": 4,
                        "created": "2020-12-02T06:21:40Z",
                        "workload": 15,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-2045cd90-3994-4f3b-bd18-de5914adb6c9",
                        "body": "A good course with some challenging projects, and as with everything in Cybersecurity you need to be familiar with Python. You can pair this with another class, but be warned that the first and second (perhaps even the fourth) projects will take up all your time. Project 1 took me 100 hours, Project 2 took about 60 hours, Project 3 & 4 about 20 hours each. The mid term and final are well outlined in Piazza when they release them, and there is a presentation project that was actually fun to create. The TAs are quick to respond in Piazza, and some will respond in the Slack. \n\nProject 1 is heavy on system resources, and if you run Mac or Linux you're going to have a bad time as it only runs on Windows. The project tasks are straight forward but the project will easily suck up the two weeks to complete it. The difficulty is learning the program (read the entire manual!), and your own logic will work against you. Keep things simple and organized. For Project 2, I found the PLC Editor was far better on Windows, the Linux one is sluggish and doesn't do highlighting. \n\nThe lectures are OK. Halfway through the course the professor started talking fast and dropped a lot of heavy information to digest, expect to rewind multiple times. The books are useless, don't get them unless you'll be working around ICS or enjoy doing embedded projects.",
                        "id": "external-import-2045cd90-3994-4f3b-bd18-de5914adb6c9",
                        "_createdAt": "2020-12-02T06:21:40Z",
                        "course": null
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "body": "This was my first semester, I took this class with IIS, which ended up being good because there was a lot of overlap.\n\n\nI wouldn't say that this class is difficult, but its easy to mess up on one or two things and have a big hit to your grade.\n\nThe big grades are: 4 Projects, 2 Exams, 1 Paper Presentation\n\n**Projects**: The projects are super front-loaded, the first two projects are monoliths that take up a huge amount of time. The second two are much easier and much more straightforward. My biggest problem with the projects is that there are tiny obscure requirements littered throughout the writeups, in turn, there are also hints, occasionally misleading, also littered throughout the writeup. These tiny obscure requirements can lead to huge grade hits, even if they do not affect the functionality of the project. This knocked me quite a few points and probably cost me the A. A lot of people seemed to underestimate the amount of work/time and didn't start until the weekend before they were due. If anything else, utilize all of the time given, usually you will need it. \n\n \n_Project 1_: This is creating a \"factory\" in a program called factory I/O, Its a very neat project,  but there are a lot of edge cases and extreme specifics. Programming is done using functional blocks, so it can take a little getting used to. Takes a lot of time, but overall is neat. Expect to spend between 35 and 45 hours on this, and if you don't have a computer with a decent GPU, you're going to have a bad time.\n\n\n_Project 2_: This one is similar to project 1, but instead of functional blocks, it was with ladder logic. I already had some experience with ladder logic so it wasn't a huge learning curve, but the program and VM used are absolute garbage, its buggy, non-deterministic and performance deteriorates as it goes on. Luckily this project had an autograder so you could know if you were right at least. The autograder had _extremely_ tight tolerances though and I could only get it to pass by giving the VM 16+ GB of Memory. Many people got dinged on this for not passing the Autograder. \n\n_Project 3_: This one was by far the easiest, but also the one I did the worst on by getting dinged for obscure details. It's just analyzing a modbus wireshark capture and answering questions, then setting up your own modbus communication and sending things back and forth. \n\n_Project 4_: This was a buffer overflow attack, very similar to the first project of CS6035, but with a few extra steps. Wasn't too difficult once you figured out the main part. \n\n\n**Exams** There are only 2 exams the midterm and the final. \n\nThe midterm was really poorly written, with a lot of unclear and obscure questions. You could bring a 1-page sheet of notes, but it was useless since basically none of the questions were from the slides, and were just testing if you could remember that one obscure piece of info from the lectures. \n\nI found the final to be much better written and much more relevant to the material.\n\n**Lectures**\n\nThe lectures are well-produced, but they circle a lot, repeat the same information, are poorly organized, and the professor talks ridiculously fast with no breaks between sentences. If there weren't questions on the midterm based solely on things he said from the lectures, I'd say just forget the lectures and read the book. 95% of the lectures are him just reading the slides, but it's that last 5% that was the entirety of the midterm.\n\nThe lectures also only occasionally line up with the projects and are usually completely detached. \n\n\n**Presentation**\n\nThe presentation was a small amount of work, coming up with something to say for a 20-minute video was the hardest part. You can pick your paper. Pretty straightforward. \n\n\n**Professor/TA Interaction**\n\nThe professor was completely absent from the entire course, I never saw him once for office hours, on Piazza, or anything else. \n\nThe TAs were pretty helpful, but definitely didn't take any bullshit. There was more than one occasion where a TA would verbally smackdown a student for being whiney or unable to figure something out. They were always available for office hours, quick on piazza, and obvious that they ran the entire class.\n\n\n**Overall**\n\nI didn't particularly enjoy the class, it was interesting, but I don't think I'd take it again unless I had to. The projects were definitely the highlight of the class.\n\nLooks like right now I'll be ending with a B, but If I paid closer attention to the requirements for Projects 1 and 3, I would easily have an A. \n\n\n",
                        "id": "external-import-289caee8-e39c-414d-81cb-c7970d912dcd",
                        "created": "2020-11-30T20:18:45Z",
                        "difficulty": 3,
                        "_createdAt": "2020-11-30T20:18:45Z",
                        "course": null,
                        "workload": 12,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "_id": "external-import-289caee8-e39c-414d-81cb-c7970d912dcd"
                    },
                    {
                        "difficulty": 2,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_type": "review",
                        "rating": 3,
                        "workload": 6,
                        "id": "external-import-c707168b-1900-422e-bc8e-96ef71ddc0ab",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_id": "external-import-c707168b-1900-422e-bc8e-96ef71ddc0ab",
                        "body": "I took this class based on the reviews that it was not particularly difficult.  The reviews were accurate, this class is not difficult.  It did not have the rigor that I expected from a graduate-level class.\n\nThere was a lot of whining that the first two projects were difficult, I did not find them to be a problem, but I did start as soon as possible, which gave me some cushion to get them done.  I would not wait until the last minute to do any of them.\n\nThe class appears to be completely run by TAs, there is no interaction with the professor at all.  ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-11-29T16:29:53Z",
                        "created": "2020-11-29T16:29:53Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "workload": 6,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "body": "It is an easy class. Lectures were bit boring. Projects were fun especially if you don’t have experience with ICS. I think they’ve changed the format or something. It is much more time consuming now. \n\nThe first two projects took me 30-35 hours each. Project 3 and 4 were much easier and less time consuming, and I spent no more than 5 hours each. I put almost minimal effort other than doing projects. I spent 2-3 hours watching the video (played at 2x) right before each exam, and finished each in less than 20 minutes. For presentation, it took me less than 5 hours. I got 100% on projects/presentation and 70%+ on exams. I ended up with an A.\n\nThe main problem with the class is that assignments were not distributed evenly. Many people dropped after first or second project because they were way too time consuming. Things eased after the first two projects.",
                        "difficulty": 2,
                        "_createdAt": "2020-11-23T19:13:33Z",
                        "id": "external-import-c8c4fa25-6018-40d3-82b1-7f6e61947b1f",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 3,
                        "course": null,
                        "_id": "external-import-c8c4fa25-6018-40d3-82b1-7f6e61947b1f",
                        "created": "2020-11-23T19:13:33Z"
                    },
                    {
                        "rating": 4,
                        "_id": "external-import-a9261d70-ce7a-452b-b707-b9c3fb60a3f4",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "body": "My background: Took this my first semester alongside IIS. No experience in integrated control systems or any of the technology in this course.\n\nProjects: Four projects this semester where the work varied pretty greatly. The first two took me between 30-40 hours each and were somewhat stressful. While the work wasn’t necessarily difficult, it was certainly time consuming as it took forever to get used to the tech. There is almost no documentation on the tools used for any of the 4 projects, so a lot of the learning is trial and error. Project 2 in particular had an autograder that seemed to be inconsistent and I had to get a regrade because of a 10 point difference between my local performance and how their system ran it the first time. \n\nProjects 3 and 4 are a lot simpler and take less time, but they are both somewhat tricky. Each of them I spent around 20-25 hours on where most of the time  I spent banging my head against the wall until I got my “aha” moment. \n\nTests: The midterm was pretty easy and could be studied for easily in a week. I made a crazy long cheat sheet that I ended up not using at all because the questions weren’t directly from the lecture content. As I write this I haven’t taken the final yet, but it looks to be similar. I will update if it isn’t.\n\nPresentation: You are also responsible for creating a research presentation which is super simple. You get points for responding to other presenters, which obviously isn’t difficult but it is easy to forget.\nThe TA team seemed to be good but I think they’re fairly limited in the questions they are able to answer about the projects. I had much better luck getting help in office hours than I did asking private questions in Piazza.\n\nOverall, I’d recommend this course if you have the time to do the projects and are interested in exploits against Modbus based systems or learning how they work in general. My biggest issue was that the learning was mostly in how to create and work with the systems rather than securing them or learning exploits against them, especially in the first two projects.  The work is not hard but does take a decent amount of time. I don’t know if I’d choose to take this if I wasn’t interested in cyber security, as the actual technology itself is limited in usefulness for most people, I’d imagine.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-a9261d70-ce7a-452b-b707-b9c3fb60a3f4",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 15,
                        "difficulty": 3,
                        "_createdAt": "2020-11-11T19:29:14Z",
                        "created": "2020-11-11T19:29:14Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-ea7e85a0-6d7f-4906-853b-b48407929cda",
                        "created": "2020-09-06T22:19:30Z",
                        "rating": 4,
                        "course": null,
                        "workload": 15,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-09-06T22:19:30Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "body": "Class was fairly easy. You learn how to use GDB and Factory I/O software. Some fill in the blank questionare type assignments informing you of how industrial hardware can be searched as easily as search for something on google. I recommend this class because it's easy, and we need more easy classes. ",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_id": "external-import-ea7e85a0-6d7f-4906-853b-b48407929cda",
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "body": "This class was great in introducing how physical systems are used and implemented.  I enjoyed learning about the grid and how insecure it was, and ways to better secure it.\nThe grading on a few of the projects was harsher as compared to the other projects so I suggest really paying attention to the requirements and following them.   Their autograder, which isn't released, was rough.\n\nA shout out to the TA's, they are doing all the work and the instructor was nowhere to be seen the entire time.  ",
                        "_id": "external-import-c66d9f00-794c-493e-afff-65890f79e0b6",
                        "difficulty": 3,
                        "id": "external-import-c66d9f00-794c-493e-afff-65890f79e0b6",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "workload": 15,
                        "_createdAt": "2020-08-24T13:56:42Z",
                        "_type": "review",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2020-08-24T13:56:42Z"
                    },
                    {
                        "created": "2020-08-15T23:14:57Z",
                        "_id": "external-import-6dbd5d07-a9a1-4593-a106-2e5a7014d61d",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "rating": 1,
                        "body": "This class feels like a waste of time. The first 2 projects are definitely time consuming, so plan on reserving time to complete them. They are the meat of the course. They are not hard, just very tedious. After the first 2 projects the rest of the class is smooth sailing. Projects 3 and 4 can be completed in a day with relative ease. The TA's are mostly helpful, but I would find that they would sometimes contradict each other in Piazza. There is also paper presentation that we also have to upload to Youtube. I am pretty sure they were very lenient with grading for it because I didn't even read the paper when making the presentation. The lectures are more boring than watching paint dry. Plan on bringing duct tape to keep yourself awake. Exams are easy because you can bring a notes sheet, so there is no point in studying or buying the textbook. Overall, this not a good graduate course. I would not recommend this course until the contents of it are restructured. I wish I had taken something else.",
                        "_type": "review",
                        "id": "external-import-6dbd5d07-a9a1-4593-a106-2e5a7014d61d",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 10,
                        "difficulty": 1,
                        "_createdAt": "2020-08-15T23:14:57Z"
                    },
                    {
                        "_id": "external-import-e4a99617-bab3-41f2-ba2e-43576ed88399",
                        "body": "I took this class as an easy filler. I was planning to take the summer off, but with the potential of limited summer activities with COVID i thought id slip in an easy class.  \nThis class is anything but easy. The lectures are short and sweet, but give boring a new meaning. \nYou have to write a paper, and if you happen to have limited access to a computer for the first few weeks of class, you will miss the sign up for your date.  \nThis means that you will have to pick an article, from basically nothing since they are all gone, and then read an article, and then do a youtube presentation and upload it. All in like a day since you signed up late.  \nOh i forgot to mention, this is also while you are spending the 120 hours on the first project, because its an insane amount of tedious work.  \nThen you get to start project 2. Which is another application, in a different ide/simulator. Which, guess what. Also take like 100 hours to do.  \nProject 3 is not as bad. However, this is like the only place in the class i got a bad grade. Be careful when doing this. It seems easy, but i feel like it is done to trick you.  \nProject 4... The omit important things to attempt to make you learn, but its just irritating. Then for the last part, they actually provide with you incorrect instructions, and the only way you know is if you attend office hours, or pay attention in slack.  \nAnd without these important things, this project took me 80 hours or so, until i got frustrated and started reading through slack, and then watched office hours.  \nThe exams are a joke. No need to study anything. Just good luck.  \nThis class is not per say hard, but it is really time consuming, and really frustrating.  \nAll that aside, the first two projects were fun and the class contained some interesting stuff you dont normally think about.  \nWould not recommend as a filler and/or an easy class.  Be aware.   \n  \nEdit: LOL at the people below me. this class consumed my life. \n",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 4,
                        "created": "2020-08-15T16:22:28Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "rating": 4,
                        "workload": 45,
                        "id": "external-import-e4a99617-bab3-41f2-ba2e-43576ed88399",
                        "_createdAt": "2020-08-15T16:22:28Z",
                        "_type": "review"
                    },
                    {
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 35,
                        "id": "external-import-8228ed6d-1926-4c9c-920d-eb45cf9f5045",
                        "difficulty": 4,
                        "_createdAt": "2020-08-04T15:08:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "rating": 1,
                        "created": "2020-08-04T15:08:43Z",
                        "_id": "external-import-8228ed6d-1926-4c9c-920d-eb45cf9f5045",
                        "body": "First, the good prior review (from the summer 2020 semester) doesn't seem legitimate and/or could potentially be a TA. This course has completely changed and is very strict now. For all projects, there are no partial credit points and it's a pass or fail model. They've done curves in the past and given additional points which are now not an option.\n\nThe lead TA runs the course (like most of the OMS courses), and even makes new rules as they go along. They actually stated they had little time in the summer, and attempted to change course policy to mark additional points off any assignment that you submitted (which was blocked by the actual professor...).\n\nThe exams were ok, but just had random questions that didn't have much meaning from the lectures. It's more of a guessing game to make a higher score. I did enjoy the actual content from the professor via the lectures, but sadly most of it wasn't really applicable to the projects.\n\nThe presentations were educational, and we made a short video over a topic of Cyber Physical Systems (which could nicely be done in a weekend...). You had to comment on other presentations as well and start somewhat of a mini discussion.\n\nThe first two projects were terrible. They are controls and PLC oriented, and will take you a minimum of 35-60 hours each (which is ridiculous for a 2 week span project). It is *impossible* to do it in a few hours as the prior review states. The last two projects are copied from other classes (CS-6250, the mininet project & CS-6262 buffer overflow) with modbus thrown in. The mininet project is the easiest, but the TA switched up how the project was setup and suggested using Docker which wouldn't work for many causing countless wasted hours.\n\nWhat's sad about the last two projects is that if you haven't taken the other classes it makes the projects much more challenging since the TA's really don't teach \"how\" to actually do the project. They also don't explain the concepts which are at the core of \"learning the material\". What's the point in the class if the knowledge of how to solve the problem is not taught?\n\nI would HIGHLY advise you to take pretty much any other class. I'm almost finished with the program and this has been the worst not in *content difficulty* (b/c the content understanding is trivial), but in dealing with poor documentation, *utmost restrict requirements on every single assignment, and the length of assignments.\n\n*Edit:  I would still not take the prior review seriously even if they *edited* their post to say they're not a TA. The review right before it, speaks to what I'm saying and I'm only stating facts here about the course. Of course there will be people that like and dislike a course, but the legitimacy of the review is mainly in question due to what it said (such as getting the initial labs done in a few hours, which is *impossible unless you're an expert in Factory IO and PLC programming using openPLC). \n"
                    },
                    {
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "body": "First class in OMSCS, and as a Controls Engineer of 8 years (BS in Computer Engineering), I wanted a good class to get me back in the swing of things as far as combining work and school. This class was fairly easy and flexible, though you have to take your background into account when judging for yourself. \n\nProject 1 was fun, though edge cases for some of the Robotic challenges were a bit irritating. This project took me the most time. For learning the basics of Control Systems, I thought the workload for this project was overkill with the quantity of processes and details. Additionally, when selecting between Control System \"languages\", I felt that projects 1 and 2 should have been swapped. The sequential/timing logic of project 1 was better suited for ladder, and vice versa. Due to logical execution order and a few other concepts, using the function block of FactoryIO felt clunky for this application.\n\nProject 2 had some interesting content, but the simulation environment is bad. However, coming from the Controls realm, I know that there aren't many good options for simulating ladder logic. If you get the hang of the software quickly, this CAN be quicker than the first project. I feel the biggest \"gotcha\" for others was not understanding how the PLC scans through the program and constantly updates the same registers. (AKA, if a coil is evaluated as TRUE, it can still be re-evaluated back to FALSE further down in the program. Basically, it's not like an \"if statement\". It WILL turn off the coil if it's evaluated as FALSE.\n\nProject 3 was a Wireshark project, and the easiest by far. \n\nProject 4 involved buffer overflow via a low-level Controls communications protocol called MODBUS, and really consisted of 2-3 \"a-ha!\" moments that gets you through to the end. \n\nThe Midterm and Final were straight from the lectures, though there were a few questions that felt a bit too \"gotcha\". If you watch the lectures and pay attention/take basic notes, I feel it's fairly easy to get an A or B. The paper presentation I put together in one weekend, and got an A on it.\n\nFinal grade was an A+ for a low-ish average workload that really was better characterized by weeks of nothing and some weeks of large spikes.",
                        "rating": 4,
                        "created": "2020-05-14T19:34:28Z",
                        "_type": "review",
                        "_id": "external-import-ea15d823-8094-4c77-8e72-5befffd71d96",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-14T19:34:28Z",
                        "id": "external-import-ea15d823-8094-4c77-8e72-5befffd71d96",
                        "workload": 6,
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 12,
                        "difficulty": 2,
                        "rating": 5,
                        "created": "2020-05-08T15:44:31Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "_type": "review",
                        "_createdAt": "2020-05-08T15:44:31Z",
                        "_id": "external-import-0aa21c7c-9dc8-43aa-8df7-83697298dd5d",
                        "body": "I took this course Spring 2020.  I am not a developer or programmer and was able to get through the course without much of a problem.  I ended up with an A overall.  I spent a lot of time on the first 2 projects.  I lost a few points for not following clear instructions in the write up that would have been trivial to get.  I think some of the requirements were added just to make sure you read the instructions carefully.\n\nThe TAs were very helpful and I would recommend attending office hours if you're having troubles with the projects.",
                        "id": "external-import-0aa21c7c-9dc8-43aa-8df7-83697298dd5d",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 10,
                        "_id": "external-import-50beafde-03ee-4d1a-9bbf-4a9648bd8301",
                        "created": "2020-05-04T19:26:27Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "As an EE/Controls Engineer, I was very interested in this class.  The projects (called Mini-Projects) are released in plenty of time and the VM's provided worked well for me, but others in the class had issues.  All in all, I thought the class was well managed and the TA's were very responsive.  Excellent texts were assigned to compliment the lectures and if you studied the lectures and did the readings, the exams were not difficult.  I would highly recommend this course, especially if you work at all in Industrial Controls.  ",
                        "_createdAt": "2020-05-04T19:26:27Z",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "id": "external-import-50beafde-03ee-4d1a-9bbf-4a9648bd8301"
                    },
                    {
                        "_createdAt": "2020-05-04T15:27:06Z",
                        "rating": 5,
                        "course": null,
                        "_id": "external-import-55d162b8-3798-448d-a22e-6ce593ca8923",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-55d162b8-3798-448d-a22e-6ce593ca8923",
                        "created": "2020-05-04T15:27:06Z",
                        "_type": "review",
                        "workload": 12,
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "body": "This was my second class in the OMSCS program, and I learned a lot of practical skills in this class. I felt the goal of the course was to get students familiar with PLCs and the tools used to program/configure them. There are 4 projects that aim to teach things like how to program PLCs, understanding and exploiting the Modbus protocol, and using openly available tools to locate vulnerable devices on the Internet. Some feel the class was a bit light as it relates to the security of embedded systems, but I believe the skills taught in this course give me a deeper understanding of how to defend against attackers in this domain (as the course title says, it is an 'intro' to these topics). \n\nThe class format worked well for me, and I didn't feel it was too much work. I even bombed the second project (family vacations in the middle of a project isn't a great idea), but I was still able to catch up and make a B. The teaching assistants were constantly on top of things in this class and did a very good job in facilitating all aspects. I highly recommend this course.",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "workload": 4,
                        "body": "Other reviews have good descriptions of projects. The first 2 projects are quite different from other programming assignments. More like logic gate thinking than normal code. After some initial struggles to understand how to translate loop and conditional programming logic into this hardware world, things went pretty smoothly. No auto grading, so not as easy to know if they did everything correctly, but most of it can be checked yourself to be pretty confident. \n\nThe paper presentation (20-27minutes) is not difficult and as long as you follow instructions seems like an straightforward 100%.\n\nThe exams were straight from the 6.5 hours of lecture videos. The readings may reinforce those, but I did not read of the books. Each exam was 20 question multiple choice. One page of hand written cheat sheet was allowed. The questions were not tricky, but some were fairly specific to remember. I did well on exams, but with each question being worth 5 points it is easy to miss just a few and not get a great grade. Final is cumulative, but any material from first half of class felt more like just knowing the high level concept rather than specifics like on first exam. \n\nOverall a pretty straightforward class without a ton of work. The lectures in the first half of class were pretty good. The second half drug a little bit, but with only 6.5 hours total it wasn’t a big deal. ",
                        "id": "external-import-55bb0a0a-e195-45dd-bcb0-1a89abc6d9e1",
                        "created": "2020-05-03T12:17:36Z",
                        "_createdAt": "2020-05-03T12:17:36Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_id": "external-import-55bb0a0a-e195-45dd-bcb0-1a89abc6d9e1",
                        "difficulty": 2,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "created": "2020-05-03T07:54:57Z",
                        "rating": 4,
                        "workload": 12,
                        "_id": "external-import-8d1ddbef-3799-42ab-a8de-75261cf08b2e",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_createdAt": "2020-05-03T07:54:57Z",
                        "course": null,
                        "id": "external-import-8d1ddbef-3799-42ab-a8de-75261cf08b2e",
                        "body": "This was a class I required for Computing Systems and I have mixed feelings about though mostly in the end I'd say positive. It has lot of potential but I think a bit of organization (technical organization cause TAs are great but requirements are never set in stone and can change so keep an eye on piazza) will help make it more popular. It has 4 projects (20/20/10/10):\n1. Factory I/O software is required. This is basically you engineering logic gates to create a program. Its easy but time consuming. One requirement is that the software is only for Windows and requires a decent iGPU at the very least so make sure you have that sorted. 40 hours maybe over two weeks.\n2. Similar to project 1 but the software is OpenPLC. Here the simulation is digital instead of graphical. The VM is terrible. I think the TAs need to spend a bit more time on making the VM since its a deprecated and yet recent Ubuntu version 18.10 or something. Easy like Project 1 but maybe 20-25 hrs instead.\n3. This is a coding project but very little coding involved. If you took CN youll know exactly the tools in the class and it will take you 1 hour at best once your tools are setup which is also like 1 hour at best if you know what you are doing. I dont think I spent more than 2 hours on this project.\n4. This was hardest. IIS Project 1 will help to know what you need to do, but this project is different. Unlike what other reviews say, this is not harder than IIS, its just that the documentation online for the type of attack is little to no and so it takes time to figure out what you need to do.\n\nPresentation grading (10) is very lenient. I did terrible in it in my opinion especially with the recording and still got full grade.\n\nExams (2x15) are kind of tricky. You need to do well in exams otherwise you cannot get an A. However, if you study well, then 90% in them should be easy.\n\nAn extra credit of 9% was awarded where you had to give some feedback on things like software and auto-grading. I didn't need it for an A but did it anyway. I didn't do well in it (2/9) even though I thought I had spent enough time on it. So don't depend on it. Make sure you do everything else well.\n\nOverall I learned few things about CPSs that I had no idea about so for me it was informative. I think this is low workload class if you can put enough time in first 2 projects. But overall it was okay.",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester"
                        },
                        "difficulty": 2,
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 5,
                        "body": "To preface my review, this is my first class. I've been in the software industry for 10+ years. I have a BS and MS in Computer/Electrical engineering and have a slight background in security through web development. I'm doing this degree for fun. I didn't learn very much security related in this class. The first project was hard as balls. Since I have a degree in EE, I eventually realized I could finish the projects using state machine. The professor mentions state machine briefly in the lectures. Of course, I didn't watch the lectures till the week of mid-terms. But regardless, you would need to be able to create complex state machines to do the projects successfully, and easily. The 3rd project was meh, but the 4th actually had some security related components. \n\nI spent most of my course time on the first 2 projects...probably 40+ hours each. I received 90%+ on everything, and a 75 on the final. Since I'm doing this degree 'for fun', I just wanted a B or higher. Once I practically solidified my B, even if I got a 0 on the final (assuming a high project grade)...I decided not to study for the final. Still got a 75 just be thinking through each question (average was 83) and ended up w/ an A in the class.\n\nThe lectures were mostly the professor reading from the book. If you watch the lectures, then read the book, you'll be reading it in his voice. I can't comment on the lectures after the mid-term...didn't watch them. \n\nI wish the first 2 projects weren't so time consuming (they weren't difficult, just time consuming) and/or was more related to security. The only thing 'security' related was to put a \"logic bomb\" in your complex state machine...which is a piece of cake if you actually got the project working.\n\nIf you're worried about getting a good grade...focus on the items that weighed the most (projects...). Start early, and attend office hours if you're not confident. I never attended office hours, but did watch recorded videos if I got stuck. So thanks to those who attended and asked questions!\n\nThe TAs were helpful all and all in office hours and the forums. ",
                        "id": "external-import-c0522ab5-a9d4-4f26-9039-b8f807488aa9",
                        "course": null,
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "_id": "external-import-c0522ab5-a9d4-4f26-9039-b8f807488aa9",
                        "_createdAt": "2020-05-02T19:05:21Z",
                        "created": "2020-05-02T19:05:21Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "rating": 3
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "I really enjoyed this course and found the projects interesting. The first project took sometime to finish but it was OK. The projects write ups are clear and the TAs are very helpful.  \nThe lectures and the book go hand by hand. They have a huge focus on industrial protocols, so not much of a CS course in my opinion. \nThis course has two exams and they really just test your understanding of the subject. If you watch the lectures and read the required chapters, you will pass them easily. \nThe professor and the TAs were generous and gave extra credit assignments that add up to 9% to the total grade. This is too much in my opinion.    ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2020-05-02T18:55:39Z",
                        "rating": 5,
                        "_id": "external-import-3ea28f7a-e4bc-49fa-bf60-075db5d53f8c",
                        "difficulty": 2,
                        "course": null,
                        "workload": 4,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-02T18:55:39Z",
                        "id": "external-import-3ea28f7a-e4bc-49fa-bf60-075db5d53f8c"
                    },
                    {
                        "rating": 2,
                        "workload": 4,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "_id": "external-import-dd538c87-b754-41bc-a28e-5f445d91bb72",
                        "body": "I track my time pretty closely. The whole class took 70hrs and 37 minutes. So that's just under 4 and a half hours a week. But importantly that's not evenly distributed over the whole semester. There are 4 projects for the class. I spent almost all of my time in the week before a project was due. Otherwise I was able to completly ignore the class for weeks at a time. So most weeks were zero hours, and then crunch time before the project due date.\n\n \n\nThe lectures were super boring. The readings were so bad I just skipped them entirely. But the 4 projects were actually a lot of fun.",
                        "id": "external-import-dd538c87-b754-41bc-a28e-5f445d91bb72",
                        "created": "2020-05-02T18:17:00Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 2,
                        "_createdAt": "2020-05-02T18:17:00Z"
                    },
                    {
                        "difficulty": 4,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 5,
                        "course": null,
                        "created": "2020-04-27T19:17:15Z",
                        "body": "This class is front loaded for sure. \n\nThe first project is really hard and time consuming. I spent over 60-80 hours on it. It was really painful. I was certain I was going to drop the class. It just didn't click for like ever. The first project was the nightmare one. It uses functional block diagrams on a quite iffy system.\n\nIt is different. Its challenging. If you complete it, you'll feel amazing and be like 'oh wow, look at how cool this is that I made!' If you don't, you have a good chance at being one of the many who dropped after that. \nTake this advice: Don't brute force your way through it. Take the time to understand all the different function blocks and then map out the process, draw it if you need to, but write it out and take your time. I tried brute forcing for way to long and it caused a lot of anger and depression on my end. If you can get by that assignment and do fairly well, the rest of the class should be smooth sailing. The 2nd assignment uses ladder logic, but if you successfully completed the first assignment, the 2nd should be a natural extension. Project 3 and 4 were much smaller and more manageable.\n\nI had no background in security, networks, etc. so this class had a huge learning curve for me. I thought it was amazing though. I thought the material was well presented, the books are good and the TAs are amazing (p.s. don't be afraid of office hours.) If you are struggling that is what they are for. Don't let pride stand in the way :)\n\nThe midterms and finals (i haven't gotten my final grade yet) are medium difficulty. If you watch the lectures, read and think about the material you've learned, you should be able to do ok on them. \n\n",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-04-27T19:17:15Z",
                        "_type": "review",
                        "workload": 20,
                        "_id": "external-import-e0ecfb61-6c98-466f-bf54-eeb1c206b5e2",
                        "id": "external-import-e0ecfb61-6c98-466f-bf54-eeb1c206b5e2"
                    },
                    {
                        "_type": "review",
                        "workload": 14,
                        "_id": "external-import-47e703ea-9216-41b9-8fd8-58e8e578581d",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 1,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "_createdAt": "2020-04-26T18:22:06Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "This was one of the worse course, It was quite unstructured and the Projects were nightmare , TAs try to help but the underline software was so buggy that lot of time you dont figure out if its your fault or the underlined software's. In addition to it, they have increased the complexity of mini project 1 which was using Factory IO . The underline software use block and uses physics engine which require high end computer and a paid software ( though you can get 30 days free trial ) . The mini project 2 uses OPENPLC , a non documented software ( good luck finding documentation on how to use it) , But TAs are really helpful. Last two projects are fun but its really dry content. In the last project we need to do buffer overflow . But TA/ Question doesn't make anything clear about deliverable. Last Professor is never available on Office hours ( which is understandable) . \n\nPS: As I mentioned about mini project 1 , TA even do not have auto grader so results are really late and can have lot of bug , make sure you ask for regrade .",
                        "id": "external-import-47e703ea-9216-41b9-8fd8-58e8e578581d",
                        "created": "2020-04-26T18:22:06Z",
                        "difficulty": 4,
                        "course": null
                    },
                    {
                        "created": "2020-01-06T23:09:09Z",
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "body": "The exams were pretty easy. If you watched the video lectures you learned most of the necessary material and if you actually read through the books and Piazza you should be good to go.\n\nThe presentation was pretty straightforward to put together and the grading seemed to be pretty light as long as you followed directions.\n\nThe content was interesting and fun.\n\nThe first few projects had you spending most of your time setting up a buggy environment with software that was poorly documented doing things that were never explained in class. I learned some stuff, sure. But it was not much that I cared about, nor was it a very realistic or effective way to learn.\n\nThe later projects were more fun and useful, but had many of the same problems.\n\nLuckily the TAs and the classmates were pretty active on the forums.\n\nI never went to office hours but they happened regularly.\n\nI got an A in the course and would recommend this as an easier/fun elective if you need one.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_id": "external-import-d6d9f768-ee51-42c9-b0af-9b6dd27cfde5",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-d6d9f768-ee51-42c9-b0af-9b6dd27cfde5",
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "_createdAt": "2020-01-06T23:09:09Z",
                        "workload": 10
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "body": "Overall I enjoyed this class. It's one of those dual purpose classes (It counts for CS as well as ECE I believe) so its not exactly your normal \"programming\" course but it was still fun. The projects were still logic based so if you have a background in CS you will be fine but your not going to compile code or anything.  The tests were very straightforward and as long as you watched the lectures they were really easy. The projects were a bit of a learning curve for me but they end up being fun and I was happy once I completed it.",
                        "difficulty": 3,
                        "_type": "review",
                        "id": "external-import-0d75f620-c82d-47a0-980b-e0999e518532",
                        "created": "2019-12-21T20:39:22Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "_createdAt": "2019-12-21T20:39:22Z",
                        "workload": 7,
                        "course": null,
                        "_id": "external-import-0d75f620-c82d-47a0-980b-e0999e518532",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "created": "2019-12-16T04:25:16Z",
                        "_type": "review",
                        "_id": "external-import-b3142e89-82af-450a-b71a-de8911b8d2a1",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "This was my third course in this program and i strongly disliked the course. The worst part about the course is that the schedule offers no flexibility to the students. Each mini project is released only 2 weeks prior to the deadline and each mini project involves a lot of overhead. There is minimal to almost no discussion about the software tools or platforms in the lectures and you are left all by yourself to search for relevant videos and figure out on my own. The grading is very unfair specially for mini project 2 because the software platform provided has a lot of bugs and auto-grader will give 0 if the output is delayed even by 100 ms. Overall I felt the course lacked the flexibility and enthusiasm i have seen in all the other courses i have taken so far.",
                        "_createdAt": "2019-12-16T04:25:16Z",
                        "id": "external-import-b3142e89-82af-450a-b71a-de8911b8d2a1",
                        "rating": 1,
                        "difficulty": 3,
                        "course": null,
                        "workload": 8,
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        }
                    },
                    {
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 5,
                        "id": "external-import-17bb7a7c-82e7-446f-ae0a-fde4e5bb5e59",
                        "created": "2019-12-11T16:48:52Z",
                        "body": "Not a very difficult course, but one that I definitely learned something from. \nExpect the projects to have very little to do with the material learned. Overall, the class is fair and not too challenging. If you are a good self-teacher, you should be able to do well and learn a thing or two along the way.",
                        "_createdAt": "2019-12-11T16:48:52Z",
                        "course": null,
                        "_id": "external-import-17bb7a7c-82e7-446f-ae0a-fde4e5bb5e59",
                        "difficulty": 2,
                        "rating": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "rating": 4,
                        "created": "2019-12-06T04:35:20Z",
                        "difficulty": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "_id": "external-import-ee14cae6-adf0-4a7f-bbc3-33223d2716a8",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "id": "external-import-ee14cae6-adf0-4a7f-bbc3-33223d2716a8",
                        "body": "I thought this class was interesting. The first 2 projects are pretty cool. You can make an automatic conveyer belt system. The last 2 projects are boring. \n\nThis class should not be rated on average taking 8 hours a week, I spent far more than that. Some of these projects took me 40 hours each. The exams are also pretty broad. \n\nThe presentation will suck some time out of you as well. \n\nOverall, I liked the class.",
                        "_createdAt": "2019-12-06T04:35:20Z",
                        "course": null,
                        "workload": 15,
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "body": "CPS is a strange class, and I'm not sure how well I can recommend it, but I'm glad I did it. (However, I did it with a group of almost a dozen friends, which makes a lot of difference). I did this course for the OMSCS; there are also OCY students in this course.\n\n_Topic:_ I really appreciated the topic, and it's a good counterpoint to normal cybersecurity thinking. When availability matters more than confidentiality, ideas like \"fail-safe defaults\" take on a different meaning. Super valuable to think about the different challenges that they face. It's also a cross-discipline topic, so you have CS folks as well as electrical engineers and government regulators in the field too.\n\n_Lectures and readings:_ The lectures were mostly super short, they were ok. You can see them on Udacity. However, they were almost word-for-word from the textbook, which was really dry. I don't think it was worth it to buy the textbook, and I ended up not reading it after the midterm, once I knew how the tests worked.\n\n_Tests:_ a midterm and a *cumulative final.* But, you get a cheat sheet for each - one page for the midterm, two pages for the final. Neither were bad. 20 multiple choice questions each.\n\n_Assignments:_ 4 projects. Proj 1 must be done on a Windows machine and uses software that simulates a factory floor - it's a lot like a video game - so hopefully you have a reasonably good graphic card or this project will be painful. Proj 2 is in a VM, and had the most headaches associated with it - it was not set up in a way to make it easy to test whether you had done it right, although the autograder would measure to the .0001s. Proj 3 was relatively easy (it used mininet). Proj 4 was interesting, but it overlapped with IIS Proj 1. You also have to pick a paper and do a ~15-20 minute YouTube presentation on it.  \n\n_TAs and Instructor:_ the instructor showed up on Piazza once or twice. The TAs held individual, unrecorded office hours. We felt like the TAs were very disorganized and not on the same page with each other. There were two TAs (and one of them was very active and vocal) that gave instructions in multiple instances that were later shown to be flat-out wrong and directly contradicted by the head TA. The head TA did a great job, but it was too much for him to keep track of everything. There were issues with each project release - each project had to have some instruction revised (exacerbated by TAs giving wrong information), and there was a lot of general confusion due to this - especially since sometimes the instructions changed halfway through the project window timeframe and we were threatened with zeros if we did not perfectly comply.\n\nThere was also a huge problem with Proj 2 where the autograder was set up incorrectly. The TAs pushed to release the project early, but there were a lot of problems with the instructions and it had to be revised. This was made worse by some of the TAs giving purposefully vague and unhelpful answers, despite the project requirements expecting us to have an exact and nuanced understanding of the sequence of events in the project description. The TAs then pushed to get grades back to the students before the withdrawal deadline, but because the autograder was set up incorrectly, the class scored very low (many people scoring zeros with grading comments that made no sense). In the end, they had to do a massive regrade (the professor gave everyone an extra 10% to help make up for this), but by this point, people had withdrawn from the course because they were worried about how low their initial grades were.\n\nAll that said, the projects weren't too hard, but there were lots of annoying little details that had to be met exactly right. For CS folks, it can be a hurdle to work with ladder-logic - it's logical but very different from normal programming.\n\n_Schedule and class flow:_ This was a pretty lightweight course. Even over summer, there were two or three times where I basically ignored the class for about a week at a time, and my friends did the same.\n\n_EC and curve:_ Grades were curved just a little bit. I want to say there was like 10% of the overall course grade available in EC. I didn't attempt it, so I'm not sure how difficult that would have been.\n\n*_TL; DR_* - It's ok, pretty easy, some interesting things to learn and do in the projects, but be cautious, there's a reason old reviews have said this course has issues with how it's run.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "course": null,
                        "workload": 8,
                        "_id": "external-import-69b2b0a9-0b1f-484c-a9e4-cecb89232f10",
                        "_type": "review",
                        "id": "external-import-69b2b0a9-0b1f-484c-a9e4-cecb89232f10",
                        "created": "2019-08-29T16:02:37Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 3,
                        "_createdAt": "2019-08-29T16:02:37Z",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI"
                        }
                    },
                    {
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        },
                        "body": "This course was very interesting. \nThe projects were interactive and logical. \nI found the projects to be practical and informative. Completed projects with less investment in time.\nWould recommend to take this course along with any other course with more workload. If you have already taken CS 6035, this would be an easy walk for the last project.\nFeel light and knowledgeable.",
                        "_createdAt": "2019-08-12T17:51:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "difficulty": 2,
                        "_type": "review",
                        "_id": "external-import-7f4a2b19-ef84-4d94-a626-c2e3983f4e96",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 6,
                        "id": "external-import-7f4a2b19-ef84-4d94-a626-c2e3983f4e96",
                        "created": "2019-08-12T17:51:18Z"
                    },
                    {
                        "id": "external-import-667ae1d9-617d-4ce7-ba26-6245b8ec5514",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "Some good, some bad, some things different.\n\nPros: projects were generally interesting and different than most typical OMSCS projects. I loved making little robot boxes run through a factory floor, and then have a little robot arm start tossing them around. Some of them are finicky (ladder logic), but it's an interesting experience. \n\nThe stability of the assignments was fine -- the changes were minor and when there was a autograder messup it was corrected and we got a couple bonus points.\n\nCons: Tests are multiple choice with ambiguous questions that test your ability to parse meanings like the instructor more than having actually covered the materials. And the video lectures are virtually straight from the book, organized like a giant outline. Could be a pro in that you're not missing anything I guess, but gets very tedious.\n\nStill, it's scary fun to learn about these vulnerable systems and it was overall a capably-run course.",
                        "workload": 6,
                        "_id": "external-import-667ae1d9-617d-4ce7-ba26-6245b8ec5514",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "created": "2019-08-08T00:41:56Z",
                        "difficulty": 3,
                        "_createdAt": "2019-08-08T00:41:56Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4
                    },
                    {
                        "_createdAt": "2019-08-05T12:36:12Z",
                        "_type": "review",
                        "created": "2019-08-05T12:36:12Z",
                        "difficulty": 2,
                        "_id": "external-import-51ad15f4-93ec-4c07-aede-2c8598e6062a",
                        "body": "The material was somewhat interesting, but the delivery was not the best.\n\nExams were pretty easy but I don't think it tested the material too great. Some questions had 3 out of 4 possible answer evidently wrong so it made getting a good grade on those straightforward.\n\nProject 1 was interesting, it simulated a factory floor using factoryio. It was more like playing a videog ame than anything. Project 2 was Ladder Logic. It was interesting, however the tools that they used were very unreliable. I worked on the last 2 our of 5 parts without being able to test it since my VM blew up. It happened throughout the whole project. Project 3 was very basic and used mininet and wireshark. Project 4 was a buffer overflow vulnerability exploit similar to IIS's project 1.\n\nYou are also required to do a presentation, this was interesting and oddly enough enjoyable. This being said, the TAs say that you can use any paper pertaining to CPS and even outside the weekly assigned topic, This is untrue, I had papers rejected because of them being outside the weekly topic.\n\nThe TAs were not the best, the grading had errors. On Project 2 the auto grader messed up and everyone's grade was affected, funny that none of the TAs thought that it was odd that the highest grade would be a ~80. They re graded and lo and behold people did get 100 on them.\n\nMy Project 3 was graded erroneous, i had to ask for a regrade to get back 10 points, which turns out it was yet another TA mistake that affected a number of students.\n\nThe TAs were often contradicting themselves when providing clarifications, you would have one say something then another one say something completely opposite a few posts down in the same thread.\n\nLastly, don't bother being the 1st to try out projects, there's been bugs and writeup errors with each and every one of them. The submission naming requirements would often change, and if you submitted early and never checked Piazza you could have lost up to 20% of your grade.\n\nAdvice for the TAs: Try giving the students Vagrant files, and deliver the project code via Git, it might simplify some of the issues and updates to projects.\n\nOverall I would not recommend this class as it is now, I think that with some effort it could be a great class.\n\n\nP.S.: In case you are wondering, I did get a comfortable A.\n\nP.P.S:  Considerable Extra credit was offered which was awesome to see, although i did not attempt it. It looked interesting though.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 3,
                        "id": "external-import-51ad15f4-93ec-4c07-aede-2c8598e6062a",
                        "course": null,
                        "workload": 6
                    },
                    {
                        "_createdAt": "2019-08-01T20:37:02Z",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-6e11ff85-cebb-4f4c-821a-794037e39072",
                        "created": "2019-08-01T20:37:02Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 3,
                        "workload": 3,
                        "_type": "review",
                        "_id": "external-import-6e11ff85-cebb-4f4c-821a-794037e39072",
                        "body": "Lectures are pretty boring, but are only really needed for exam questions. Professor is very monotone and reads things to you.\n\nI didn't interact with any TAs, but they often seem to not be on the same page. At least one of the TAs only gives short vague answers to questions on Piazza, which can be frustrating.\n\nI despise presentations, and there is a requirement to do a ~25 minute research presentation in this course. A lot of the good papers get taken up very early on in the semester. Don't be like me and have to find your own paper that was out of date because anything good was already taken. You also get to choose your due date, which I wasn't a huge fan of since you have to squeeze it in between other projects (but I was just going to wait until the last minute either way, right?). \n\nMini projects are easier if you have taken CN and IIS. \n\nProject 1 was a lot of fun, very interesting and straightforward. \n\nProject 2 was one of the most frustrating projects I have had to do in my 8 classes so far. The open source tools were very buggy and frustrating to work with. Project 2 also had major issues with the auto-grader, so most people had incorrect grades at the withdraw deadline.\n\nProject 3 was fairly easy, especially having taken CN. \n\nProject 4 was pretty frustrating, but it's one of those where it could take you an hour or 10 hours, depending on when it clicks in your mind. IIS knowledge helped, but the project was just enough different to not make it very straightforward what the solution was. Report aspect to this project seemed pointless (but I generally hate report projects in CS).\n\nPretty easy course when compared to most others. I went a couple weeks at a time between projects without doing anything, even in the summer course. I would recommend this course if you are looking for an easy course to get some credits or if you are genuinely interested in CPS."
                    },
                    {
                        "body": "<h4>Main Review</h4>\n<p>Overall the class is decent, has good amount of information. I wasn't prepared to take the class at all. I thought it would be an easy class to take in the summer, plus I personal didn't hear of Security regarding Physical System, so I went in with zero knowledge and some Network Security knowledge. If you are like me, be prepared to put in a lot of effort. </p>\n\n<p>The TA's are very good, compared to the previous classes I took. Lecture are very clear and informational. One draw back is that sometimes on Piazza they are very slow to reply back or don't reply back at all if you ask a dumb question. On another note: Lots of auto grader issues on the 2nd project :/</p>\n\n<h5>Projects</h5>\n<p>Projects were interesting, I would rate them between medium-hard level, most of them are very buggy. I wish I started a bit earlier just for the set-up. I would recommend looking into PLC, Python, memory stacks and registers. </p>\n<ul>\n<li>Project 1 (20%) - super fun and relatively easy</li>\n<li>Project 2 (20%) - super fun as well, but hard and very buggy. I recommend starting on the project early, people dropped out after this project :/</li>\n<li>Project 3 and 4 (10%-10%)- rather on the harder side for me because I had little knoweledge of how stacks, wireshark, Modbus worked. I lucked out because I started on these projects early</li>\n<li>Presentation (10%) - I enjoyed this one a lot. I got to choose a good paper to present on. This one is easy, just try to not mess up on this one</li>\n</ul>\n\n<h5>Exams</h5>\n<p>Midterm - 15%, Final- 15%. Exams are reasonable, some questions were tricky but exams were well made. The lectures mirror the books, but I highly recommend reading the books, they are awesome.</p>\n\n<h5>Note</h5>\n<p>Extra Credit was offered this semester.  One was hard and other one was easy.</p>",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-f586ce40-a594-4ee0-89d4-5e908844de94",
                        "created": "2019-08-01T15:00:21Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 12,
                        "_id": "external-import-f586ce40-a594-4ee0-89d4-5e908844de94",
                        "difficulty": 4,
                        "rating": 4,
                        "_createdAt": "2019-08-01T15:00:21Z"
                    },
                    {
                        "course": null,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester"
                        },
                        "body": "It was a really fun class. There were some issues with small annoying misunderstandings in how to take the exam and how to submit your projects.\nAlso some of the projects were supposed to run on VirtualBox images of Windows machines. That setup was extremely slow for me on a powerful 2015 Mac. I ended up using a native Windows machine which I got from a friend. If I had no access to this machine, I would have not been able to finish at least two out of four projects. This scared me at the moment I realized this.\nThe material was nice and I actually learned a lot.",
                        "_createdAt": "2019-07-31T22:25:22Z",
                        "workload": 18,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-3fe24549-c452-4966-9ea1-1f76bb227cf9",
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-3fe24549-c452-4966-9ea1-1f76bb227cf9",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-07-31T22:25:22Z",
                        "difficulty": 4
                    },
                    {
                        "_type": "review",
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_id": "external-import-39e067a8-59e2-4972-94e1-fce19b34358d",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-39e067a8-59e2-4972-94e1-fce19b34358d",
                        "body": "To put things in perspective, I work in robotics and haven't taken ISS/NS. Working in that field, I'm already quite familiar with some of the background concepts explained like controllers, industrial protocols, PLCs and so on. On the other hand, since I haven't taken any other of the security classes, almost everything I learnt here in that regard was new, so there was no overlap for me as other folks explained. After all, this course gave me some security fundamentals that have a more direct application in my field that the one I would have got in other security classes.\n\n**Course organization**\n\n* Projects (60%)\n *  Project 1: Industrial programming using a delightful framework (FactoryIO). Believe me, is great, specially when compared to Project 2 environment.\n *  Project 2: Ladder logic under OpenPLC. I enjoyed it since I have always been curious about that programming language, but the write-up and virtual machine provided should be reviewed from scratch.\n * Project 3: The easiest. Study some network traffic and implement a simple attack on Modbus.\n * Project 4: Buffer stack overflow under Modbus. Quite tricky, requiring lots of trial-and-error and and some \"a-ha moments\". Folks who had already taken ISS said it was more difficult that the same project in that course.\n\n* Exams (15% + 15%). Based directly in the lectures. Regarding them, they are short, engaging and informative for the first 2/3. The rest is quite boring, specially the chapter focused on industrial protocols.\n\n* Paper presentation (10%): Choose a research paper from a list (or propose one related with the class topics) and create a video-presentation of around 25'. For earning some participation points, watching the presentation of other students and making meaningful questions was required. This was an interesting way of learning about last trends in the field.\n\nThings to improve:\n* Consistent instructions between project submissions.\n* Project 2, in general. The VM provided was not updated and worked really slow. In order to complete the assignment, we had to download a newer version of one of the programs included in the VM, what created some confusion among the students.\n* My English is not great as you can see and even with that I could detect several mistakes in the assignment instructions.\n\nIn conclusion, a different but great summer class. Fun and easy, I would recommend it to everybody pursuing the CP&R specialization. I think it could go well to pair with a more demanding course in Fall/Spring.",
                        "difficulty": 2,
                        "_createdAt": "2019-07-31T14:42:43Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "created": "2019-07-31T14:42:43Z",
                        "workload": 10
                    },
                    {
                        "id": "external-import-9c65e2b3-e388-4fcf-8c26-2fa13f05a02a",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "body": "<h3>Sneaky Challenging</h3>\n\nThis class was full of new information for me.  As a java software developer, I never experienced PLC programming or ladder logic.  \n\nThe **first project** was straight forward, block programming in a program called factory io.  Once you get the hang of it, assignment was pretty easy to complete.  The **second project** was most difficult and took the most time.  The TA's generously gave us an extension, which I needed.  I am still not sure how my timers did not pass the autograder, but with extra credit, it wasn't worth the regrade request.  The **midterm** was very straightforward from the video lectures.  **Project 3** was using mininet, python and wireshark, similar difficulty to the first project.  **Project 4** dealt with a buffer overflow and was challenging for me, as I had no experience with gdp and assembler.  \n\n**Overall**, I loved the information presented in the class and the projects were unique and challenging.  We were given two weeks to work on each project and one week to study for exams.  I felt like it was enough time.  I would usually wait 4-5 days after the project was released to start working on it, as sometimes the requirements changed midstream.  Usually others worked out the kinks in that timeframe, but I also lost valuable time when it came to project 2.  I felt like the VMs could have been set up a little better.  We had to go through the rigmarole of installing a gui and guest additions and updating software before working on the projects.  The TA's work very hard to make it right.  One scare in the semester when they released project 2 grades where the autograder failed to work correctly.  It sent the class into a panic generating regrade requests, when in fact, it was something on their end.  Professor ended up giving everyone extra credit, but I feel like it should have been caught before grades were posted.  This is a grad class where most people get As or Bs, class average was in the 70s...  in software development we called that a bad smell.  \n\n**To be successful in this class**, watch the lectures for the exams and do some research on the project topics before jumping in.  There are not a lot of resources out there, as you will learn that is why there is a need for this class.  Start the projects early and keep trying.  TAs are helpful and don't be afraid to ask questions, as a lot of this will be a new way of programming and thinking for many students.",
                        "difficulty": 4,
                        "created": "2019-07-31T14:26:27Z",
                        "workload": 14,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_id": "external-import-9c65e2b3-e388-4fcf-8c26-2fa13f05a02a",
                        "_createdAt": "2019-07-31T14:26:27Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "_createdAt": "2019-07-30T22:52:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-b87eabfd-08ed-4d52-b767-00a2517f169c",
                        "rating": 2,
                        "course": null,
                        "body": "As my fifth class in the OMSCS, this was my least favorite. The projects felt very unorganized and the VMs could be improved so they are project ready instead of having students get the VM working then start the project. Requirements changed and regrades were frequent and abundant. It felt as though the projects had not been properly tested. Some changes were being made to the projects and I can appreciate the work that is going into fixing them but at this point they still require a lot of work. In previous classes, I've had TAs post a short youtube video explaining the project and covering setup which I believe would benefit this class. Course is heavy on extra credit which I would guess became a requirement for many students that may have struggled on some of the 4 original projects. The course by itself isn't a heavy course load with just 4 projects but factor in the extra work you'll most likely end up doing for the extra credit and its a bit of a load for the summer semester. Tests were  20 questions multiple choice and fair for the most part. I mostly use piazza for communication and TAs were a bit slower to respond than other classes and a few questions went unanswered. I wish that there were more/better office hour times. There was one late Monday night and one session held in the middle of the workday (not very helpful when you're trying to complete a project due Sunday night and you have a question). The OMSCS has created a high standard for me and I would like to see this class on par with the rest of the program!",
                        "workload": 15,
                        "_id": "external-import-b87eabfd-08ed-4d52-b767-00a2517f169c",
                        "created": "2019-07-30T22:52:18Z",
                        "_type": "review",
                        "semester": {
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z"
                        }
                    },
                    {
                        "_id": "external-import-c43b2d5d-e3ba-492e-b133-255a4abc28de",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "workload": 10,
                        "id": "external-import-c43b2d5d-e3ba-492e-b133-255a4abc28de",
                        "created": "2019-07-30T20:41:55Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        },
                        "_createdAt": "2019-07-30T20:41:55Z",
                        "course": null,
                        "body": "This class was not that interesting, if you have taken IIS or NS you probably know everything there is here.\nIt is some what an easy course if you can do projects with friends and all. The work material itself is very dry and boring.\n\nThe TAs are not very engaged except for a few. The auto grader for the project screws up regularly and the professor and TA have to work out how to fix it. The class has potential but it does not look like they will improve it.\n\nThe lectures are soooooo boring that you will probably sleep through most of it.",
                        "difficulty": 3,
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-6986cbcb-8c79-4a00-a97e-c413f65fd442",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_id": "external-import-6986cbcb-8c79-4a00-a97e-c413f65fd442",
                        "difficulty": 3,
                        "_createdAt": "2019-07-30T15:58:32Z",
                        "_type": "review",
                        "created": "2019-07-30T15:58:32Z",
                        "body": "Like many other reviewers have mentioned, there is a noticeable issue of changing requirements with respect to the projects. However, I was never so inconvenienced that I felt outraged. The projects themselves are quite doable relative to other OMSCS courses I've taken. I do think you should take IIS before this though. Project 4 is a much harder version of IIS's project 1. The tests are very straightforward if you watched the lectures. No deceptive/trick questions. And the readings are basically the same material as the lectures. \n\nAs for the material/learning experience itself, I'd say it was worth it! It's very refreshing to complement your knowledge of computer science with the cyber physical  realm. You'll never look at traffic lights, power grids, factory floors, etc. the same way again.",
                        "workload": 9,
                        "rating": 4
                    },
                    {
                        "created": "2019-07-30T10:38:08Z",
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-df5d3314-6438-4e74-9738-54218a8b89a4",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 6,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "body": "This course covers industrial programming, security, and hacking. It is an end to end survey of the physical systems that leverage automation to ship packages, mix composite materials, generate power in a smart grid, etc. The projects can take a significant about of time, but they are very realistic with elegant solutions. The exams are straight forward if you followed the syllabus. The hardware in this course should be new to most CS students, but everything is virtualized and simulated very well. The course demystifies the industrial world significantly showing the increasing overlap with enterprise security concepts.",
                        "id": "external-import-df5d3314-6438-4e74-9738-54218a8b89a4",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-07-30T10:38:08Z",
                        "course": null,
                        "difficulty": 3
                    },
                    {
                        "difficulty": 2,
                        "_createdAt": "2019-07-29T22:54:14Z",
                        "workload": 6,
                        "_id": "external-import-43128775-cc2d-4fd8-b6de-05146b0bb1eb",
                        "created": "2019-07-29T22:54:14Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 2,
                        "body": "I thought this class was going to be a lot of fun.\n\nIt wasn't.\n\nHonestly, I feel really bad for the TAs. It feels like there are two or three very invested TAs who dedicate as much time as they have to run the course. Unfortunately, that shows.\n\nThe lectures are essentially the professor reading the readings back to you. You may as well just do the readings instead of the lectures.\n\nThis class consists of 4 mini projects, 2 exams (multiple choice, about 20ish questions, pretty easy if you just study a little), and 1 paper presentation (also pretty easy).\n\nThe thing that made this class un-fun was the shifting requirements for the projects. Things like project naming would change halfway through the project due date. This was really unfair to people who submitted early, especially because if you didn't follow the name scheme you would get a 0.\n\nI had to submit two projects for a re-grade because the TAs were sloppy about grading and would take more points off than what was appropriate. Honestly, if I hadn't asked for the points back, it was the matter of getting two completely different grades amount of points taken away.\n\nThis is an overall easy course, so it's recommended as a summer class. However, go in with the expectation that you're going to probably have to resubmit a project multiple times and ask for regrades.",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "id": "external-import-43128775-cc2d-4fd8-b6de-05146b0bb1eb",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "workload": 6,
                        "id": "external-import-d5848867-a1cd-4b35-9bb2-ac942b2712fc",
                        "created": "2019-07-29T22:54:14Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "body": "I thought this class was going to be a lot of fun.\n\nIt wasn't.\n\nHonestly, I feel really bad for the TAs. It feels like there are two or three very invested TAs who dedicate as much time as they have to run the course. Unfortunately, that shows.\n\nThe lectures are essentially the professor reading the readings back to you. You may as well just do the readings instead of the lectures.\n\nThis class consists of 4 mini projects, 2 exams (multiple choice, about 20ish questions, pretty easy if you just study a little), and 1 paper presentation (also pretty easy).\n\nThe thing that made this class un-fun was the shifting requirements for the projects. Things like project naming would change halfway through the project due date. This was really unfair to people who submitted early, especially because if you didn't follow the name scheme you would get a 0.\n\nI had to submit two projects for a re-grade because the TAs were sloppy about grading and would take more points off than what was appropriate. Honestly, if I hadn't asked for the points back, it was the matter of getting two completely different grades amount of points taken away.\n\nThis is an overall easy course, so it's recommended as a summer class. However, go in with the expectation that you're going to probably have to resubmit a project multiple times and ask for regrades.",
                        "_createdAt": "2019-07-29T22:54:14Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_id": "external-import-d5848867-a1cd-4b35-9bb2-ac942b2712fc",
                        "difficulty": 2,
                        "_type": "review",
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "_type": "review",
                        "difficulty": 3,
                        "course": null,
                        "id": "external-import-30882416-48be-4cdd-b83b-45490ca60538",
                        "created": "2019-07-29T20:51:41Z",
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        },
                        "_id": "external-import-30882416-48be-4cdd-b83b-45490ca60538",
                        "body": "Note: This is for Summer 2019:\n\nOverall - I thought this was a good course. It seems like it was better organized than past semesters, with that said, Project 2 was a difficult project and the grades were released right before the drop date. Furthermore, they had issues with the autograder so some students dropped when they might have had a decent grade. The first project was fun and provided an understanding of industrial systems. Project 2 had a much higher learning curve, primarily due to ladder logic that wasn't well explained in the course material. There is one section in particular which could stand to use simplified logic. \n\nOverall - there is a lot of material and I personally would de-emphasize the material on the smart grid. \n\nPast reviews are right on about the tests - you are allowed a cheat sheet and there are not many questions. \n\nYou can handle the first three projects without any previous experience. Project 4 is much easier if you've taken IIS.",
                        "rating": 4,
                        "workload": 12,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-07-29T20:51:41Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "_type": "review",
                        "_id": "external-import-8bec31da-6dd8-46b1-8ee5-333e39c798f8",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "body": "Tohid is the only good TA on the team. Some of the other TA's will literally tell you things that are false. \n \n\nThe first project was a joy to work on. \n\nThe second project in this course is an \ninsult to the quality of the program as a whole, and should be entirely removed. To be clear, my issue is not the content or the work we're being asked for, it is the hideous structure of the development environment, and the vast diversity between the different sections that just makes this so much more work than it needs to be. Consider removing part 3 and changing the abstractions so that we're not learning entirely new systems for each different part. It's just too many details to the point where it takes away from the goals of the assignment. You could easily use factory IO for both project 1 and 2, I think that would actually be great, and could enable you to delve into more interesting PLCs and see them work on real machines which was the best part of P1. \n\nThe third project is interesting and fun, the fourth project is also good. \n\n\n### BE AWARE OF HIDDEN REQUIREMENTS. \n\nIt is so ridiculous how many times the project requirements \"changed\" due to the vagueness of the writeup, these new details only became clear after arguments on piazza.",
                        "id": "external-import-8bec31da-6dd8-46b1-8ee5-333e39c798f8",
                        "created": "2019-07-15T13:54:02Z",
                        "workload": 10,
                        "difficulty": 2,
                        "rating": 2,
                        "semester": {
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_createdAt": "2019-07-15T13:54:02Z",
                        "course": null
                    },
                    {
                        "body": "Great class. The first 2 projects were interesting and challenging, but you learn a ton. Some people struggle with first 2 projects and drop. Majority of students really like the projects.\nThey give you 2 weeks to complete each project and there was 1 extra project at the end. If you start early, you should be fine. \nDr. Beyah and TAs were really helpful.\nI really liked this class and I'm glad I took it.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-05-05T22:07:49Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-1feedeaf-3465-4f5e-926a-24392add5af4",
                        "rating": 5,
                        "id": "external-import-1feedeaf-3465-4f5e-926a-24392add5af4",
                        "created": "2019-05-05T22:07:49Z",
                        "difficulty": 3,
                        "workload": 8,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        }
                    },
                    {
                        "_createdAt": "2019-05-05T14:07:48Z",
                        "_id": "external-import-ce320ee7-1b7c-46bf-b000-4aab64e1bcf7",
                        "difficulty": 2,
                        "body": "I liked the projects much. First project was very interactive and challenging. Second project was also interesting. The first 2 projects require some investment in time. While 3rd and 4th projects are easier. Exams were good with most of the questions from lectures. Need to focus on all aspects to get an A. Paper presentation helped a lot to learn more about what happens in current trend",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "rating": 5,
                        "_type": "review",
                        "workload": 6,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-ce320ee7-1b7c-46bf-b000-4aab64e1bcf7",
                        "created": "2019-05-05T14:07:48Z"
                    },
                    {
                        "workload": 20,
                        "_createdAt": "2019-05-03T16:54:13Z",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "created": "2019-05-03T16:54:13Z",
                        "_id": "external-import-ec90a48c-076b-4480-ba4e-8090780d3a2e",
                        "body": "Had no real prior experience with ICS, really enjoyed the class Instructor and TA's and other students were really great. This is the first time that I experienced this in the program.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        },
                        "id": "external-import-ec90a48c-076b-4480-ba4e-8090780d3a2e"
                    },
                    {
                        "course": null,
                        "_id": "external-import-be187180-0029-4b57-9df3-58fb273b7060",
                        "_createdAt": "2019-05-02T22:06:46Z",
                        "id": "external-import-be187180-0029-4b57-9df3-58fb273b7060",
                        "created": "2019-05-02T22:06:46Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "workload": 8,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "difficulty": 2,
                        "body": "**Overall:** This course had some really interesting topics, but did _not_ dive into them as deep as I would have liked.  _You can take and succeed in this course with little to no background in Security_  (I have one, so the topics were not at all new to me), my only suggestion is a basic background on networking.  The majority of the workload was in the 4 projects and 1 paper presentation.  TA's and instructor were responsive and worked with students to even allow us to frontload the work a little.  However, as a whole I think is course could be improved a good bit.\n\nPaper presentation: An interesting assignment, made you read, understand, and provide a talk + slides on the topic.  Took me about 15 hours total.\n\nProject1: The most time-consuming.  Not difficult, but takes time.  Took me about 30-35 hours.\n\nProject2: The second most time-consuming, dealing with PLC logic and state diagrams.  This one used an unreliable environment that was the most frustrating part of it.  Took me about 15-20 hours, about 5 of which were setup/fighting the unreliable tools required for it.\n\n\nProject3: Very quick project, but was somewhat interesting as you were actually dealing with fieldbus protocols. Took me about 10 hours.\n\n\nProject4: Basic use of GDB debugging and Return-oriented programming (ROP).  Interesting and no problems with environment.  Took me about 15 hours.\n\nBoth tests (midterm and final) are cumulative and based straight off the lectures and two primary textbooks.  Not difficult if you watch the lectures and review some material."
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2019-05-02T19:50:13Z",
                        "_type": "review",
                        "rating": 4,
                        "workload": 12,
                        "body": "Great Course! The assignments were fun. After taking this course I realized that industrial control systems are not really secure and the difficulty involved in securing them.",
                        "id": "external-import-428c8d9e-61b4-4165-b89a-8f4987eb52aa",
                        "created": "2019-05-02T19:50:13Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "difficulty": 3,
                        "_id": "external-import-428c8d9e-61b4-4165-b89a-8f4987eb52aa"
                    },
                    {
                        "id": "external-import-606d1de5-91c5-4831-98f1-2ae159dd62d1",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "For context, I have a background in security, including being in charge of security architecture, being a CISO twice, and a (lapsed) CISSP. Given that, I didn't think I'd learn a ton in this course, but that was not the case.\n\nIt turns out that, when you look at security through the lense of Cyber-Physical Systems and Industrial Control Systems, a lot of things you think are settled or solved are still open questions. In fact, we are creating new \"legacy\" situations every day as we invite all sorts of networked devices (with questionable security, monitoring, and updateability) into our lives. IoT, anyone?\n\nAs far as logistics, there were inevitable hiccups, but the TAs were on top of it and worked hard to make sure that we could learn. Very flexible and supportive.\n\nDr. Beyah has an engaging lecture style and covers the material well. I recommend this course if you have an interest in security, how infrastructure works, and what the \"new infrastructure\" (IoT, AVs, etc.) will be and how to secure it.",
                        "created": "2019-01-15T23:36:01Z",
                        "_createdAt": "2019-01-15T23:36:01Z",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z"
                        },
                        "_id": "external-import-606d1de5-91c5-4831-98f1-2ae159dd62d1"
                    },
                    {
                        "_type": "review",
                        "id": "external-import-40543672-babe-4691-b652-2571152d3cac",
                        "created": "2019-01-01T16:09:05Z",
                        "difficulty": 3,
                        "_id": "external-import-40543672-babe-4691-b652-2571152d3cac",
                        "_createdAt": "2019-01-01T16:09:05Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 5,
                        "course": null,
                        "workload": 8,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "body": "This course was excellent! \n\nThe material was well summarized by the professor in the video lectures and it gave a concise overview of the many aspects of CPS security. \n\nThe assignments were challenging but the TAs did it a good job in hinting us in the right direction when needed. \n\nThe use of Piazza was well organized and everyone from the Professor, to the TAs, to students participated well in the discussions.\n\nThe paper presentation also gave everyone the chance to get exposure to several research topics on this field.\n\nLots of reading and lots of work on projects but well worth the time.",
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "difficulty": 4,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 10,
                        "rating": 3,
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-129daf6f-75aa-4ab2-b37d-779f9cdbf848",
                        "_createdAt": "2018-12-18T00:46:38Z",
                        "id": "external-import-129daf6f-75aa-4ab2-b37d-779f9cdbf848",
                        "created": "2018-12-18T00:46:38Z",
                        "body": "Definitely not a easy class especially want a A grade. The projects are not easy, but if you take CS6035 and CS6250 before this class, those project won't be a big deal. The extra projects are difficult, especially the first. TA didn't provide any information regarding the extra projects, and the knowledge we need to accomplish those projects didn't come from the lecture. I spend a whole weekend tried to figure out the right way to perform MITM attack. Overall, I think this is a interesting course, although may not be very useful"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 4,
                        "_createdAt": "2018-12-16T14:35:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "workload": 6,
                        "id": "external-import-0e93a55d-1117-4455-b0cc-9a4a45f1c8de",
                        "created": "2018-12-16T14:35:17Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3"
                        },
                        "body": "The exams were taken almost exclusively from the lectures. Take good notes as this is all you can have for the exams (limited notes only for exams, no open book). The text books and other readings were not used much at all. The projects were interesting, but the was little to no feedback on them after the were graded - no explanations, examples, or answers - just the instructors private comments. Some of the project requirements are vague, so be VERY careful when answering them. In this case, MUCH more information is better. Some of the test questions were ambiguous and I think one of them was flat out wrong (the \"correct\" answer was actually a sub-set of one of other excluded groups), but the head TA cited some extra material not covered anywhere else to show how they considered this answer \"correct\". You should have taken the Information Security (CS6035) class as a prerequisite as one of the projects leans heavily on material covered there, so definitely NOT a good 1st course. Grading for the class seemed to take way to long (last day of semester and still waiting for a final grade for one assignment).",
                        "_id": "external-import-0e93a55d-1117-4455-b0cc-9a4a45f1c8de"
                    },
                    {
                        "difficulty": 3,
                        "course": null,
                        "workload": 16,
                        "_id": "external-import-3abe2757-2666-43a8-96d0-7a09bb78fc6d",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "body": "The professor reads directly from the book for all lectures (so no need to buy them).  The projects are virtually unrelated to the curriculum (line logic PLC programming and low-level stack overflow coding - seriously?).  TA's are not buttoned up - assignment dates are arbitrary, deliverables change last minute, etc..  Professor makes 0 appearances during the semester.  Unfortunately, it didn't meet the GT bar...",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 1,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        },
                        "id": "external-import-3abe2757-2666-43a8-96d0-7a09bb78fc6d",
                        "created": "2018-12-15T03:03:52Z",
                        "_createdAt": "2018-12-15T03:03:52Z"
                    },
                    {
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3"
                        },
                        "difficulty": 2,
                        "_createdAt": "2018-12-14T18:46:23Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 3,
                        "id": "external-import-5f69c5ba-f7cf-4b55-9ee1-3093b7ba7ba2",
                        "created": "2018-12-14T18:46:23Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 10,
                        "body": "If you've taken Computer Networks and Info Security like i have, there is not very much new technical material in the course - except for the ladder logic project, which was different and cool. The extra papers were good reads, but the official text was dry and verbose. One could almost do without it, but not quite,  if getting an A is the goal. One specific gripe is with the tests,  which are a large percent of the grade, not being worthy. Overall, just OK and possibly redundant. I'd rather have taken something else.",
                        "_id": "external-import-5f69c5ba-f7cf-4b55-9ee1-3093b7ba7ba2",
                        "_type": "review"
                    },
                    {
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        },
                        "created": "2018-10-28T00:29:21Z",
                        "_id": "external-import-1ab81ffc-7fe0-4f20-a3bd-1a928e24e757",
                        "body": "I took this course for Fall 2018, and withdrew as I had unplanned international travel right on the timelines for Project 2. \n\nThis is a very interesting course. Don't come in expecting to learn the standard C/Java like programming assignments. This is a new domain (was at least new for me). If you come in with that curiosity, you will enjoy this course. \n\nTeaching assistant team for this course is really good. Tohid is clearly passionate about this course and domain and does a fantastic job. \n\nCourse has three projects and 2 exams. Generally projects use non-traditional  protocols and technologies such as ladder logic, somachine, mininet, modbus, etc. So there is a ramp up time before every project. But the learning curve is not too steep. If you start early, you will do well.\n\nMedian for this course is quite high given that lot of people do well. There is also an extra credit assignment (Between 1 to 3 % points). So don't expect a curve for this course. \n\nPiazza for this course is probably the best organized one in the entire OMSCS program. Tohid creates a thread for every part of the project and all the discussions are generally captured in that one place. It is much better than wading through several threads of totally disorganized topics in some of the other courses. \n\nOffice hours are also recorded, which is another plus. \n\nPaper presentation was tried for the first time in this course in Fall 2018. It gives a very good exposure to a bunch of research topics on this field. If you are complaining about lack of an evaluation component in the first 4 weeks, here is one that you can pick. It is much easier to see a video done by one of the peer students for 20 minutes compared to reading through 40-50 research papers through the semester.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-1ab81ffc-7fe0-4f20-a3bd-1a928e24e757",
                        "_createdAt": "2018-10-28T00:29:21Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-46fee9ce-29af-4b13-a5fd-c5a0fbf4bcc8",
                        "_id": "external-import-46fee9ce-29af-4b13-a5fd-c5a0fbf4bcc8",
                        "rating": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "body": "I found the course to be pretty interesting as it made me explore a different aspect of security which was quite an unknown zone for me and it had some decent projects though I really disliked the pacing of this course. Piazza was quite active for the most part with TA's/students sharing articles/papers/news outside of the course content but still related to the subject matter. I really loved the documentary related to Stuxnet that was shared - well worth a watch.\n\nI took the summer version - and there were 3 projects. First project was quite easy and required the use of Schneider Electric's SoBasic. Second project was related to the protocols that you will study during the course - Modbus/DNP3 - I personally did horrible on this one as I was in the middle of relocating between countries due to my Job. But the class median on this project was quite high so I think it would have been doable, I just did not have the time to do it properly. The third project was nice and a bit tricky also - it required knowledge of using gdb to ultimately exploit a buffer overflow vulnerability. There was a 15 point extra credit on this project also.\n\nExams were fair, questions did not seem ambiguous but they were extremely short. They give you 2h 50mins for the final exam that you can complete in 10 minutes - I don't understand the point of this. The first exam was 1 hour and frankly it had more questions where some \"thought\" was needed and there the 1 hour time was somewhat justified. Final exam is cumulative.\n\nComing to the pacing - I don't know who has decided this schedule but there's practically nothing that happens during the first few weeks and very little even in the first month and then you finally get something to do from the mid-term till the end. It would be really worthwhile to adjust the schedule and put two projects before the midterm instead of just one. Currently, the workload is a bad factor to judge this course on. Not saying the workload is too much, it's just not indicative of the reality - I don't think I ever spent 7 hours per week, but certainly spent 20+ hours on the 3rd project trying to figure out a silly error. \n\nOverall, it was a decent course. My complain is the awkward pacing and the fact that the grading is quite weird - you basically have to do great on everything. With 100% in two projects and 90% in both exams, I still ended up with only a solid B since the second project pretty much screwed me over as I got a 50%. And since the overall class median/average is quite high, you cannot expect a curve. So if you have some important personal/job related stuff come up after the mid-term, then it could affect your performance in some projects.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_type": "review",
                        "created": "2018-08-07T22:01:51Z",
                        "_createdAt": "2018-08-07T22:01:51Z",
                        "course": null,
                        "workload": 7
                    },
                    {
                        "rating": 1,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 10,
                        "semester": {
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-05-10T18:41:28Z",
                        "difficulty": 2,
                        "_type": "review",
                        "_id": "external-import-fe2492e5-3e03-4cbc-9f10-ccd8ddb514ea",
                        "body": "As others have stated, this is a bad course, and the worst security course in OMSCS (I have taken all the other ones before this). The professor clearly doesn't put any effort into the class or the tests. The projects are hard to interpret, but not too bad once you get past the setup time. \n\nThe real issue I had with this class were the tests. They are about 20 multiple choice questions that are terribly worded with answers that all make sense depending on the context that you do not have. Its more or less his opinion really, so you have to spend a ton of time trying to figure out what he believes is the best answer and not what is actually the best answer. \n\nTAs were good. They had to deal with almost all aspects of the class because the professor was non-existant but they did a good job with that overall. I strongly recommend not taking this class, even if you want an easy A. Its not worth the time or effort you will spend.",
                        "id": "external-import-fe2492e5-3e03-4cbc-9f10-ccd8ddb514ea",
                        "_createdAt": "2018-05-10T18:41:28Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "body": "I almost never write reviews for courses, but this one is so terrible that I wanted to make sure to warn people. The subject matter is dull and the lectures make it even worse, there are two 'required' books which I never touched, the TAs/professor got combative with people in Pizza on a few occasions, and there was almost no interaction at all.  I mentioned the books.  I never once opened them, but I got an 'A' in the class.  I've no idea what is in them, but clearly it wasn't needed.\n\nBy far, the best part of the course are the projects, but that isn't much of a compliment.  The things are terribly designed, require janky industrial software (seriously, why is industrial software so terrible), and have unclear requirements.  Once you've figured out what you are being asked to do, however, the projects are simple and can be finished in an hour or two.\n\nBeware the exams.  They are easy (like 5-10 minutes easy), but there is often misleading wording to questions.\n\nIs this an easy class?  Yes.  Does it require much thought or time?  No.  Will you still be sad you took it?  Very much so.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3"
                        },
                        "id": "external-import-276a2328-46c5-4dee-b102-29ab2c7fcc27",
                        "created": "2018-04-27T13:24:33Z",
                        "_createdAt": "2018-04-27T13:24:33Z",
                        "rating": 1,
                        "course": null,
                        "workload": 4,
                        "_id": "external-import-276a2328-46c5-4dee-b102-29ab2c7fcc27"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2017-10-07T22:59:05Z",
                        "_createdAt": "2017-10-07T22:59:05Z",
                        "course": null,
                        "difficulty": 1,
                        "body": "Until theres a restructure, I would avoid this course. Unfortunately, its a poor reflection of the OMSCS program and hopefully the feedback on OMSCentral will be used to improve the course.\n\nThere is almost no interaction between the instructors/TA and students on Piazza -- it was the least amount of Piazza/Slack activity I've observed so far in this program. There's pretty much nothing due for the first 4 weeks, then there's an extremely simple project that is made difficult through lack of clarity. After that, there's nothing due for a few more weeks until the Midterm that contains less than 20 multiple choice questions and is worth 25% of your grade. There is no direction on what to study, because the assessments are meant test the student's broad understand. This has the side effect of questions that are vague and open for interpretation, allowing multiple technically correct answers to some questions based on the level of abstraction of your interpretation. The books are just a really general overview of the topic. This course takes only a few hours of work per week to complete in its current state, and when the appropriate amount of effort is put forth, it will give you a 50% chance at a B, and 50% chance at an A. \n\nThe instructor is likable and he does a good job with the lectures, so that is one benefit. The instructor is knowledgeable in his field, just as you'd expect from a GA Tech professor.\n\nThis review isnt in retaliation for a bad grade, or a personal attack on any of the instructors; I received an A, and the instructors were willing to help a student when contacted. My theory is that outside of the lectures, the course was developed and operated by TAs from the brick and mortar program who just don't have much stake in the online program. I'd love to see this course improved upon.",
                        "rating": 1,
                        "_id": "external-import-b9f6539e-dab4-45f1-8c34-6acd372153e1",
                        "id": "external-import-b9f6539e-dab4-45f1-8c34-6acd372153e1",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "workload": 3,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester"
                        }
                    },
                    {
                        "_type": "review",
                        "_id": "external-import-7520ba70-5528-48b5-bfa0-d08f7f1e0225",
                        "workload": 7,
                        "id": "external-import-7520ba70-5528-48b5-bfa0-d08f7f1e0225",
                        "difficulty": 2,
                        "_createdAt": "2017-08-03T00:50:54Z",
                        "rating": 4,
                        "semester": {
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z"
                        },
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2017-08-03T00:50:54Z",
                        "body": "Overall, a good class. Yes, the lectures and books were often repetitive and some rote learning was involved. And yes, the professors and TA's weren't very active on Piazza. But the material was interesting and you get the understanding about what makes cyber security different for embedded systems versus general purpose systems. In contrast to what a previous reviewer said, when the professor said \"I won’t debate you further. However, for the other students reading this, my statements were correct, \" I thought it was great. The student was arguing for the point of arguing on the Piazza forums, adding unneeded contention. And I didn't really see any other students surprised or \"roiled up\" by that comment. Anyways, back to the class itself. Enjoyed it, and wasn't a bad class to take during the shorter summer semester."
                    },
                    {
                        "_createdAt": "2017-08-02T05:21:46Z",
                        "id": "external-import-c04a2c9e-cafc-4bbe-a549-a3b829d06398",
                        "created": "2017-08-02T05:21:46Z",
                        "rating": 4,
                        "course": null,
                        "difficulty": 3,
                        "workload": 12,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-c04a2c9e-cafc-4bbe-a549-a3b829d06398",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15"
                        },
                        "body": "this is a good class, it provides good lectures, good books and reasonable projects. the issue is that the exams which represent 50% of the final grade are short multiple choice / true & false. The material is interesting. the semester didn't provide an active piazza or slack channel. So it's really about keeping up with the class. Office hours weren't recorded which is a definite bummer if you do work on the program late at night.",
                        "_type": "review"
                    },
                    {
                        "_id": "external-import-610b2cd2-cd42-42fa-b814-47bb347d37ba",
                        "created": "2017-07-30T22:26:51Z",
                        "rating": 3,
                        "difficulty": 2,
                        "body": "Felt to be more of an survey of Industrial Control Systems and protocols than a security course. We periodically touched on security here/there, but much more of the focus was on a very wide brief introduction to a wide variety of systems and protocols with a never ending list of acronyms. I would have preferred much more time spent on the application of security (e. g. here's a situation... this is what was done to secure it... or here's an case where there was an exploit, this is what was done to discover it, this is how it could have been discovered earlier, this is what was done to fix it -- in other words, learning from other's mistakes and analysis). \n\nThe projects were very lightweight and completed with minimal time and effort. Others had trouble getting the systems up/running, but I did not have that issue. \n\nThe other half of the grade for the course is tied up in hair-splitting true/false questions on two tests (both of which have a fairly limited number of questions). \n\nI think the course needs some work to take some slices of it deeper and give up on some of the broadness of the topics covered.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null,
                        "id": "external-import-610b2cd2-cd42-42fa-b814-47bb347d37ba",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_createdAt": "2017-07-30T22:26:51Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 2
                    },
                    {
                        "_id": "external-import-c77698e8-e0f1-4c8d-8428-e1f18cf5daac",
                        "body": "Let's start with good cop- the lectures are fairly alright. The problem is that the course is a long, extensive enumeration of a bunch of things that you should memorize (snooze-triggering videos on the details of various protocols used in industrial control systems) and then the exams do a very poor job in measuring the extent to which you've absorbed that information. So what's the point? I hate courses that function like a laundry list of concepts to memorize, but if they can't even write unambiguous exam questions based on that list, the course is garbage. (Additionally, the lectures are just a condensed version of the book readings, rendering the readings redundant and unnecessary. ) The projects were poorly explained and there was much reliance on the student Slack channel for project setup (hint: project setup is like 90% of the work for the projects). To top it all off, the instructor was either unengaged or condescending. The course is technically \"easy\" in terms of workload and subject matter, but I would imagine that most people got B's just due to there being few grading events that don't measure your understanding very well. I just finished the final in less than three minutes, having settled on an end goal of getting over half of the T/F questions correct for a B (the A being unattainable or not worth it due to crap questions). The worst course I've taken in the program and could use some strong changes.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 5,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 2,
                        "id": "external-import-c77698e8-e0f1-4c8d-8428-e1f18cf5daac",
                        "created": "2017-07-30T22:15:54Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "_createdAt": "2017-07-30T22:15:54Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI"
                    },
                    {
                        "id": "external-import-3b686fec-2f5f-4921-a47f-d66c5bc5b56b",
                        "created": "2017-07-30T21:56:27Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "difficulty": 2,
                        "_id": "external-import-3b686fec-2f5f-4921-a47f-d66c5bc5b56b",
                        "body": "This class has a lot of potential that goes largely untapped. The professor runs the lectures of the course nearly directly from a technical book, with his preferences emphasized. It sometimes feels more like a survey of a wide range of industrial control topics with an emphasis on the power grid. The problem is that it's a poorly written book in both language and conceptual layout. For example, you find repetition of facts at the beginning, middle, and end - but all high level concepts without specifics. \n\nTechnical papers the professor wrote were more interesting than anything in the book, and I wish the professor focused more on his work instead of the book - \"Industrial Network Security\". There was a little bit of opinion/politics thrown into a couple lecture - and this is my ultimate pet peeve. \n\nNot too much detail on most topics or specific technical challenges like you will find in nearly every other OMSCS course. Two of the three projects allow for a slightly deeper dive, but still not what you would expect from your average GT graduate course. The instructor did post a few things throughout the semester on piazza, but TA involvement was puzzling. Although the TAs do answer random questions, you definitely get the feeling that the TAs have a lot better things to do than answer questions on piazza. Even with that our TAs still really seem like great people, and I liked them. \n\nThe hardest part of the course is having so few grading events. There are two tests and three projects. And the tests are not long, so you have to make each grade count. \n\nI write a review for every class I take, and this will be the first negative review for any class. That probably speaks to the strength of OMSCS. It's not a BAD class, per se, but it does not stand up to many of the others. And that's a pretty high bar.",
                        "_createdAt": "2017-07-30T21:56:27Z",
                        "_type": "review",
                        "rating": 2,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 6
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "_id": "external-import-154acf5b-e80c-4e6f-a79b-2d7f68c45d69",
                        "_createdAt": "2017-07-29T19:09:42Z",
                        "workload": 1,
                        "difficulty": 1,
                        "semester": {
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "body": "SHITTIEST COURSE! A BIG WASTE OF TIME & MONEY. \n\nThis is not a Master level class. It does not teach you how to think, analyze, or reason with logic. Instead, it asks you to memorize concepts, protocols, and several shameless plugs from the instructor. \n\nDon't let the first few videos fool you with that hard yellow hat or the substation in the background into thinking the instructor is passionate about the class. On the contrary, you rarely see him participating. There was a question from a student and he condescendingly answered \"I'm not going to debate with you but for other students, my statements were right. \" That surprised and roiled up many students. If there's anything you'd learn in this class, unprofessional attitude is surely one. \n\nThe remaining of the videos are paraphrases from books, with a bunch of fundamental errors sprinkled in for taste. You're expected to remember all of that, including misinformation. \n\nThe mini projects (i. e. homework) are ill prepared. Unlicensed Windows, outdated software, non-working environment, etc. These issues were reported in earlier semesters but none bothered to fix them. The staffs just don't give a f*ck. And the previous sentence is my only review about the staffs. \n\nThe exams, as mentioned before, expect much rote-learning. But questions are badly written. In a true/false setting, most questions can go either way depending on the (missing) context. There is no way to reason them out, even security pros fail to match the answers. The final is especially terrible. Scheduled for ~3 hours, many completed in ~3 minutes. This class obviously does not meet any educational standard. \n\nTo recap, taking this class would set you back a few steps on your way to a good job. There are better security classes in the OMSCS program. But please do take this class if learning-by-rote is your kinda thing and you want to sell security to your boss. This class is easy and has enough spins for that.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-154acf5b-e80c-4e6f-a79b-2d7f68c45d69",
                        "created": "2017-07-29T19:09:42Z"
                    },
                    {
                        "course": null,
                        "id": "external-import-2706c28c-f6ef-491e-9e64-3892b4a39d56",
                        "body": "This was the first semester this class was offered. It covered a wide range of topics from general network security, industrial control systems and programming in ladder logic. It is a lot of material and overall it is very interesting. The grading was fair and was based on 3 projects and 2 tests. \n\nThe tests were short, multiple choice and T/F tests. In general I ended up studying all the material for a very long time only to spend 5 to 10 min on each test. The testing on ladder logic was not done well since there was no effort to give partial credit. This I feel is important when testing knowledge of a programming language. \n\nThe projects were the best part of the course, but still fell short of providing that much challenge in the class. The actual tasks pertaining to the material were quite easy, but sometimes it was the preparation that took the longest. My feelings after taking the class were that homework should be given each week to introduce the students to the technologies they will be using, like VirtualBox, Wireshark and the ladder logic emulator. Therefore the projects could involve more of the class material and less learning about the project environment. \n\nLastly, TA involvement on Piazza was good. They were there to answer questions or concerns. Since the class grading involved only 5 assignments Piazza was quiet most of the semester. \n\nI would like to see this class improve since the material is current and well-delivered. There should be some attempts to make the delivery focus more on the projects and less on the tests.",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester"
                        },
                        "_id": "external-import-2706c28c-f6ef-491e-9e64-3892b4a39d56",
                        "_type": "review",
                        "workload": 2,
                        "_createdAt": "2017-05-09T11:38:03Z",
                        "rating": 3,
                        "created": "2017-05-09T11:38:03Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI"
                    },
                    {
                        "_id": "external-import-8b23df8e-a940-45cc-a7b5-728a7a87822c",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-8b23df8e-a940-45cc-a7b5-728a7a87822c",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester"
                        },
                        "body": "Fairly simple, but assumes a moderately broad basis of knowledge. A little programming would help, and a fair bit of information security, and a bit of networking. If you have that, it's a short time commitment for several assignments and two exams. It was nice that it was fairly new material. One of my favorite classes, and I learned a good bit despite it not being labor intensive. Had A's straight through, despite doing the assignments entirely later than I should have.",
                        "_createdAt": "2017-03-19T19:43:33Z",
                        "created": "2017-03-19T19:43:33Z",
                        "difficulty": 2,
                        "workload": 2
                    },
                    {
                        "workload": 10,
                        "_id": "external-import-ac95928f-0bbd-4bec-959c-95e75c783377",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2017-1",
                            "_updatedAt": "2022-07-22T00:48:17Z",
                            "startDate": "2017-01-09",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRJmH",
                            "_type": "semester"
                        },
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "id": "external-import-ac95928f-0bbd-4bec-959c-95e75c783377",
                        "created": "2017-03-14T23:12:45Z",
                        "_createdAt": "2017-03-14T23:12:45Z",
                        "rating": 4,
                        "body": "The class topic is very cool. The projects are good for learning about the Industrial Control System Environments. What makes the class more difficult is that there are only 5 gradable events. There is a midterm that had 19 questions total. (I mean, miss 3 and you are at a C-), and 3 projects, plus a Final. The questions on the midterm were somewhat ambiguous which left me very nervous. I liked the first project on Ladder Logic. The Second was Modbus, and I ran out of time because of conflicting project schedules with CS6262 Network Security. I ended up having to drop this one here in the Spring, but will look to redo in the summer. It is a good topic, but overall, I wish the exams had more questions so it had better coverage of the material and less \"gotcha\" ambiguous questions. And actually, I wish there were more projects too. Some parts of the class go a long time with simply reading a chapter and watching a lesson. Even smaller projects would be good here and cement the material.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null
                    },
                    {
                        "_id": "external-import-26bc6bd6-c807-4f23-9a89-7dcf3e690204",
                        "difficulty": 4,
                        "_createdAt": "2017-03-11T15:36:03Z",
                        "id": "external-import-26bc6bd6-c807-4f23-9a89-7dcf3e690204",
                        "created": "2017-03-11T15:36:03Z",
                        "_type": "review",
                        "body": "Not sure how fall semester was but I took this in Spring semester and it was an awful awful class. I had to withdraw since my first midterm grade was very poor and the instructor had no intentions of giving a curve even though the class average was failing! Nobody got an A on the first exam and the exam did a poor job of gauging my understanding of the material since it was all T/F questions with 3 ineligible Multiple choice questions (we could not see the diagrams properly). Despite all of the students complaints, the instructors simply ignored them and moved on. On top of that, we never even got the answer key for the first exam so I don't know what I got wrong (or could argue for any points back). \n\nThe mini projects could be fun; however, the lectures do not show how to solve them at all. I was very stuck on both thus far, not because it was necessarily difficult but because there was little documentation or little knowledge given to us about the project. On top of that, the VMs and instructions provided for the mini projects were very very poor and paltry when it came to details. I had to scour Piazza in order to troubleshoot some of the most basic issues with the VM (for instance, there was an Ubuntu VM given to us that had no taskbar and had I not known the command needed to use in the terminal in Piazza, I would've just been completely stuck). A lot of time is also spent configuring the VM, downloading files/applications, and installing everything just to begin the project - why the instructors/TAs don't do this themselves and then provide the VM is beyond me. \n\nI would strongly suggest to avoid this terrible class. It is sad because the material looks so cool but the lack of structure, direction, and overall unfairness of this class has lead me to believe that this is the worst class I have ever taken as a student (and this was my 8th class in the program).",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 1,
                        "workload": 10,
                        "semester": {
                            "startDate": "2017-01-09",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRJmH",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2017-1",
                            "_updatedAt": "2022-07-22T00:48:17Z"
                        },
                        "course": null
                    },
                    {
                        "_id": "external-import-943d488a-87d4-4e30-a63f-778799d1465c",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3"
                        },
                        "body": "An easy but rewarding course. The projects are perhaps a bit too easy, but I found the material and reading itself very rewarding. Gives me a new perspective on talk of 'cyberwar' in the news. I would strongly recommend reading the academic papers assigned - although they weren't so relevant to the projects/exams, they were sometimes far more interesting than the textbooks. \n\nMy only complaint is easiness of the class - some of the projects definitely did not feel rigorous, especially in their programming component. But others may disagree, just my two cents. \n\nOverall, I would recommend this class, but definitely as a second class in addition to something else more challenging.",
                        "difficulty": 2,
                        "id": "external-import-943d488a-87d4-4e30-a63f-778799d1465c",
                        "created": "2017-01-06T15:57:22Z",
                        "course": null,
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 4,
                        "_createdAt": "2017-01-06T15:57:22Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-f245645a-ddd6-4e49-a778-9354ebcf3b3d",
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-f245645a-ddd6-4e49-a778-9354ebcf3b3d",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 5,
                        "body": "Overall a great class! It has some issues, but fortunately they are ones I think will be resolved in future iterations of the course. \n\nThe course stands alone very well, and covers the necessary background material needed to be successful without needing to take other classes. If you have taken CN, InfoSec, and NetSec, you will find much of the material to be review. What is unique to this class is how this pertains to the realm of cyber physical systems like Programmable Logic Controllers, and how these devices are used in a conventional industrial plant. \n\nThis semester the course had 3 projects, each taking between 5-8 hours to complete. Each focused on it's own area - Ladder Logic Programming, Industrial Protocols, and exploiting vulnerabilities in CPS. There was a one hour midterm consisting of multiple choice and T/F style problems. I have yet to take the final, but it is 3 hours long, has a similar format and length to the midterm, and is comprehensive. We are permitted to use a single sheet of notes for the tests. \n\nThe material spends a lot of time focusing on definitions of terms, policies, and best practices. It uses common terminology, so much of it will be familiar, just applied to a new realm. The videos are high quality, easy to understand, and you can tell Professor Beyah was well rehearsed and polished for their production. There are a few moments where I felt like I was watching the Turbo Encabulator video, but it wasn't too terribly distracting. \n\nThe course also has some pacing issues. With only three short projects, straightforward material, two tests, and ~50 students this semester we probably won't get higher than 300 threads in Piazza. I think the inclusion of meatier projects / more projects is likely to occur, and would benefit the class. \n\nIf you are looking to prepare for the course, you could learn Wireshark if you don't already know how to use it, and potentially buy the books in advance and do some casual reading.",
                        "created": "2016-12-08T15:29:15Z",
                        "_createdAt": "2016-12-08T15:29:15Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 2,
                        "_updatedAt": "2022-07-11T19:08:17Z"
                    },
                    {
                        "created": "2016-11-03T01:04:00Z",
                        "_id": "external-import-95a6c567-dde9-4c7c-bf93-c56941b4a5d0",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "_type": "review",
                        "id": "external-import-95a6c567-dde9-4c7c-bf93-c56941b4a5d0",
                        "workload": 8,
                        "difficulty": 2,
                        "rating": 4,
                        "_createdAt": "2016-11-03T01:04:00Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22"
                        },
                        "body": "The instructor (Raheem Beyah) keeps his syllabus on his website at\nhttp://users. ece. gatech. edu/~rbeyah/classes/fall2016/cs8803/ (substitute your term as appropriate)\n\nGrading summary: \n2 projects @ 25% each\nMidterm & Final @ 25% each, via ProctorTrack (T/F, MC)\n\nProject 1 was PLC ladder logic programming\nProject 2 analyzing ethernet traffic and using Python to inject bad commands\nProject 3 researching vulnerable devices\n(All projects are individual; no group projects)\n\nPace is slow, so a great class to take along side another. I'm taking CS6035 concurrently. This class does not require CS6035 as a prereq - it can stand on its own. The content is interesting and worthwhile. There haven't been any office hours, but the TAs and instructor monitor Piazza well. Granted we only have ~50 students in the class during its 1st run. \n\nEdit: updated review after finishing the class"
                    }
                ],
                "id": "external-import-CS-6263",
                "syllabus": {
                    "url": "https://rbeyah.ece.gatech.edu/classes/summer2022/cs6263/"
                },
                "programs": [
                    {
                        "acronym": "CS"
                    },
                    {
                        "acronym": "CY"
                    }
                ],
                "_rev": "iLpqNfBINCDhaBRaVOI4YJ",
                "rating": 3.3461538461538463,
                "difficulty": 2.6025641025641026,
                "workload": 10
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "introduction-to-cyber-physical-systems-security"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}