{
    "props": {
        "pageProps": {
            "course": {
                "_updatedAt": "2022-08-24T20:00:09Z",
                "isDeprecated": false,
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/476bd54a45f664fe8c0206abb24e7093cec1bd6e.pdf",
                "reviews": [
                    {
                        "course": null,
                        "semester": {
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15"
                        },
                        "_updatedAt": "2023-08-07T00:16:49Z",
                        "_rev": "ng0seSqXq9rIn99TlBJKMN",
                        "id": "ng0seSqXq9rIn99TlBJKRD",
                        "rating": 4,
                        "difficulty": 3,
                        "body": "TLDR: Good course overall with some frustrations about clarity of project instructions and response times from TAs. \n\nOverall, I did enjoy this course and its material. The seven projects cover a wide swath of cybersecurity topics to include malware analysis, web exploitation, intrusion detection systems, android \"malware,\" and machine learning (among other related topics). For the most part, the projects were not that difficult once you were able to understand what was actually being asked. To be honest, the difficulty of this course overall came from often unclear project directions and the unfortunate delays in TA answers to student questions (which had fairly significant impact given that I took it during the shorter summer semester). But, to give credit to the TAs, they often did listen to student feedback and pushed back due dates for projects multiple times when asked. The TAs also made some grading adjustments for this semester that I think were very helpful. Basically, I think the TAs overall really wanted students to succeed, but they were likely overwhelmed with all the work given that there were only two of them. This course could really use another one or two TAs to help out. I think that alone would greatly enhance the course and help reduce turn around times with answering student questions (for the summer term at least, perhaps its not an issue in a normal term with more time). This course also had extra credit in the form of providing feedback on how to improve the projects which really pushed worries about overall grades out of mind. The TAs even made a comment about how the course was truly focused on students learning new concepts through the projects and that no one should stress about grades so long as they put in effort for each assignment. \n\nBe wary of the ML project though if it is still kept around. The one available server had several technical issues with processing submitted jobs that seriously delayed progress for a lot of students. Start that one as early as possible. It isn't difficult, but you can't really control how long it takes to complete most tasks.\n\n",
                        "_id": "ng0seSqXq9rIn99TlBJKRD",
                        "_createdAt": "2023-08-07T00:16:49Z",
                        "_type": "review",
                        "workload": 15,
                        "created": "2023-08-07T00:16:49Z",
                        "authorId": "cHMSA05U+R8xxli3kBrJog=="
                    },
                    {
                        "_updatedAt": "2023-07-30T21:02:12Z",
                        "difficulty": 4,
                        "_rev": "GaVPCT8bbJ3ZdIEcpbiE6b",
                        "_type": "review",
                        "id": "GaVPCT8bbJ3ZdIEcpbiEA6",
                        "created": "2023-07-30T21:02:12Z",
                        "course": null,
                        "_id": "GaVPCT8bbJ3ZdIEcpbiEA6",
                        "body": "This class was horrible structured. And it's a shame because the content is great. There was just a slew of technical issues with a lot of the projects. The TAs don't respond on the forums at all and if they did it was a couple word answer that wasn't helpful. The positive thing is that they graded easily, but it was still an extremely difficult class. You'll learn a lot but at the expense of your sanity. \n\nThe projects were structured terribly. They basically all had a tutorial that walked you through exactly what you needed to do but then left out key details that you needed to even understand what you were responsible for. One of the worst structured classes I've ever taken. \n\nlab1 - buffer overflow, which in my opinion was the easiest and didn't have too many issues, it was just structured weird where they stacked all the difficult issues into one with no lead up in difficulty at all. semi-difficult for the average person but nothing horrible unless you don't know assembly/buffer overflow attacks\n\nlab2 - malware analysis, decently easy if you are comfortable with assembly, but good luck understanding angr, it was very weird and confusing and the TAs only explained things in a weird abstract way. Very hard for most of the class\n \nlab3 - android rooting, once again, they didn't explain much but overall the easiest lab \n\nlab4 - host-based IDS - 75% of it is just hooking syscalls then trying to determine if binaries were \"abnormal\". It really didn't make much sense because of the background noise in linux was just not explained at all and they didn't tell us how to handle it so it ended up just being a mess. Fairly easy\n\nlab5 - network-based IDS - gave us the solution to lab4 to detect issues in binaries sent over ftp. Wouldn't be bad if ftp wasn't old and deprecated in modern day. Just felt too hypothetical and not useful at all. Pretty sad because it's a good concept. Somewhat difficult but nothing too bad\n\nlab6 - web security where a vulnerability was \"recently\" patched so they had to scrap a whole section that wasn't possible where I think the TAs just were too lazy to research beforehand and just carried this over from many years ago, overall pretty easy\n\nlab7 - worst thing I've ever done. It was supposed to be a ML project to learn malicious malware based on windows internals that malware tried to access. The server broke many, many times. It's designed horribly internally by somebody at tech. I ended up using this as my dropped project and not doing it since there was so many technical issues. They, 2 weeks to the end of class, announced a dropped project",
                        "workload": 30,
                        "_createdAt": "2023-07-30T21:02:12Z",
                        "rating": 2,
                        "semester": {
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z"
                        },
                        "authorId": "vgX5ONkvBILCXq/1UbWWdw=="
                    },
                    {
                        "_createdAt": "2020-08-21T20:20:44Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "created": "2020-08-21T20:20:44Z",
                        "difficulty": 5,
                        "_id": "external-import-3a0d5bb9-a186-4846-87d8-4bda1e46ec5c",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "workload": 25,
                        "id": "external-import-3a0d5bb9-a186-4846-87d8-4bda1e46ec5c",
                        "_type": "review",
                        "body": "To mimic the others, the course is extremely challenging. This is a \"lab\" course, so the course content isn't all that in-depth and in order to complete the projects, a significant amount of external reading/learning is required. The Summer 2020 semester did have a curve similar to what was mentioned below, but I believe the size of the curve depends on the class averages, not a defined marker or guarantee.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "_createdAt": "2020-05-08T16:28:09Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "body": "This was probably the most challenging course I've ever taken, across all of undergrad and through 4 masters-level courses here at GA Tech. That's not entirely a bad thing, as this program is meant to be rigorous, but this course suffered from many of the issues that first-time offerings have, notably that the projects were not quite as refined as they otherwise could have been, and many required a key \"aha\" moment similar to other classes.\n\nThe majority of the grade (90%) was based on 7 projects, with a final exam comprising the last 10% of the grade. Some of these projects were reasonable; others, less so given the time.\n\nInfo on those 7 projects follows below - in general, each was supposed to be 2 weeks, but COVID-19 led to some changes later in the semester:\n\n1. ROP Chains. Exploiting an application to read a flag using Return-Oriented Programming. This project was challenging, but well-done, building nicely on the overflow attack from IIS. ~20 hours.\n\n2. Malware analysis. Again, this built (to some degree) on the malware analysis project from IIS,  but with a focus on activating and analyzing malware behaviors both statically and via concolic execution. 2/3 of the project was doable, the last binary could have used more guidance. This was the project the class struggled with the most. ~60 hours.\n\n3. Kernel IDS. We had to hook system calls and determine whether or not the actions performed by a binary were anomalous or malicious for different inputs. There was some confusion over alerting on just anomalies, or just malicious behavior. The base concept was workable, but some specific requirements (notably that they wanted anomaly detection to be done via some sort of syscall tracking rather than exempting known good) made it so that this would be very difficult to accomplish in 2 weeks. This was the second-hardest project. ~40 hours.\n\n4. Network IDS. This takes the kernel IDS from project 3, and uses Snort and daemons to capture and analyze binaries sent over the wire. Neat project, relatively doable (as long as project 3 went well). The open-endedness on how this was done was beneficial for this one; it didn't matter so much how we got to the end result as long as it all worked. ~25 hours.\n\n5. Exploiting Android Webview UI. This one had potential, and wound up being relatively easy. We initially had to exploit flaws in Webviews via two mechanisms, and then implement a solution within an application to mitigate those vulnerabilities. Unfortunately, one of the two flaws was no longer working at the time we did the project. This took what would have been a 5-10 hour project and turned it into a 40-50 hour project.  If the second exploit was doable, it probably would have been a 15-20 hour project. As it stands, ~40 hours.\n\n6. Rooting an Android Device. This is a guided project and lab write-up, requiring less coding. As long as you read through the documentation a couple times, it's not difficult. ~15 hours.\n\n7. Machine learning classification of malware, and mimicry attacks. This was originally a 5-part project, but was later cut to 3. Originally had a one week window, but was extended to about 10 days. Could have used more guidance on this, and there were a number of technical issues. ~30 hours.\n\nThe class did end up being curved to an 80 for an A, a 60 for a B, otherwise C. I wouldn't expect such a generous curve in future semesters. I think the biggest issue was with projects being too large in scope. If this had been cut to 5 or so projects over the course of 15 weeks (3 weeks/project, maybe less for easier projects and more for harder projects), it would have been more reasonable. Others have mentioned recycled content, which is a fair issue to raise, but I think most of the learning in this class came out of projects, and that was fairly reflected in the grading. I really hope they get some of the issues with the first run of this class ironed out, as I definitely learned a lot, but there was much more frustration than there needed to be.",
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-4aee3ada-fe12-45fe-9270-f8b695de3caf",
                        "created": "2020-05-08T16:28:09Z",
                        "_id": "external-import-4aee3ada-fe12-45fe-9270-f8b695de3caf",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "workload": 20
                    },
                    {
                        "_type": "review",
                        "workload": 15,
                        "_id": "external-import-a0999491-1596-4df7-82d5-b1df45a2a3b4",
                        "body": "This was the first time this course was offered at Georgia Tech. With the honour of being amongst the pioneers a.k.a guinea pigs, I would highly recommend taking CS 6262 (Network Security) as a prerequisite. \nCS 7641 (ML) or CS 7646 (ML4T) are optional prerequisites, either one will be required to tackle one of the projects that entails machine learning. \n\nThere were a total of seven projects:\n\n1. Return Oriented Programming (ROP): Primarily a CTF project.\n\n2. Malware Analysis: You'll be given three malware samples; two known and one unknown and you're expected to assess the samples using both static and dynamic analysis. \n\n3. Kernel Hooking: This task entailed writing a loadable kernel module (lkm) in linux to differentiate malicious from benign activity from a binary sample. \n\n4.  Network Intrusion Detection: You are expected to use SNORT in conjunction with shell scripts and a custom daemon to detect both malicious and benign binary files. \n\n5.  Exploiting Android Webview UI: Write a javascript code that secretly renders a malicious web page onto the Android browser. \n\n6.  Rooting Android: Build over-the-air (OVA) updates to gain a root shell on a locked android device. The entire project was conducted using the Android VM. \n\n7.  Malware Detection using ML: You'll use MLSploit and devise a machine learning model based on extracted static malware features in order to detect an unknown malware sample.  \n\nThe projects constitute 90% of your grade with the remainder of the grade  from a cumulative final exam. Expect a grading curve with the cutoffs for this semester being:\n\nA: 80+ \n\nB: 60-79\n\nC: 0-59\n\nOn the contrary, this course had several teething problems my primary dissatisfaction being vague and unclear project requirements with the TAs constantly pestled and sought for clarifications. \n\nAll in all, I give my thumbs up as the projects were challenging and if you had an open mind you'll get to learn much. \n",
                        "rating": 4,
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-08T12:46:59Z",
                        "id": "external-import-a0999491-1596-4df7-82d5-b1df45a2a3b4",
                        "created": "2020-05-08T12:46:59Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "difficulty": 4,
                        "course": null
                    },
                    {
                        "_createdAt": "2020-04-20T05:41:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "workload": 10,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_id": "external-import-d5d66b25-06b7-4a2c-8a87-2e05880c143e",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-d5d66b25-06b7-4a2c-8a87-2e05880c143e",
                        "created": "2020-04-20T05:41:25Z",
                        "difficulty": 3,
                        "rating": 2,
                        "course": null,
                        "body": "This was the first semester this class was taught. Never be the first cohort for an OMSCS course.\n\nThe lectures are non-existent (it's all recycled videos from IIS and NS). 90% of your grade are labs and they are ok but highly variable in quality. Some labs are easy the other labs are hard but not in a good way. The instructors sometimes try to insert gotchas so students can distinguish themselves and everyone loses points for lack of clarity. If the entire class misses an objective on a lab I'm pretty sure it wasn't hard but just ill conceived. For the sake of future students I'm hoping this was due to being the first offering and the labs and content delivery matures. It's basically the result of Wenke's IIS and NS class having a baby with Taesoo's CTF class (binary exploitation). Content and style more like the former (same instructor), emphasis on labs like the latter."
                    }
                ],
                "created": "2022-07-05T23:23:15Z",
                "officialURL": "https://omscs.gatech.edu/cs-6264-information-security-lab-system-and-network-defenses",
                "codes": [
                    "CS-6264"
                ],
                "description": "This course will help students develop both in-depth knowledge and hands-on skills in a number of important cybersecurity areas, including software security, malware and threat analysis, end-point security, network security, web security, mobile security, and machine learning based security analytics.",
                "tags": [
                    "SND",
                    "ISND",
                    "ISLND"
                ],
                "id": "external-import-CS-6264",
                "_type": "course",
                "_createdAt": "2022-07-05T23:23:15Z",
                "_rev": "iLpqNfBINCDhaBRaVI7kzf",
                "_id": "external-import-CS-6264",
                "name": "Information Security Lab: System and Network Defenses",
                "isFoundational": true,
                "creditHours": 3,
                "syllabus": {
                    "file": {
                        "_type": "file",
                        "asset": {
                            "_ref": "file-476bd54a45f664fe8c0206abb24e7093cec1bd6e-pdf",
                            "_type": "reference"
                        }
                    }
                },
                "programs": [
                    {
                        "acronym": "CS"
                    },
                    {
                        "acronym": "CY"
                    }
                ],
                "slug": "information-security-lab-system-and-network-defenses",
                "rating": 3.1666666666666665,
                "difficulty": 3.8333333333333335,
                "workload": 19.166666666666668
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "information-security-lab-system-and-network-defenses"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "gsp": true,
    "scriptLoader": []
}