{
    "props": {
        "pageProps": {
            "course": {
                "_type": "course",
                "officialURL": "https://omscs.gatech.edu/cs-6460-educational-technology",
                "_id": "external-import-CS-6460",
                "creditHours": 3,
                "created": "2022-07-05T23:23:15Z",
                "codes": [
                    "CS-6460"
                ],
                "isDeprecated": false,
                "id": "external-import-CS-6460",
                "_rev": "vLev53Cwnp4JOI2CCHlG7t",
                "description": "Introduction to educational technology, with an emphasis on theoretical foundations. Introduces basic philosophies, approaches, and technologies. Analyzes issues surrounding technology's impact on education.",
                "programs": [
                    {
                        "acronym": "CS"
                    }
                ],
                "syllabusUrl": null,
                "reviews": [
                    {
                        "_id": "FYsk5S1Mp27IS8S7UrV3KK",
                        "_updatedAt": "2024-08-10T23:54:52Z",
                        "_type": "review",
                        "workload": 20,
                        "semester": {
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "difficulty": 4,
                        "course": null,
                        "_createdAt": "2024-08-10T23:54:52Z",
                        "_rev": "FYsk5S1Mp27IS8S7UrV3FD",
                        "rating": 5,
                        "id": "FYsk5S1Mp27IS8S7UrV3KK",
                        "created": "2024-08-10T23:54:52Z",
                        "body": "I took this class in Spring 2024. The course is split into two phases: an exploratory phase and a project phase. In the exploratory phase, you explore the literature in Edutech and write several papers where you summarize research and respond to prompts in the form of essays. This phase took me around 20 hours per week.\n\nIn the project phase, you can choose to either work individually or in a group. There was also an option to do research with Code.org, and this would satisfy the project requirement. You had to apply for this, and from the responses on Ed Discussion, it looks like the majority of applicants got ghosted. It was slightly inconvenient because we didn't have a timeline of when the selected applicants would be chosen, so it was hard to move forward with selecting a project because we were all hoping to be chosen by Code.org, but didn't know when or if that would happen. A couple of people asked about this on Ed Discussion, but got radio silence. \n\nAs others have mentioned, the projects are graded very leniently. As long as you turn in your weekly progress checks and make progress every week, you should have no problem getting an A from your mentor.",
                        "authorId": "4bAmToXB3t9tFYKjhRjd0Q=="
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z"
                        },
                        "course": null,
                        "_id": "0zwV6JWkoiMq9vnKyd6Mt4",
                        "authorId": "9OnNVU16JiP7Z209SFe05g==",
                        "difficulty": 3,
                        "_createdAt": "2024-08-10T14:16:25Z",
                        "rating": 2,
                        "_updatedAt": "2024-08-10T14:16:25Z",
                        "body": "Overall, I like the idea that you get to work on a project you’re passionate about. There’s no grading inconsistency like some other courses because you’re paired with a TA who acts as your mentor.\n\nHowever, there’s a chance you might end up with a TA who’s clueless about your project. I was assigned a TA who not only lacked understanding of the project I was building, but also had a condescending attitude. Interestingly, this is the only one out of four courses where I found peer feedback more valuable than the grader’s. That being said, this course could really use some external mentors, kind of like in the Intro to Health Informatics course.\n\nIf you’re looking for a reason to tackle an education-related project and aren’t banking too much on the mentor, then go for it.",
                        "id": "0zwV6JWkoiMq9vnKyd6Mt4",
                        "created": "2024-08-10T14:16:25Z",
                        "workload": 17,
                        "_rev": "0zwV6JWkoiMq9vnKyd6Mp1"
                    },
                    {
                        "created": "2024-07-30T21:18:46Z",
                        "authorId": "BiBkezga6mVxm90bW8ILAw==",
                        "body": "Honestly, I think course CS6460 has so many little and big things that should be included in other OMSCS Courses. \n\nThe Course Full Calendar with all updated links is wonderful (all OMSCS Course must have it, exactly in this course format (not other). \n\nIt is impressive that I never had an office hour in a telepresence video tool, but I did not need it, every single week action items were clear and received more than enough inputs at Ed Discussions interactions with peers and TA's. \n\nCanalize everything as possible with your mentor at Piazza.  This person must become your best guidance for the course healthy progress.\n\nI definitely and strongly recommend this course to learn how to do academic research and translate all of it into a final product or service.\n\nJust get ready on the first 4 weeks the heaviest part of the whole course is on these first weeks, later you will just move forward smoothly.  \n\nAnd before starting the course try to have a research topic described in terms of a final Educational Technology product or Service.\n\nI loved this course! Highly recommended. \n",
                        "workload": 15,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME"
                        },
                        "_createdAt": "2024-07-30T21:18:46Z",
                        "_rev": "uSG6j0nzFMARMpT3ZlYAbE",
                        "rating": 5,
                        "_updatedAt": "2024-07-30T21:18:46Z",
                        "_type": "review",
                        "id": "uSG6j0nzFMARMpT3ZlYAfC",
                        "_id": "uSG6j0nzFMARMpT3ZlYAfC",
                        "course": null,
                        "difficulty": 3
                    },
                    {
                        "course": null,
                        "_createdAt": "2024-06-05T21:05:49Z",
                        "id": "g04FYxIKjjiXwBYaQGywx2",
                        "created": "2024-06-05T21:05:49Z",
                        "authorId": "VtyRcZyoXyFfbMYeeTvd/A==",
                        "workload": 15,
                        "difficulty": 3,
                        "rating": 5,
                        "_id": "g04FYxIKjjiXwBYaQGywx2",
                        "_updatedAt": "2024-06-05T21:05:49Z",
                        "_rev": "g04FYxIKjjiXwBYaQGywu4",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester"
                        },
                        "body": "If you're reading this review then you've probably already looked up this course and sample syllabi and know the rough structure so I won't go into that much here.  No lectures, no exams, very self-paced/self-motivating (unless you choose to be part of a team for the project, then less self-motivating).\n\nEveryone has different measuring sticks for how they rate courses, so I'll do my best to justify my rating.  To me, this course was the most valuable and interesting course I've ever taken, in OMSCS and otherwise.  I could see this paradigm being adopted for many other courses in this program.  \n\nFor the project tracks, the lines delineating them are not strict and are somewhat fuzzy, but in a good way.  For example, I went the research track, so I did a bunch of research, wrote an academic paper, but also developed some prototypes using Python to illustrate different principles in the research topic.\n\nThe beginning of the course can be somewhat strenuous digging up a bunch of academic papers, reading, digesting, and writing about them.  BUT if you make sure you have at least a vague idea of your project topic from the start, then you can steer your research for these initial assignments in that direction (which I believe is the goal of these assignments in the first place).  Essentially you are doing a ton of the research up front before your project even starts.\n\nOnce those assignments are done, the schedule really becomes a lot more flexible as long as you keep up with the milestones you set in your proposal and are open and communicative in your weekly submission to your mentor.  I had a week or two where family stuff came up and I couldn't stick to my proposed schedule, but I made it up in other weeks, made sure I ticked all the boxes from my project proposal, and made sure I thoroughly and clearly stated what I had accomplished for each status update, milestone deliverable, etc.\n\nHonestly the hardest part about this course is the participation points.  I was so focused on my own research and on developing my project that I found it hard to devote enough time every week to doing helpful peer reviews.  \n\nAnyway, take this  course!  It is awesome.\n\n\nEven though the topic of your project needs to be related in some way with Education, you can spin almost any interesting topic into being applicable.  If you're interested in LLMs, then you can research/develop an LLM education bot of some sort, if you're interested in data analysis, then you can develop an experiment relating to how students do such-and-such and collect data to analyze.  \n\nIt is really a great starting point for anyone that wants to learn how it feels to do structured research (for a future PhD program or for work).  For me, I loved the entire process and learned a ton about myself, my research style, and my interests.\n\nThis is one of those courses, more so than any other course, that you really get out of it what you put in.  "
                    },
                    {
                        "created": "2024-05-29T10:12:02Z",
                        "_createdAt": "2024-05-29T10:12:02Z",
                        "_rev": "03UsYe0XQSPmVvrUc4SmqR",
                        "_type": "review",
                        "_updatedAt": "2024-05-29T10:12:02Z",
                        "semester": {
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08"
                        },
                        "body": "This is a great course! I'm surprised we don't see more reviews for this course as it is a specialization elective for two of the specializations.\n\nOverall, the assignments take a lot of time, but are easy. But if you're a procrastinator, then you have no hope. The earlier assignments require at least 18-20 pages of writing (due weekly!), so if you wait until Sunday to work on it, you're doomed.  I don't understand why anyone would rate this course with difficulty > 1. Writing papers isn't that difficult, it just takes a lot of time. \nI've read below, from other reviewers, that you'd be doing yourself a favor if you know what you want to work on beforehand. In reality, you can come into the course without having any clue. The first 3 assignments are you doing research on any areas of education/educational technology. The \"areas\" of education are pretty massive. You can do research on how to improve teaching methods, grading methods, study bias in education (why some demographics are not represented adequately) etc. After 3 assignments, you've perused through 45 articles (15 each), and read your peers' papers, up to 9 peers per assignment. So that's an additional 9 x 15 x 3 papers. You should be able to come up with a topic after getting exposure to 600 articles.\n15% of your grade is participation. If you're timely, you'll get 1.5 points per peer review, 9 peers per deliverable and 13 deliverables. That means just doing peer reviews alone, you'll get 100 points for the 15%. You can get up to 40 points by writing timely posts in the discussion board. It seems like they give 1 point per post. They say 0.2-3.0 points per post, but from my experience, a decent 4-5-sentence paragraph gets you a solid point.\nWe had two intermediate delivers for the semester-long project. You just need to come up with a 5-10 minute video for each. It's not that difficult; talk about what you did, come up with some PowerPoint slides, and spend a minute or two showing off what you got so far.\nLet's see, what else... right. The project itself is whatever you and your mentor decide. I do think this is one thing that can be improved. The projects that many of the students were doing was basically not challenging at all. One student for IM1 (Intermediate Milestone 1), presented the results of one survey they did, and then drew some conclusions. Then she said, \"I'm almost done with the project\". I was rather shocked how their mentor would let them get away with a very low-effort project. But it wasn't just her. Because we did peer reviews we can see other's works, and I think most of the students picked very easy topics/projects. I think I even mentioned that to my mentor, and they said that I'm drawing conclusions on just a few submissions, so it's not valid. To be fair, I would say about 10-15% did some very excellent projects. There were a few for sure that I think were publication-worthy.\nOk, so to wrap things up here, if you put in the effort, and don't procrastinate, it's an easy A. \"Easy\" meaning not intellectually demanding, just spending the time to research and write.",
                        "id": "03UsYe0XQSPmVvrUc4SmvW",
                        "workload": 15,
                        "_id": "03UsYe0XQSPmVvrUc4SmvW",
                        "authorId": "NY4g4d52fN39h+Un1yQDkg==",
                        "difficulty": 1,
                        "rating": 5,
                        "course": null
                    },
                    {
                        "_id": "Pm4H4xdFhHJgzHn4Z1wn7G",
                        "rating": 5,
                        "difficulty": 3,
                        "_createdAt": "2023-12-13T00:27:19Z",
                        "semester": {
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "id": "Pm4H4xdFhHJgzHn4Z1wn7G",
                        "created": "2023-12-13T00:27:19Z",
                        "course": null,
                        "workload": 13,
                        "authorId": "B2R/DEtMZGuUBgdcFgzLTQ==",
                        "body": "This is an excellent class. It operates mostly as an independent-study class and it is very different from most of the other OMSCS classes. \n\nYou will learn how to perform academic research, read and understand different perspectives, think through alternative solutions to a designated problem area. In addition, you will get the opportunity to review your peers' work and gain exposure to diverse topics in educational technology. You will also get the opportunity to learn how to present your work (via the milestone 1, 2 and final project presentations). These are all valuable skills to develop, whether it's in academia, in the workplace or elsewhere. \n\nYou can find all of the information on what's expected here: https://omscs6460.gatech.edu/fall-2023/\n\nPacing: \nAssuming a 16 week schedule, weeks 1 through 7 are dedicated to research and writing. Then, weeks 8 through 15 are dedicated to working on your project. Week 16 is where you deliver a presentation (recorded), a final paper summarizing your work and your actual project artifacts. \n\nAssignments: \nAs mentioned, the first 7 weeks are heavy on reading and writing. Assignments 1, 2 and 3 each require reviewing and citing 15-20 academic sources. This mean you'll learn how to skim and figure out the most important parts of each academic article that you are reviewing. \n\nOn my end, I wrote 15-20 pages per paper for A1, A2 and A3. For the Qualifier Question and Project Proposal, I wrote 7-10 pages each. From my experience, the writing component of the class was most concentrated at the beginning. While it can feel daunting, if you can get through that initial challenge, the pace does ease up. \n\nThe remaining assignments from week 8 onward were weekly status check-ins with your mentor, two intermediate milestone presentations where you record a video of your progress to-date. This is a good chance to practice your public speaking, communication and presentation skills. \n\nToward the end, I picked up my pace of work. So this class had a bit of a U-shaped workload for me (spike at the beginning, to get the written work done, slower-to-moderate pace for the middle, then a spike of work at the end to finish my project, get the final paper and presentation out the door, etc). \n\nI would recommend this class for someone who has an idea of what they want to create or build. It's also great for someone who really wants to divde into a specific area of educational technology. It does require for you to be able to manage your own time and deliverables and some honestly about your current skill set when choosing what to build during the semester.",
                        "_updatedAt": "2023-12-13T00:27:19Z",
                        "_rev": "Pm4H4xdFhHJgzHn4Z1wn3s"
                    },
                    {
                        "id": "hJHM1Qo6YGhDUyHpGtzAKI",
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "_updatedAt": "2023-12-09T19:04:20Z",
                        "rating": 4,
                        "_createdAt": "2023-12-09T19:04:20Z",
                        "workload": 20,
                        "_id": "hJHM1Qo6YGhDUyHpGtzAKI",
                        "created": "2023-12-09T19:04:20Z",
                        "authorId": "tTb8KqAw9Zs01vBDk45q4A==",
                        "_rev": "hJHM1Qo6YGhDUyHpGtzAGm",
                        "difficulty": 2,
                        "_type": "review",
                        "course": null,
                        "body": "This is a wonderful course if you want to develop something or write a research paper. The first part is pretty research and writing intensive, which requires a lot of time, but afterwards it gets a lot better depending on what you want to do for your project.\nI was one of the unfortunate ones who had an unhelpful mentor who eventually stopped responding. My experience in the course would've been better if there's no mentor system at all and just have TAs grade the papers. \nThe forum's surprisingly dead. I expected students to brainstorm and help each other but none of that really happened.\nOverall, I learned a lot as I was passionate about my project. Could I have learned the same amount and made the same progress on my own time? Probably. The greatest benefits from the course were the structure and the credit."
                    },
                    {
                        "_rev": "fzIldrAWHJy6U3JqBuYa4k",
                        "rating": 5,
                        "semester": {
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2023-02-20T18:23:56Z",
                        "id": "fzIldrAWHJy6U3JqBuYa92",
                        "_type": "review",
                        "course": null,
                        "difficulty": 3,
                        "workload": 19,
                        "authorId": "FF6E/PjtuWtwj7SOYrDdIg==",
                        "created": "2023-02-20T18:23:56Z",
                        "_createdAt": "2023-02-20T18:23:56Z",
                        "body": "This is the greatest class I have ever taken. For context, this is my 5th degree. \n\nIf you want to pursue a PhD in the future, then you really should consider taking this class. It is structured the same way a PhD is. \n\nYou have 3-tracks to choose from: research, development, or content. You can research an area and submit for publication. You can create your own tool or online course. You can do pretty much whatever you want.\n\nThe negative reviews for this class are a reflection of the student, not the class. ",
                        "_id": "fzIldrAWHJy6U3JqBuYa92"
                    },
                    {
                        "_id": "8TBloK0Mo9ZsPoyG1rvnWm",
                        "_updatedAt": "2022-12-16T06:14:11Z",
                        "body": "I really enjoyed this course and I'm glad I took it, but I also seriously considered dropping the course during the first three weeks. I read the reviews from past semesters, so I knew that I would be doing a lot of reading and writing during the early weeks of the course. I was still surprised by how much time I spent on the first three writing assignments. I put in probably around 40 hours on each of those assignments. I learned A LOT by doing those assignments, but I also really struggled to find the time to do them well. \n\nOnce I made it out the other side of those first three papers, the hours I put in each week were around 10-20 hours. On the heavier weeks I put in extra hours to learn things that were new to me that I needed to learn for my project (Javascript, React, asynchronous calls to APIs, web development as a whole...) so a lot of that extra time could be avoided by choosing a project that relies on skills you already have instead of one that pushes you to learn new skills. \n\nI had an excellent mentor and I felt like the whole process or proposing and then executing my project was very rewarding. I learned a lot, I really enjoyed the work, and I produced a finished final product that will be one of the highlights of my professional portfolio. \n\nI DO NOT recommend this class if you're looking for an easy course to pair with something else. For me, the best thing about the class was pursuing a project that was interesting to me, and I wanted to be free to put all my time and energy into that project. Also, the work load in the first six weeks of the class will make it very difficult to complete any other coursework.",
                        "difficulty": 4,
                        "_rev": "8TBloK0Mo9ZsPoyG1rvnSW",
                        "rating": 5,
                        "id": "8TBloK0Mo9ZsPoyG1rvnWm",
                        "authorId": "b5gqhGYJdmyoX0ymWhi20A==",
                        "_type": "review",
                        "course": null,
                        "created": "2022-12-16T06:14:11Z",
                        "_createdAt": "2022-12-16T06:14:11Z",
                        "workload": 15,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx"
                        }
                    },
                    {
                        "created": "2022-12-10T17:44:24Z",
                        "body": "This is a great class, *if* you know what you are getting yourself into.\n\nHaving the freedom to truly run with a project is great. If you come into the class with an idea of what you want to build, or what paper you want to write, you can very easily get the guidance you need to make it a reality. You do need to be aware, though, that A: you'll be spending a lot of time reading research papers and B: you will get out what you put in, more or less.\n\nThe one common criticism I see that is that mentors are hit or miss, which I imagine is true. I had a good mentor, though, and he really helped my paper grow in the ways I needed it to. I'm now working with a GA Tech professor to get my paper published in a conference, so I'm getting exactly what I wanted out of the class. \n\nWould strongly recommend if you have an actionable goal.",
                        "_type": "review",
                        "_updatedAt": "2022-12-10T17:44:24Z",
                        "_rev": "k1if27Q2SfTAO2ctPZZJpO",
                        "course": null,
                        "workload": 12,
                        "authorId": "NYOuWkXHMdgPL2r/spYhSA==",
                        "_createdAt": "2022-12-10T17:44:24Z",
                        "rating": 5,
                        "difficulty": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2"
                        },
                        "id": "k1if27Q2SfTAO2ctPZZJuF",
                        "_id": "k1if27Q2SfTAO2ctPZZJuF"
                    },
                    {
                        "body": "The course was easy and recommended while taking 1 more course together. It will defintely help you in research later on but not very interesting to me . You will get an A by doing fair hardwork",
                        "difficulty": 1,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "_id": "external-import-c2119965-d7fa-441e-8065-1b83a336a90b",
                        "rating": 3,
                        "workload": 10,
                        "_createdAt": "2021-08-13T20:59:11Z",
                        "id": "external-import-c2119965-d7fa-441e-8065-1b83a336a90b",
                        "created": "2021-08-13T20:59:11Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "body": "There's a lot of things I liked about this class but also many I disliked. \n\nFirst off the course let's you do pursue any project you like as long as it's related to education. This can be a great oppurtunity for anyone looking to add a mjaor project to their CV or wanting to pursue a passion project. At the begninning of the course you also spend some time researching a topic, as well as doing some writing exercises. I enjoyed that part a lot. In the summer you have one of these assignments every week for the first three weeks, which keeps you busy but it's doable. \n\nAs for the project. I enjoyed doing it and learned some new skills so I'm happy with that. But if I had just done it in my own time it would have been a better expierence. As others pointed out it all depends on your mentor. In my case he was just not very useful. He generally didn't know anything about the area I was pursuing and thus didn't give very useful feedback. Any request for input was evaded. I would have been happy enough if having the mentor would have been a net neutral but it caused a lot of extra work and stress as the lack of knowledge resulted in a lot of misunderstandings (especially at the beginning when I had assumed some prior knowledge in my deliverables). Having a person who knows so little about the topic grade you is pretty frustrating. As others mentioned they don't share avg grades anymore but I suspect that the grading is indeed quite random, depending on your mentor. I liked the system DVA had for grading projects a lot better.\n\nAnother thing I didn't like is how isolated I felt during the course. Slack was removed and piazza was dead so there wasn't much conversation going on. I'm sure other people had similar issues and even if not even hearing from other people would have been good.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-08-08T18:21:33Z",
                        "workload": 15,
                        "_id": "external-import-d56ab1a6-f12d-4340-9ecf-df18355eca84",
                        "id": "external-import-d56ab1a6-f12d-4340-9ecf-df18355eca84",
                        "created": "2021-08-08T18:21:33Z",
                        "_type": "review",
                        "rating": 3,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "_type": "review",
                        "_id": "external-import-e0c04629-4dc1-4777-9b5c-cb2ee6c12711",
                        "body": "As many others already said: you have to be able to motivate yourself and be self-organized, should like to research and should like to write. If that's three times \"yes\" for you, this course could be for you.\n\nThere are no (or close to zero) real lectures. The first couple of weeks are spent on researching the broad field of educational technology and summarize what you read in more or less extensive papers. Ideally this leads you to a project idea (or you come into class with the project already in mind, that would make your research more targeted). You propose a project, get approval and spend the second half of the class working on your project, supported by a \"mentor\" (TA).\n\nAs others also said... mentors are hit or miss. Maybe some of them are helpful, mine I would not call a mentor. He was a more or less responsive TA with no guidance or useful input. It wasn't a problem for me, but then they shouldn't be called mentors.\n\nI liked the class because it is open ended and it's really just about what you are willing to put in. If you picked a good project (and there's a lot of leeway regarding type of project) the second half of the class is still stressful but it's actually a lot of fun. Deliverables for the project are a video presentation, a 10 page paper plus the entirety of your project artifacts.",
                        "id": "external-import-e0c04629-4dc1-4777-9b5c-cb2ee6c12711",
                        "created": "2021-08-06T09:07:35Z",
                        "course": null,
                        "difficulty": 3,
                        "_createdAt": "2021-08-06T09:07:35Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 4,
                        "workload": 12,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "body": "Like many others have mentioned, what you get out of this course is entirely what you put into it. You start off the course with a few weeks of intensive reading/research and writing, which is actually really enjoyable if you are interested in educational technology in general. I came into this class thinking I would build a particular tool, and through my research I decided on a completely different idea.\n\nThen, after you propose a project and your TA/mentor accepts it, you spend the rest of your semester executing your idea. Obviously, this part is largely self-driven and you're essentially paying tuition to motivate yourself to actually work on your project. But if you put in the effort and decide on a project that helps you learn and grow, it's a pretty great experience.\n\nThere are downsides to this class. Unless you're REALLY ambitious with your project, you probably won't learn as much as other courses. Also, I was excited to learn from Dr. Joyner since he seemed super passionate and involved in this field. But he's basically a no-show and you'll have zero interaction with him. Instead, you'll be paired with a TA/mentor that may or may not be helpful. Mine was not, he provided zero useful feedback and was not timely with any of his responses. Luckily, he was pretty lenient on grading though.\n\nI spent around 8-12 hours/week on this class (depending on how motivated I was that week) and got an A. I'd recommend this class only if you are really self-motivated or are interested in this field. Otherwise, your time and money might be best spent on one of the other cool courses this degree has to offer.",
                        "_createdAt": "2021-05-10T04:18:56Z",
                        "workload": 9,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-c06e6749-c6ab-422b-b5fc-fd64fda65c90",
                        "created": "2021-05-10T04:18:56Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "rating": 4,
                        "_id": "external-import-c06e6749-c6ab-422b-b5fc-fd64fda65c90",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "difficulty": 1,
                        "_createdAt": "2021-04-05T17:05:43Z",
                        "workload": 15,
                        "_type": "review",
                        "rating": 5,
                        "id": "external-import-f6d4392a-26cc-43b6-a034-fd594a4853f8",
                        "created": "2021-04-05T17:05:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "_id": "external-import-f6d4392a-26cc-43b6-a034-fd594a4853f8",
                        "body": "I want to preface this review by saying that I may not be a typical OMSCS student. My undergrad was in humanities and social sciences. I love writing. I have research experience and my job requires a lot of deck/video making.\n\nThis class is a essentially a research seminar/independent study class that you take for credit. The first few assignments focus on learning about different fields related to a topic of your choice from which you create a project proposal. After that, you have a 100+ hour final project to be done over 1.5 months. For the final project, you're asked to produce video(s) about your work for your milestones.\n\nDeliverables: If you are comfortable reading and writing academic papers, you won't have any issues with writing in this class. Most of what you'll be doing is using Google Scholar to find relevant research and conduct a literature review. For the project, you don't have to make any fancy videos, but be prepared to spend some time figuring out how to talk about your work. Personally, I found it much easier to provide quality feedback to peers who had well-presented project milestones. This can help you get better input for your final deliverable.\n\nFeedback: The primary mechanisms for feedback are peer review and mentor grading. My mentor was unresponsive and provided little concrete feedback on my project. I don't recommend taking this course if you are looking for a lot of supervision on conducting your own research. Peer feedback can be hit or miss depending on how knowledgeable your peers are, how willing they are to engage with your work as well.\n\nOverall: I argue that this class is more about figuring out how to conduct and present work in an unstructured environment than learning a specific topic. You'll get a lot from thinking about the research/design/development process, which is something not every class in OMSCS can teach.",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "id": "external-import-9ff26d7f-cf16-410e-938d-2984ff5d7bc1",
                        "created": "2020-12-13T05:11:43Z",
                        "body": "This is a very different type of class for OMSCS, the first few weeks are really tough. You will need to read close to ~60 research papers and each week you will write ~20 pages summarizing your research for the week, along with an arbitrary writing assignment thrown on top as well. After you grind out the research section, you then design and propose a project related to your research. If your project proposal is approved then you have the last half of the semester to build your project.\n\nYour grade really depends on what your assigned mentor/TA thinks about your project. If you have a supportive mentor, then the class is excellent (I did), however, there were many students who had issues with unresponsive mentors who handed out subjective grades. Be careful when you get assigned a mentor and see about switching if you get a bad feeling.\n\nIt really helps to come to this class with an idea in mind or a topic space that you would like to research. It does not need to be strictly \"ed-tech\", although there needs to be an educational aspect to whatever you choose for a project. I saw a number of students build interesting tools related to AI/ML/NLP this semester, so you can really do whatever interests you and will help you grind through the research stage.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-9ff26d7f-cf16-410e-938d-2984ff5d7bc1",
                        "difficulty": 4,
                        "_createdAt": "2020-12-13T05:11:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "id": "external-import-62482f1c-9347-4428-a660-7035c5bb132e",
                        "created": "2020-12-10T16:33:13Z",
                        "workload": 12,
                        "rating": 2,
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-62482f1c-9347-4428-a660-7035c5bb132e",
                        "body": "First off, this is a superb course offered by a great teaching staff. The reason I \"disliked\" it is because I found that I'm not that interested in educational technology or writing research papers (go figure!).\n\nThings I liked:\n\n- This is essentially an independent research course where you are allowed to choose a topic and pursue either a research, development, or content based project. This type of course is traditionally not scalable since it requires working closely with a professor and/or grad student mentors. The teaching staff did an amazing job of adapting this course for the online program. I wouldn't have thought it would work, but they pulled it off.\n- The ability to choose your own project gives you a lot of control over what you get out of this course.\n- The first part of the course gives you solid experience finding research papers, reading them, citing them, developing your own ideas, and writing at a professional academic level. If you are interested in research at all you should consider taking this course, even if you're not interested in educational technology specifically.\n\nThings that could be improved:\n\n- The first few assignments have an \"activity\" component that gives you an opportunity to practice things that you will need to do later in the course. For example, you are given a research question and you need to write a literature-backed response to the question. I found these exercises to be tedious and unnecessary since we are already required to do essentially the same activity in our project.\n\nGeneral comments and advice:\n\n- The first few assignments are brutally time consuming. I found that this course actually starts off really hard but gets easier as the semester progresses which is very different from every other OMSCS course I've taken. Of course, YMMV as this depends highly on your project.\n- I feel like some of the reviews give an impression that this course is an easy A (or at least I had that impression somehow). It's not. This is a rigorous course and the expectations are set high.",
                        "_createdAt": "2020-12-10T16:33:13Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "_type": "review"
                    },
                    {
                        "created": "2020-12-09T18:10:06Z",
                        "difficulty": 5,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-12-09T18:10:06Z",
                        "_type": "review",
                        "workload": 25,
                        "id": "external-import-1c81d4d4-ac09-4fc3-a67d-d47476bcca7e",
                        "rating": 1,
                        "body": "Let me start by saying that I understand why this class is such a wonderful experience for some people. You do get to pursue your own interests and design your own project. That would be incredibly fulfilling with a mentor who is invested in you and your success or, at the very least, isn't actively working against you. If you end up with the latter, this class will be a nightmare. \n\nI was one of the unlucky students who was paired with a mentor who had no interest in me or my project and seemed to be fulfilling some sort of boot camp drill sergeant fantasy. They waited exactly 48 hours (the maximum allowed time) to respond to any questions and ignored all my other posts. This all would have been tolerable had my mentor not announced 2 weeks before the deadline that they didn't like my project direction (which they had approved and been viewing progress on all semester) and that I would most likely receive a failing grade. I put 20-30 hours a week into my project and completed it exactly to my proposed specifications. They refused to give suggestions for how to improve and ignored my request for more detailed feedback and assistance - just straight up did not respond to me. I reached out to the professor and was ignored as well. \n\nThis is my 10th and final course and I have never witnessed such unprofessional and ridiculous behavior among teaching staff. I'm enormously disappointed in this course and this is not the standard I expect from Georgia Tech. I can see how this class would be a joy with a supportive mentor, but do not underestimate how awful the situation can get if you are unlucky. Take this course with caution. ",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-1c81d4d4-ac09-4fc3-a67d-d47476bcca7e"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-bf9ad6b9-f930-44d3-aeb0-9157b0815d70",
                        "_id": "external-import-bf9ad6b9-f930-44d3-aeb0-9157b0815d70",
                        "_createdAt": "2020-12-08T16:25:16Z",
                        "workload": 30,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 2,
                        "created": "2020-12-08T16:25:16Z",
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "difficulty": 2,
                        "_type": "review",
                        "course": null,
                        "body": "The idea behind this class is excellent - you get to do research on any topic within education and create your own project. The TA assigned as your project mentor however could make or break your experience with this course. I feel like the TA I was assigned to didn't care at all.  It sometimes took more than a week just to get a response to simple but urgent questions. \n\nI put alot of work and effort every week into the writing assignments and I feel like a reciprocal effort in giving constructive feedback and fair grades was not returned. In fact, I'm 100% sure that the TA put little effort into grading my assignments because the TA's feedback was regurgitated(word for word exactly and several times)from feedback given to me by classmates using the peer feedback feature.  \n\nI understand that the TAs have plenty of papers to review but it's very lazy to 'copy and paste' feedback from the peer feedback feature to just avoid having to put real time and effort into reviewing assignments. This would be an awesome class but the TAs are hindering its value because of their own lack of effort and lazy/unfair grading habits."
                    },
                    {
                        "created": "2020-12-08T05:45:14Z",
                        "course": null,
                        "workload": 17,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "The formula for success in this class is pretty simple. Do the work = get an A.\n\nBut as this course is almost entirely defined by you, the \"do the work\" part of the equation requires introspection and personal planning. Are you the kind of self-motivated person who can put in 15-hours per week without anybody asking for specific deliverables?\n\nThe main part of the course is the 100-hour project. Ten weeks of ten-hours-per-week. In addition to that, you need to contribute to Piazza and spend time giving your classmates detailed feedback (getting you to a total of 15-hours per week).\n\nI would *strongly recommend* that you have a project in mind before starting this course. You _can_ figure out a project during the first four weeks of the class, but I think it is much better to come in with a concept already in mind. For two reasons:\n\nFirst, the research and papers in the first weeks are designed to support your project. If you start with a clear concept, your final paper should be a copy-and-paste from your earlier papers.\n\nSecond, your project has got to be interesting enough to get you to the finish line. I saw a clear difference between those projects driven by personal motivation, and those that might have seemed like a good idea but quickly became mundane. Once your project starts getting boring it's going to be very hard to keep up your effort for the full ten weeks.\n\nOtherwise, I was surprised by the inactivity on Piazza. In the other courses I've taken, Piazza was a critical lifeline. But in this course it was little more than a distraction. The instructors try hard to encourage discussion and debate, and you will pick up a lot of interesting insights. But you could ignore Piazza for a week and not miss out on anything.\n\nI read somewhere that this is a great course to finish on, and I would agree with that. Keep it in mind until you've got a great project idea, then jump in with both feet. Your project can be part of your day job, the capstone on your resume, or the hobby you always wanted to complete.",
                        "id": "external-import-9905cee4-9fe9-4290-9e49-eb1660915dbd",
                        "_type": "review",
                        "rating": 5,
                        "difficulty": 3,
                        "_createdAt": "2020-12-08T05:45:14Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "_id": "external-import-9905cee4-9fe9-4290-9e49-eb1660915dbd"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 30,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "_id": "external-import-6efc1fba-3fa4-4392-b8c8-b8ad5b2a7b28",
                        "body": "#### Context\n\nI had the privilege of not working while I was taking this course, in the summer semester without any other class and with few family obligations.\n\n#### A Lot of Writing\n\nThere is a lot of writing due during the first weeks. and reading - you'll need to read and summarize 20 peer reviewed papers to get a 10/10 or 'only' 15 papers to get 9/10 - which is still an A though. But the rubrics for the papers are quite clear and also the goal: to teach you to research - research for writing a research paper, or research for developing an application - or research for creating content. Also, the writing assignment are front-loaded in that you can - and should re-use your writing in the project proposal and in the final paper. So it gets easier.\n\n#### Choosing a Project\n\nI didn't come into the course with a project in mind - but I did latch onto my subject by the 2nd week. I discovered my subject by discussions on Piazza and with my mentor and from browsing papers and thinking how I could make a better course on a certain subject than what exists now (I chose the content track).\n\nIt's true that it could be great if you come into the course with a project in mind, but you shouldn't reject this course if you don't have a project. I learned so much in this course it's hard to list it all, but one thing I learned is that after you start reading papers you'll come up with more ideas that you have time to implement. I came into the course wondering how people find ideas for projects and came out with a project that still keeps me busy plus a few more ideas for my 'do one day' list. \n\n#### Scoping the Project\n\nWhat is nice about the project is that _the scope is whatever you decide it is!_ If you don't have 60 hours a week like I did to devote to the project, then you can propose a scope of 10 hours a week in your proposal, and if you stick to what you say you'll do, then you'll get an A.\n\n### Grading\n\nThe course is designed so that everyone can get an A. You will have to sweat to get 10/10 on the assignments, but a 9/10 on them also gives you an A. The participation grade is not easy to get full marks on. You must do all the peer reviews and ask for some extra ones, participate on Piazza in meaningful ways and participate in lots and lots of your classmate's surveys (usually not too painful)",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "id": "external-import-6efc1fba-3fa4-4392-b8c8-b8ad5b2a7b28",
                        "created": "2020-08-12T14:08:46Z",
                        "_createdAt": "2020-08-12T14:08:46Z",
                        "difficulty": 4,
                        "rating": 5,
                        "course": null
                    },
                    {
                        "course": null,
                        "created": "2020-08-10T20:07:35Z",
                        "difficulty": 4,
                        "rating": 3,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_id": "external-import-9bf52820-bc23-4e25-a4fc-028107e8d8e9",
                        "body": "This is not a traditional CS course, in fact, you can do as little or as much coding as you want because you decide what you want to do for your project.\n\nThe initial few weeks start with you doing a lot of \"research\" and writing.\n\nThis class reminded me of the technical writing class I had to take in college that I absolutely abhorred. If any of you ever recall going through that class in university and did not enjoy it, you won't enjoy this either. \n\nDespite how much I did not like this course, I am still neutral. Why is that? Because I think this course imparts valuable non-traditional skills to technical people such as effectively working without constant direction, being a clear and effective writer and communicator, and where and how to find research papers for any topic you might be interested in, and turbo read them so you know if it has any useful information you might want to pay closer attention to.\n\nIf you're hoping to be more of a software engineer working in dev ops, you will probably find nothing useful here, but if you have an interest and enjoy research, I think this course is good at exposing you to tasks require you to hone your ability to communicate and present information effectively as you'd have to do to people on the business or management side. \n\nI have to begrudgingly admit that despite having very little interest in the work I was doing for this class, and constantly regretting that I signed up due to how little I enjoyed the course, I am a better worker and person for it because it forced me to build and use skills which I do not value but are valuable to have. Without this course, I would have never bothered to pursue this type of thing on my own. \n\nTo a certain degree, I guess you could say it's like a bootcamp phd.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "id": "external-import-9bf52820-bc23-4e25-a4fc-028107e8d8e9",
                        "_createdAt": "2020-08-10T20:07:35Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 30
                    },
                    {
                        "_id": "external-import-ab2fdfa7-c8cb-47e5-9265-bd0a992db69a",
                        "body": "This class essentially revolves around a self-driven project that is educational. I would suggest entering the class with a decent idea of what you want to work on, and make sure it is educational. (Education need to be the intent of the project, not a bonus) There are three tracks to this project: Development, Content, and Research. These may overlap somewhat, but generally, you will target one of these areas. I took one that overlapped Development and Content.\n\nAs a preview for the rest of my review, I think that the absurd quantity of writing in this class overshadows the ability to work on your own project. DO NOT TAKE THIS FOR GRANTED!\n\nIn the beginning, you are assigned a TA/mentor who will be grading you and giving advice. Generally, it seems your mileage with the class may vary depending on this factor. After this, you will spend the first 33-50% of the class doing heavy research and peer-reviews into the nature of your project. The second half of the class is entirely dedicated to your project. At the end you turn your project in, present, and report on it.\nSo this is a build your own project class, and as such you ultimately decide what your working on. So why did I not give it a “Strongly Liked” label? There are a few reasons:\n\n1) I took this during summer, and the workload was really intense. I suggest not taking this class over summer as they still expect you to create a 100 hour project despite the shortened semester. \n\n2) The amount of writing and researching is RIDICULOUS. The first three weeks of class, I had to produce 20 page papers each week. 20 pages. Each week. It got a little better for weeks 4 & 5, but not much better.\n \n3) The above is because you will be forced to read no less than 15 research papers each week, 12 of which must be peer-reviewed and academic papers. Thats 45 papers in the first three weeks. You will probably have at least another 20 for the next two papers. \n\n4) You will be asked to peer review your classmates papers and give a substantial critique. They only require 4, but if you want your participation grade to be an A, you should be doing 9. No one on this planet has time to review 9 20 page papers, offer a decent critique, research their own 15 page paper, and write their own 20 pages. (Especially if they are a married, full-time employee & a homeowner) This leads to getting garbage peer reviews, and writing garbage peer reviews. \n\n5) A lot of the peer-reviewed papers I read around the development areas I was interested in were straight up terrible. They were proposals for technology that, as a developer, I can see were basically non-starters. This is frustrating because peer-reviewed research is touted as the best kind of research in this class. I found better tools and technology outside of academia, but I couldn’t cite them lest I be told they were not scholarly enough. \n\n6) The grading scheme is created such that meeting every expectation gets you a 90. To get a 100, you have to exceed expectations, which is very illusive. There are only a few graded areas where this is not the case, other than that, you must do perfect on all assignments if you want an A in this class.\n\nIn essence, do not take the amount of writing, researching, and peer-reviewing you will be doing for granted. It is very extreme, and I almost lost sight to the fact that this is a DIY project class. This is Dr. Joyner, and you may have some semblance of the amount of writing if you’ve taken KBAI or HCI. Be warned though: this takes it to a whole new level. It is, in many ways, a mini-PhD. If I learned something in the first half, it is that a PhD is not something I think I’d be interested in. \n\nOn the other hand, like I said, this is a do your own project class. Ultimately, it is up to you whether or not you like the second half of the class or not. You choose your project. My advice if you take this is: do not lose sight of the fact that, at the end of the extreme writing and research tunnel, there is a project waiting to be tackled that is ultimately up to you. You just need to stick it out until you get there.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-08-01T23:29:05Z",
                        "workload": 20,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3,
                        "course": null,
                        "id": "external-import-ab2fdfa7-c8cb-47e5-9265-bd0a992db69a",
                        "created": "2020-08-01T23:29:05Z",
                        "_type": "review",
                        "rating": 2
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-7e981452-12fe-4407-9105-8f91afbd8809",
                        "created": "2020-07-21T05:47:13Z",
                        "_createdAt": "2020-07-21T05:47:13Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 10,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "difficulty": 3,
                        "_type": "review",
                        "_id": "external-import-7e981452-12fe-4407-9105-8f91afbd8809",
                        "body": "This course was fun because you learn how to write a research paper; actually several. Like all Joyner classes theres is a TON of writing for this course. I had an EdTech curriculum idea before the course started.\n\nI suggest that you select either a technology, content, or research idea before enrolling - even if it is vague. The more personally compelling the better. Mine was very compelling.\n\nYou will be pair with a TA throughout the course. During the project phase of the class (10 weeks) you will receive a lot of intimate feedback from your TA about your project and how well you're doing on meeting mutually agreed upon expectations. \n\nDr. Joyner is the best professor in the program and he was very empathetic during the outbreak of COVID-19. He deserves a medal for not terrorizing us in March, April, and May.",
                        "rating": 4
                    },
                    {
                        "_createdAt": "2020-05-24T00:33:45Z",
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "difficulty": 3,
                        "course": null,
                        "body": "You are totally at the mercy of your TA in this class. They call them mentors but all my \"mentor\" did was critique my work and he never once offered any helpful direction on how to improve. Grading is totally subjective. There is no clearly defined criteria and my TA was rude and basically said \"I told you so\" when he gave me a lower grade at the end of the semester and when you try to challenge the grade or ask your professor for clarity as to why it was graded as such, you get totally ignored. Terrible class. ",
                        "id": "external-import-6331f894-81ff-42f4-86cc-23748768663a",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 15,
                        "_id": "external-import-6331f894-81ff-42f4-86cc-23748768663a",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 1,
                        "created": "2020-05-24T00:33:45Z"
                    },
                    {
                        "_type": "review",
                        "rating": 4,
                        "workload": 12,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2020-05-06T01:40:39Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-ef111f6d-94aa-40ed-8ead-1a25c63101f6",
                        "created": "2020-05-06T01:40:39Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "_id": "external-import-ef111f6d-94aa-40ed-8ead-1a25c63101f6",
                        "body": "I took this course last year so my memory is a bit hazy on the details/workload hours. I gave a review when I had completed the course through the class survey but I'm doing the omscentral one now. \n\nSo this is the seminal Joyner class. If you've taken one of his classes then you'll understand the style and general expectations. I've taken all of Joyner's classes because 1) they are well-ran and 2) you can tell he cares about his students and online learning. You'll review one of his papers in this course in one of the HWs if I recall correctly.\n\nFor course specifics: this is an independent study style course that is front-loaded. This course centers around creating a mini-thesis project that has something to do with educational technology. Pick your topic carefully because it will dictate the workload of the entire second half of the course. While you can take any subject you are interested in and turn it into an EdTech project try to choose something you are familiar with.\n \nThe project can involve coding, research, or content creation. It can be done solo, which I opted for. The first half of the course is very KBAI/HCI-esque style of writing papers which never feel unfair but it is a lot of work. I can't remember how many academic sources you had to research (60?) but if your topic isn't *academic* enough you might have a difficult time getting to required amount like I did. Once you are onto the second half of the course you can focus on content creation which was enjoyable. No exams which is nice but there are milestones comprised of presentations that require a basic recording setup. Overall I enjoynerd this class."
                    },
                    {
                        "_id": "external-import-f5f6439b-f3f8-46b5-9675-2150fa961611",
                        "body": "The mentor makes or breaks this experience. Quality and objectivity varies wildly. Research should be a rich discovery experience in my view - to reduce it to formulaic pedantry undermines the whole purpose.\n\nLots of articles - too many? - to read and report on with a very heavy start initially. After the first half it's essentially self-paced work with substantial work deliverables for milestones and especially the final submission. Really easy to put in >25 hrs a week, sometimes ~50 on crunch weeks, based on your passion. Some \"cool cats\" put in <10 hrs a week but I think they miss the point...\n\nResearch track can be dry; more a case of \"do more surveys\" than an insightful analysis of new theory. Content track almost universally takes 2-3 times more than expected so I'd be hesitant to commit here unless you have substantial content creation experience and workflows \"down\". On web dev, similar challenges ref work estimation, to get a quality project \"stood up\" in less than 100 hours is also problematic.\n\nJoyner, as always, is a breath of fresh air in OMS. Sincere, authentic, helped with flexible Incomplete for those suffering with Covid-19. The gold standard for online Profs involvement and course mgt.",
                        "difficulty": 3,
                        "id": "external-import-f5f6439b-f3f8-46b5-9675-2150fa961611",
                        "created": "2020-05-02T08:51:56Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 2,
                        "workload": 30,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "_createdAt": "2020-05-02T08:51:56Z"
                    },
                    {
                        "created": "2020-01-20T08:46:01Z",
                        "_createdAt": "2020-01-20T08:46:01Z",
                        "workload": 10,
                        "_id": "external-import-bc0190c7-453e-433f-8185-3e53d446b8a4",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 2,
                        "id": "external-import-bc0190c7-453e-433f-8185-3e53d446b8a4",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 3,
                        "body": "Its a decent subject with manageable workload and good curriculum. You need to make sure you don't procrastinate and you will get a good grade relatively easy. \nJust one thing that can change is their definition of mentor. They assign \"mentors\" to you for entire sem but that is basically a TA who is going to grade your submissions and not a mentor in proper definition of the term, but an designated TA. Just remember this part and you will be fine with this subject.",
                        "course": null
                    },
                    {
                        "_id": "external-import-dff90f0d-bd4c-4280-8487-de6731e4cdbb",
                        "rating": 5,
                        "body": "You should probably take this course.\n\nIt's unique in the program in that you get to work on a project (research, development, or content-based) that you can actually go do something with. Ideally, go into the course with something in mind. If you like guitar, do a guitar-playing app or website. If you are interested in something else, do something else. Try out some different tools that are out there and figure out what is missing that you can provide. Then take the course and implement it.\n\nJoyner mentioned that if it were up to him HCI would be people's first course and EdTech would be their last, and I think this is a good idea. He also mentions that HCI should be considered a soft prerequisite for EdTech, and this seems fair too. Take HCI first if you can. If you can't, don't worry about it too much.\n\nThere is a lot of writing required, and a lot of it has nothing to do with your actual project. This can be a little frustrating if you are excited to get cracking on your actual project (which hopefully you are!) If you hate writing, this isn't the class for you.\n\nAnyway, it's a great and unique class. It's one of the only ones where you can actually have something to show potential employers or friends or anyone else. For that alone, I'd recommend it.",
                        "created": "2019-12-09T14:47:53Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2019-12-09T14:47:53Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 15,
                        "id": "external-import-dff90f0d-bd4c-4280-8487-de6731e4cdbb",
                        "difficulty": 2
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_id": "external-import-6e3f143d-f9b7-49f2-9d19-b35ae1d8a33d",
                        "body": "This is my favorite course so far. I'm 4 courses in and I liked this one so much that I took the HCI class after it, which has a somewhat similar format and the same professor. This course is often called the mini-Phd and it definitely felt that way so if you're into the academic side then this is the class for you.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-6e3f143d-f9b7-49f2-9d19-b35ae1d8a33d",
                        "created": "2019-11-06T18:20:42Z",
                        "workload": 12,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        },
                        "_createdAt": "2019-11-06T18:20:42Z",
                        "rating": 5,
                        "course": null,
                        "difficulty": 4
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "difficulty": 3,
                        "id": "external-import-9784686d-03fb-4144-8d84-86fcc8cf3d5b",
                        "created": "2019-10-31T19:53:28Z",
                        "_id": "external-import-9784686d-03fb-4144-8d84-86fcc8cf3d5b",
                        "workload": 16,
                        "body": "I love this course. It was my first experience really digging into academic literature to explore a topic, and I thought that was super interesting and valuable. You need to be an independently motivated student to succeed, moreso than in other classes, as this course is essentially an independent study with some extra structure to help you get there.\n\nYou spend the first third or so of the course exploring Ed Tech literature, reading a ton of papers looking for an area that you find interesting, and proposing a project idea. The rest of the course is spent working on an Ed Tech related project (optionally a group project, but most people seemed to go solo) that you turn in at the end, with some milestone assignments along the way.",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-10-31T19:53:28Z"
                    },
                    {
                        "semester": {
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z"
                        },
                        "course": null,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 4,
                        "workload": 18,
                        "_id": "external-import-cad1f352-b46d-43b3-b09c-34988e625d88",
                        "body": "This is one of the most polished, organized courses that I’ve taken thus far, in or out of OMSCS. The bulk of the semester is devoted to a project of your choosing, on your own or as part of a team (if you want a team, go looking for one early), which can be a research project, educational content project, and development project. You will break down the tasks into a schedule for the semester with help from your mentor, but whether it’s a normal Fall/Spring semester or accelerated Summer semester you’re expected to put in 100 hours of work. This can be a great way of integrating things you’ve always wanted to learn into a project. Just be careful that your project clearly fits into Educational Technology, and can be supported by scholarly articles.\n\nThe course is modeled after a PhD program, with extensive writing assignments early in the semester intended to bring you closer to deciding on a project topic. Even if you enjoy writing, as I do, taking these assignments seriously could lead to some sleepless nights (from experience). On the other hand, I really enjoyed the Peer Feedback system, which gives exposure to others students’ projects and gets feedback for your own assignment. Even though there are no office hours, Dr. Joyner makes up for it by being very active in the forum, and the TAs are usually available to answer questions on the Slack channel. Each student is assigned a mentor who will grade and provide feedback for all assignments; mine was mostly supportive throughout the semester, just make sure that you’re honest with them about your progress along the way.",
                        "_createdAt": "2019-08-02T22:18:29Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-cad1f352-b46d-43b3-b09c-34988e625d88",
                        "created": "2019-08-02T22:18:29Z",
                        "rating": 4
                    },
                    {
                        "id": "external-import-6226e085-77ac-4702-b2d9-02cfbf7fa5d2",
                        "rating": 5,
                        "_id": "external-import-6226e085-77ac-4702-b2d9-02cfbf7fa5d2",
                        "_createdAt": "2019-07-31T03:04:10Z",
                        "semester": {
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z"
                        },
                        "body": "## Most fun I've had in the OMSCS program yet \n\nI've been in the program since 2017 and this course was so enjoyable. I saw other reviews which seemed to indicate that they had a really bad experience with their TA, but the experience I had with my TA was great. The beginning of the course helps you do pre-requisite research around your project, and it helped  me improve the quality of my project a lot (I created a MOOC on Udemy for DevOps tools). \n\nThis course gave me the ability to do what I would do in my spare time anyway, and it was structured enough to where I wasn't totally floating around aimlessly. \n\nI would say that this course is probably a lot more fun if you go into it with a project idea already. Maybe something you've been wanting to do on the side but haven't had time.",
                        "difficulty": 2,
                        "created": "2019-07-31T03:04:10Z",
                        "_type": "review",
                        "workload": 9,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "id": "external-import-7bdd0d13-408c-4cc2-ac88-0737dad4b88f",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-7bdd0d13-408c-4cc2-ac88-0737dad4b88f",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "created": "2019-07-24T01:46:52Z",
                        "_createdAt": "2019-07-24T01:46:52Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "difficulty": 2,
                        "course": null,
                        "workload": 8,
                        "body": "Use this class as your 'elective research' class, as long as its vaguely related to educational technology. I used it to prepare for interviews and GA by creating interactive notebooks for algorithims preparations. It is extremely open-ended, and I could see myself using this class to work on a fun pet project under different circumstances.\n\nI'd also suggest pairing it with something else. Definitely a well run Joyner class, and I appreciate the openness to work on your own stuff. Writing is less than HCI. The degree of development work you want to do is up to you."
                    },
                    {
                        "workload": 10,
                        "_id": "external-import-2ac3547f-03e9-4ad8-b258-60dd002b5680",
                        "id": "external-import-2ac3547f-03e9-4ad8-b258-60dd002b5680",
                        "created": "2019-07-15T14:07:12Z",
                        "_createdAt": "2019-07-15T14:07:12Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 4,
                        "body": "## pros\n\nthis is an awesome and very unusual course. I like it because it forces you to really be an individual about what you want to get out of it. You can choose to be boring and write a bunch of papers that no one will read, I think that's fine. But _if you choose_ you can build something that you think will really matter. \n\nMake no mistake, this class will be a bunch of work no matter which way you go, I just think it was good work to do, a nice change of pace from the typical course because you get to build the project you want, not one that's given to you. You also get to do a good bit of academic writing at the beginning and learn a bunch at the beginning. \n\n## cons \n\nI think the peerfeedback requirements are kind of annoying, It felt way more like a chore when i'm forced to give my colleagues feedback, I'd very much like to have some kind of project / paper showcase at the end of the semester than randomly give feedback throughout to incomplete projects.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3
                    },
                    {
                        "created": "2019-07-08T20:08:34Z",
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "course": null,
                        "id": "external-import-428b645e-bcb3-4056-ab95-b4e226b173aa",
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-428b645e-bcb3-4056-ab95-b4e226b173aa",
                        "_createdAt": "2019-07-08T20:08:34Z",
                        "workload": 8,
                        "body": "This class is entirely what you make of it. The beginning assignments assignment essentially push you to do research, along with gathering the correct materials for your final project. Then, you get to propose your own idea, which can either be a development based project(an actual working piece of software), a research based project(research paper where you gather data by interviewing, surveying, etc), or a course construction. I personally chose to do a research based project, and I didn't find it all that difficult. The class is very self driven, so it is what you put into it. I would take this with another class if I could go back",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "workload": 10,
                        "_id": "external-import-656c0ffc-5ddd-412b-8676-06216d25ab50",
                        "course": null,
                        "_createdAt": "2019-05-21T00:14:23Z",
                        "id": "external-import-656c0ffc-5ddd-412b-8676-06216d25ab50",
                        "created": "2019-05-21T00:14:23Z",
                        "rating": 3,
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "body": "Not as bad as a lot of other classes.\n\nFirst couple of weeks are rough because you have to read so many papers, write about them, and cite them properly. Grueling work, and not enjoyable. I particularly hate doing citations.\n\nAfter you've gotten a project planned out and approved, the workload is what you make it, and if you've planned it out well, the workload won't be so demanding or frustrating.\n\nFinal project deliverables include a video presentation and a paper in SIGCHI format. I recommend doing the paper in LaTeX, and the citations using BibTeX. Saves a lot of time when you have to iterate.",
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 12,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "difficulty": 3,
                        "_createdAt": "2019-05-13T18:12:19Z",
                        "body": "As you probably know, this course is structured around one independent project. It starts out with 5 lengthy weekly assignments which mostly involve coming up with an idea and gathering references. There are 2 intermediate milestones where you demonstrate your progress, then a presentation and final paper. \n\nIf you have an idea you want to work on and are good at pacing yourself independently, this will be a good class for you. I ended up changing the project I worked on at the last minute and was not very disciplined about working on my project consistently so I didn't enjoy this class as much as other people did although I ended up doing well in the end.\n\nThe grading policy is very explicit about what you need to get an A, and you usually have a chance to revise your work if you get below a 90, so as long as you do the work you will get an A.",
                        "_type": "review",
                        "id": "external-import-4ab13e0d-0d47-434f-a9ea-7dbf4dc2b503",
                        "created": "2019-05-13T18:12:19Z",
                        "rating": 3,
                        "_id": "external-import-4ab13e0d-0d47-434f-a9ea-7dbf4dc2b503"
                    },
                    {
                        "_createdAt": "2019-05-11T06:09:10Z",
                        "id": "external-import-868bcccd-f7d1-43a1-abfe-3adc0bf3456d",
                        "created": "2019-05-11T06:09:10Z",
                        "difficulty": 3,
                        "course": null,
                        "body": "You can choose whatever project related to Educational technology. A lot of writing, and your grade relies on the TA.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 15,
                        "rating": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "_id": "external-import-868bcccd-f7d1-43a1-abfe-3adc0bf3456d",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-f6825296-0c5e-4bc8-b79a-f8826290ed48",
                        "created": "2019-05-08T07:28:28Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 8,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 3,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "body": "This is basically a mini-research course where you go from researching about an area you are interested in, collecting resources, to proposing your own idea and then doing it as a project. Most of the projects are related to \"education\" in general. For me, the most time-consuming part was the collection of resources. I (unfortunately) chose a topic which did not that many academic papers, so I had to search a lot to just satisfy the basic requirement of no. of references for the proposal. Every week, your mentor will give you feedback and you will work based on that. If you have a project you want to do and want to experience how a to do proper research-based work, take this course. If you do not have a project topic in mind before coming into the course, you might have some difficulty in choosing one. This course is usually done in combination with a difficult course as the workload (IMO) of this course is very less. But that can again depend on the project you are doing in this course.",
                        "difficulty": 1,
                        "_createdAt": "2019-05-08T07:28:28Z",
                        "course": null,
                        "_id": "external-import-f6825296-0c5e-4bc8-b79a-f8826290ed48",
                        "_type": "review"
                    },
                    {
                        "difficulty": 2,
                        "_createdAt": "2019-05-07T20:31:00Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 1,
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "workload": 18,
                        "created": "2019-05-07T20:31:00Z",
                        "body": "There are no exams. You can choose almost what you want within educational technology for your own project in this course. The grading and your learning experiences depend almost 100% on your assigned mentor. So taking 6460 is like gambling, but generally, you won't get a grade lower than B. There're not many students who are trying to get registered for this course and the waitlist is usually very short, so I still recommend this course as a first course...",
                        "_id": "external-import-fb456fe5-ca24-4fd7-a8a6-0a32d539d982",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-fb456fe5-ca24-4fd7-a8a6-0a32d539d982"
                    },
                    {
                        "created": "2019-03-26T20:14:02Z",
                        "body": "It is up to you how much you will work here. I chose a relatively big project, and I did it alone. It was a nice experience, but a lot of work.",
                        "course": null,
                        "workload": 30,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-b1cc17ef-3be1-4c14-a593-b41dec3c9482",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-b1cc17ef-3be1-4c14-a593-b41dec3c9482",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "_createdAt": "2019-03-26T20:14:02Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-8927715c-bac0-43b0-b0f9-44d6f8ba1a7f",
                        "_id": "external-import-8927715c-bac0-43b0-b0f9-44d6f8ba1a7f",
                        "body": "This is the worst class I have ever taken in my life. I take this course because I want to satisfy the requirement of II Specialization. The course is strongly controlled by the teaching assistant, the homework/project is boring and time consuming. You can not learn any thing from this course but waste your money. The grading criteria is not consistent between different TA and some of them are abusively using their power since the grading is totally subjective. They even disabled you to see the grade distribution in canvas! Some students posted complaints on  piazza and the complaints were deleted immediately(there is no dirty words, just complaining their TA is unfair). I strongly recommend the professor check the TA's quality before letting students to take this class.",
                        "_createdAt": "2019-02-24T17:23:47Z",
                        "workload": 15,
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "created": "2019-02-24T17:23:47Z",
                        "_type": "review",
                        "rating": 1
                    },
                    {
                        "id": "external-import-30c7f742-aa34-4fe7-940e-6ffd78af72c4",
                        "created": "2019-02-16T21:55:21Z",
                        "_createdAt": "2019-02-16T21:55:21Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "body": "Would you risk letting a younger, less experienced fellow student grade you, give you advice on a topic in which you are an expert, and potentially fail you?  That's what you are risking when you sign up for Ed. Tech.\n\nIn this class you pick a research project and spend the entire semester working on it.  There is a written assignment every week.  The assignments are all similar: write about a topic, use about 30 formal references.  Week one you write about previous class's topics.  Week two, a general topic.  Week three, a more specific topic.  Week four, a problem in your topic.  Week five, your topic.  Week six, your project.  Etc, etc.  You get a lot of formal writing practice.\n\nThere is no textbook, no lectures, no office hours, no tests, and no required readings.  There is also no rubric or instruction.  One person does all your grading.  Your grade is entirely based on whether you 'meet her expectations'.  In my case, my grader had expectations that she could never explain.  Fail.\n\nI love to learn, but didn't learn in this course.  It's just writing practice.  I'm an excellent writer, published author, and a straight A student.  I've never strongly disliked a course before this one.  \n\nThis is the second highest rated OMSCS course, because it can be a lot of fun to work on something you love with a supportive, helpful mentor.  But if you get a mentor who disagrees with you, has poor teaching skills, or is just plain overworked, this class is a depressing hazing ritual.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 30,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3,
                        "_id": "external-import-30c7f742-aa34-4fe7-940e-6ffd78af72c4"
                    },
                    {
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_id": "external-import-b8fde96e-3028-4872-add8-b6f5fd42c355",
                        "_createdAt": "2019-02-06T08:01:21Z",
                        "id": "external-import-b8fde96e-3028-4872-add8-b6f5fd42c355",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "workload": 15,
                        "body": "I would say this course is the worst course in OMSCS program, maybe the worst cs course in the world. The course is useless if you want to pursue a career in CS, the homework is all about writing and just waste your time. I would suggest OMSCS terminate any course designed by David Joyner, since it will have a negative effect on the reputation of cs program.",
                        "created": "2019-02-06T08:01:21Z",
                        "rating": 1,
                        "semester": {
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z"
                        }
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "body": "Totally a trash. TA doesnt know a thing and you will receive a random score depending on TA's mood. Format, format, format. It is basically the only important thing for this class",
                        "_type": "review",
                        "created": "2019-02-06T02:03:48Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 1,
                        "_id": "external-import-02810167-9f86-41ad-9851-fdeb618d7a8b",
                        "difficulty": 1,
                        "_createdAt": "2019-02-06T02:03:48Z",
                        "id": "external-import-02810167-9f86-41ad-9851-fdeb618d7a8b",
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        }
                    },
                    {
                        "workload": 20,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-d9a66aa9-fa4a-4ba0-a066-76f3a5126368",
                        "_createdAt": "2019-01-16T10:05:13Z",
                        "body": "I really loved this class, but I had a project I wanted to make 2 years ago, so it was the perfect excuse. I spent much more than 20 hours a week, but that was my own obsession with the project. 10 hours or so is enough for most if you do not have a passion project. I've taken 4 courses so far, this was the most well run and fairly graded(essays are allowed to be rewritten and the TAs are very responsive).\n\nI would only take this course when you know exactly what you want to do; otherwise you will be rather lost and it would be a shame; 2 semesters later I am still working on this project and this year I will make it public. I wish most courses on OMSCS were like this one; but non of them are so leave the happiness for the end, I cannot stop comparing this course to the others ones now :(",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "created": "2019-01-16T10:05:13Z",
                        "_id": "external-import-d9a66aa9-fa4a-4ba0-a066-76f3a5126368"
                    },
                    {
                        "created": "2019-01-03T01:53:34Z",
                        "course": null,
                        "workload": 15,
                        "_id": "external-import-ac798762-46f1-4cf6-946b-20ebfa60bbe9",
                        "id": "external-import-ac798762-46f1-4cf6-946b-20ebfa60bbe9",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_createdAt": "2019-01-03T01:53:34Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_type": "review",
                        "body": "This course is the best I've taken so far. I loved the format (less lecture more research and writing), but I love writing. This is what Graduate courses should be like. Dr. Joyner's passion for EdTech and drive to make online learning the best it can be is very obvious. He was very active on Piazza. I have never met any professor who solicited more feedback and wanted other's ideas than Dr. Joyner. \n\nTA's do a lot of work in this course due to the projects and amount of writing. I doubt that grading is consistent across TAs - it will depend on your fit with your TA's communication style and the TA's prior experience (more experience = higher expectations). I felt a bit lost on the project proposal, then as I learned more I could not change the way-too-large scope of my project. I wish I had asked more questions before project proposal and was less ambitious! \n\nOverall, great course that will help you polish your writing skills to a respectable level to submit to a journal or conference."
                    },
                    {
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        },
                        "body": "I took it fall/2018. This course is a research track course, so we need to find ideas of what you want to contribute in educational field. I took a development track in my research, so I had to develop small prototype. If you choose development track, it is good to setup the framework beforehand. \nOverall this course has a lot of reading and the writing, which is consumable.\nI personally loved class, because this was only class where I can apply my creativity.",
                        "difficulty": 3,
                        "rating": 5,
                        "created": "2018-12-27T06:18:04Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 9,
                        "course": null,
                        "_id": "external-import-30d7b8b8-1a9c-4d73-ad2e-84a20ea7d7a0",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "id": "external-import-30d7b8b8-1a9c-4d73-ad2e-84a20ea7d7a0",
                        "_createdAt": "2018-12-27T06:18:04Z"
                    },
                    {
                        "_type": "review",
                        "id": "external-import-ea12adac-3f62-406c-9841-01f5e6a91126",
                        "_id": "external-import-ea12adac-3f62-406c-9841-01f5e6a91126",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4,
                        "course": null,
                        "created": "2018-12-17T17:48:02Z",
                        "_createdAt": "2018-12-17T17:48:02Z",
                        "workload": 20,
                        "body": "This course is great for self-starters and creative thinkers.  I recommend taking the course with an educational project in mind.  By taking your research, development and participation seriously, you can get a lot out of this course.  Invest some time and effort.  Don’t rely on handholding, although there is help if you really need it."
                    },
                    {
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-1dc80d32-39f6-418e-9ff5-a46291e3c51f",
                        "_createdAt": "2018-12-16T07:05:10Z",
                        "id": "external-import-1dc80d32-39f6-418e-9ff5-a46291e3c51f",
                        "created": "2018-12-16T07:05:10Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "body": "Simply put. Awesome class, awesome professor, awesome TAs. And definitely awesome students.\n\nThis is not your average or regular class. It tries to build your focus on Educational Technology and then prepare you for your related project. All the while Dr Joyner and the TAs make it worthwhile. Piazza interactions are regular and there are different optional weekly activities where you can touch upon various strides in Educational Technology, all the while keeping up with the course.\n\nYou can take up a project which can be either research, content, or development of a tool. Its worthwhile to mention if you have something in mind already you are better prepared and can utilize the beginning weeks to hone it further. There will be a mentor for each student, do make use of consulting and clarifying in need.\n\nOverall course was fun and I enjoyed it.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 9
                    },
                    {
                        "_createdAt": "2018-12-11T20:56:10Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "workload": 15,
                        "created": "2018-12-11T20:56:10Z",
                        "_id": "external-import-05661774-f593-41fd-9374-8aa37b5cfb94",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "body": "Fall 2018\n\nGreat course. It introduced me to Google Scholar and digging into research papers",
                        "difficulty": 3,
                        "rating": 5,
                        "id": "external-import-05661774-f593-41fd-9374-8aa37b5cfb94",
                        "_type": "review",
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        }
                    },
                    {
                        "_type": "review",
                        "id": "external-import-4b991745-708a-4865-a967-349e2d91ef32",
                        "created": "2018-11-18T20:45:49Z",
                        "rating": 4,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "body": "If you feel comfortable reading / writing and coming up with your own project, you will do well and enjoy this class. This class, more than others, depends on how much you put into it. I would've loved to put more into it but I'm overall satisfied with what I learned, and the project I ended up doing research on.",
                        "_createdAt": "2018-11-18T20:45:49Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_id": "external-import-4b991745-708a-4865-a967-349e2d91ef32",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "_id": "external-import-c7c875af-be6c-4292-aeab-124fa256ca61",
                        "course": null,
                        "rating": 4,
                        "difficulty": 4,
                        "_createdAt": "2018-08-16T15:01:56Z",
                        "semester": {
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "This course is tough especially if you do not have an idea of the project you are going to work beforehand. This was my case, so I took the first three weeks to decide what was going to be my project so I was in a little disadvantage.\nOnce you know the project is very straightforward. It is not difficult at all just a very heavy workload.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 30,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-c7c875af-be6c-4292-aeab-124fa256ca61",
                        "created": "2018-08-16T15:01:56Z",
                        "_type": "review"
                    },
                    {
                        "created": "2018-08-15T14:07:39Z",
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-8cb61450-7c95-4f8f-ad52-4a28bf67745a",
                        "course": null,
                        "_type": "review",
                        "body": "As always, Dr Joyner is awesome. All of his courses are very well organized.\nHe did a very great job creating a mini PhD-like course.\nThe idea of the course is for you to get a feeling of how would it be to pursue a PhD, to get a feeling of the researching activity. \n\nI enjoyed the course and got what I expected in terms of research experience.\n\nIt has consumed more time than I expected in the project, but this is totally up to you, it is possible to spend as many hours as you want.\n\nThe only downside I can mention is about my TA. Although he was answering and participating, I felt he was always shallow and not very helpful, he did not provided many insightful advices.",
                        "rating": 4,
                        "id": "external-import-8cb61450-7c95-4f8f-ad52-4a28bf67745a",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_createdAt": "2018-08-15T14:07:39Z"
                    },
                    {
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-fc082e27-a7d9-4d02-9927-a564f421c8cb",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb"
                        },
                        "workload": 10,
                        "id": "external-import-fc082e27-a7d9-4d02-9927-a564f421c8cb",
                        "created": "2018-08-10T11:59:36Z",
                        "_createdAt": "2018-08-10T11:59:36Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "body": "This course is pretty much a self study. You research a topic for the first half of the course, and then create a project to work on for the second half of the course. This project can be done in groups of your choosing.",
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null,
                        "_id": "external-import-78d72ca4-1b1f-454c-9162-9bf6c83ea06b",
                        "body": "This was a very unique course. It's basically a PhD condensed into a single semester. I learned a lot about the process of doing research towards a PhD but not much about actual education technology. The course format and general set up is cool and it's useful tof work on a project that you can get regular feedback on.",
                        "_createdAt": "2018-08-08T16:44:40Z",
                        "_type": "review",
                        "rating": 4,
                        "id": "external-import-78d72ca4-1b1f-454c-9162-9bf6c83ea06b",
                        "created": "2018-08-08T16:44:40Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 10
                    },
                    {
                        "id": "external-import-457f67c9-56d1-493a-b49b-124332f007aa",
                        "created": "2018-08-06T15:07:52Z",
                        "_createdAt": "2018-08-06T15:07:52Z",
                        "rating": 3,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu"
                        },
                        "_id": "external-import-457f67c9-56d1-493a-b49b-124332f007aa",
                        "workload": 22,
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "body": "I have taken this class in Summer 2018 and, I must say, I'm unimpressed. I had read it was fabulous, but I didn't really enjoy the course, and I seem to have wasted an enormous amount of time in apparently not-useful tasks.\n\nThis course requires you to absolutely know what you'd like to do and HOW to do it BEFOREHAND. It's quite hard to learn how to do something (e.g. some advanced development, or the research process, or creating content) WHILE during the course. My mentor was absolutely useless in the process, I was left on my own but I didn't understand what the target was. Actually, I don't know whether my issue was with the class itself, or with my mentor.\n\nAdditionally, the Summer term is too short for this course, doesn't let you digest the information you need in a calm fashion.\n\nSome people in the class obviously leverage the class to create some interesting project that they would do anyway, either for their jobs or for their leisure, but the amount of time they pour into such projects is enormous and you simply can't afford to stay in the same league as theirs.\n\nI think the class has a lot of potential, but it's a source of dismay and frustration for whoever is not already \"in tune\" with it. Clearer objectives and expectations would be nicer.\n\nSummarizing: \n1) this class is mentor based. If your mentor is not great, or doesn't like you, it can give you a though time. \n2) Do what you ALREADY know how to do if you want to succeed. Don't do research if you've never done research. Don't do content if you've never created a course. Don't do development if you can't code."
                    },
                    {
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "course": null,
                        "body": "If you are the type of person that needs instructions week in week out then this course would probably not be a good fit. I think individuals are also more likely to achieve more out of this class if you had a broad idea of what you wanted to work on coming into the course. From the get go you are pretty much working on the initial stages of your final project up until submission at the end of the semester.",
                        "_id": "external-import-5a639e09-cbe3-4fdb-a10c-ee8cfbc76788",
                        "_createdAt": "2018-08-06T13:24:16Z",
                        "difficulty": 3,
                        "id": "external-import-5a639e09-cbe3-4fdb-a10c-ee8cfbc76788",
                        "created": "2018-08-06T13:24:16Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 10,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu"
                        }
                    },
                    {
                        "body": "This course should be mandatory for all OMSCS graduates, as you get to contribute back to the educational community at the end.  It is extremely well ran, probably one of the best ran courses in this entire program.  Dr. Joyner is a natural when it comes to education, the guy is simply an awesome professor.  You have to do a lot of research and also write a lot throughout the course, but you get to pick the research and thus what you write about.  You are able to work within a team or solo, and I decided to work solo, given that I had an educational project which I have wanted to work on for years now.  You will learn how to read scientific papers in this course, and also how to write one, which is extremely valuable, especially if you plan to take courses such as Reinforcement Learning, which require you to read a ton of scientific papers.  Educational Technology is structured as a mini Ph.D. course, so if you plan on doing a Ph.D., you should probably take this course.\n\nNote, the last four weeks are the most time consuming, as this is when you will be working on your final project, which easily exceeds 100 hours.",
                        "difficulty": 2,
                        "_createdAt": "2018-08-06T12:41:22Z",
                        "created": "2018-08-06T12:41:22Z",
                        "workload": 12,
                        "_id": "external-import-48fae8da-476f-4093-9371-4e6e57e3ecbe",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "_type": "review",
                        "id": "external-import-48fae8da-476f-4093-9371-4e6e57e3ecbe",
                        "rating": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        }
                    },
                    {
                        "body": "This is my second course with Dr. Joyner, and I strongly recommend it overall. You will need to keep track of your progress and the deadlines, but if you put in a good 16 hours a week, then you'll do fine.\n\nI chose the research path and very much enjoyed the worked that I did on virtual reality for learning. You'll pick your own topic and the path you want to go down. The options are Content Development, Build an application, or do research. \n\nIn the end, I thought this was a great class and I would do it again if it were an option.",
                        "created": "2018-08-05T20:04:52Z",
                        "_type": "review",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "course": null,
                        "id": "external-import-004698f9-7020-4766-8479-a2e109a84413",
                        "_createdAt": "2018-08-05T20:04:52Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 12,
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        },
                        "_id": "external-import-004698f9-7020-4766-8479-a2e109a84413"
                    },
                    {
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "id": "external-import-4b57555e-58d8-478d-a702-1317f4c4501c",
                        "difficulty": 3,
                        "_createdAt": "2018-08-05T15:34:52Z",
                        "rating": 3,
                        "_id": "external-import-4b57555e-58d8-478d-a702-1317f4c4501c",
                        "body": "A largely self-directed semester, you propose your project, choose whether or not to acquire teammates, write your own deliverable schedule, then deliver it. You can produce a research paper, a software demo, or a short online course. Your focus can be any subfield of educational technology.\n\nI did a research track solo and would only recommend that for to-the-bone introverts. Since literally _no one_ else in the class is doing (or paying attention to) your thing until the very end, it got surprisingly lonely.\n\nOn the research track you'll learn a lot about source and reference management with software such as EndNote, how to make the web great again through the GT VPN & Library which unlock every academic database known to man, and how to make a great looking academic paper in LaTeX or even Word.",
                        "created": "2018-08-05T15:34:52Z",
                        "workload": 10
                    },
                    {
                        "created": "2018-08-04T10:43:23Z",
                        "_createdAt": "2018-08-04T10:43:23Z",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu"
                        },
                        "_id": "external-import-38907e12-a897-4bde-9294-d0b381580445",
                        "course": null,
                        "workload": 28,
                        "body": "This class is a must-take in this program. It's the only class when you come up with a project yourself (there is a process that helps you do that) and then work on it for the remainder of the semester.\n\nOne very important tip: do not focus on the points in this class. Forget about them. Focus on creating something great. Be ambitious. Make something that you will be proud of. You can even use this class to build a product for your future startup, to learn the technology that you always dreamed of learning, or to help a cause that you care about. You are the one that can define this class for you. You can make it an easy filler class without much substance or something extraordinary that can jump-start your future. \n\nNote that the workload that I indicated is quite larger, but only because I decided to work as much, to achieve the goals that I had for myself. I could have easily worked 5 hours a week and still got an A.",
                        "id": "external-import-38907e12-a897-4bde-9294-d0b381580445",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 5
                    },
                    {
                        "difficulty": 3,
                        "body": "As expected from a Dr. Joyner course, student and instructor engagement set the standard for OMSCS courses.  Dr. Joyner is active and thought-provoking and the weekly updates help steer you through the course.  \n\nBottom-line: The course is about using academic research to advance the field of EdTech.  If you want to do a research project and feel comfortable reading / writing and coming up with your own project, take this class.  I used this course to learn about some front-end development and used some product management methodologies (survey,  user research, and rapid prototyping) I learned from HCI.  What I liked about this class is that I learned how to use academic research and how to integrate those ideas into a solution.  Lastly,  this class, more than others, depends on how much you put into it.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "created": "2018-08-03T14:43:27Z",
                        "workload": 8,
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-5ebdfea8-e695-4c83-a1c1-1e546f0f9935",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-03T14:43:27Z",
                        "id": "external-import-5ebdfea8-e695-4c83-a1c1-1e546f0f9935",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        }
                    },
                    {
                        "difficulty": 4,
                        "_id": "external-import-8e914b8e-b06a-47f6-bcc7-368ad3418d75",
                        "created": "2018-08-03T14:24:33Z",
                        "workload": 25,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "I made this course harder and more hours consuming by implementing a real project for a conference so this isn't the norm. I could have done much less. The class was awesome in that it supported going to a conference. Cannot say enough nice things about this class and probably one of the best in the program.",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "id": "external-import-8e914b8e-b06a-47f6-bcc7-368ad3418d75",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-03T14:24:33Z"
                    },
                    {
                        "workload": 20,
                        "course": null,
                        "_id": "external-import-a26f5bb5-75be-43fa-9597-ad1f6c80fde3",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-03T14:03:07Z",
                        "id": "external-import-a26f5bb5-75be-43fa-9597-ad1f6c80fde3",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4,
                        "_type": "review",
                        "created": "2018-08-03T14:03:07Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "body": "This class was an interesting experience that diverts from the usual OMSCS course.  I won't re-iterate what was said in the previous reviews (its an overall good class), but I will offer some ways I think the class could improve.   I think this class should have two tracks - one for people that aren't sure what they want to do coming in, and those that are.  I feel like I did one or two too many papers, and it was a bit of a stretch sometimes trying to lead the papers towards the project I already had in my mind since the beginning of the semester.  Another small thing is that a lot of people are taking OMSCS while working full time (or more).  It is necessary to grade participation for peer feedback and surveys because they're central to the course, but grading participation in a forum (piazza) when you maybe only have an hour outside of work for free time is a bit of a downer.  Some people can't check this stuff constantly (and when checked, most topics already have good answers).  It feels like they're taking points away for something I can't help. Piazza participation will happen naturally, there's no need to force it on the students.  Another thing is that a lot of these projects varied incredibly greatly in quality. There were some very impressive projects, and others seemed like way less than 100 hours was spent on it (particularly the research track projects). Maybe you could rework those. Some of the papers I peer reviewed were poor quality as well- maybe this was handled in the grading as a matter of course. Sometimes it was a little frustrating to put a lot of effort into my papers and then read papers that seemed like they weren't up to Georgia Tech's quality bar.  Finally, the way the grading is done on the final projects for the development track encourages students to take a safe project (not a lot of effort) so that they have time to make a really polished presentation. It may discourage ambitious projects. This might not be what you're going for."
                    },
                    {
                        "id": "external-import-c9b80cdc-18c8-407a-9aa0-8c04b4f1a490",
                        "created": "2018-07-30T21:20:30Z",
                        "difficulty": 2,
                        "rating": 2,
                        "course": null,
                        "_createdAt": "2018-07-30T21:20:30Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "_id": "external-import-c9b80cdc-18c8-407a-9aa0-8c04b4f1a490",
                        "body": "I don't like this class. This class is more like a writing class. Some student may conduct the personal project in the class. but I feel that I did learn something new. The whole class is to finish a project. The project can be almost anything that related to online education. you can build an APP, website, or analyze some data, or even do some literature survey about online education. If you are new to OMSCS, you can use this class to get familiar with OMSCS.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "workload": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "difficulty": 3,
                        "id": "external-import-46bd0b25-7846-424d-8238-d0d4ff26f781",
                        "_createdAt": "2018-07-30T19:49:46Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-46bd0b25-7846-424d-8238-d0d4ff26f781",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-07-30T19:49:46Z",
                        "body": "The course was good, but not great. This is a good first course. The students can choose any project they want, which was very good. There are no exams, quizzes. At the end of the course I guarantee that you'd come out with a solid understanding of how to write academic papers and the steps involved in getting a PhD. However technologically I doubt if you will learn something. \n\nThe only problem that I had was that my TA was a bit ... uninterested in what I was doing. They were excellent in giving me guidance when I'm stuck but the advice always seemed shallow. It was as if the TA wasn't really reading my papers/submissions in detail and giving me feedback by skimming through my content. Definately nothing against the TA but the course should hire more TA's to get stuff done. \n\nOverall, it was a good experience and I'd definately recommend this course."
                    },
                    {
                        "id": "external-import-b98c568d-fefc-4ee3-9022-0258dc5d0b4c",
                        "created": "2018-05-02T22:08:43Z",
                        "_id": "external-import-b98c568d-fefc-4ee3-9022-0258dc5d0b4c",
                        "_createdAt": "2018-05-02T22:08:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 5,
                        "_type": "review",
                        "body": "This is probably the most interesting class I've taken in the program.   it requires either a resource, content or development of educational technology.   I didn't know what I wanted to do prior to taking this classes, but as I started doing research, I got a great sense of what to do.   This is a work at your own pace, but keep up class.   It does require somewhere between 12 and 15 hours per work a week.   There several large papers and smaller papers.   If you pick an interesting topic you end up loving this class.    I want to continue to develop my idea and maybe leverage it back to OMS or other educational programs.    It's a truly great experience and I highly recommend this class.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        },
                        "course": null,
                        "workload": 15
                    },
                    {
                        "_type": "review",
                        "rating": 5,
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "_id": "external-import-cccc9933-c00e-4ceb-812f-078c93e05d1d",
                        "body": "This was my first OMSCS class after joining the program. We worked on a semester-long project, where we had the option to work individually or in groups, on a development or a research project -- I worked individually on a research paper. Definitely suggest honing your time management skills for this course, but overall a great class!",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-cccc9933-c00e-4ceb-812f-078c93e05d1d",
                        "created": "2018-04-30T19:11:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 10,
                        "difficulty": 3,
                        "_createdAt": "2018-04-30T19:11:57Z"
                    },
                    {
                        "created": "2018-04-29T14:55:26Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        },
                        "difficulty": 3,
                        "_createdAt": "2018-04-29T14:55:26Z",
                        "body": "This course was my introduction to the OMSCS program and I felt it was a good transition from professional life back into school life. The course is very much what you make of it and most of you will enjoy the freedom granted in the final project. The first half is very heavy in writing where you are exploring a topic of interest then you get into your project. You can choose to either work individually or work with a group. The freedom in project allows you to create something meaningful; I will continue the work that I started this semester after the conclusion of the semester because I believe in the value of what I got started.\n\nI highly recommend this course!",
                        "id": "external-import-912bd85c-652a-41df-b2da-f50ff08e9d61",
                        "rating": 5,
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-912bd85c-652a-41df-b2da-f50ff08e9d61"
                    },
                    {
                        "_id": "external-import-aa3bdf27-b29b-423a-b3f4-dddfcdfaa754",
                        "created": "2018-04-04T17:42:53Z",
                        "_createdAt": "2018-04-04T17:42:53Z",
                        "rating": 5,
                        "_type": "review",
                        "workload": 10,
                        "course": null,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-aa3bdf27-b29b-423a-b3f4-dddfcdfaa754",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "body": "Had the option of working with team or individual, I selected to work as individual and although the research was, well, it was research, the outcome and process of creating a research project was fun."
                    },
                    {
                        "created": "2018-01-01T18:41:31Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 5,
                        "workload": 5,
                        "difficulty": 2,
                        "body": "This is a great class where you get out of it what you put in. It's quite easy to get an A by putting in minimal effort; if you at least execute on the main grading points of each assignment, you're guaranteed an A. However, the one pain point of this class is the rush to complete the final project. I would recommend getting as much done as possible well ahead of time, because you will have to submit a formatted paper, a video presentation, and your actual project. The course library is very well thought-out and organized (if incomplete at this time). The forums are active, which is typical of a Joyner course. I would definitely recommend taking this class.",
                        "id": "external-import-3979d92a-df01-44ef-8245-bbcff54c71b2",
                        "course": null,
                        "_id": "external-import-3979d92a-df01-44ef-8245-bbcff54c71b2",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-01-01T18:41:31Z",
                        "_type": "review",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        }
                    },
                    {
                        "body": "This is a very easy class. It's self-paced so if you are able to manage your own self and capable of coming up with stuff to do and do those things you come up with, then you will do well in the class. I think I got 100% on everything. It requires a lot of writing and checking in every week with your TA to let them know how you are progressing. I would recommend this class to only those who are interested in starting a business after they are done with the masters or to those who may be interested in doing PhD after the masters. The reason why is because if you want to start a business, you can get the ground work done in this class - have an app you want to build or software for something related to education (and education is really being used light here) this is the class for you. Have a cool research idea you want to research and maybe do a PhD on, this is the class for you to learn how to go about doing that in the next level and also get some serious research done.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-c9bdc914-09a7-4bb4-93c1-a6a5f44f2562",
                        "created": "2017-12-22T05:57:41Z",
                        "workload": 5,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        },
                        "_id": "external-import-c9bdc914-09a7-4bb4-93c1-a6a5f44f2562",
                        "difficulty": 1,
                        "_createdAt": "2017-12-22T05:57:41Z",
                        "course": null,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_createdAt": "2017-12-21T07:11:29Z",
                        "workload": 15,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        },
                        "difficulty": 3,
                        "id": "external-import-2f5bb9fa-5797-4960-b361-c5fe7f722904",
                        "created": "2017-12-21T07:11:29Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-2f5bb9fa-5797-4960-b361-c5fe7f722904",
                        "_type": "review",
                        "rating": 5,
                        "body": "This course is one of the best courses i've ever taken, online or offline. There are a lot of learning moments for each individual, from reading papers, to gathering peer feedback to building, designing, and scaling up or down the project based on your own abilities. I think at the end of it, not only did I learn about education technology, but I also learned about how I learned and how I analyzed and tackle projects.\n\nGreat class and honestly, the workload is what you put in it. If you want to learn more and deep dive, feel free, but if you want to do the bare minimum, that's ok too."
                    },
                    {
                        "id": "external-import-79212013-61ba-4be4-823a-7ba3065b30b5",
                        "difficulty": 3,
                        "_createdAt": "2017-12-19T23:31:57Z",
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-79212013-61ba-4be4-823a-7ba3065b30b5",
                        "body": "Rating: \nThis is wonderful class that I was skeptical about but ended up loving. The course is compared to a PHD in structure, not necessarily rigor, and I learned a lot about the academic development process. The strongest aspect is this class is the organization and communication which is led by Dr. Joyner. His planning makes it very easy to focus on the content of the course and if you do have questions, answers are swift and sincere. The format is unique in that you are assigned a mentor who guides you through the process of deciding on a project and fulfilling the requirements. There aren't any strong negatives in the course but I suppose the initial project dive is a little rough. There is just so much data to sort through and it is a little hard to pick the problem you want to solve. Fortunately, if you come in to the program with a problem in mind this is a non-issue!\n\nDifficulty:\nThis class is what you make of it. You could pick an really easy problem or a really hard problem, the only person you're hurting or helping is yourself.The first few assignments are almost entirely reading academic articles so get good at reading those efficiently. The writing is not that hard as long as you stay on point and have a purpose. My initial project idea was too ambitious but I was able to massage it into something that could be completed in about 100 hours which is the goal. \n\nWorkload:\nI spent a lot of time reading throughout the entire course so that never really goes away. The last 4 weeks was my big dev cycle and I ended up pouring about 25/hrs in the last week or so. My measured average is about 10 and if I had not been taking a second class, I probably would not have had the huge uptick in hours during the last week.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2017-12-19T23:31:57Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U"
                        },
                        "workload": 10
                    },
                    {
                        "difficulty": 3,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null,
                        "workload": 10,
                        "_createdAt": "2017-12-19T02:51:51Z",
                        "body": "A self-driven class where you get out of the class what you put in. You explore areas of educational technology at the start of the class and then propose a project you would like to do. Communication is excellent throughout the course. The mentors are helpful, and everyone encourages you as you explore, define, and create your mini PhD project.\n\nI wish I would have had more time to explore other project proposals to join a group. There's some opportunity to do that by looking through the library and peer-reviewing projects, but you need to make time for it. Really recommend doing that if you take the course because you might find something you hadn't thought about or that captures your interest more.\n\nI'd recommend taking this course towards the end of OMSCS as you might have acquired some new skills that you'd like to apply to an EdTech development project. Such a great class either way! Kudos to David Joyner and the awesome mentors in the class.",
                        "id": "external-import-af25ab70-0f83-431a-9579-e508a88665ef",
                        "created": "2017-12-19T02:51:51Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 5,
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "_id": "external-import-af25ab70-0f83-431a-9579-e508a88665ef"
                    },
                    {
                        "workload": 35,
                        "course": null,
                        "body": "This course should be mandatory for first semester omscs student! It is very well organized and Prof. David Joyner is such a positive influence in the course interactions and all communications throughout. Peer feedback is a great feature to learn about other projects and possibilities. Highly recommend this course. You will guaranteed to learn other fascinating things beside computer programming.",
                        "_createdAt": "2017-12-18T06:50:13Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "id": "external-import-4be22314-3f15-4794-8540-f60ea9e49c01",
                        "created": "2017-12-18T06:50:13Z",
                        "rating": 5,
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "_id": "external-import-4be22314-3f15-4794-8540-f60ea9e49c01",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI"
                    },
                    {
                        "body": "Very self driven class. The entire class is working towards a single project and presentation at the end of the semester. The video content is very limited and is essentially just a tour of the course catalog and what the different categories are.\nThe class is certainly what you make of it, the instructors aren't really looking over your shoulder. I'm sure they would be helpful if you asked them direct questions, but they didn't seem to have much input for any given weekly checkin.\nIt'd be great if there was some way to encourage more group participation, the peer feedback is a great tool, but working directly with classmates would allow teams to have cooler and larger-scoped projects.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "workload": 10,
                        "difficulty": 3,
                        "_type": "review",
                        "id": "external-import-aeef0dcc-5dd8-4fae-9a43-890c0242f5d5",
                        "created": "2017-12-17T17:21:46Z",
                        "_createdAt": "2017-12-17T17:21:46Z",
                        "rating": 3,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-aeef0dcc-5dd8-4fae-9a43-890c0242f5d5"
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 5,
                        "id": "external-import-04563b5f-aa20-4fed-9ccf-c7e7369b9d7d",
                        "created": "2017-12-16T16:30:47Z",
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        },
                        "_id": "external-import-04563b5f-aa20-4fed-9ccf-c7e7369b9d7d",
                        "body": "This class is unique. It is great to learn how to do research and construct a research thesis. I learned a lot of project management skills also that I feel will be great in the work field. All the deliverables are stated and guide you through it. If you have an idea for a project or a business this will force you to follow it through and a mentor will guide you.  I had no ed tech experience and I learned so much since at the beginning I had no idea for a topic so I researched many fields prior to narrowing in on a project idea. The class  is definitely what you make of it. Great for independent learners.",
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2017-12-16T16:30:47Z",
                        "_type": "review"
                    },
                    {
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 30,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd"
                        },
                        "id": "external-import-583ce730-4c23-4cc8-8601-2c42156b0e83",
                        "body": "One of my favorite classes. It's the first course where could throw your efforts into something you find super interesting. The entire course is focused around a project you get to choose. The professor is highly engaged.",
                        "rating": 5,
                        "course": null,
                        "_id": "external-import-583ce730-4c23-4cc8-8601-2c42156b0e83",
                        "difficulty": 3,
                        "_createdAt": "2017-09-30T19:19:07Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2017-09-30T19:19:07Z",
                        "_type": "review"
                    },
                    {
                        "difficulty": 3,
                        "_createdAt": "2017-08-12T02:31:31Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2"
                        },
                        "_id": "external-import-486adaa5-2cb8-4e93-9718-c82c7092bd9f",
                        "rating": 5,
                        "id": "external-import-486adaa5-2cb8-4e93-9718-c82c7092bd9f",
                        "workload": 8,
                        "_type": "review",
                        "body": "I loved this class. Choose a project (content, development, or research) that you are truly interested in and the semester will fly by. Ask questions of your TA/mentor, they seem genuinely there to help. It is difficult to assign a number of work hours per week. Some weeks only required a few hours of research and peer feedback, however other weeks required many more hours to pull an assignment together (especially the final project deliverable). Almost everything is self-paced, so be sure to have your calendar out and set reasonable milestones at the start of the project. Dr. Joyner and the TAs were fantastic.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2017-08-12T02:31:31Z"
                    },
                    {
                        "course": null,
                        "workload": 8,
                        "created": "2017-08-11T20:52:45Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_id": "external-import-9a1c9aac-aa04-4e7e-b35f-29d0b630f1f6",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester"
                        },
                        "id": "external-import-9a1c9aac-aa04-4e7e-b35f-29d0b630f1f6",
                        "_type": "review",
                        "body": "This is a great course after you have some experience in OMSCS. I've seen wonderful projects ranging from instant messaging APP to second language study software. The tutor is helpful all the time and the progress is very much self-paced. You will like it a lot!\n\nI also saw in this class people recorded podcasts about wine or wrote about gender in IT. It seems to me that you can do whatever you want in the class.",
                        "_createdAt": "2017-08-11T20:52:45Z",
                        "rating": 5
                    },
                    {
                        "_type": "review",
                        "body": "This is one of those classes where you get out what you put in. You spend the first few weeks figuring out which areas you're interested in, and the remainder of the semester is spent putting your project together. Those first few weeks are very important as they will change the complexion of your experience in the course depending on what you choose. I worked on a team, and I think that is the best way to approach this class. You have other students that are holding you accountable and that are dependent upon you to get a good grade. You can do the project individually if you'd like (most people did, but I wanted a bigger project). It is also worth noting that you have one TA in this course - your mentor. So if you have any questions or want to know what to do to succeed, you have one person you can ask. In my opinion, this made it much easier because you're not getting conflicting information or trying to juggle multiple people's expectations. It is also much easier to get answers to your questions because one TA isn't trying to answer all of the questions - just their group of students' questions.",
                        "id": "external-import-c3ba2787-c599-4b4d-9adb-b3867f4e93d3",
                        "workload": 10,
                        "_id": "external-import-c3ba2787-c599-4b4d-9adb-b3867f4e93d3",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "rating": 5,
                        "created": "2017-08-11T18:18:07Z",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb"
                        },
                        "_createdAt": "2017-08-11T18:18:07Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2017-08-11T02:33:49Z",
                        "_id": "external-import-9f77f0dc-91bd-4576-a8d8-0f64d092d020",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15"
                        },
                        "rating": 5,
                        "workload": 10,
                        "body": "This course was a fun course, I would recommend to anyone who is interested in working on a project/projects. That said, it involves is a lot of writing but it gets all connected to the end project and you will appreciate it in the end when you see the results of your hard work in the end. Dr Joyner is great, the class was well organized and documentation is spectacular, second to none.",
                        "id": "external-import-9f77f0dc-91bd-4576-a8d8-0f64d092d020",
                        "course": null,
                        "difficulty": 3,
                        "_createdAt": "2017-08-11T02:33:49Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI"
                    },
                    {
                        "created": "2017-08-07T13:41:35Z",
                        "_id": "external-import-4ac67455-ba91-4954-af3b-d02ae1f91771",
                        "course": null,
                        "rating": 5,
                        "workload": 10,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "id": "external-import-4ac67455-ba91-4954-af3b-d02ae1f91771",
                        "difficulty": 3,
                        "_type": "review",
                        "body": "This class is fairly unique in that it begins with discovery and research of the domain but finishes with a 100% self-driven project, either done with a team or individually. As a professional software developer having built some POC/crude mobile apps, I used this opportunity to use a framework and toolset I have always wanted to try but never had the time or project-idea that combined led me to actually investing the time to learn and develop the application. This class gave me that flexibility with some rigor through a proposal with a timeline and ultimate deliverable with the flexibility to adjust as needed. \n\nOverall, I would recommend this class for anyone who genuinely is interested in exploring the intersections between education and technology and is interested in either developing content, doing research, or developing an application to add to the community. The flexibility to do a more research based approach versus a development approach is something that I think most people will enjoy about this class. Simply explore, learn, and contribute. \n\nAlso, the professor is very engaging and constantly is a resource to contribute and inspire conversations.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2017-08-07T13:41:35Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2"
                        }
                    },
                    {
                        "body": "Great class. You pick your project and develop it during the semester, alone or as a team. Instructors and classmates offer support and feedback. Dr Joyner is fantastic.",
                        "_type": "review",
                        "_id": "external-import-d2d0b185-07dd-4d94-a995-0a21da20160d",
                        "id": "external-import-d2d0b185-07dd-4d94-a995-0a21da20160d",
                        "created": "2017-08-05T16:06:07Z",
                        "difficulty": 2,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 21,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15"
                        },
                        "_createdAt": "2017-08-05T16:06:07Z",
                        "rating": 5
                    },
                    {
                        "id": "external-import-fe3ddeac-e450-484b-a387-2abce7452f9d",
                        "rating": 4,
                        "_id": "external-import-fe3ddeac-e450-484b-a387-2abce7452f9d",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2017-08-05T13:55:37Z",
                        "workload": 15,
                        "semester": {
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z"
                        },
                        "created": "2017-08-05T13:55:37Z",
                        "_type": "review",
                        "body": "I'm pretty much echoing the other comments. This course is different than the typical OMSCS course (It was my 7th one, for basis of comparison). It is unstructured in the sense that there are not formal video lectures throughout [there are several introductory videos from Dr. Joyner on Udacity you'll watch in the first week, but that's it and even those are informal]. The rest of the course involves researching educational technology and proposing a project which you'll then complete while working with an assigned mentor. However, it is structured in the sense that you'll be guided through a series of objectives and milestones along the way. Discussion on Piazza plays a big part too... basically every day, there'll be some suggested topic to discuss or debate, although everyone is encouraged to ask questions, share articles or other interesting content they've found and just generally join in much as you would in a traditional seminar course. The TAs and Professor were extremely responsive and involved, but they also managed to stay out of the way and avoid micromanaging. The style of individual mentors varies as you'd expect but they make an attempt to match you up for a good fit and I had no problems working with mine. Finally, peer reviews are also included.... my impression of the utility of those was mixed. In all cases, various sorts of 'participation' are acknowledged and form part of your final grade. At the beginning, you'll probably wonder \"What have I go myself into ?\" but before long you'll find yourself fitting into the flow just fine. Your communication skills will definitely be exercised... there are weekly essays prior to actually beginning the project phase, milestone & progress reports, a final project video presentation, and a final project paper suitable for publication. Time management is also important, particularly in the compressed summer semester. Bottom line --- you'll get out of it what you put into it.",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null
                    },
                    {
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2"
                        },
                        "_createdAt": "2017-08-01T19:58:06Z",
                        "rating": 5,
                        "_id": "external-import-7a02c9b1-21b0-4d2c-ade8-a8dc6539a737",
                        "_type": "review",
                        "created": "2017-08-01T19:58:06Z",
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 15,
                        "body": "I loved this class and wish more courses followed this format! It's an almost completely open-ended class where you propose a project and then work on it throughout the course. The professor and TAs are good about making sure you know the expectations for the class, that you keep your scope for you project reasonable, and that you are roughly on track throughout the course. If you prefer a more structured course, you may not enjoy this course, however if you like to work on a project that interests you personally and have a ton of creative control then you will enjoy this class. \n\nI would suggest having a rough idea of what you would like to do for the project going into the course. However if you aren't sure, educational technology is a pretty broad field and the first few weeks are spent researching various topics in the field to help you brainstorm ideas. \n\nAs far as grading and workload, the expectation is that the scope of the project itself will be about 100 hours. This amounts to 10-15 hours of work each week. You should be able to earn an 'A' if you put in the time and communicate your progress (even if you end up behind your original schedule). Difficulty is really how familiar you are with the work you do for the project, and since you choose what to work on you can control how much you want to branch out there. \n\nTaking this course over the Summer is tougher but do-able, you are looking at a few extra hours a week due to tighter timelines.",
                        "id": "external-import-7a02c9b1-21b0-4d2c-ade8-a8dc6539a737"
                    },
                    {
                        "_createdAt": "2017-07-31T05:04:16Z",
                        "created": "2017-07-31T05:04:16Z",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-b65d4d24-07da-4864-aeb7-fc5bc945d31c",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 18,
                        "id": "external-import-b65d4d24-07da-4864-aeb7-fc5bc945d31c",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IVUb",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2017-2",
                            "_updatedAt": "2022-07-22T00:48:07Z",
                            "startDate": "2017-05-15"
                        },
                        "body": "Dr. Joyner is amazing, as usual. My mentor is also amazing, I guess also as usual? He's got some reputation, so I heard, though this is my first time I had \"met\" him. My classmates are amazing. We have another TA who has been really friendly, helpful and also amazing. My teammates are amazing, and I think we did an amazing job. Everything is amazing, but still, if you get to decide whether to take this course on a shorter summer or on a full semester, I suggest you choose the full semester. Those extra 3 to 5 weeks would be a very big difference. Really big. \n\nBTW, there are now three available tracks: research, development, content."
                    },
                    {
                        "workload": 12,
                        "_createdAt": "2017-05-16T21:52:33Z",
                        "created": "2017-05-16T21:52:33Z",
                        "rating": 5,
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IYZd"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "_id": "external-import-ccbf1557-f4bc-4c93-ac14-76ae8a539171",
                        "id": "external-import-ccbf1557-f4bc-4c93-ac14-76ae8a539171",
                        "difficulty": 3,
                        "body": "A class that rewards hard work and is really oriented around you persuing something you're interested it. This was a very different type of class - only one week of lectures and the rest of it were projects. Probably shouldn't be taken your first semester or two."
                    },
                    {
                        "workload": 10,
                        "_id": "external-import-0ec145dc-fcfd-4eb7-a882-c52647ff4de8",
                        "body": "It sounds cliche, but this class is what you make of it. You are the primary driver of what you learn. During this course there are two tracks you can take: research or development. Both require you to conduct a mini \"literature review\" before you can begin your final project. If you choose research you will either conduct your own study or find a new way to examine existing data/studies. If you choose the development track you will create a working prototype/product. There are really no lectures outside of a few at the beginning and then any others you choose to watch while trying to land on a research topic. \n\nThere are papers you must write during the initial research phase as you narrow down your topic. During the project phase you must do weekly check ins and two milestones. The final project is a paper formatted for journal publication, the actual project (paper or prototype), and then the actual files/research you used. \n\nI personally chose to do develop an actual prototype. I was given free reign to pick the platform and the features as long as I could justify them. I really enjoyed working on the project and was able to produce something I had always dreamed of producing. \n\nThat last point is something that the instructor specifically designed the course to encourage. During course feedback on Piazza I said at times I felt like I was paying money to work on a hobby project. He responded saying that was the idea. This course will give you credit for working on a passion project. You can then use the results for other endeavors: publishing, PhD, or even a start up. You will ultimately learn only what you choose to learn. If you want an easy A you could likely get that done, but honestly it would be a waste if you don't use the opportunity to push yourself.",
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRJmH",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2017-1",
                            "_updatedAt": "2022-07-22T00:48:17Z",
                            "startDate": "2017-01-09"
                        },
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "id": "external-import-0ec145dc-fcfd-4eb7-a882-c52647ff4de8",
                        "created": "2017-05-11T18:27:01Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_createdAt": "2017-05-11T18:27:01Z",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "body": "This course is what you make of it. I did a research project based around another OMS class. Based on the schedule for that class, my workload varied a fair amount week to week. There were weeks where the instructional team for the other class wanted formal writeups from me that were above and beyond what this class required. I did have a bit of a crunch at the end of the semester, as I didn't have my full data available for analysis until about a week before the final project was due, which meant that I put in a lot of hours the last week analyzing data and writing. \n\nDavid Joyner describes this class as a mini Ph. D. and I think it's a perfect description. You explore your educational interests, propose a project, have it accepted, do the project, and defend your results. Many students picked difficult projects, put in a lot of hours, and produced amazing results. Other students put less in and got less out. I have a paper that is close to being ready for publication that I do intend to submit this summer to its intended journal. Since there's currently no research track available in OMS, this class was a welcome bit of research. I'd love to see more classes like it if not a full research path available for OMS students! If you like research, this class is for you. If you'd rather read, do problem sets, and take exams, pick another course.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRJmH",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2017-1",
                            "_updatedAt": "2022-07-22T00:48:17Z",
                            "startDate": "2017-01-09"
                        },
                        "_id": "external-import-c1ac8272-b9c2-4ac4-972e-420daf83d895",
                        "created": "2017-05-10T02:41:12Z",
                        "difficulty": 3,
                        "rating": 5,
                        "course": null,
                        "_createdAt": "2017-05-10T02:41:12Z",
                        "id": "external-import-c1ac8272-b9c2-4ac4-972e-420daf83d895",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review"
                    },
                    {
                        "difficulty": 2,
                        "course": null,
                        "workload": 12,
                        "_createdAt": "2017-05-08T15:46:55Z",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-b2eb1093-8727-4d06-b71f-943d1aa0fbcc",
                        "created": "2017-05-08T15:46:55Z",
                        "_id": "external-import-b2eb1093-8727-4d06-b71f-943d1aa0fbcc",
                        "body": "As with many previous comments, this class is really about how much you put into it. The grading is very generous and it's really easy to get grades from participation. Participation points literally rains on you from the surveys, Piazza participation, and even peer feedback (similar to KBAI). A side effect of this is that some of the peer feedback you get is pretty much generic. There are some really useful ones though so keep an eye on that. \n\nThe class's Piazza is really active and Dr. Joyner is quick to reply there and on Slack as well. Your mentor may be a hit or miss. My first mentor was great and we had lots of discussions on my research topic at the time. If you form a group, you get assigned a new mentor and that's usually the mentor that most group members have (if there's one or is random otherwise). My group's mentor was really hands off (as in I actually got 1 personal communication the entire time he was assigned). We didn't hear much from him throughout the entire project and our team's grades was always late. \n\nThe class allows you to research/work on a project that you want as long as its related to ed tech in some sense. There were some really interesting projects and I believe group work here helps a lot. While most of the time group projects are kind of a bane, this is one of the classes where it can really help you come up with something that you'll never be able to going at it alone. Just MAKE sure that your group mates are as interested in the idea/project as you are. I had a really great group but found out late that one person in the group was just bandwagoning and the work produced by that person really showed the lack of interest.",
                        "_type": "review",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:48:17Z",
                            "startDate": "2017-01-09",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRJmH",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2017-1"
                        }
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IYZd",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2016-3",
                            "_updatedAt": "2022-07-22T00:48:29Z",
                            "startDate": "2016-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-4b900c9a-11fa-408f-b8a4-0c090d1e4181",
                        "body": "This class is a lot what you make out of it. You start the class with a bunch of essays slowly narrowing down you topic. Should be at least one less essay in my opinion. The instructor, Dave, is really involved and will probably write to much instead of not enough. TL;DR will happen some, you can't help it. There is no real videos as it is all about the conversations hence the didn't read above. Also, I think the Peer Reviews were mostly crap as most didn't really provide any input anyway. I always did but others just did an exercise instead of a way to help others. The project itself was incredibly open ended and the meat of the class. I thought there were alot of useless projects people took on, however, it might have just been hard to come up with ideas. Here is where you can get a lot or a little out of the class. The TAs and Dave are here to help you in this open ended way. The class is an easy A but it is what you make out of it. You can learn a lot or a little but depends on you. Interesting concept for a class (being lecture less) and has merit. Grading of a class like this does require a finesse which I am thinking is a little lacking at moment. Overall, a fantastic class by a fantastic instructor and would recommend. If nothing else to get use to how upper academia is done. My criticism is just to let people know what they are getting. Note, my project was fun to do but it was one I thought about ahead of time noted below as important.",
                        "id": "external-import-4b900c9a-11fa-408f-b8a4-0c090d1e4181",
                        "created": "2017-01-03T15:37:23Z",
                        "_createdAt": "2017-01-03T15:37:23Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "course": null,
                        "rating": 4
                    },
                    {
                        "_id": "external-import-241da919-eba4-4dd1-bb0d-bf4a289fad8a",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester"
                        },
                        "created": "2016-05-20T14:08:08Z",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "_createdAt": "2016-05-20T14:08:08Z",
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "difficulty": 2,
                        "rating": 5,
                        "id": "external-import-241da919-eba4-4dd1-bb0d-bf4a289fad8a",
                        "body": "In this class, you choose your own project, which can either be an educational tool or a research study. You don't need to have a project in mind before starting the class but since all the activities since week two are directed towards researching your problem space, you'll need to land on one pretty quickly. Alternatively, you can join someone else's project, which I'd probably recommend even if you have your own idea. With more people on the team, you can combine your efforts, build something more polished, and have more fun along the way. Otherwise, despite encouraging feedback from peer reviews, you might feel a little lonely in your one-man-project. \n\nDuring the first 5 weeks, there will be a short (~500 words) written submission documenting your research every week, followed by project proposal. In the next 8 weeks, you'll be working on the project, summarizing your progress in a short text or video recording every other week. In the final two weeks, you will combine all your previous notes and research to write an academic paper in a format and quality to be presented at a scientific conference. You don't have to officially submit it but even without doing so, you'll have gone through the entire process of researching a topic, identifiying a problem, designing a solution, and writing a paper about it. \n\nThe structure of the course is very free-form. There are no common videos or texts to read -- instead, you'll be expected to do your own research (i. e. find relevant papers, learn tools you want to use). There is a suggested breakdown of how much time you should spend on research/review/writing/programming in a given week (~10h/w total), but the actual content varies for each student. The plus side is, you'll be assigned a mentor who will guide you on your journey. And if you've known David Joyner for a while, you can be sure he'll post weekly plan and summary announcements, daily discussion threads, and reply to almost every comment.",
                        "course": null,
                        "workload": 10
                    },
                    {
                        "created": "2016-05-12T02:25:42Z",
                        "_createdAt": "2016-05-12T02:25:42Z",
                        "rating": 4,
                        "course": null,
                        "_type": "review",
                        "_id": "external-import-2a90c7b8-7456-4dbd-b582-350387ed85d8",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "id": "external-import-2a90c7b8-7456-4dbd-b582-350387ed85d8",
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11"
                        },
                        "difficulty": 3,
                        "workload": 15,
                        "body": "If you go into this class with a clear project in mind, you will love it. \n\nYou will be spending a lot of time writing and peer reviewing other students. The peer review process made it clear that students who didn't have a clear project definition, and students without strong project management skills, struggled with this class. \n\nOverall, this is a \"capstone\" kind of class, that is best taken once you've developed strong research and project management skills."
                    },
                    {
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review",
                        "body": "Good course if you are self-driven. There is no specific syllabus and sky is the limit. Chose a topic and explore and build a tool/ application or do research. Education is something we have all gone through and are continuously doing and changing education landscape should be of interest for almost everybody. \n\nBased on what I understand, you are judged on what you do - not how brilliant your idea is. And that is a good thing for most part. \n\nThe course is divided into multiple questions/ milestones and you should know if you have gone of track. Try to keep yourself on track - for getting grade \"A\" - the margin for error is not very high. \n\nAnother plus for this course: if you have made a mistake - you can simply request your mentor (TA) to correct it. You can focus on ideas and innovation and not worry about typos and losing points.",
                        "difficulty": 3,
                        "rating": 4,
                        "id": "external-import-3de1ba9e-1b90-4e0d-be98-47c97bf4c16a",
                        "semester": {
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "course": null,
                        "_createdAt": "2016-05-10T20:44:37Z",
                        "created": "2016-05-10T20:44:37Z",
                        "workload": 14,
                        "_id": "external-import-3de1ba9e-1b90-4e0d-be98-47c97bf4c16a"
                    },
                    {
                        "_id": "external-import-107d416f-2f35-47d1-9c1f-c15e472ddfcc",
                        "difficulty": 3,
                        "_createdAt": "2016-04-25T22:04:28Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "workload": 15,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci"
                        },
                        "id": "external-import-107d416f-2f35-47d1-9c1f-c15e472ddfcc",
                        "created": "2016-04-25T22:04:28Z",
                        "body": "For the most part this class is what you make of it. It is possible to say that the hardest part of the class is the beginning where you are deciding what you want your project to be. There is consistent writing along with consistent feedback. For me the pressure of finding a project topic was a little over whelming. \n\nOnce you decide on your project, it may feel easier since you have probably chosen something you at least enjoy doing. Don't get me wrong though, you are definitely expected to challenge yourself and follow through. The TAs and professor set a high bar and make sure you reach for it. \n\nOverall a great class and very well run.",
                        "rating": 5,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review"
                    },
                    {
                        "created": "2016-03-17T06:14:29Z",
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester"
                        },
                        "_id": "external-import-998ba211-4514-4a6b-a303-71d8f5a037ce",
                        "body": "This is a class structured as a PhD, where there are no lectures and you decide how hard it will get. It's very possible to ace this class if you're motivated enough. \n\nSince you choose your own project or research, pretty much anybody can relate to a project that concerns Educational Technology. \n\nHere are some examples of projects: Music teaching tools, sign language SW, anti plagiarism tools, identity verification, group interaction tools, AI for pretty much anything, k12 and STEM involvement, safety and security, assessment tools, and the list goes on and on.",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "id": "external-import-998ba211-4514-4a6b-a303-71d8f5a037ce",
                        "rating": 4,
                        "workload": 10,
                        "difficulty": 3,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_createdAt": "2016-03-17T06:14:29Z",
                        "_type": "review"
                    },
                    {
                        "_createdAt": "2016-02-24T23:22:17Z",
                        "workload": 10,
                        "_rev": "IGjXs14mpjIFkE02pfCSUD",
                        "_type": "review",
                        "body": "Requires writing/reading and peer-reviewing every week. You are free to choose your topic, project to work on ; however be concise on what you want to do with your project. The whole course will based on your decision of topic choice, and final delivery is either your research paper or application about Education Technology. This course is really open , your final grade is based on what you have done in the project as a part of learning process , not the outcome or feasibility of your project.",
                        "_updatedAt": "2022-07-11T19:08:16Z",
                        "difficulty": 3,
                        "id": "external-import-a03109be-987f-4449-8e20-fb37d0c4efbc",
                        "created": "2016-02-24T23:22:17Z",
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2016-1",
                            "_updatedAt": "2022-07-22T00:48:57Z",
                            "startDate": "2016-01-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Idci",
                            "_type": "semester"
                        },
                        "_id": "external-import-a03109be-987f-4449-8e20-fb37d0c4efbc"
                    },
                    {
                        "id": "external-import-413651d1-0746-4896-a200-dfd8ca8de2ba",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "course": null,
                        "created": "2015-11-05T06:00:00Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "workload": 10,
                        "_id": "external-import-413651d1-0746-4896-a200-dfd8ca8de2ba",
                        "body": "If you are familiar with how Dr. Joyner runs a class (7637 KBAI), then you will know how this class will work. Weekly written assignments, peer feedback and a very active and well managed piazza forum. Grading is non-typical: Doesn't meet expectations, meets expectations, exceeds expectations. If you need an exact scale to feel comfortable about your grade, this may not be the course for you. A significant amount of your mark is based on your project (group or single - your choice), which is due at the end of the semester. So yes, you are in complete control of your grade, but you won't know what it is until that project is in. \n\nOne person likened the course structure to that of a mini-thesis, and that describes the course very well. \n\nI am really enjoying this course, but it isn't for everyone.",
                        "difficulty": 3
                    },
                    {
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "semester": {
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "created": "2015-11-05T06:00:00Z",
                        "_id": "external-import-6d74e1fc-9fe5-4aa8-813f-48d72ed407d5",
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_type": "review",
                        "_createdAt": "2015-11-05T06:00:00Z",
                        "course": null,
                        "workload": 10,
                        "body": "I put the difficulty and workload at average levels, but it is really up to you. The course is an exploration of education technology in whichever direction you wish to go in the space. There are a number of quicky videos and a growing library to help you decide if you don't come in already with some ideas. The course has a number of short essays due weekly that step you through the process of identifying an area of interest, reviewing existing research, and scoping a research project or development tool project for the remainder of the semester. The project is formalized with a Proposal that includes weekly milestones and some progress deliverables prior to the final completed project. Along the way, your progress is monitored by a single 'mentor' (TA) that is there to answer questions and ensure that your are on track, scoped correctly, etc. An important component of the class is participation, which includes giving and getting peer feedback along the way with each of the essays. The students are encouraged to participate in daily discussions on Piazza which follow a weekly pattern... 'What did you learn?', 'Q&A with ??', 'Let's discuss +/- of an existing OMS course', etc. The instructor is Dr. David Joyner, of KBAI fame, and he is extremely active on Piazza, keeping the class lively and engaged, which is no mean feat since we are all doing different projects. The final coursework is not done, so I can't comment here how it will all end, but so far it is a joy to be part of this particular environment. It is different from other courses. There are still deliverables and the process is part of the course, but the project or research area is open-ended and up to the student to design.",
                        "id": "external-import-6d74e1fc-9fe5-4aa8-813f-48d72ed407d5"
                    },
                    {
                        "body": "This class can't really be described too easily. For me, I have thought that this class was easy but at the same time it has taken a good amount of work. The gist is that you research topics that you find interesting and your goal is to come out with some kind of proposal for a tool, a paper, or research.. something along those lines, and then you complete your project. The sky is the limit on this one. If you know how to do what you want to do.. then you shoudln't have a problem in this class. David isn't silly with participation in that it is some hidden secret. He will let you know if you need to participate more. This is also the only class that so far has really made sense for peer review. Some of the other classes could have just not used it and I think it would have been fine. CP for one. Basically if you are fine working mostly on your own with guidance from a mentor, then this class is for you. If you need absolute structure, then this class is not for you.",
                        "difficulty": 3,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:12Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRuSI",
                        "id": "external-import-bb4c0fdd-e3b2-4447-a4a1-d019e5d617c7",
                        "_id": "external-import-bb4c0fdd-e3b2-4447-a4a1-d019e5d617c7",
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFROor",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2015-3",
                            "_updatedAt": "2022-07-22T00:49:10Z",
                            "startDate": "2015-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "course": null,
                        "created": "2015-11-05T06:00:00Z",
                        "_createdAt": "2015-11-05T06:00:00Z"
                    }
                ],
                "_createdAt": "2022-07-05T23:23:15Z",
                "_updatedAt": "2022-08-24T17:26:15Z",
                "isFoundational": true,
                "name": "Educational Technology: Conceptual Foundations",
                "slug": "educational-technology-conceptual-foundations",
                "tags": [
                    "EdTech"
                ],
                "rating": 4.03,
                "difficulty": 2.8365384615384617,
                "workload": 14.41747572815534
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "educational-technology-conceptual-foundations"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}