{
    "props": {
        "pageProps": {
            "course": {
                "isDeprecated": false,
                "textbooks": [
                    {
                        "name": "Ubiquitous Computing Fundamentals, 1st Edition",
                        "_key": "5adec9f0707cda35df9584ef4e12a99d",
                        "url": "https://amzn.to/3R1AfgU"
                    }
                ],
                "_rev": "Ge7QFtjd7Oo12iAJ8Wb0sb",
                "reviews": [
                    {
                        "semester": {
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z"
                        },
                        "authorId": "4bAmToXB3t9tFYKjhRjd0Q==",
                        "_type": "review",
                        "_id": "WO6QCb0AdjGY7KsBRt1Kni",
                        "_updatedAt": "2024-08-10T23:24:17Z",
                        "difficulty": 2,
                        "_rev": "WO6QCb0AdjGY7KsBRt1Kjq",
                        "course": null,
                        "id": "WO6QCb0AdjGY7KsBRt1Kni",
                        "created": "2024-08-10T23:24:17Z",
                        "_createdAt": "2024-08-10T23:24:17Z",
                        "rating": 3,
                        "body": "The professor and TAs are not that active on Ed Discussion, but the grading is very lenient. You are able to choose your own groups for the project, so that's nice. They also increased the maximum group size from 4 to 5. If you're not looking to do much work, I recommend a group of 5. It felt like barely any of us did any work but we still got full or almost full points on every assignment. If you're in the HCI specialization or doing OMSCS for the piece of paper at the end, I would recommend this class.",
                        "workload": 5
                    },
                    {
                        "authorId": "ML40KueKrVVBvrtJ6q4vAg==",
                        "body": "Really horrible course with a ton of potential. Rather than teaching or making projects/exercise that are cohesive our build, they simply took an inperson class and shoved it into an online format. Out of 10 classes I've taken, this is by far the worse in terms of content and learning. Take the class for an easy A and to check a box. Otherwise, prepared to be disappointed. ",
                        "_updatedAt": "2024-03-31T14:03:17Z",
                        "created": "2024-03-31T14:03:17Z",
                        "semester": {
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester"
                        },
                        "_createdAt": "2024-03-31T14:03:17Z",
                        "id": "hhyYyLbngOMVMei6DnRCaV",
                        "rating": 1,
                        "workload": 20,
                        "_id": "hhyYyLbngOMVMei6DnRCaV",
                        "_type": "review",
                        "course": null,
                        "_rev": "hhyYyLbngOMVMei6DnRCXR",
                        "difficulty": 1
                    },
                    {
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "authorId": "FI2nrW7+VsXdUQgLu1QNEg==",
                        "_type": "review",
                        "_updatedAt": "2024-03-30T17:28:15Z",
                        "id": "hhyYyLbngOMVMei6DlkEn7",
                        "created": "2024-03-30T17:28:15Z",
                        "_createdAt": "2024-03-30T17:28:15Z",
                        "_id": "hhyYyLbngOMVMei6DlkEn7",
                        "body": "this course is not the best, ",
                        "workload": 40,
                        "rating": 1,
                        "_rev": "hhyYyLbngOMVMei6DlkEk3",
                        "course": null,
                        "difficulty": 4
                    },
                    {
                        "body": "This is it. This is the worst class in the OMSCS. Yes, I have taken Software Architecture and Design. This is worse. \n\nOnly 30% of your grade in this class is based on your own work. The rest is based on group projects. The volume of work in these group projects is impossible to complete alone or with 1 other person unless you're unemployed and not taking any other classes. So if you get stuck on a bad team, you are completely screwed. Your grade in this class is purely a matter of luck. You'd better pray that you have the good fortune to get at least 2 team members that actually do some work. Good luck with that. \n\nIf your teammates don't do any work, you're completely screwed. The instructor will not allow you to change teams or request additional team members. You will not be given extra time, even if you can prove that your teammates are not responsive. I literally showed Ploetz screenshots of my team members explaining why they would not be contributing to the project. He did nothing. \n\nLet me state this again: YOUR ACADEMIC COMPETENCE AND WORK ETHIC WILL NOT SIGNIFICANTLY IMPACT YOUR GRADE IN THIS CLASS. The work that you actually do barely matters. Your team determines your grade. ",
                        "rating": 1,
                        "_createdAt": "2024-02-05T15:45:26Z",
                        "_rev": "czvLVjfKQbSQNZjOPwswJc",
                        "course": null,
                        "_type": "review",
                        "workload": 30,
                        "id": "czvLVjfKQbSQNZjOPwswN8",
                        "created": "2024-02-05T15:45:26Z",
                        "_id": "czvLVjfKQbSQNZjOPwswN8",
                        "authorId": "o8HMU4BGyQsYYgXng2bOOw==",
                        "_updatedAt": "2024-02-05T15:45:26Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "difficulty": 4
                    },
                    {
                        "id": "Yrd8OglJjxc78vMjasexOB",
                        "created": "2024-01-09T03:53:55Z",
                        "_id": "Yrd8OglJjxc78vMjasexOB",
                        "_updatedAt": "2024-01-09T03:53:55Z",
                        "rating": 1,
                        "course": null,
                        "_rev": "Yrd8OglJjxc78vMjasexKa",
                        "workload": 20,
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "difficulty": 3,
                        "body": "Overall, I would not recommend this class. If you are in the HCI specialization, then prepare for a below average experience.\n\nThe course content is comprised of 4 professors teaching the subject. The course material is relatively straight-forward and the content/reading checks are incredibly easy. There are unlimited attempts so retaking them in encouraged. This will amount to your overall participation grade. No issues here. \n\nThe communication of the TA's/mentors running this course is where the course became pretty frustrating. A bit more on that in a moment. \n\nThe other issue is that there is a project which is worth more than 50% of your overall grade. I believe the group you are assigned will be the deciding factor in your attitude towards the class. You are able to choose the members of your group so find a good group early on. This is my most valuable advice to you. If you are put into a poor group, you will end up doing all the work unsure of your progress at all times due to inconsistent feedback from the project mentors. \n\nIt seems that Professor Starner does not give his TA's a full understanding of the project requirements (either that or there is some miscommunication) as we were at odds with our assigned TA multiple times making the project absolutely unbearable at times. Literal weeks were wasted going back and forth trying to get an understanding of our goals and what we could and could not do. \n\nThe final exam is easy if you study as the content is not difficult. There was one assignment which required an Arduino board. That was actually very fun and my favorite part of the course. In that moment, it felt like a ubiquitous computing course learning about sensors and making actual circuits. Only caveat is that it would be great if you didn't have to buy a $45 dollar kit only to use it once and never touch it again. If I could go back in time, I would center my final project around the Arduino somehow. \n\nSome TA's were great. Answering as much as they can and trying to organize as best as they could with what they were given. \n\nIt's not that I did not learn anything, it's that my memory of this class is tarnished due to what could have been avoidable if more care was taken into organizing the class. \n\n\n\n",
                        "_createdAt": "2024-01-09T03:53:55Z",
                        "_type": "review",
                        "authorId": "vsibVbdFfYHQ84sN6cGhvw=="
                    },
                    {
                        "_type": "review",
                        "_id": "EMDrCE8zqCAoxcS5c4LqAr",
                        "difficulty": 2,
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "body": "Embarrassingly unprofessional, pointless, and not up to the OMSCS standard.\n\nFull disclosure:  I have already received my grade and got a high ‘A’ in this course.  I learned absolutely nothing of any real importance, and I hate every moment of this course from week 1.\n\nI was going to be diplomatic in my review here, but Thad’s only real involvement in the online portion of this course was to show up twice a semester (via email) talking about catching cheaters in a smug and gleeful manner.  I wish he displayed the same level of enthusiasm for this course running smoothly as he did catching academic integrity violations.  Since both Thad and his TA’s can’t bother to be professional, I won’t either.  The content is mostly irrelevant and only exists to stoke the egos of the four professors running it.  That’s right, four professors, this is a common property problem where (apparently) nobody thinks its their job to fix the course administration.\n\nThis course opened at 2:00 PM on Friday of add/drop week.  Stuff happens, but let's not pretend a 30 second email could not have been sent out on Monday/Tuesday informing the class of what was going on.  I did not enjoy refreshing canvas all week to see if it finally showed up.  I even checked my registration to see if I had been accidentally dropped from the course. That gave online students 2 hours, during the workday, to look at the course before it would count as a 'W' to leave it.  That is about the level of respect that you can expect from Thad throughout the course.  I get the sense that the professors are used to younger undergrads, where lazy administration can be hand-waved away as a learning experience when it's really just unprofessional.  They adopt a \"wait and see\" attitude that can work on-campus and in person but does not work for online courses.\n\nThe TAs do not seem to be getting much (if any) guidance from him, nor does anyone care to even adjust the assignment asks to make sense for OMSCS.  There is an attitude from the course runners that would be appropriate to undergraduate students, but not really working professionals (lots of pretending bad directions and poorly constructed assignments are a ‘learning experience’).  The full-time student TA did not seem to understand that he is dealing with adults working full-time jobs in addition to this degree, which makes sense since he is on-campus and shouldn’t even be involved in the OMSCS section.  Frankly, most of us are busier than you are, and your lack of professionalism does not go unnoticed.  I don't expect an early-twenties TA without real work experience to understand that, but Thad should be embarrassed by how poorly this course is run.\n\nIf you want the only learning I got out of this class without having to take it, go download “phyphox” and mess around with your phone sensors.  The rest of the course content is hidden in cringe back-and-forth lectures that add nothing at best and are difficult to watch at worst.  Also, don’t expect any PDF or PowerPoint lecture summaries.  Most of the exercises are busy-work that seem to be there just to kill an in-person lecture period, so the instructor doesn't have to actually instruct.  Lots of \"turn the person next you and do this worksheet\" type of work.  This would be welcomed in-person but devolves to pointless busy work needing to coordinate random groups with very little notice.  We had almost no time (2-3 workdays) between the first group being formed (by the instructors) and the due date on Sunday night.  Insane…  They spend 2 weeks of lectures on the completely failed Google Glass, like it is 2015 and it might have meant something.  If this wasn't the egotistical professor’s pet project it would probably be a 15 minute note on the subject.\n\nI do NOT recommend you take this class unless you are in the HCI specialization, and in that case, prepare for it to suck.  My group and I could not wait for this to be over, it was a complete waste of time and massive stressor to deal with a poorly administered class.  Georgia Tech needs to get involved and force Starner (and the other 3) to actually make a full online version and split out the sections.  Let me repeat that:  they cannot be bothered to separate online and in-person.  Several exercises require you to get a partner from the class, this is just incredibly lazy for an online class.  I do not want to have to involve friends/family because you cannot be bothered to adjust this course to being actually online.  This is a “cool” exercise that would be easily completed in an in-person lab session, but it is a needlessly tedious waste of time online.\n\nYou are a second-class citizen to the on-campus people, none of the assignment instructions are even edited to acknowledge online is a thing.  Be prepared to have to clarify a lot of questions about grading/assignments/dates that should have been spelled out in the syllabus on the first day.  Requirements are inadvertently hidden from online students until someone asks a clarifying question.  You have to ask constant clarifying questions and get TA pushback for your trouble.  Hey TAs:  put the details in the assignment if you don’t like answering “repeat” questions.\n  \nDon't expect the hardware assignment to have any lectures pertaining to it, they give the history of Google Glass instead, go figure it out on your own and enjoy doing so remotely without being able to even touch the same hardware as your groupmates.  Presumably, they discuss this in detail in the on-campus classes since the assignment description has this in it:  \"We will go through the first task together during the first session. Make sure that you don't get stuck for long at any place and feel free to ask for help. The TAs will be around all the time. Happy tinkering!\"  First, what session?  Second, don't get stuck for too long?  You gave us barely a week to do a hardware project with people we can't even meet with.  And it was due at the same time as the OTHER group project, because that one needed to be pushed back since they couldn’t be bothered to even start the class on time.  Then they had to redo the groups, because 15% of the class had withdrawn by week 2.  Somehow, this was a surprise to the professor, which indicates that they really are not aware of how poorly this course is administered online.  I assume some of those withdrawals would have been simple drops (and other people could have added), but we were only given 2 hours during the workday to make that assessment due to the late start.\n\nThe obvious solution here is to have one professor do an on-campus section and have another professor do the OMSCS section for each semester. There is a high cognitive load on the student to even know what is due and when since there is no respect for the asynchronous nature of an online course.  \n\nBy far, this is the laziest administrated course I've taken in both OMSCS (this is my last class).  I was really hoping they would have fixed most of these problems in the previous 4-5 semesters that this course has been offered online, they have not.  Stop expecting TAs to meet weekly with a half-dozen groups of online students in addition to on-campus groups.  This is a complete failure of course processes if that is even necessary.  Define requirements thoroughly and put it in a PDF like every other course, this is amateur hour of course administration.  There's no excuse because they could have and should have involved their OMS professor peers here, there is no need to do this in a vacuum.\n  \nPlease go talk to Dr. Joyner and figure out how poorly you’re doing compared to your peers.  It's ridiculous how misaligned this course is, and I'm surprised it was even allowed to be offered in this current state.  Thad was surprised by a lack of online office hour attendees, we all work full-time, we're as busy or busier than you and the full-time students by the very nature of this program.  We don't need you to hold our hands in office hours, we need you to do your job and design projects that can be completed remotely without constant professor/TA involvement.  If we're lucky the professors will receive a slap on the wrist by the College of Computing/OMSCS and be told to actually administer an online version of this course.  If I was a new student and thought this class was representative of OMSCS as whole I would be assuming this degree is a joke and dropping out of the program completely.  \n",
                        "id": "EMDrCE8zqCAoxcS5c4LqAr",
                        "created": "2023-12-29T21:12:42Z",
                        "rating": 1,
                        "_updatedAt": "2023-12-29T21:12:42Z",
                        "_createdAt": "2023-12-29T21:12:42Z",
                        "_rev": "EMDrCE8zqCAoxcS5c4Lq9K",
                        "authorId": "daz28+ORmWoNJLdWj/90Uw=="
                    },
                    {
                        "rating": 2,
                        "body": "OK. Class basics: So this class is a guaranteed B and easy A. I got an A, and based on the rubric grading, I cannot see how someone could less than a B. A lot of modules broken down into about a dozen topic areas. \"Prompts\" are just unlimited attempts roughly a week apart (maybe a little more sparse). Then there are one or two exercises in each topic area. The exercises take a little more time, but honestly, I do not think more than an hour (most extremely less time). There are two group exercises that do take a bit more time. You get put into a group for the first one.\nThen you have a group project where you can pick your team. This is the bulk of the grade. Again, I got a really great group. I did socialize early though. Yes you have to put time into this, but again nothing really that big. I said I put in 6 hrs/wk (at least half of the course though was much less). I think that is accurate. That time was really due to the group project more than anything else. This semester you had to write a couple pages for research instead of a midterm. This was the only thing I got worried about due to work life balance. But I knocked it out in somewhere between 3-4 hrs.\nAgain, the grading is abouth the rubric and the grading is generous (although I may have disagreed on some points, who cares in the end if the grade is still an A ).\nNow for the course itself. This is basically just a survey course of the material that is out there. I didn't learn a whole lot that could actually \"be used\". And I am not referring to learning coding algorithms, just having anything coming from the class to use. Just a couple peices of useful information every now and then (and that wasn't much). This might be appealing to people though. The instructor always has his Google Glass glasses on because he worked on them. It gets really obnoxious. Also the product is always being brought up as if it is the pinning achievment of technology. It just got annoying to me after a while. After taking the class I try to think what I learned, and I really can't say I learned anything.\nSo easy A, but fairly useless class.",
                        "difficulty": 2,
                        "_createdAt": "2023-12-19T19:40:59Z",
                        "workload": 6,
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "id": "j07GwiPkUVDQQ5A5oRszYI",
                        "created": "2023-12-19T19:40:59Z",
                        "_id": "j07GwiPkUVDQQ5A5oRszYI",
                        "authorId": "CeCFXKcZ3Al9kC8Wvk5heA==",
                        "_type": "review",
                        "course": null,
                        "_rev": "j07GwiPkUVDQQ5A5oRszWW",
                        "_updatedAt": "2023-12-19T19:40:59Z"
                    },
                    {
                        "id": "biJ44PowJMKgkMZd1ATdM9",
                        "rating": 4,
                        "_updatedAt": "2023-08-08T19:54:40Z",
                        "workload": 7,
                        "_id": "biJ44PowJMKgkMZd1ATdM9",
                        "body": "The content is fun and there was one exercise to be done with a Arduino board (with some sensors and actuators) - this was fun, but would have been great if there were multiple iterations of this exercise (as we spend around $45 for the board).\nThere were 'prompts' from the lectures that were due every week. Some of them were multi choice questions, but also included few questions that required 150 word answers (dont think this was graded by anyone and we received full grade for the essay answers).\nThe Ed board was a mess (compared to other subjects at least) - from day one there were over-enthusiastic individuals looking for team members and inquiring about third or fourth assignments. \nThere were no official team selection criteria - Most of the teams were random. \nThe project topic could be anything that is useful in the real world and uses sensors. It was fun to work on (actually made use of the Arduino board here). The project required updates in the form of videos, short trailers, and a final presentation which had very limited time to be recorded. \nAnother problem that I faced for this course is the submission day cadence - some assignments were due end of Sunday, some on Saturday and the project submissions were always mid-week which was confusing.",
                        "difficulty": 1,
                        "course": null,
                        "created": "2023-08-08T19:54:40Z",
                        "_rev": "biJ44PowJMKgkMZd1ATdI6",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U"
                        },
                        "_createdAt": "2023-08-08T19:54:40Z",
                        "_type": "review",
                        "authorId": "xNrgBxc91yhu7pRQAbWlkA=="
                    },
                    {
                        "id": "ph5Aem2mzqa5NpY5m7FVbA",
                        "_rev": "ph5Aem2mzqa5NpY5m7FVDu",
                        "authorId": "NY4g4d52fN39h+Un1yQDkg==",
                        "semester": {
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_type": "review",
                        "_id": "ph5Aem2mzqa5NpY5m7FVbA",
                        "course": null,
                        "created": "2023-08-03T02:47:47Z",
                        "_createdAt": "2023-08-03T02:47:47Z",
                        "body": "I took this class over the summer. Overall, it was one the best courses that I’ve taken here. Some random points:\n•\tWe had to buy a $45 Arduino kit. There was only one homework assignment where we had to build some circuits. After that we had no use for it. In my opinion, they should drop the Arduino module altogether.\n•\tFinal project was required to be a mobile project. Apparently in previous terms they had feedback that it was hard for team members to coordinate hardware projects. They did make exceptions though because I did see some micro-controller projects in the final video presentations.\n•\tThe TA’s were very helpful. They were generous in grading and receptive to regrading if you explained why you answered incorrectly. \n•\tThe videos are well done. Most videos had dialogues between top professors in the industry, Dr. Zeagler, Dr. Starner, Dr. Abowd, and Dr. Ploetz. I believe they rotate in teaching this course. For my semester, Dr. Zeagler taught. I’m glad he did, he seems genuinely interested in student’s success. If you’re in no hurry to take the course, wait until Dr. Zeagler teaches it.\n•\tShout out to the head TA Cynthia for running the course smoothly and listening to all our concerns.\n",
                        "_updatedAt": "2023-08-03T02:47:47Z",
                        "difficulty": 1,
                        "rating": 5,
                        "workload": 12
                    },
                    {
                        "_rev": "Z8lmzTuc5emciZPRAp6JPe",
                        "_type": "review",
                        "_createdAt": "2023-06-04T19:41:54Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "_id": "Z8lmzTuc5emciZPRAp6JSd",
                        "_updatedAt": "2023-06-04T19:41:54Z",
                        "course": null,
                        "id": "Z8lmzTuc5emciZPRAp6JSd",
                        "authorId": "PM9ZOJQTsUIQmv8nTTGxQg==",
                        "workload": 15,
                        "created": "2023-06-04T19:41:54Z",
                        "difficulty": 2,
                        "body": "Overall: Terrible class. This is one of, if not the most pointlessly tedious courses in the program. Artificially made more difficult and tedious by handcuffing students. Not hard in a technical sense, but in a VERY tedious.\n\nIndividual Work:\nSenseless and silly little quizzes/exercises on topics the professors thought was \"cool\". What really makes it suck is they do not provide power point slides for the lectures, just to make it that much more annoying so you get to spend hours taking notes. As a result, you spend most of your time combing through the videos to find the answers to the quizzes/exercises. Its a very tedious and poor way to design a course. I don't feel like I learned anything by doing this.\n\nGroup Work:\nArduino. What more can I say. There is one group exercise that requires your to use the damn thing. Which makes no sense as we are a fully online and remote group. This was a nightmare. All 4 of us had to get the exact configuration the others had to run the Arduino code. It was easily one of the most frustrating time sinks I ever had in this program. The worst part is, I will NEVER in my life use a damn Arduino again, so all this time was wasted. This Arduino project is purely done because one of the professors thought it would be \"fun\". It's not. Its frustrating, annoying, and adds no real world value. Luckily, you can return the damn thing after this silly little group exercise.\n\nIf you are smart you will NOT do the main group project using an Arduino. Just do a mobile app, which was encouraged by the TA's as well. This mobile app heavily depends on the group you get. I will not comment on this much as you all should know by now how the roulette of GaTech students goes. Getting a group early tends to give better results as the students who actually stay on top of their work tend to get a group earlier.\n\nThis was my 8th class in the program and first ever review on here. I never had the desire to make reviews but this class was so shit I had to warn the rest of you. Unfortunately, if you are in the HCI Specialization you have to take this course. If you are not in the HCI Specialization do yourself a favor and pick an elective that will actually be somewhat fun/interesting.",
                        "rating": 1
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "_id": "bKSRXDuTtNOB1Cc926bHvQ",
                        "authorId": "nxSQb6FOcVHHJT2ueblSNQ==",
                        "_updatedAt": "2023-05-11T17:33:28Z",
                        "rating": 3,
                        "course": null,
                        "_rev": "bKSRXDuTtNOB1Cc926bHs3",
                        "_type": "review",
                        "body": "It is more interesting than it looks, but a bit more basic as well... Still, sounds easy, and it is easy, but not that easy to obtain an A... \n\nHours are wrong, and nobody remembers about the mandatory required CITI courses:\n- Responsible Conduct of Research (1 — Basic Course)\n- Human Research (Group 2 Social / Behavioral Investigators and Key Personnel — 1 Basic Course)\nThese take a large number of hours, and you have to do them in a couple of weeks... I printed some chapter that was like 60 pages on PDF, the first weeks I had to put like 30 hours on this, although later I was sometimes putting in 7 or 8, each course on lectures or videos are dozens of hours. I printed the course, \n\nThe videos edition seems not finished.",
                        "id": "bKSRXDuTtNOB1Cc926bHvQ",
                        "created": "2023-05-11T17:33:28Z",
                        "_createdAt": "2023-05-11T17:33:28Z",
                        "difficulty": 2,
                        "workload": 16
                    },
                    {
                        "course": null,
                        "_type": "review",
                        "created": "2023-04-30T18:21:16Z",
                        "workload": 7,
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "body": "Uh, weird course. Subject matter is incredibly interesting and the lectures are very engaging. But everything else is at best immature as an online course and at worst plain awful. There are some major problems with this course:\n1. It's both online and in-person, and Canvas is shared between the two. This creates a lot of confusion about what information is relevant to which group of students (online or in-person). TAs sometimes forget there are online students, and a lot of exercises require in-person collaboration. When asked how to complete those, TAs give conflicting replies that are basically along the lines of \"dunno, we didn't think about that\".\n2. There is a major disregard for the syllabus and rubrics when it comes to grading. The staff keep changing rules, sometimes after assignment deadlines have passed. Grading is also inconsistent and seemingly random, or at the very least poorly communicated.\n3. The group project suuuuucks online. I'm sure it's better in-person, but most of the projects are hardware-based, which creates difficulties by itself. On top of that, the TAs make the requirements for the projects seem relatively open and permissive, yet then grade submissions very harshly (again, based on some made-up rules that are explained after-the-fact). I think they should just have smaller individual projects for online students instead.\n4. The auto-graded Canvas assignments are very simple in theory, but incredibly time-consuming and frustrating in practice. They're mostly multiple choice \"pick the most correct answer\" sort of deal, with all of the answers being right in some aspect and wrong in some aspect. At least they offer multiple atttempts. So instead of using knowledge to answer them, it's a game of trial-and-error until you find the \"correct\" choices.\n\nThe course has its bright moments, and as previously stated, the actual content is very unique and incredibly interesting, and the multiple lecturers do a very good job at covering a very broad topic from different perspectives and sub-areas. But in hindsight, I slightly regret taking this course simply due to the \"frustration factor\" that comes with it. I'm still finishing up the take-home final exam, so I'm not sure what the final grade is going to be, but so far it's looking like it's going to be my worst in the program (and this is my 10th course). Not because I couldn't understand the subject matter - it's actually incredibly approachable - but simply due to the weird grading and general awfulness of the assignments.",
                        "_id": "izKdQKGWKnehyWbkvpyg6t",
                        "authorId": "pYQsJdBYdTuRHWL4dnJk7Q==",
                        "_updatedAt": "2023-04-30T18:21:16Z",
                        "id": "izKdQKGWKnehyWbkvpyg6t",
                        "difficulty": 3,
                        "_rev": "izKdQKGWKnehyWbkvpyg3I",
                        "rating": 2,
                        "_createdAt": "2023-04-30T18:21:16Z"
                    },
                    {
                        "_updatedAt": "2023-04-28T19:48:09Z",
                        "body": "I took this course in Fall 2022 entirely online with Professor Starner. After taking several courses in this program, this class was my least favorite and by far the most unorganized.\n\nThe other reviews before me describe the assignments and projects well, so I won’t go over them again here. \n\nThe content is high level and not challenging but did become time-consuming as you must progress on the semester-long GROUP project and complete the labs and assignments given at the last minute.\n\nThis course was poorly managed by the teaching staff, feedback was lacking, and grading was unfair and not in line with the rubric. Some of the TA responses and feedback were just wrong, and it took them a long time to post them. For example, we received late, generic, unhelpful feedback on our half-time report for our semester-long project. We had to ask for clarification several times until the professor got involved (after about a week of back-and-forth emails). The professor finally gave us proper feedback, although that feedback even had issues. The professor said he wanted to teach us the “right” way to write a report, but we were unaware we were writing it the “wrong” way since we had never previously received that feedback and the template posted for us to follow had the “wrong” way. This is just one example of the disorganization of the teaching staff and the inexperience of the TAs; most of the TAs had undergrad tags in their emails.\n\nIn summary, I’m glad this course is over. It’s disappointing that this course was allowed to be taught this way. One thing this course did do right was assigning a mentor for us to meet once a week. Our mentor was a professor, and he was not part of the teaching staff.",
                        "_createdAt": "2023-04-28T19:48:09Z",
                        "_rev": "izKdQKGWKnehyWbkvYxj0H",
                        "course": null,
                        "authorId": "kL2PDajrQSpmoxZZ3wm9Gw==",
                        "rating": 2,
                        "_type": "review",
                        "id": "izKdQKGWKnehyWbkvYxj3s",
                        "workload": 18,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "_id": "izKdQKGWKnehyWbkvYxj3s",
                        "created": "2023-04-28T19:48:09Z",
                        "difficulty": 2
                    },
                    {
                        "_id": "ojGpuoLqWcC94EPn3gmwfb",
                        "body": "tl;dr Fall'22 offering was very disorganized that affects both your grade and your learning. Don't take this course unless wearable computing is part of your career.\n-----------\nI got an A in this course, but I am very pissed about this course. I will try to keep my opinions in the end.\n\nDescription of Content:\nThe course tries to give you an overview of the challenges of ubicomp. There are modules like the rest of the courses, but they don't dive deep into anything (which was annoying for me). This includes everything from sensors to design principles. There are assignments that mostly don't take a lot of time to complete, but require doing some activity (ex: moving around a place and doing something on your phone). There are required readings that won't affect your grade much. The main load lies in the group project. You choose from 12 ideas that mainly give you room for novelty. You get assigned a mentor that you do weekly meetings with.\n\nFacts:\n1. The course load wasn't smoothed out across the semester as the first 1.5 months didn't have anything to be done, and then everything got compressed for the rest of the semester\n2. Assignments can be posted suddenly with a due date of 4 days. \n3. Grading is done very late \n4. Grading isn't descriptive and might seem illogical\n5. The TA that will grade your assignment and group project might be an undergrad\n6. Some assignments get graded without proper feedback\n\nOpinion:\nMy problem with this course is how disorganized it was. It was already hard to work as an online team on the group project, but the TAs and the professor, Thad Starner, made it even harder. Grading of the early submissions of the group project was very clearly done incorrectly. It was clear because we got feedback 1 at the beginning. When we requested clarification, we got a totally different feedback 2. When we asked for a regrade, we got a different feedback 3. When we insisted, we got a different feedback 4. All of the reasons why we lost grades have been downright wrong and don't exist in our group project nor even the rubric. This was extremely infuriating if you have done a lot of effort and then find out that (with all my respect) an undergrad TA will not give enough time to read your report and still deducts a lot of grades from it. What is even more infuriating is that when you elevate this to the Head TAs and the professor, they don't react properly and still continue giving vague reasons for losing grades that are 100% refutable. This hasn't been rectified till now after the semester was complete, and the grades we lost for most project deliverables don't have proper feedback on why we lost them. It was very unprofessional from the teaching staff and doesn't suit GaTech by any means. To give a picture of how disrespectful this felt, If I hadn't got an A, I would have probably elevated this to the GaTech office to investigate this.\n\nThe only good thing about this course is that I interacted more with the GaTech community than other courses. You get to be in a team which was hard but new, and you get a weekly meeting with a professor for 30mins which was nice. ",
                        "authorId": "HcT0wCV+2ypQx4I3dGS++g==",
                        "id": "ojGpuoLqWcC94EPn3gmwfb",
                        "difficulty": 3,
                        "workload": 15,
                        "_rev": "ojGpuoLqWcC94EPn3gmwbq",
                        "course": null,
                        "_type": "review",
                        "_createdAt": "2022-12-21T19:19:31Z",
                        "_updatedAt": "2022-12-21T19:19:31Z",
                        "created": "2022-12-21T19:19:31Z",
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        }
                    },
                    {
                        "body": "\nIt's an awesome course, though it's offered first time Online in Spring-22 so there will be some improvements along the way. \n\n\nNOTE: The course needs a Hardware Kit \"ELEGOO UNO Project Super Starter Kit with Tutorial and UNO R3 Compatible with Arduino IDE\" order ahead of time. \n\n\n-> Grading Scheme: \nProject: \t\t\t\t        50%\nExames: \t\t\t\t20% (10% each)\nIndividual Assignment: \t10%\nGroup Exercises (two):       10% (5% each)\nClass Participation \n(exercises): \t\t\t         8%\nClass Participation: \n(quizes): \t\t\t\t  2%\n\n\n-> Project: \nIt's the most weighted and important part of the course. You make teams of 3-4 members and use hardware to create a Ubicomp device. Different projects are suggested by the instructor and student skills are matched to make teams. There 2 checkpoints in the project; In the first checkpoint 2 project teams are engaged in a discussion, to present the project and give feedback on each other team's project. \n\nAt the end of the project, a final report and/or project code and demo are submitted. Students also create 2 videos one after submitting the proposal and one to demonstrate the final project. \nAll project reports are graded so project grade doesn't only depend on the final report. Teams must work very efficiently on the project and its demands. \n\n\n-> Individual Assignment: \nIt's an essay that shall be of the same quality as a research paper. The topic is usually available in the 2nd or 3rd week of class. Do start working early on it because one needs to explore some research papers to write it. It must be done individually. \n\n\n-> Group Exercises: \n1st group exercise will need some data processing tasks, knowledge of Jupiter notebook and sci-kit learn, matplotlib etc can help. However, the main task needs to process signal data. It's the most challenging part of the course given that it is the first assignment in the course and needs a lot of effort. Start it as early as possible. \n\n2nd group assignment is based on the hardware kit, having some electronics and Arduino knowledge may help but is not needed. This one can be done on time easily. I suggest do start early. \n\nClass Participation Quizzes and Exercises: \nThe quizzes are unlimited attempts with unlimited time so a brute-force can be done though it seems to change in the future. Usually, the material from lectures is covered in these. \n\n\n-> Exams: \nExams are open books and need you to provide a solution for a ubicomp use case. At least a week is provided to solve it. \nI lack some scores in Exam-1 and didn't submit a regrade which I should have done. \n\n\n-> Professor and TA: \nProfessor Thomas Plotez is very cooperating and mentors projects. He, himself schedules meeting with student groups and is available if you are stuck. Also, if you find yourself interested in doing research in Ubicomp, you must attend this class. \n\nAll TAs are very cooperative and ample attention is given to students. In fact, you feel like an On-Campus student. Though I may not get an A in this course, however, I liked the course. \n",
                        "id": "external-import-2abdcfdb-ee29-4eba-9504-2d437be3bffc",
                        "workload": 6,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "_id": "external-import-2abdcfdb-ee29-4eba-9504-2d437be3bffc",
                        "_createdAt": "2022-05-02T12:16:57Z",
                        "rating": 5,
                        "created": "2022-05-02T12:16:57Z",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "difficulty": 3,
                        "workload": 10,
                        "_type": "review",
                        "course": null,
                        "id": "external-import-e2b41db7-c279-4f8e-80be-db7ac831b101",
                        "created": "2022-04-08T21:47:08Z",
                        "_id": "external-import-e2b41db7-c279-4f8e-80be-db7ac831b101",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "body": "Wanted to get this out there before the end of the semester in case people are thinking about taking it. First off I want to state that the TA's and the prof were fantastic for this course, by far some of the most engaged individuals I've had the pleasure to learn from after 6 other courses. With that this class is really high level with very little hands on work. There are two \"physically\" hands on assignments, one of which is a group assignment so unless you just do it on your own you're getting nothing from it. There is, so far, only individual assignments that touch on how to actually do some of this stuff in the real world. In it you are using RSSI signal strength to triangulate where your phone is (the script given is super shoddy so you'll probably have to debug it). The vast majority of the class is undergraduate level lectures, which are fairly interesting if you want high level information, and a giant semester spanning group project. And that's where this falls apart. To me it feels like a semester of weekly meetings and busy work, which if you already do that for your job gets a bit old. With that, I'm actually frustrated that I wasted a semester just reenacting my day job instead of learning something new. Was really hoping to walk out having done some practical hands on work. Probably great as an on campus course but doesn't work super great online.  ",
                        "_createdAt": "2022-04-08T21:47:08Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    }
                ],
                "created": "2022-07-05T23:23:15Z",
                "isFoundational": true,
                "_type": "course",
                "codes": [
                    "CS-7470"
                ],
                "programs": [
                    {
                        "acronym": "CS"
                    }
                ],
                "id": "external-import-CS-7470",
                "officialURL": "https://omscs.gatech.edu/cs-7470-mobile-ubiquitous-computing",
                "description": "Investigates the infrastructure required to develop mobile and ubiquitous computing applications and establishes major research themes and experimental practices.",
                "slug": "mobile-and-ubiquitous-computing",
                "syllabus": {
                    "url": "https://docs.google.com/document/d/15mIhtnfy2kK4d2n4fWB8ljrjVFOIz3PvWePgVIn7Wpg/edit"
                },
                "creditHours": 3,
                "name": "Mobile and Ubiquitous Computing",
                "_id": "external-import-CS-7470",
                "_createdAt": "2022-07-05T23:23:15Z",
                "_updatedAt": "2023-08-11T18:39:13Z",
                "tags": [],
                "syllabusUrl": "https://docs.google.com/document/d/15mIhtnfy2kK4d2n4fWB8ljrjVFOIz3PvWePgVIn7Wpg/edit",
                "rating": 2.1875,
                "difficulty": 2.375,
                "workload": 14.8125
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "mobile-and-ubiquitous-computing"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}