{
    "props": {
        "pageProps": {
            "course": {
                "slug": "network-science-methods-and-applications",
                "_id": "external-import-CS-7280",
                "syllabus": {
                    "file": {
                        "_type": "file",
                        "asset": {
                            "_ref": "file-ba6d7139ebc0df0ab105aa08ebe66e53a0aebd32-pdf",
                            "_type": "reference"
                        }
                    }
                },
                "name": "Network Science: Methods and Applications",
                "isFoundational": true,
                "isDeprecated": false,
                "officialURL": "https://omscs.gatech.edu/cs-7280-network-science",
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/ba6d7139ebc0df0ab105aa08ebe66e53a0aebd32.pdf",
                "codes": [
                    "CS-7280"
                ],
                "_rev": "959qsafI8uoLDPJecgcmVL",
                "_updatedAt": "2022-08-25T04:28:04Z",
                "creditHours": 3,
                "_type": "course",
                "reviews": [
                    {
                        "created": "2024-08-23T13:28:33Z",
                        "_id": "So8d9Kk50nkF3J4M8CIKk0",
                        "_updatedAt": "2024-08-23T13:28:33Z",
                        "rating": 5,
                        "body": "I thought this course was excellent. The material was interesting, the video lessons clear, the assignments enjoyable, and the TAs helpful. It's hard to imagine how an online course could be better.",
                        "id": "So8d9Kk50nkF3J4M8CIKk0",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME"
                        },
                        "_createdAt": "2024-08-23T13:28:33Z",
                        "course": null,
                        "_rev": "So8d9Kk50nkF3J4M8CIKj7",
                        "workload": 20,
                        "difficulty": 3,
                        "_type": "review",
                        "authorId": "5ay3Qq60XSe2KK3VgvNJGQ=="
                    },
                    {
                        "id": "0zwV6JWkoiMq9vnKySAbXk",
                        "_updatedAt": "2024-08-07T19:42:32Z",
                        "course": null,
                        "_rev": "0zwV6JWkoiMq9vnKySAbTh",
                        "semester": {
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z"
                        },
                        "body": "This is the worst course I have ever taken. The instructor and TAs are unprofessional, and the course is not useful at all. They changed many scores without any reason and gave the worst scores. No one responds to your questions if you send an email. Everything about this course was bad. Do not waste your time.\n\n",
                        "created": "2024-08-07T19:42:32Z",
                        "difficulty": 3,
                        "_id": "0zwV6JWkoiMq9vnKySAbXk",
                        "_createdAt": "2024-08-07T19:42:32Z",
                        "_type": "review",
                        "workload": 10,
                        "authorId": "t7u0m0cOWvHAoSzQgpzUqw==",
                        "rating": 1
                    },
                    {
                        "created": "2024-07-24T17:44:46Z",
                        "semester": {
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19"
                        },
                        "_id": "GDxJY9xbxPgDgifFl7OmPg",
                        "_createdAt": "2024-07-24T17:44:46Z",
                        "_rev": "GDxJY9xbxPgDgifFl7OmNv",
                        "difficulty": 4,
                        "id": "GDxJY9xbxPgDgifFl7OmPg",
                        "course": null,
                        "authorId": "erIST4vceSRSmEIkNQU1IQ==",
                        "workload": 12,
                        "body": "I enjoyed this class. I have a background in mathematics, and am in OMSA so while the maths and proofs were pretty easy, I at times found the coding elements of this class more challenging than an OMSCS student might have. I'd never used the networkX package before, but found it common-sensical and VERY well-documented. I spent maybe more time than most on homework assignments, but I found them engaging, interesting and novel compared to what else I've encountered in OMSA. Also on that, HW weeks were much more involved than non-HW weeks, despite having two lessons' material to review in non-HW weeks.\n\nTA interaction on Ed Discussion was mixed. The TAs worked very hard to have HW2 graded prior to the class withdraw deadline, giving students a better idea of their standing in class. That is awesome. But I tended to do homework on the weekends, and I don't recall there being many (if any) office hours scheduled for the weekends. Students sometimes asked questions on Ed Discussion for TA help, and they'd sometimes stay 'Unresolved' for days, often the weekend before HW was due. These are challenges of asynchronous learning, and I think because this isn't a 'core' class in any program, they may struggle to have TAs on call as it were.\n\nThat said, the homeworks make up 65% of your grade, and at least in the summer semester, the lowest HW grade is dropped (as well as your lowest two quiz scores of 14), so it's nice in that a couple very poor showings won't ruin your entire grade. I'd take this class again.",
                        "rating": 4,
                        "_updatedAt": "2024-07-24T17:44:46Z",
                        "_type": "review"
                    },
                    {
                        "created": "2024-04-26T16:06:34Z",
                        "_updatedAt": "2024-04-26T16:06:34Z",
                        "difficulty": 3,
                        "rating": 3,
                        "course": null,
                        "id": "TkbJzK0vW4Wob0w96wv4O4",
                        "body": "The subject matter of the course is interesting and the quizzes and homework aren't too hard. The main issue I had with this course was 1) the lack of TA response on the Ed forums. Some TAs were really good about this but for the rest I wouldn't be surprised if they didn't reply to more than 5 post the whole semester. For example for quiz 12 or 13 I think all the questions on the discussion post were left unanswered until less than 12 hours of when the quiz was due!  2) The quiz grades are released a week after they are due even though they are auto-graded. ",
                        "_type": "review",
                        "workload": 8,
                        "authorId": "4kluWNzA+TUcEksL17C2JA==",
                        "_createdAt": "2024-04-26T16:06:34Z",
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "_id": "TkbJzK0vW4Wob0w96wv4O4",
                        "_rev": "TkbJzK0vW4Wob0w96wv4L1"
                    },
                    {
                        "created": "2024-01-04T20:04:27Z",
                        "_rev": "So3eNGHfSOg3xoOFmSp0vP",
                        "workload": 4,
                        "_id": "So3eNGHfSOg3xoOFmSp0y9",
                        "difficulty": 1,
                        "_updatedAt": "2024-01-04T20:04:27Z",
                        "course": null,
                        "_type": "review",
                        "rating": 3,
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "id": "So3eNGHfSOg3xoOFmSp0y9",
                        "authorId": "R8l0R4kwK0XSbtOW5wjGEQ==",
                        "body": "Overall this course is a good intro to network science and sets you up some of the basics of the field. I thought some of the material was quite interesting, though felt that it could be a really valuable course if it dived in deeper to more applications and graph neural networks (since it's one of the ML specialization courses). It felt a bit too high level and cursory at many points. For example the neural network applications was only in one  lecture in the final week of the course, with no hands on work in the final assignment. \n\nThis course is by far the easiest one I've taken in OMSCS. The weekly readings are pretty easy to fly through, and the quizzes are 5-7 questions  untimed. There are only 5 assignments throughout the course that didn't take more than a few hours each, and no exams. The assignments themselves should be improved to be more interesting and more application focused. As is, they simply let you practice some of the concepts from the lecture and get you familiar with the networkx package. However, they're at least very straightforward and don't require much clarification, and for the most part were graded fairly. Some TAs seemed to be a bit more nitpicky with their grading such as with formatting plots, labels etc.",
                        "_createdAt": "2024-01-04T20:04:27Z"
                    },
                    {
                        "authorId": "jiSBPxsSUJFAZWj0X6rCyQ==",
                        "difficulty": 3,
                        "body": "Course Description:\n\n- Lectures: I personally like text-based lectures as it saves a lot of time. What I did not like was that these lectures use notations and terms without ever defining them or providing any reference. You need to refer to the book to understand some parts. Content is Maths heavy but you do not need to understand it completely to grasp the concepts.\n\n- Quiz: Quizzes were mostly fair but I agree that quite a few had ambiguous questions. You have unlimited time which is sometimes useful and sometimes tricky.\n\n- Projects: Projects were fairly easy due to the networkx library. The only part we had to implement ourselves was the motif finding algo from a paper, which is not too difficult.\n\n- Issues: I liked the content, but the course never took off. It always felt like the first week of the course. Since there is no exam, it is easy to speedrun through the weeks lectures and complete the quiz. There was no effort to connect different parts of the course or enable retention of core concepts. The professor is completely absent from the course.",
                        "_type": "review",
                        "_id": "Pm4H4xdFhHJgzHn4Zpo462",
                        "_updatedAt": "2023-12-19T10:29:29Z",
                        "course": null,
                        "created": "2023-12-19T10:29:29Z",
                        "workload": 9,
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "_createdAt": "2023-12-19T10:29:29Z",
                        "_rev": "Pm4H4xdFhHJgzHn4Zpo42e",
                        "rating": 4,
                        "id": "Pm4H4xdFhHJgzHn4Zpo462"
                    },
                    {
                        "created": "2023-12-13T13:37:09Z",
                        "_updatedAt": "2023-12-13T13:37:09Z",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "_type": "review",
                        "authorId": "CJsHkG9iRi7KVP3msEBxlg==",
                        "workload": 10,
                        "id": "Pm4H4xdFhHJgzHn4Z6gzYq",
                        "_rev": "Pm4H4xdFhHJgzHn4Z6gzVS",
                        "_id": "Pm4H4xdFhHJgzHn4Z6gzYq",
                        "course": null,
                        "difficulty": 4,
                        "_createdAt": "2023-12-13T13:37:09Z",
                        "rating": 5,
                        "body": "This is my first course in the program and I truly enjoyed the contents. I highly recommend this course to anyone interested in data science and ML.\n\nFor those who don't have a CS or math background (like myself), ensure you understand all the questions in the prerequisite test before you sign up for the class. You don't need to know all the answers, but you should at least be able to figure out the answers after reading some wiki articles. (This is essentially a math class for me!)\n\nThe course is quite tough for me because I don't have a math background, but it was also one of the most intellectually satisfying classes I have taken.\n\nMost TAs are really great and patient, except two who selfdom reply to questions on Ed Forum. Thankfully, these two TAs also tend to grade very leniently lol"
                    },
                    {
                        "id": "82cNgj2inMQdAXMxwiLlst",
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "_id": "82cNgj2inMQdAXMxwiLlst",
                        "workload": 12,
                        "_rev": "82cNgj2inMQdAXMxwiLlp9",
                        "authorId": "w1iKInaZlhWHxhBh8cNKNA==",
                        "difficulty": 3,
                        "_type": "review",
                        "_updatedAt": "2023-12-06T19:18:09Z",
                        "_createdAt": "2023-12-06T19:18:09Z",
                        "body": "The concept of network science is great, I was so excited about this course and hoping to learn from this course so I can apply it in different application. \nThis is Network Statistics course, machine learning on networks was mentioned briefly in last week without proper practicing. \n\npoor lecture explanation, no videos for lectures, just text to read which is a copy/paste from the textbook. \nTAs grade assignments based on final result only, they focus on cosmetic issues like graph axis title, legend rather than the understanding of the concepts. \nThis course has a potential to become more interesting and more practical but unfortunately the way they structured this course made it extremely boring and useless. ",
                        "created": "2023-12-06T19:18:09Z",
                        "rating": 1,
                        "course": null
                    },
                    {
                        "_id": "HuiHeyCDns6YHDupkSvvCR",
                        "course": null,
                        "workload": 12,
                        "rating": 1,
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "created": "2023-11-23T01:28:35Z",
                        "_updatedAt": "2023-11-23T01:28:35Z",
                        "_rev": "HuiHeyCDns6YHDupkSvv9L",
                        "_type": "review",
                        "body": "This was hands down the worst class i've taken so far into the program. TA's are unresponsive and take ages to release grades - we just got our grades for A3 it was due over a month ago...\nTopics are really uninteresting first 2.5 modules are foundational and necessary and somewhat interesting, but then after that its just so.... boring? The final module is on GNN which in an ideal class would be 50% to 70% of the class focus but all you get is one quiz on it - no idea why this class is part of the ML track if thats the case highly recommended you take something else in the meantime.",
                        "id": "HuiHeyCDns6YHDupkSvvCR",
                        "_createdAt": "2023-11-23T01:28:35Z",
                        "authorId": "lq2i70VEyEPs6A7BHVOefw==",
                        "difficulty": 3
                    },
                    {
                        "id": "llHPdpE6t2d8pDZnUHKQts",
                        "workload": 15,
                        "_createdAt": "2023-11-23T00:37:11Z",
                        "_rev": "llHPdpE6t2d8pDZnUHKQql",
                        "body": "This is probably one of the worst courses I've taken at GT. I was initially excited to take a class in Network Science, but after taking this course, not so much. \n\nThe class is structured such that there are no formal lectures that cover the material. Instead, you're given a bunch of slides on canvas that barely contain any useful material. To help fill in the huge gaps from the slides, you have required reading from various sources. After each section then there are the awful quizzes. Do you like confusing multipart multiple-choice questions that require you to read the questions multiple times? If so, this course is for you!\n\nAbout the only redeeming thing about this course is the projects, but even then, you're going to be using a lot of matplotlib. \nFinally, to top it off, the TA's and Prof are non-existent. Need a question answered on the forum? Good luck, but don't you dare collaborate with fellow students!\n\nI am legit angry I wasted my time, money and energy on this course. \n",
                        "_type": "review",
                        "created": "2023-11-23T00:37:11Z",
                        "course": null,
                        "_id": "llHPdpE6t2d8pDZnUHKQts",
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "authorId": "D+ZjqG9NaPgWzNxW/1xZ1g==",
                        "difficulty": 4,
                        "rating": 1,
                        "_updatedAt": "2023-11-23T00:37:11Z"
                    },
                    {
                        "rating": 1,
                        "_id": "svKdjQPfy8Uid76wWqG7kk",
                        "difficulty": 4,
                        "_rev": "svKdjQPfy8Uid76wWqG7gw",
                        "_type": "review",
                        "authorId": "GAxmweE1NxDZsRMTrJO5Kw==",
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "created": "2023-11-12T13:53:15Z",
                        "_updatedAt": "2023-11-12T13:53:15Z",
                        "body": "This is a very math/statistics heavy course with mathematical proofs. \n\n1. Lectures\nMostly self study reading contents with only few video lectures. The average time spent on self studing the lecture contenst is much longer than all other courses I have taken so far (this is my 9th course)\n\n2. Quizes (35% of the final grade)\nThere are total 15 quizes, one per module, all open book/notes. The openess of the quizes does not help much. The way quizes are worded is quite confusing and very easy to misguide students. Many cases, you will get wrong answer because of mis-reading the intent of the question, rather than not understanding the concept.\n\n3. Projects (65% of the final grade)\nThere are total 5 projects, which are all in python Jupyter notebook format. Projects are heavy in generating plots with pyplot. There is no gradescope tests available to test your code before submitting to Canvas. Therefore, often times, you will get surprise results once the project grades released.\n\n4. Professor Office Hours\nNot available even a single time in entire semester.\n\n5. TA Office Hours\nTA office hours are often get cancelled constantly last minutes. Even if it's not cancelled, quite often no host shows up in Zoom meetings. Further, there is no Zoom recordings available for the sessions that were actually hosted.\n\n6. Ed discussion\nThis is pretty much the only sources you can get help. Some TAs are very responsive, while some are not at all. Regardless, the Ed discussions went very passive after last drop deadline, and most people just dissapeared. My guess is that even for the people still around, kind of gave up on the course. \n\nSummary:\nThis is by far the most un-organized OMSCS course I have taken. (This is my 9th course) I am quite dissapointed by the quality of the course and even question if overall OMSCS course quality is going down the hill. I would not recommend taking this course to anyone, and to be honesly many past reviews are misleading. I would think the way this course is run needs intervention from OMSCS program administration.\n\nSincerely,\nAnonymous (serious student)\n\n=========================\nReference: course I have taken so far\n1. CS6210: Advanced OS  (grade A)\n2. CS6290: HPCA  (grade A)\n3. CS6250: Computer Network (grade A)\n4. CS6310: SW Architecture and Design (grade A)\n5. CS7646: ML for Trading (grade A)\n6. CS6291: Embedded Optimization (grade A)\n7. CS6340: SW analysis (grade A)\n8. CS6035: AI for robotics (grade A)",
                        "id": "svKdjQPfy8Uid76wWqG7kk",
                        "course": null,
                        "workload": 20,
                        "_createdAt": "2023-11-12T13:53:15Z"
                    },
                    {
                        "difficulty": 4,
                        "_createdAt": "2023-11-11T22:30:23Z",
                        "workload": 15,
                        "body": "This is my 4th course. The course content is fantastic. The only problem is that each project requires about 15-25 hours of work but only gives 2 weeks of time. The content is very interesting and math heavy. It would be great if you can front load course videos right after submitting a project (project free week) so that you can have plenty of time of working on the project. The only star lost is because a few of the TAs not quite responsive to questions on ed discussion.",
                        "_rev": "usqXEJs2xfOvzALZaigfS4",
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "_updatedAt": "2023-11-11T22:30:23Z",
                        "course": null,
                        "_id": "usqXEJs2xfOvzALZaigfSu",
                        "authorId": "LRlaCEbmOzYGJQ+i+1t8Dw==",
                        "id": "usqXEJs2xfOvzALZaigfSu",
                        "created": "2023-11-11T22:30:23Z"
                    },
                    {
                        "created": "2023-09-27T04:53:12Z",
                        "_id": "pqi0YI0b4n0uiYRAY99IdF",
                        "id": "pqi0YI0b4n0uiYRAY99IdF",
                        "_type": "review",
                        "rating": 2,
                        "authorId": "gAW8JlSAOpqdTp60fbBslw==",
                        "_rev": "pqi0YI0b4n0uiYRAY99IcQ",
                        "difficulty": 2,
                        "_updatedAt": "2023-09-27T04:53:12Z",
                        "workload": 10,
                        "semester": {
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z"
                        },
                        "body": "The class is very straightforward and manageable as a summer class. There are only weekly quizzes and projects. Check the math prereqs for this course, they are pretty broad and it is a math course, but the (written) lectures are good.\n\nSpeaking of the content it is a very questionable class. Most lectures are around theory of generating power law distributed graphs and checking their features. It honestly looks like either the field is too new or it is artificial. I would rather have graph concepts in specific courses than in the separate graph concepts course. \n\nSo this is an easy A and can be a filler course, but I am not sure I could not just google particular concepts if I even need them.",
                        "_createdAt": "2023-09-27T04:53:12Z",
                        "course": null
                    },
                    {
                        "authorId": "2LJF7VLZMq9DaIMpOrrzVg==",
                        "body": "I took this class during summer and found it extremely manageable and entertaining. The class teaches a lot of network (graph) analysis. You can find the most important nodes (vertices) in a network using different algorithms. For example one might deem a node as important if it has a really high degree. Furthermore one can notice whether a network follows a powerlaw or a random nature which can enable one to provide importance to the nodes. In general the class is about the study of networks and finding interesting features. It also uses statistics to support claims about the network. I liked it!",
                        "rating": 3,
                        "_id": "HDbsrzRZRpzQ4DQ91lm2OE",
                        "_createdAt": "2023-08-12T00:04:58Z",
                        "semester": {
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z"
                        },
                        "_updatedAt": "2023-08-12T00:04:58Z",
                        "_rev": "HDbsrzRZRpzQ4DQ91lm2KX",
                        "created": "2023-08-12T00:04:58Z",
                        "course": null,
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 15,
                        "id": "HDbsrzRZRpzQ4DQ91lm2OE"
                    },
                    {
                        "created": "2023-07-29T07:02:10Z",
                        "id": "G2CNO6q5LhmMM5wp3xjm8z",
                        "rating": 3,
                        "workload": 12,
                        "authorId": "Maaf85QtBxth++wde3bH5A==",
                        "_updatedAt": "2023-07-29T07:02:10Z",
                        "_type": "review",
                        "_createdAt": "2023-07-29T07:02:10Z",
                        "_rev": "G2CNO6q5LhmMM5wp3xjm3g",
                        "_id": "G2CNO6q5LhmMM5wp3xjm8z",
                        "body": "Hope you like matplotlib. \n\n",
                        "semester": {
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z"
                        },
                        "course": null,
                        "difficulty": 2
                    },
                    {
                        "difficulty": 3,
                        "semester": {
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z"
                        },
                        "authorId": "XgZOSDRApzXAkgNb7f1ReA==",
                        "_rev": "G2CNO6q5LhmMM5wp3hSZY1",
                        "id": "G2CNO6q5LhmMM5wp3hSZdK",
                        "created": "2023-07-27T19:35:20Z",
                        "workload": 13,
                        "body": "I wish I had spent more time doing derivations vs worrying about my grade. The grading is lenient and IMO makes the class seem a bit easier but you still have to start your projects early. My 1st project had the lowest grade because I started the Sunday before the Wednesday morning it was due :( Each project probably takes 20+ hours. Your lowest project grade is dropped.\n\nQuizzes! Quizzes are non-stop, every week we had a quiz. For me, each quiz took ~2+ hours and that's after attending lecture. The summer schedule might have made it more fast-paced than I would have liked. But we got to drop 2 quiz grades.\n\nI enjoyed my time in OH with the TAs. They were very helpful and willing. That being said, my biggest complaint was TAs canceling OHs without notice. We students who work are on finite schedules so it's a big deal when we make efforts to attend OH and are left hanging. \n\n2nd biggest complaint was the new grading procedures they were working through and project corrections. However, they also understood their issues slowed us down and compensated us a few extra days on projects.\n\nIt would have been nice to have more time with Prof. I liked his lectures but we only got 1 hour with him at the end of the class.\n\nTake the class and spend time on the derivations!",
                        "_updatedAt": "2023-07-27T19:35:20Z",
                        "course": null,
                        "_type": "review",
                        "rating": 4,
                        "_createdAt": "2023-07-27T19:35:20Z",
                        "_id": "G2CNO6q5LhmMM5wp3hSZdK"
                    },
                    {
                        "_id": "meCCLzRK2zIBL5FIK6opZV",
                        "authorId": "u6Ht6glG/lCds9XTvylglQ==",
                        "difficulty": 2,
                        "_createdAt": "2023-07-27T14:46:32Z",
                        "body": "This a good course marred by confusing assignment wording ,understaffed TAs, and absent professor. I really liked the quizzes and even though they are open everything I found them to be time consuming, probably because they test on concepts as well their applications. Office hours are a great way to understand some of the confusing aspects of the assignment, so make best use of it. I think this course in general was an easy A. The cutoff is 85% and I believe historically 70-80% of the class gets it. ",
                        "_rev": "meCCLzRK2zIBL5FIK6opW8",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249"
                        },
                        "_updatedAt": "2023-07-27T14:46:32Z",
                        "workload": 12,
                        "_type": "review",
                        "rating": 3,
                        "id": "meCCLzRK2zIBL5FIK6opZV",
                        "created": "2023-07-27T14:46:32Z"
                    },
                    {
                        "_createdAt": "2023-07-27T00:31:48Z",
                        "rating": 2,
                        "_type": "review",
                        "_id": "GaVPCT8bbJ3ZdIEcpF0IT6",
                        "id": "GaVPCT8bbJ3ZdIEcpF0IT6",
                        "_updatedAt": "2023-07-27T00:31:48Z",
                        "body": "The reason why I **hated** the running of this course, I believe, is centered on the ineffiencies of 2 people.\n\nThe Deputy Head TA, and the Professor himself.\n\nThe Professor himself had only held ONE live office hour, and that's only held on the very last few days of the class. He's not even remotely bothered about running the class anymore after getting a new job in Cyprus, except for what to me it seems as a last-minute saving gesture to earn some positive reviews. I am over this.\n\nWhich brings to the \"Food for Thoughts\". In previous iterations of the class I've understood, the Prof runs his own OHs to go through this section, which would have drastically helped in the concepts of the course.\n\nTo the deputy Head TA, timestamps don't lie. It seems that most of the delays due to the results of the assignments are attributed to your late marking and your extremely irritably late response to your questions in Ed Discussions. It appears that you are trying to hang the Head TA, the rest of the TAs, and us out to dry in this course by doing a drastically different route by focusing on creating the \"Course Glossary\". Frankly, this is also an afterthought, and for sure NOT needed during the Summer session when time is of the essence.\n\n**To be frank**, if the Professor had continued to run his weekly OHs, this experience would be MUCH MUCH better. Granted, Network Science is a new domain, which is precisely why we need the Professor to lead with a steady ship. This is not present at all.\n\nAs for the rumors regarding turning quizzes to exams in Fall 2023, so long as the \"Food for Thoughts\" are being addressed - it could even be easier. I know they are fine-tuning the assignments to make it easier to mark and score as well - to be honest I am not even bothered about these inconveniences. \n\nShout out to the Discord group, and the TAs named JC (Head TA) and JY that saved what seemed to be a difficult course because of the above situations over the Summer. You know who you are. Wouldn't have survived this course without you.",
                        "course": null,
                        "created": "2023-07-27T00:31:48Z",
                        "semester": {
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "authorId": "QaHiGrgd+Pjfq59R17SqTA==",
                        "_rev": "GaVPCT8bbJ3ZdIEcpF0IPb",
                        "workload": 18,
                        "difficulty": 5
                    },
                    {
                        "difficulty": 4,
                        "course": null,
                        "body": "This course was border line difficult. I did this course along with another course from CS department.\n\nEvery week, the it took me atleast 4-5 hours of slogging to understand the concepts in lectures and complete the quizzes.\n\nThe assignments are long and time consuming. Having to shuffle between courses, I was usually late to start assignment, and had to work continously for 1-3 days to wrap up the assignments. \nI did not get the oppurtunity to attend office hour, and this made completing assignment difficult as there would always be a lot of uncertainities in the assignment.\n\nThe course work is overall rewarding as you will learn a lot. I regret rushing through the assignments and quizzes due to my schedule. \nI think this is a good course that can be done well by a disciplined student. \nAs a disclaimer : If you doing this course without a python background, be ready to struggle through the assignments ! I am familar with python, but took hours to implement some of the questions.",
                        "_createdAt": "2023-05-22T23:16:57Z",
                        "_rev": "o6AF09gQgKTs4CFsYBa3L4",
                        "id": "o6AF09gQgKTs4CFsYBa3NJ",
                        "created": "2023-05-22T23:16:57Z",
                        "authorId": "sLaWhsPRieq/5Ge4vSSc7w==",
                        "semester": {
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z"
                        },
                        "_updatedAt": "2023-05-22T23:16:57Z",
                        "rating": 4,
                        "_id": "o6AF09gQgKTs4CFsYBa3NJ",
                        "workload": 14,
                        "_type": "review"
                    },
                    {
                        "created": "2023-05-09T16:20:44Z",
                        "workload": 16,
                        "authorId": "vFWTixFU0s3VpLG1+NlauA==",
                        "rating": 5,
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "id": "AnVLGnCOep77YjL1sv9Qy6",
                        "_id": "AnVLGnCOep77YjL1sv9Qy6",
                        "difficulty": 4,
                        "_createdAt": "2023-05-09T16:20:44Z",
                        "_type": "review",
                        "body": "I really enjoyed the course even though I do not have a strong math background.  \n\nThe course material is fascinating, and the lectures and recommended readings are interesting as well, though there is a fair amount of skipping around from week to week.\n\nThe quizzes can be tricky, but they're open everything and don't count as much as the projects.\n\nWhile the project instructions need to be more detailed, the TAs do an excellent job of answering questions in the dedicated threads for each part of the project.  There are also numerous TA office hours, so you can get your question answered by the TA responsible for grading a particular part of the project.  TAs also do a great job of answering private posts for code or output-specific questions.\n\nThe time estimate is probably wrong because there are 3 weeks between projects, and the weeks where only quizzes are do are lower unless you want to get a head start on the projects (which is recommended).",
                        "_updatedAt": "2023-05-09T16:20:44Z",
                        "course": null,
                        "_rev": "AnVLGnCOep77YjL1sv9QxF"
                    },
                    {
                        "created": "2023-05-09T02:47:29Z",
                        "course": null,
                        "rating": 4,
                        "_rev": "3KqS0NOF6YxT8AZtWt9WTP",
                        "difficulty": 2,
                        "_createdAt": "2023-05-09T02:47:29Z",
                        "_updatedAt": "2023-05-09T02:47:29Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "authorId": "P4kXVnuT9fvrkg0ObjiCwg==",
                        "id": "3KqS0NOF6YxT8AZtWt9WW2",
                        "_type": "review",
                        "workload": 10,
                        "_id": "3KqS0NOF6YxT8AZtWt9WW2",
                        "body": "This is a great survey course in the field of Network Science. The grading of this course consists of 14 open-note quizzes and five Jupyter Notebook assignments. \n\nThe quizzes for this course are challenging (I ended up with an 88% average for them), but they make up only 35% of your total grade. Honestly, I don't have much to say about the quizzes, since they seemed mostly fair. The only thing I will note is that a few of the questions felt tricky for the sake of being tricky, so that is something to look out for.\n\nThe 5 Jupyter Notebook assignments make up the remaining 65% of the grade. The main challenge comes from the lack of auto-graders or examples to base your assignment on. You need a good understanding of what is being asked of you and how you are expected to implement things to make a good grade on these. For these, I had nearly all 98% or above except for the third assignments; for this assignment, I made a small mistake that caused all my calculations in a section to be wrong, losing nearly 13 points. Overall, I feel like these assignments are exciting to do and give a real feeling of applying the skills you learn in the course, although the instructions are a bit unclear.\n\nThe only thing that keeps me from rating this course a 5 is that it definitely feels like a survey course. You are given a lot of information on how to analyze networks, but the information you receive feels a bit disjointed. I think this course could benefit from a cumulative final project to tie everything together and give a real feel for doing research in the field. I also feel as if this course could have leaned more heavily into the math and theory instead of just the application.\n\nNetwork Science feels like a course that is designed to prevent you from failing (unless you miss half of the assignments or something) and is also fairly easy to earn an A in. If you have any interest in Network Science and have an open spot in your schedule to fill, I think this is a great option for an elective."
                    },
                    {
                        "workload": 15,
                        "rating": 5,
                        "_updatedAt": "2023-05-05T09:03:25Z",
                        "_rev": "3KqS0NOF6YxT8AZtWQSNcE",
                        "body": "This was a proper graduate level course which exposed me to the latest research being conducted in a very interesting area of applied computer science. Network science is a fascinating area of research and finds application in a number of industries (most notably in epidemiology, social network and internet). I am from the finance industry and while the application of Network Science in my field is still in its primitive phase, I see a lot of very interesting opportunities in the future.\n\nNow about the course.\n\nPros:\n1) Very thorough curriculum starting from the basics of network science to the very advanced and latest research in the field.\n2) Excellent TAs who are very helpful answering assignment related and other queries. Nicely conducted class.\n3) Generous marking on the assignments (5 in total accounting for 65% of the final grade). Difficulty of the assignments on the easier side if you are proficient with python and basic data science stack (pandas, matplotlib, seaborn etc.)\n4) The Epidemiology assignment was an excellent insight into the field of pandemic modelling which I found fascinating.\n\nCons:\n1) 90% of the lectures are written notes and tend to be very mathy and dry. Most of the lectures cover mathematical derivations which could be very difficult to follow and easy to get lost in.\n2) There are weekly quizzes which in total account for 35% of the overall grade. These quizzes are open book and open everything but still very annoyingly tricky and require thorough understanding of the module.\n3) Assignments are fun but time consuming. The python Networkx library is going to be your best friend but the biggest challenge is preparing the required visualisations. \n4) Absolute grading with A grade cutoff being 85%. My final grade was A (overall marks 93%) with most of the lost marks in quizzes. \n\nAll in all a very good class.",
                        "_createdAt": "2023-05-05T09:03:25Z",
                        "_type": "review",
                        "id": "3KqS0NOF6YxT8AZtWQSNer",
                        "course": null,
                        "_id": "3KqS0NOF6YxT8AZtWQSNer",
                        "difficulty": 3,
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "created": "2023-05-05T09:03:25Z",
                        "authorId": "Y0p+1lfk2jRxT+Y8MpA7lA=="
                    },
                    {
                        "created": "2023-04-21T00:06:14Z",
                        "workload": 12,
                        "_updatedAt": "2023-04-21T00:06:14Z",
                        "_createdAt": "2023-04-21T00:06:14Z",
                        "_id": "cDAbkjKqIb2hsptV0hc0UZ",
                        "difficulty": 1,
                        "_rev": "cDAbkjKqIb2hsptV0hc0SI",
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "_type": "review",
                        "authorId": "y7X+zgdHqKRxBUN8+jSUwA==",
                        "course": null,
                        "id": "cDAbkjKqIb2hsptV0hc0UZ",
                        "rating": 1,
                        "body": "Avoid this class. While the material may be good, it is not taught correctly.  It is testing if English is your first language. Ed stem posts are deserted where a single person is creating a lot of posts but has no reply as students are not interested after the initial quizzes to even bother discussing the topic. There are lots of fancy charts in projects which add little value in learning. I personally did not learn anything after all this hype of the class. Looks like TA added all the favourable posts to get it included in ML elective as it does not reflect the class correctly. The class is miserable in its current state. The only post with traction are the assignment clarification threads. It is oxymoron as the class which is testing command over English language through highly ambiguous quizzes has such a poor level of question description for the assignment. There is a perception among new students that it will help learning GNN, but that is not the case. There is no assignment on GNN. There are a few slides but you don't code anything. The class has a simple grind loop - search for networkx function, create a chart. It is not worth the effort to invest so much time in a class and then learn nothing after a semester. "
                    },
                    {
                        "_rev": "VTG4RAOJbpPp7OML2DL2gy",
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "_id": "VTG4RAOJbpPp7OML2DL2mB",
                        "body": "Overall, course I’d very interesting. This is a subject matter you don’t learn about in undergrad ML or CS courses, as it has way more focus on applications than a graph theory or discrete math course. \n\nTo set expects, this is a math course really. Most of the learning comes from deriving proofs and statements in the lectures in more detail, as the lecture materials purposefully skip steps and ask you to derive yourself. This isn’t necessary to do to get an A, but I was motivated to do so as it’s an interesting topic.\n\nI would recommend to someone who is interested in graph theory and wants to brush up on their math. This course uses a little linear algebra, probability, calculus and discrete math, so it’s a fun way to get back in the swing of things if you’re like me and didn’t do math for a couple years.\n\nOnly downside is that I can already feel myself forgetting the content from the beginning of the quarter. There’s too much stuff covered at a high level and it’s too specific, so I don’t expect to have many practical applications of what I learned. Nonetheless it’s good to know these ideas are out there.",
                        "difficulty": 3,
                        "_createdAt": "2023-04-09T12:25:37Z",
                        "_type": "review",
                        "rating": 4,
                        "workload": 12,
                        "_updatedAt": "2023-04-09T12:25:37Z",
                        "id": "VTG4RAOJbpPp7OML2DL2mB",
                        "created": "2023-04-09T12:25:37Z",
                        "course": null,
                        "authorId": "LFYTGqNd0fLxyOh5XdSp6w=="
                    },
                    {
                        "difficulty": 4,
                        "created": "2023-02-18T16:56:18Z",
                        "workload": 23,
                        "rating": 3,
                        "course": null,
                        "id": "fzIldrAWHJy6U3JqBecJhA",
                        "body": "*Full disclosure, I dropped this course after finishing the fifth week. \n\nI found this course to be interesting but much more time consuming than previous reviews suggest. Every week there is a lesson that goes over a broad range of topics that relate to statistics more so than graph theory or linear algebra (although you absolutely need know linear algebra as a prerequisite as well). There is a big focus on statistical analysis of concepts like degree distributions and other derived measurements that continually get more convoluted. There is nontrivial math that goes into introducing every new statistical measurement, of which there can be 5+ in a given weekly lesson. I would say if you really want to understand the material, there is no way the material is going to click with less than 10-15 hours of lecture alone every week unless you deeply understand and can apply concepts like the first and second moments of a distribution, why a constant in a power law distribution can lead to undefined variance but well defined mean, etc. I suggest looking at lessons 3 - 5 before taking the course so you know what you're getting yourself into. Overall, I give lessons a solid 3/5.\n\nThe assignments are tightly aligned with the lectures, and once you complete them you do get a solid grasp of the application behind some of the theory you learned. These are all done in Jupyter Notebooks. I personally found them incredibly time consuming. I never really loved mathematical analysis in notebooks (using numpy, scipy, and matplotlib) over traditional assignments in courses like GIOS. But the assignments in this course were exceptionally painful for me. The problems break down into subproblems of subproblems that all require a ton attention to detail. The less popular libraries often have poor documentation and are pretty hideous to use. And it is too often the case that before you even start answering a problem you need to tab between library source code, edstem, assignment instructions, and back for over an hour before the first step clicks. Overall I found the assignments to be great in theory, but the perceived open-opendedness when there was in fact only one correct  way to solve problems made assignments unnecessarily painful in practice. These assignments took me 15+ frustrating hours each, and for that reason I give them a 2.5/5. Expect to lurk and post on edstem a ton. Which brings me to my next point.\n\nTAs are as helpful as they can be. Questions about the notebook assignments do get answered and you can feasibly finish the them after struggling through and getting tons of clarification. HOWEVER if you are struggling with any part of the lecture that is genuinely unintuitive, chances are you simply will never get an answer at all. I found this incredibly frustrating. For example, there was a short sublesson about the connectivity of a graph approaching some constant and enough of math was provided to make it clear that understanding the process to reach the result was important. However, the math skipped damn near every step, and neither myself nor other classmates could reproduce the proof. I hopped on office hours, and couldn't get an answer but was assured I would get one from the course head if I posted on edstem. I never did. I never had this problem with other courses. For notebook questions I give edstem a 5/5. For lesson questions I give it a 1.9/5\n\nFinally, the quizzes were almost fair. You have unlimited time for them and they follow the lecture pretty faithfully. However, some of the questions are straight gotchas with inverted true/false logic. Some of them suggest doing a calculation by hand that would take over an hour (for these get comfortable setting up the problem in networkx, even if the setup itself takes nearly an hour). Some of them are so specific / require application of the lessons' topics that it's hard to feel comfortable with a selection even if you really do understand the lecture. Overall I give quizzes a 2.8/5.\n\nOverall, if I could give this course a 2.7, I would. I don't think any engineer would enjoy this course at all unless they are also super into stats. I've taken IHPC, GIOS, AOS, AI, and can honestly say that the material of this course is harder than all of them except maybe IHPC. The saving grace is easier grading, no tests, and unlimited timed quizzes. But that doesn't take away from how frustrating and time consuming the course can be if you really want to understand it.",
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "_id": "fzIldrAWHJy6U3JqBecJhA",
                        "authorId": "/LdK3Fny63SnAgY5R/ld1A==",
                        "_updatedAt": "2023-02-18T16:56:18Z",
                        "_rev": "fzIldrAWHJy6U3JqBecJcs",
                        "_type": "review",
                        "_createdAt": "2023-02-18T16:56:18Z"
                    },
                    {
                        "id": "3Iml9JIMLV9oLijdNzd4Mv",
                        "body": "Pros:\n1. Consistent pace of the course with relevant quizzes due every week\n2. Ample amount of office hours from different TAs\n3. TAs are very helpful and do their best to give all answers\n4. This course focus more on the reading material to get conceptual understanding through quiz, IMO better than learning from videos\n\nCons:\n1. The course appears to showcase lot of real world applications but most of the homeworks are kinda generic and do not really connect with real world applications\n2. The last part of course talks about machine learning application in network science but no homework on that\n\nOverall this course is a good introduction to the topic and give a good general understanding of networks by covering strong theoretical background. ",
                        "_id": "3Iml9JIMLV9oLijdNzd4Mv",
                        "rating": 4,
                        "created": "2022-12-03T21:40:07Z",
                        "_createdAt": "2022-12-03T21:40:07Z",
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "_rev": "3Iml9JIMLV9oLijdNzd4IR",
                        "workload": 10,
                        "authorId": "Dahkq1w6VLVYACKuKJ+Lug==",
                        "difficulty": 2,
                        "_type": "review",
                        "_updatedAt": "2022-12-03T21:40:07Z"
                    },
                    {
                        "created": "2022-11-20T19:57:25Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx"
                        },
                        "_updatedAt": "2022-11-20T19:57:25Z",
                        "_type": "review",
                        "rating": 2,
                        "id": "fDZIuwDdzN7rRV8c4Ad64U",
                        "_id": "fDZIuwDdzN7rRV8c4Ad64U",
                        "course": null,
                        "workload": 10,
                        "authorId": "C6wQUdj7FRdQSc5egcMeXA==",
                        "body": "This is a math class, not an engineering class.\n\nDO NOT TAKE THIS CLASS IF:\n\n- You are NOT super into raw math, formula derivations, statistics;\n- You like to watch videos instead of reading: There are barely any videos in this class, it is just text, text, text;\n- You are looking for an engineering hands-on class;\n\nI personally didn't like the class. I work with Graph Neural Networks and love to work with knowledge graphs, but the content of the class was directed to someone studying math /statistics, not software development/AI/Engineering.\n\nFor me, it was very boring to study disease propagation and statistical models to simulate graphs. I would rather study node property prediction, link prediction, subgraph prediction, molecule modeling, healthcare related tasks, transportation optimization, product recommendation, ads recommendation, graph databases, etc.... There is nothing about that in this course. As I said, it is a like you are studying math, not engineering.\n\nAlso, all the classes are text. It was very painful for me to get through it.\n\nIf that being said. the quizzes/assignments are great.\nQuizzes are open book/notes, and assignments are great jupyter notebooks. There are no exams.\n\nIf you like math focused classes, with tons o text and no video, go for it.",
                        "_rev": "fDZIuwDdzN7rRV8c4Ad62o",
                        "difficulty": 3,
                        "_createdAt": "2022-11-20T19:57:25Z"
                    },
                    {
                        "created": "2022-09-29T04:46:56Z",
                        "_updatedAt": "2022-09-29T04:46:56Z",
                        "authorId": "Dahkq1w6VLVYACKuKJ+Lug==",
                        "_type": "review",
                        "_rev": "Y6JguxS5ufwJl5gw7q2VFQ",
                        "_id": "Y6JguxS5ufwJl5gw7q2VHp",
                        "body": "It is relatively easier course. The TAs are very helpful and they conduct lot of office hours to clarify all the doubts. The material is awesome, I liked the fact that the material has lot of reading material along with videos, in my experience reading material is very helpful in solving quizzes which are due every week.\n\nThere are no exams, projects are easy to follow given the instructions. I expected some machine learning part but that is very limited. ",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7"
                        },
                        "difficulty": 2,
                        "course": null,
                        "workload": 10,
                        "id": "Y6JguxS5ufwJl5gw7q2VHp",
                        "_createdAt": "2022-09-29T04:46:56Z",
                        "rating": 4
                    },
                    {
                        "created": "2022-08-14T06:56:14Z",
                        "workload": 15,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2"
                        },
                        "body": "As previous comment indicated, the course effort can varies (ranging from 10 to 20+ hours) depends on yourself..\nThe grading is generous in general.\nTo really learn a lot, you need to take initiative to go through the additional paper/material provided. \nThe material is difficult.  It is relative new field and definitely interesting!\nThe reading style lecture is kind of nice from my perspective after watching video lecture at 1.5x for 8 courses...\n\nI would recommend anyone like data analytics to explore this course..\nIt definitely give a different perspective to you..",
                        "id": "I85e2pBlQ8Ku7mLFcQ0ZQI",
                        "rating": 5,
                        "_updatedAt": "2022-08-14T06:56:14Z",
                        "course": null,
                        "_rev": "I85e2pBlQ8Ku7mLFcQ0ZNr",
                        "_id": "I85e2pBlQ8Ku7mLFcQ0ZQI",
                        "authorId": "jmISiTBGzj9ZV5pQjHLU1w==",
                        "difficulty": 5,
                        "_createdAt": "2022-08-14T06:56:14Z",
                        "_type": "review"
                    },
                    {
                        "created": "2022-05-08T20:29:41Z",
                        "_createdAt": "2022-05-08T20:29:41Z",
                        "workload": 16,
                        "_type": "review",
                        "course": null,
                        "id": "external-import-17337c89-79ca-4c9e-8b1c-5b9a2713789e",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "_id": "external-import-17337c89-79ca-4c9e-8b1c-5b9a2713789e",
                        "body": "I strongly recommend Network Science. This is a math-heavy course with some scientific computing (primarily using linear algebra and some graph-specific algorithms). The staff is comprised of the professor along with an army of TAs, who hold regular office hours and are active on the forums. \n\nI did not finish the class due to changes in my personal situation, but will be re-taking the class in Summer 2022. I completed 3 assignments, so I do have a fair idea about the class.\n\nThe math is not difficult per-se, but the biggest challenge I faced was setting up the problem using the right set of assumptions and principles, which would allow for a solution. The actual solution itself involves undergraduate-level probability, statistics, and linear algebra and is fairly straightforward once you get into the details.\n\nThat being said, you don't need to wrestle with the math if you don't want to. This is a course where you can get an A while focusing on the definitions of various metrics, building an intuitive understanding of how they behave and how they should be used, and solving the assignment questions.\n\nThe math becomes harder as you get further into the subject. If you are the type who likes to understand things thoroughly, this will mean that you need to spend more and more time as you progress in the course. This is a synchronous course (the lectures of future modules are locked so you can't work ahead), but you can still cover the subject matter by studying ahead using the [online network science book](http://networksciencebook.com/).\n\nThe grading was generous and the TAs usually give you the benefit of the doubt. I consistently scored 10-15 points higher than I should have, under a more strict grading policy. In one instance, I wrote a recursive function to find [network motifs](https://www.researchgate.net/figure/Types-of-network-motifs-Courtesy-of-8-12_fig2_263477185) but made a very stupid error which resulted in massive double counting. 2 TAs had a look at my solution and in the end they deducted only a few points since the approach I was taking was correct. They didn't zero in on the bug in my code, since they have a lot of papers to grade, but they did do the due diligence (including pulling in a second TA) to check that my understanding was correct and there weren't any major problems in my code.\n\nThe professor also gave us an extension for the deadline of one of the submissions when war broke out in Ukraine, recognizing that it was a stressful situation for everyone. I was really impressed by this act of generosity and understanding.\n\nNetwork Science is a multi-disciplinary subject. You'll read about examples from biology, medicine, computer science, and sociology. I think this provides a nice change of pace from the usual CS courses where you only deal with computing topics. The downside is that it becomes a survey course and you might find it hard to imagine how to apply the topics you learnt.",
                        "difficulty": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1"
                        }
                    },
                    {
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 10,
                        "_id": "external-import-2233cf30-9b9a-4489-8f0b-29f79a39d764",
                        "created": "2022-03-20T17:24:57Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "difficulty": 4,
                        "course": null,
                        "body": "This was my 8th course in the program and it felt much more like a math class than a programming one. Projects involve a token amount of python knowledge (use this library, transcribe this equation, make a chart, etc) but the meat of the course is mathematical graph theory. \n\n\nGrades are split between weekly quizzes and 5 projects. The projects take a decent amount of time to work through but if you start early they are certainly manageable. As frustrating as they could be at times they were clearly well designed to slowly drag knowledge out of you. Each one is structured so that it will steadily poke and prod you further and further down a path of something new to learn. At the end of each I was usually exhausted, but definitely smarter. \n\n\nMy main gripe are the weekly quizzes. They make up a third of your final grade and are the most nit-picky, tedious things I have done in this entire program. They're open note/internet and you don't even have to use Honorlock but time and time again I would spend a hour grinding away at them only to be rewarded with a 60 or 70 since each quiz has only 5-6 questions and getting one wrong is a huge hit. \n\n\nLectures were just textual summaries of the required reading with the occasional video strewn about. Some people prefer that, some don't. I'd be fine with it if they felt more relevant. When it came time to do the weekly quiz it always seemed like 2/3s or more of the content wasn't actually from the lectures, instead relying on you doing further research on your own. \n\n\nAll in all I would say if you're planning on taking this course you should pay very close attention to the introductory quiz that the professor offers as a way to test your preparedness. Unless you are very comfortable with everything that it covers you are going to suffer. ",
                        "_createdAt": "2022-03-20T17:24:57Z",
                        "_type": "review",
                        "id": "external-import-2233cf30-9b9a-4489-8f0b-29f79a39d764"
                    },
                    {
                        "created": "2021-12-22T09:10:14Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "workload": 6,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 4,
                        "course": null,
                        "id": "external-import-7347531b-8100-421f-885b-cfcda0ccc59a",
                        "difficulty": 3,
                        "_createdAt": "2021-12-22T09:10:14Z",
                        "_type": "review",
                        "body": "### Great course\n\nI found this course to be an informative and interactive course.\n\n**Pros**:\n - Well structured \n - Assignments are practical and gives a lot of ideas of real-world scenarios\n - Opens a whole new field of computer science that isn't very common\n - Quizzess every week and assignments keeps you on track\n\n**Cons**:\n\n - There are a lot of content that's not explained in videos \n\nI would have hoped for a project at the end that covers a lot of the concepts that have been mentioned in the syllabus with a real-world example. I feel I need to spend some time thinking on how to apply the concepts to problems that we face.\n\nOverall: Great experience ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-7347531b-8100-421f-885b-cfcda0ccc59a"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_id": "external-import-42d7ec0a-f2b8-4362-8bb0-878f37be1c31",
                        "body": "My background: ISYE undergrad with many prob/stats and ops research courses, likely a strong background for this class.\n\n**Summary**\n\nOverall networks are a fascinating field, this class did a good job on introducing the theory, but fell short on providing more critical thinking and prescriptive analysis type projects. **The whole \"given our networks theory and data, how can we leverage that to make better design decisions\" was missing. The assignments were quite tunnel vision: compute this metric, generate a graph using this method, find communities using this method, etc.** There was a tiny bit of this on the who would you vaccinate part, but absent elsewhere. At least the theory is rigorous, and I learned how to use networkx well though so that is a plus. \n\n**Lectures**\n\nLectures are good but not great, some annoying ego in them like \"it is not hard to show that *insert some math thing*\", which sometimes leads to making pretty big jumps in derivations that took a while to follow.\n\n**Workload**\n\nWorkload wise the first few weeks are higher to find your groove. Then once you settle in its about 2-3 hours for the lecture material, .5-1.5 hr for the quiz, and 12-15 hrs per assignment. With an assignment every 3 weeks, this comes out to around 10 hours per week. Note I read about half the textbook but not many of the extra papers. \n\n**Quizzes**\n\nThe quizzes definitely are pretty nitpicky, especially early on, but they aren't unfair. Think of it as a game to find the catch or statement that is untrue. They definitely make you think deeply about each question which is what you should be doing if you're in grad school. Get your pencil and paper out to go step by step if needs be, or verify by coding up in networkx. Averaging an A on them took some focus but is feasible. \n\n**Assignments**\n\nThe assignments are poorly written and often require some correction/clarification by the TA's. This hopefully will get better and better as the semesters go on. There are nice piazza threads for each sub question in the hw that usually clear things up well. Be sure to read those to see if there is something they're looking for that may have been vaguely asked for in the assignment.\n\n**Grades**\n\nFor grades I have a low A with the last project still to be graded. I missed a bunch of points with no partial credit due to an equation being slightly off on a question in the 3rd assignment. The rubric definitely could have been better there.\n\n**Conclusion**\n\nOverall if you are interested in network science this course is still worth taking, if you are just looking for a fun elective maybe steer clear as this course has its organizational hassles. Also steer clear if you either don't have a strong prob/stats background or don't want to put extra effort to learning as you go. ",
                        "id": "external-import-42d7ec0a-f2b8-4362-8bb0-878f37be1c31",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "_createdAt": "2021-12-03T20:47:04Z",
                        "rating": 4,
                        "course": null,
                        "workload": 10,
                        "created": "2021-12-03T20:47:04Z"
                    },
                    {
                        "created": "2021-12-01T01:17:39Z",
                        "_id": "external-import-48bd8a8a-bcd0-42c9-b6e4-5a55ef5a83fd",
                        "body": "This was my 10th class.  It is not nearly as demanding as some of the big dogs in the program (e.g., AL/ML/RL/DL -- which by the way are all must takes if you are interested in machine learning), but is a great elective course, especially for those in the ML spec.  It is hard not to appreciate how important network science is in the modern world of social networks and pandemic networks, and the subject matter alone makes this course worth taking.\n\nThis time around, I'm going to provide a very functional review.\n\n\nNote: the below workload numbers assume you have the adequate background for a Masters in computer science, you are motivated enough to focus properly, and you don't have a learning disability.  Modify the numbers as appropriate for your individual case.\n\n**5 Hours / Week:** \"I'm okay with a B\"\n\nCongratulations!  You're the typical OMSCS student who can namedrop some terminology but doesn't really understand the material you just \"learned\", and wouldn't be able to apply it to a job or on an interview.\n\n**10 Hours / Week:** \"I must get an A\"\n\nIt's about 5 hours/week to do due diligence to the lectures/slides so that you can do well on the quizzes.  It's another 5 hours/week to present respectable assignments.  Note that assignments are due roughly once every 3 weeks.  You will probably make use of the multitude of annoying classmates who need their hands held and ask the TAs for clarification on every step of the assignment.  Or you will be one of those people.\n\n**15 Hours / Week:** \"I really like Network Science!\"\n\nYou make an effort to really understand the assignments and provide a polished output.  You also put effort into working through the derivations of formulas in the slides (there are a lot of these) as well as doing all the required non-Canvas reading.\n\n**20+ Hours / Week:** \"Teach me everything there is to know about this amazing new field!\"\n\nIn addition to all that is in the above category, you do the supplemental readings and also ponder the \"food for thought\" questions inside the lectures.\n\nIn an ideal world, where transcript grades actually mattered, the top category would get Cs, the 2nd category Bs, the third category As, and the truly worthy would get A+s, but alas, things are what they are.\n\nI have a suggestion to make the course better: condense the schedule of the assignments, which aren't very difficult, and add a final assignment/solo-project that utilizes the final module of the course, machine learning, which currently is not part of any of the assignments.  ML is integral in modern network science and including a project that utilizes it would be an exciting addition to the course.   This would make the course more challenging and bring the workload numbers up a bit, more in line with the heavy hitters in the program\n\nFinal note: the difficulty assigned to this review assumes you're in the \"must get an A\" category since I think that calibrates best with what people expect in these reviews.\n\nIf anyone has any questions about the course, or the ML spec in general, feel free to email me at omscs_burner@yahoo.com.",
                        "difficulty": 2,
                        "workload": 10,
                        "id": "external-import-48bd8a8a-bcd0-42c9-b6e4-5a55ef5a83fd",
                        "_createdAt": "2021-12-01T01:17:39Z",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-11-21T13:46:15Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_id": "external-import-02b8a656-fa9c-42ef-bd66-08912b6107eb",
                        "body": "The course mentions no prerequisite, but I think it definitely needs know-how of statistics and machine learning.\n\nThe course is not inclusive of attendees who come from computing system background because lectures presume a lot.\n\nThe piazza comments by TAs are usually ambiguous and did not helped resolve or understand the main question most of the time.\nThe wordings of the assignments are not clarified well. We have to always rely on student discussions on the Piazza. \n\nSo there is no use of starting the assignments early.\n\nLectures are text-only summary of required readings. \n\nThe evaluation in quizzes is not from the lectures 90% of the time.\n\nLinks in the lecture are not verified, few of which do not work or require subscriptions to access.",
                        "id": "external-import-02b8a656-fa9c-42ef-bd66-08912b6107eb",
                        "_type": "review",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 2,
                        "workload": 12,
                        "created": "2021-11-21T13:46:15Z",
                        "difficulty": 3
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-f6a70c7f-8cf8-4202-9319-24c0af744c22",
                        "_createdAt": "2021-10-29T20:50:23Z",
                        "body": "I was really excited about this course coming in but found it pretty lacking. \n\nThe topic itself is very interesting and network science is a relatively new field in CS, so that is fun to learn about. However, despite network science explicitly being an application of various fields to the study of real-world networks, the projects and quizzes feel very impractical and not useful. I don't see any scenario where this course will help me outside of pure curiosity. The one exception in my mind would be if you are planning to study this field for say a PhD. \n\nThe course itself is very light. There are weekly quizzes which can take anywhere from 15-60 minutes, and a project due every three weeks. The projects can be done in a single weekend and usually involve just googling the relevant information to then implement in Python. ",
                        "id": "external-import-f6a70c7f-8cf8-4202-9319-24c0af744c22",
                        "created": "2021-10-29T20:50:23Z",
                        "difficulty": 1,
                        "workload": 6,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 2,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "body": "As the previous reviews noted, prof. Dovrolis is very much involved in the course, enthusiastic about the material and invests considerable time and effort in interacting with students and promoting the learning. The material itself is mostly interesting, in particular applications of the graph theory and some related network analysis algorithms. I thought it was a nice course with some advanced topics being discussed.\n\nThe TA-s are mostly involved, there were occasional misses (including some rare cases where answers on Piazza which could confuse into an incorrect quiz answer), and some questions on Piazza could be seen hanging for some time, but mostly the TA support was rather solid.\n\nLogistics wise, a lot of complaints can be seen on the quizzes, but I think those should be taken with a balanced view. Granted, the quizzes were hard, with occasional questions worded in a tricky way - but I can't say it was the general flow. FWIW, out of 14 quizzes, I got a full score only once, with average quiz grade before the final adjustment being just above 80%, and I did find it annoying more than once to receive a zero score on question where I marked 3 out of 4 T/F options correctly, and there have been occasional ambiguities (as well as regrades following discussions). However, the quizzes did require reviewing and thinking over the material and they did test the understanding. Generally, each quiz had 6-7 questions, some multiple choice, with one or two easy and some really hard, and like I said, almost every quiz tripped me with something.\n\nYou need to consider that the quizzes are open, un-timed, there are no other exams of any sort, two lower grades were dropped and the grade cut-offs, at least as described by the professor, were several points below the usual 90/80/etc cut-offs. Add to that the fact that the lower homework grade was dropped (maybe because it was the Summer term - it seemed way too generous), then I can see the point of the quizzes (35% of the grade) being hard, to push things and to help learning (which they did).\n\nThe homework (projects - 5 of those) were nice, the programming (python/networkx/matplotlib plotting) being relatively easy, but they did consume time (for me there was also matplotlib/seaborn learning curve, which was nice). Numpy knowledge is beneficial. The homework included not just dry programming but also some theoretical questions, as well as understanding how to better plot and present the data for analysis and explanation. There were some occasional ambiguities in the homework as well, but I don't think there was any point of unfair grading WRT anything. I didn't get 100-s on all of the assignments, but getting an average of well above 90 I would not consider difficult with effort spent, and those are the other 65% of the grade.\n\nJupyter notebooks are not everyone's cup of tea, so I just did and debugged the assignment parts in Pycharm and then moved to the notebook. The notebooks have some advantages,\ne.g. for isolating occasional long-running parts, to get the data, and then working separately on better plotting/analysis etc. For theoretical answers with math (not that much at all, really) I did use Latex there - nothing substantial, especially if you have survived the CP midterm report.\n\nRe required readings - I did have time limitations during the term so I skimmed most of the book (some quizzes do occasionally require looking it up - but it's online and free). Neither did I go deep into any of the papers (saved them for later). Just because I allowed that slack doesn't mean it was a good thing to do, but it did not prevent getting a good grade (before any grades or letter grade level cut-off dropped). So it's all very much doable - the return (i.e. the depth of understanding) would be in proportion to investment. As a background, I'm by far not a graph theory or (especially) machine learning specialist.\n\nThis was my 6th course. It has left a nice feeling, glad I took it in the summer.",
                        "_type": "review",
                        "rating": 4,
                        "id": "external-import-5517bad4-aeee-4146-9fbf-a761acf9bb9b",
                        "workload": 20,
                        "difficulty": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "created": "2021-08-09T12:20:28Z",
                        "_id": "external-import-5517bad4-aeee-4146-9fbf-a761acf9bb9b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-08-09T12:20:28Z"
                    },
                    {
                        "_createdAt": "2021-08-05T06:57:14Z",
                        "semester": {
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "difficulty": 3,
                        "rating": 2,
                        "workload": 25,
                        "_type": "review",
                        "id": "external-import-496a291e-3581-45fb-8593-36da9a0b61c6",
                        "created": "2021-08-05T06:57:14Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-496a291e-3581-45fb-8593-36da9a0b61c6",
                        "course": null,
                        "body": "Prof Dovrolis is amazing, one of the most actively involved prof among all the courses I have taken (this was my 9th). He conducts office hours while taking questions from the students and goes into immense detail to explain the concepts.\n\n**Do not take this course if**\n\n- you do not truly understand advanced mathematics algebraic equations and can then translate those into python code without any boilerplate code.\n\n- you will not really read (not just skim) and synthesize the content in Network Science (Barabasi) book. You will fail miserably in the open book quizzes.\n\n**Syllabus and Lectures**\n\n- Network Science is a very interesting topic and the syllabus contains exhaustive details if one can devour it (I found it really daunting for a summer semester).\n\n- Video lectures are less than 5% of the actual syllabus so consider near to nothing. It is really hard to consume endless hours (book, exhaustive slides, papers) of text where a minor word if missed can cost of in the quiz.\n\n**Assignments**\n\nI took the course hoping that most of the work will be based on the NetworkX library but I was wrong. The assignments are not straightforward and I observed the wording of assignments specifically ambiguous. There were numerous corrections while you were actively working on an assignment, though TAs were lenient to let you off if you missed late corrections in the assignment.\n\n**Quizzes**\n\nQuizzes were the hardest ever I have faced even though these were open book. The quizzes are employing wordplay and pick on edge cases that you may not encounter anywhere in the book or lectures. It is really hard to score more than 70% on average.\n\n**TAs**\n\nTAs were an amazing team with all continuously being active on the piazza. Mario Wijaya deserves a shout-out for tirelessly answering piazza questions.\n\nI got an A with the curve (2 quizzes dropped, 1 assignment dropped from grading).",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "id": "external-import-8a7529ae-bcd0-43bc-8ae5-69d7571dd459",
                        "_createdAt": "2021-08-04T20:26:15Z",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-8a7529ae-bcd0-43bc-8ae5-69d7571dd459",
                        "workload": 19,
                        "created": "2021-08-04T20:26:15Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "body": "I took the course because I really wanted to and I truly desired to love it, but I didn't. The content is good. The book is well-written. It just felt like I didn't actually get to focus on learning the network science part.\n\nI hated the quizzes. They felt pedantic and definitely contributed to my feeling that I wasn't focused on the valuable takeaways from the content. I'd rather have 25 questions that reinforced the learning instead of hunting down some miniscule details for 6, then worry about wording quirks or edge cases that inevitably blow up your answer.\n\nThe assignments were not super difficult, but parsing out each requirement from the requirements doc was more difficult than I think it should be. I started to go through and individually highlight every sentence as I completed a requirement after missing a couple dumb things early.\n\nSome people will complain that they didn't get to implement specific things (e.g. centrality, whatever) and I suppose that's valid. I personally wanted to just focus on what the concepts were and learn how/when to apply them, so I didn't mind.\n\nI found the pace of the course to be pretty intense during summer because I'm a try-hard. They didn't drop any material (though he did curve) and I treated it like there wouldn't be a curve. \n\nThis was my first class where I actually logged everything I did in a google sheet and my workload is 100% accurate. You may find yourself worrying less about quizzes (which i spent hours on each week) or maybe taking less verbose notes than me (again, hours each week). I could see someone getting through with a 10-15 hour workload.\n\nDr. D is awesome. The office hours were scheduled, reliable, and informative. The TAs did a bang up job, too. If I had to complain about anything, I'd say that some feedback on assignments was too vague to help you actually learn what you did wrong and fix it.\n\nI got an A without the curve and a much better A with it."
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-d7dbbcd4-7efe-4ecf-806d-ab70aed87d63",
                        "body": "This course provides a theoretical base for several things we see in the world around us. It will definitely influence how you see things from office interactions, traffic, diseases, to characters in books and movies etc. All with a very strong mathematical base.\nWhile it's far from polished, it does offer a great deal of learning points.  \n\nThe main text book, is called Network Science by Albert-László Barabási and is available online. It's worth perusing before starting the course, but it lacks a bit in terms of clarity, as well as using obscure mathematical notations at times. The other book that features heavily is Networks, Crowds, and Markets by David Easley and Jon Kleinberg, and this is a much better read. However, the textbook content is generally summarised in the lectures which are about 90% slides - 10% videos. This slide-heavy format is a deviation from OMS, but I found it rather refreshing to be able to read bits and pieces here and there instead of having to devote blocks of time to consuming videos.\n\nA lot of the workload for this course was in the required readings and the 14 quizzes. Though open-book the quizzes were particularly tricky, with class means generally falling between 75 and 80%.\n\nThe 5 projects were generally doable in a couple of days, though I personally found stretching them out over a week or so allowed the material to sink in better. The projects are all with Jupyter notebooks and require decent Python Knowledge with topics like list and dict comprehension, Matplolib, and basic Numpy featuring heavily.\n\nThe TAs are very helpful and are active on Piazza and on the slack channel.\n\nProf Dovrolis will probably one of the kindest people you'll ever interact with during the course of this program. He really invests himself in helping students succeed.\n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_createdAt": "2021-07-23T23:41:17Z",
                        "workload": 18,
                        "id": "external-import-d7dbbcd4-7efe-4ecf-806d-ab70aed87d63",
                        "created": "2021-07-23T23:41:17Z",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        }
                    },
                    {
                        "id": "external-import-4962584c-73de-4349-9e09-32b65bfedbb0",
                        "body": "This course offers a pretty good introduction to basics and applications of network sciences. I thoroughly enjoyed the subject, and am very interested in learning more.\n\nThe lessons are pretty thorough, and mirror the material in the textbooks, both of which are free. \n\nThe pace over the summer is pretty fast, but if you're consistent, it's not bad. You may get burned out and frustrated at times, or often, though. \n\nThe class tries to cover a lot of fundamental topics, so unfortunately there isn't a lot of depth. You will ultimately learn some very interesting fundamentals, though. \n\nYou should have a basic college algebra / calculus background as well as some familiarity with python. You will develop some skill using networkx, matplotlib, and a bit of numpy in this class.  \n\nThe projects are pretty straightforward, but grading is a bit slow and assessments seem somewhat subjective. Later quizzes demand considerable time scouring papers and trying to piece together formulas. I never felt fully confident on quizzes, even when I ended up doing well. \n\nThe professor and TA's are all very considerate and helpful. TA's were always active on Piazza. I enjoyed trying to help out in answering questions on Piazza, and the TA's and instructor were quite supportive. \n\nPros:\n\n* Very interesting subject, wide relevance. \n* Teacher / TAs are involved and responsive. TA's and professor are open and respond to students, revising and amending material when necessary. \n* Quizzes are open-everything, no time limit (other than due date). \n* Projects are python-based Jupyter notebooks, mostly using networkx, scipy, and plots. \n* Formulas are derived from basic principles using statistics and calculus. \n* Lots of course materials and documents / papers available for this subject area. \n* Lessons are mostly presentation slides and not traditional videos. The presentations are a great summary of the main ideas, which are not easily available in video-based classes. \n* Professor Dovrolis is one of the kindest people you will encounter. \n\nCons:\n\n* Project grading is somewhat slow for a relatively small class. \n* Lots of reading: texts and papers. You really need to read the papers to do better than average on the quizzes.  \n* No test case / feedback on projects, leads to uncertainty, although Piazza is used extensively to clarify questions. \n* Quizzes often have at least one question (including multiple-answer multiple choice questions) that can be pretty tricky. Choices are sometimes not clear. Quizzes get more difficult toward the end of the semester. They are also self-graded on Canvas, where only limited partial credit is given.\n* Most of the lectures and videos are pulled from reading material. While this is useful for a summary, it would be helpful if presentations were extended. \n* Projects are fairly basic applications of concepts and don't require a lot of interpretation or investigation. \n* Some hyperlinks in presentations are dead or outdated. Some quiz responses were arguably incorrect. These cases were fairly rare, but there was evidence that a course in its second semester is still growing. \n\nOverall:\n\nI would recommend this class. The projects are easy (almost too easy, mostly acquiring and applying the correct networkx functions), but the quizzes are challenging (in depth questions require solid understanding of formulas and doing related reading). The breadth of material is fairly vast, but this comes at the expense of depth and application. I think the course is still going through some growing pains in its second semester, but the material is very interesting and there are enough challenges to keep you busy. The small class size is an added bonus. \n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 20,
                        "difficulty": 3,
                        "created": "2021-06-27T00:11:54Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_id": "external-import-4962584c-73de-4349-9e09-32b65bfedbb0",
                        "_createdAt": "2021-06-27T00:11:54Z",
                        "course": null,
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_id": "external-import-590f6e9e-2a26-4036-a88a-e6d504e6532b",
                        "body": "For background, this was my 5th course in OMSCS. I come from a STEM background (EE) and I have a STEM job (CS/IT).\n\nOverall, I did not enjoy this course at all. I ended up withdrawing from it after 15 days (after giving three quizzes, partially working on pr1 and pr2).\n\nI felt there were two reasons I did not do so well in the course.\n\nFirst, to be honest I was horribly under prepared. I loved linear algebra, calculus and statistics in my undergrad! Linear algebra was one of the courses I was able to score a 100 on in an exam. This was 12 years ago though. I thought I’ll be able to catch up on old things quickly, but I was wrong. Between a full time job, revising old concepts and keeping up with course deliverables, I just couldn't carry on. I scored 9/13 in the assessment quiz but had difficulty going through it, so please take that quiz seriously! I did not study graph theory in my undergrad and I felt a bit more familiarity with it would have helped.\n\nSecond, the way course material is presented can do with a lot of improvement in my opinion. There are no video lectures (which is not a deal breaker for me) but the written slides/pages are **VERY** concise (emphasis on the word **VERY**). In most cases, the instructor just introduces a concept in those slides and leaves bulk of the things for you to read up on our own. I actually ended up watching a ton of youtube videos on related concepts and reading a lot of material online in addition to the required readings. \n\nI did not have enough time in the course to say anything about the professor. He was fairly active on piazza. Same goes for the TA team.\nThe course had no exams. 35% open book quizzes and 65% projects (jupyter notebook, numpy etc.). Summer 2021 semester started off pretty hectic. We had two quizzes due on the first weekend and project 1 due on the next Wednesday. Looking ahead, there were quizzes due every weekend and projects every two to three weeks.\n\nIn summary, my experience with the course was not pleasant. If you have a good command of graph theory, statistics, linear algebra and probability, you will likely enjoy this course and get a lot out of it. Otherwise, be prepared to work hard. You may also be able to get by if you don't have the urge to dig deeper and really understand the material.\n",
                        "difficulty": 4,
                        "rating": 1,
                        "workload": 20,
                        "created": "2021-05-30T23:51:07Z",
                        "_createdAt": "2021-05-30T23:51:07Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "id": "external-import-590f6e9e-2a26-4036-a88a-e6d504e6532b"
                    },
                    {
                        "rating": 5,
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "created": "2021-05-11T03:20:43Z",
                        "_id": "external-import-e706bb98-ae2b-45c4-a49a-0800b73ed673",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-05-11T03:20:43Z",
                        "difficulty": 3,
                        "body": "Overall, the course content is interesting and fun. You may learn a lot about the properties of different networks, not just computer networks, but also social networks, traffic networks, and so on. This is a fairly new branch of computer science and already has a great deal of practical application.\n\nThis class is offered for the first time during a difficult time so the expectation cannot be set too high. The course materials are delivered in a mixed format (mainly text and some videos). But I have to say that it doesn't mean that the content is not structured well. Actually, for me, it's easier to focus when reading well-summarized course materials than watching videos.\n\nThere are weekly quizzes and 5 projects. Projects very related to the topics taught and will take 10 - 15 hrs each on average. They won't be too difficult if you are familiar with Python and have undergrad-level statistics knowledge, which is one of the prerequisites of the course.  Quizzes are quite challenging and you will need to understand the concepts really well to get good scores but the lowest scores get dropped (at least for this semester). You don't really have to worry too much about the grade if you spend enough time.\n\nTAs are helpful and active and professor Dovrolis is super nice and very enthusiastic about motivating students to learn and improving this course.\n",
                        "id": "external-import-e706bb98-ae2b-45c4-a49a-0800b73ed673",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "workload": 12
                    },
                    {
                        "id": "external-import-34058a4f-fefe-4154-9a71-b2f98e29f226",
                        "created": "2021-05-10T18:36:39Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1,
                        "_createdAt": "2021-05-10T18:36:39Z",
                        "body": "The course is consisted of weekly quiz (14 of them) and 5 projects. There are no exams. For the quiz, I do not know why I studied the course materials well but still received some low scores. The quiz definitely requires some deep understanding of course concepts. The projects are always poorly worded and students need to ask many questions for clarifications. The feedbacks of projects are extremely slow, usually two weeks right before the due of the next project. The TAs do not provide sample solutions. So I just know where I lost points, but do not know how to correct them. So basically I did not learn anything from my mistakes. TAs are not quite interactive on Piazza. It usually takes some time for them to answer questions.   ",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "workload": 15,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "_id": "external-import-34058a4f-fefe-4154-9a71-b2f98e29f226",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "id": "external-import-2951ec76-a210-4ee7-84e4-0cb9b6454c27",
                        "difficulty": 3,
                        "_createdAt": "2021-05-05T00:37:24Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-2951ec76-a210-4ee7-84e4-0cb9b6454c27",
                        "created": "2021-05-05T00:37:24Z",
                        "workload": 12,
                        "rating": 2,
                        "body": "not a fan of the all reading no video bit. It was manageable, but not a very good learning experience. Quizzes were very frustrated. It seems the more time I put on the materials the lower grade I got. Very hard to get full points. Projects were ok, but not very interesting. Grading was a bit slow and there was no formal regrading process. "
                    },
                    {
                        "difficulty": 3,
                        "workload": 15,
                        "body": "I really enjoyed this class.\n\nIt was easier compared to my other late program courses, this was my 9th/10th (took with GA).\n\nIt is a survey course. It covers a huge variety of terrain in the field, which is new. The mathematics are non-trivial, but a general comprehension seems sufficient.\n\nWeekly quizzes, open everything, unproctored, non-trivial, questions are maybe 70% straight from the material. 30% are inference questions applying concepts from the material. My average for quizzes was about 75%, which was above the mean.\n\nProgramming assignments are non-trivial, and the majority of the workload. I was thorough and curious, I believe I'm a decent Python coder but I wanted my code to be clean and sensible and efficient.\n\nMost lectures are reading assignments. There is a good deal of reading material for each weekly chapter; however, I did not note that any of the quizzes were from the readings. I proposed this as a change to the instructors (sorry, later classes). You get out of this class what you put into it.\n\nMy clocked time was 12 hours per week. At the end of the semester I skipped most of the readings and knowledge checks (do not contribute to the grade), to concentrate on GA. I learned less, as a result.\n\nI wish I had taken this class earlier in the program. I'd love to study NS in more depth.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-05-04T12:43:42Z",
                        "id": "external-import-1808646e-fcdc-48ef-bdac-f04973c113f1",
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-1808646e-fcdc-48ef-bdac-f04973c113f1",
                        "created": "2021-05-04T12:43:42Z"
                    },
                    {
                        "id": "external-import-fb2ba2df-76c2-41fc-9d1f-0863d00c60ab",
                        "created": "2021-05-02T21:37:04Z",
                        "difficulty": 3,
                        "_id": "external-import-fb2ba2df-76c2-41fc-9d1f-0863d00c60ab",
                        "body": "I really don’t like how this course is taught. There are very few videos(almost no real videos) to watch, but mostly reading materials that basically summarized from an online book. I only speak for myself, but the whole point of taking a class is to not only learn from books, but also pick the instructor’s mind on how we process and understand this area of knowledge, otherwise I might as well just read the book myself. I didn't see any videos in the beginning, and was glad that someone brought this up during professor’s office hour, hoping it would change in the future sections or at least explain more on the math during office hours. But, it did not change and the professor somehow cancelled his office hours right after, saying that he didn’t find the office hour to be effective. \n\nBesides that, you can’t download the materials or the slides. You have to scroll them page by page on canvas which is really annoying. I end up printing the pages but still a very annoying process cuz there were so many pages. When students asked about downloading the materials, the answer they got was “I am afraid that currently we don't have a slide version of the course material”.  I don’t think I learned a lot from the course material. I had to search everywhere to have more understanding for the quizzes and assignments. \n\nSpeaking of the quizzes, they are open everything with no time limit, but really really tricky. I found most of the wording to be very ambiguous, I had to guess what the question was actually asking about. And the assignments were not any better, instructions were not very clear and not well-defined. I started early in the first assignment, but end up changing a lot of things before the deadline because there were so many clarifications needed in order to complete it. I ended up starting my later 4 assignments just 2 days before the deadline so that I can just read from others questions on Piazza, and don’t have to wait for responses.\n\nOnly good thing is that this course doesn’t have exams and TAs are pretty active on Piazza. Honestly, I came to this class having a lot of interests in network science, but now I don’t think I want to dig in any further.",
                        "rating": 1,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 10,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-05-02T21:37:04Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-e577dcf0-b682-4ff1-9d17-0aeee96cb5c8",
                        "created": "2021-04-30T00:27:15Z",
                        "course": null,
                        "_createdAt": "2021-04-30T00:27:15Z",
                        "_id": "external-import-e577dcf0-b682-4ff1-9d17-0aeee96cb5c8",
                        "body": "The course content is very interesting but I think the course is not ready to be published online.\n\nIn the course website they said \"Students will first watch (online) the video of the lecture on their own Then, on Thursday, we will have a BlueJeans session to go through exercises\"\n\nFirst week I didn't see any videos and most of the material was just reading, so I thought maybe the Professor would walk through the material  via BlueJeans but he didn't and after two weeks he cancelled his session !!!  \n\nThe videos cover only less than 5% of the total material and the remaining 95% is just reading and didn't really contribute to my understanding. So, I ended up searching elsewhere to learn then come back to read the lectures and then take the quiz. \n\nMost of the course is summary for \"The network science book\" http://networksciencebook.com/\n\nIn terms of Piazza, the TAs are very polite and helpful in  answering our questions about the assignments.\n\n\nMy final recommendation is to wait and not enroll in this course until they create videos for the whole material.\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 15,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "body": "If you go into this class thinking that you will be programming these algorithms from scratch, you are mistaken. This course is a survey course that does a good job of introducing students to the concepts of network science, without exposing them to the meat of the algorithms involved. If you want to delve deep into implementing the algorithms, skip this class.\n\nGiven that this course is new I am only going to comment on how the class is structured and the material presented, not things being worked out due to a new course. \n\nThe class has two parts, the quizzes and the projects.\n\nQuizes:\nPros:\nComprehensive, and make you work to get that high grade.\nCons:\nFactoid hunt that can depend on the quality of the material presented. The lectures and main text book very obvious written by someone who hasn't had a rigorous math or engineering background, lack of consistency or concise statements is frustrating. Quiz questions often hinge upon a must, may, or only statement. There are many pick all that are true or false that are also frustrating. I get this is a replacement for having a midterm and final, but I want something that's not a fact hunt, it feels like nothing stuck.\n\nProjects:\nPros:\nYou learn Networkx\nCons:\nData sets are uninteresting, and you have very little idea if your final results are correct.\n\nI would let this class have a few more iterations before you give it a try, I think it could be more enjoyable if improved.\n\n",
                        "difficulty": 3,
                        "course": null,
                        "workload": 8,
                        "created": "2021-04-20T04:41:03Z",
                        "_createdAt": "2021-04-20T04:41:03Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 2,
                        "_id": "external-import-5f922a1a-79fa-4cea-bd45-e3f61c2e9b4e",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-5f922a1a-79fa-4cea-bd45-e3f61c2e9b4e"
                    },
                    {
                        "workload": 8,
                        "body": "The class is pretty well structured. Every week you have a quiz (without fail) and every fortnight you have coding assignment (grade weight 35:65 respectively). Quiz are open book, open internet , un-proctored, you can do it in many sittings , can refer to course material. They are pretty comprehensive and not easy. average class score on quiz is around 70-75%. Each week's Material is divided into 12-15 lectures. Each lecture is not just a slide ( as mentioned in some reviews) but a full topic in itself. You can say a \"text book  page\" worth of information. Which has examples, mathematical derivation, diagrams, analytical meaning of equations. I take notes too, so it takes around 2-3 hours for that.\n\nProjects are fun. All in python and require you to play with given dataset using existing libraries ( average class score is 85-89%). This takes around 8-10 hours to finish. Good hands-on python is required. Some knowledge of statistical tests can be helpful.\n\nTA’s have some unknown (to us) rubrics based on which they grade. Grade structure is not defined. The professor said, he has some cutoff in mind for A,B,C but wont disclose. So we dont know yet what grades we are getting and just trying to do our best.\n\nI’ll say this is very rich and interesting class. Probably one of the best for OMSCS in terms for learning, structure. The material is not difficult but the class structure keeps you involved thoroughly. Examples are picked from real wold as well as text books. This is kind of class which fascinates masters student to ponder if they want to write a thesis/research on the subject. Phew! TA and professor are active on piazza. I’ll rate this class highly.",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-86b7204b-a152-4f12-a01c-cdb58c4ce488",
                        "_id": "external-import-86b7204b-a152-4f12-a01c-cdb58c4ce488",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-04-08T22:31:12Z",
                        "course": null,
                        "difficulty": 3,
                        "rating": 5,
                        "created": "2021-04-08T22:31:12Z"
                    },
                    {
                        "course": null,
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "Great class. As the previous reviewers said, the material is very interesting. Lectures do a great job of connecting theory to real-world scenarios. Sets the bar for the rest of OMSCS. Instructor and TA team are both great and the class is very well run considering it's the first semester offered online. Piazza isn't super active but it's a smaller class.\n\nCalculus, statistics, probability, linear algebra, and python are hard prerequisites for the course (you should take the prereq quiz seriously). If you don't have a good background with these you will struggle or worse miss out on a lot of the richness of the material. Experience with numpy scipy and matplotlib will help save a lot of time (I struggled here and probably spent more time than most on the assignments). Quizzes aren't a walk in the park but definitely not unfair and require you think about the material. For the motivated you could easily spend another 10+ hours a week reading papers and working on \"food for thought\" (ungraded) exercises in the lecture notes that are both very interesting and help solidify your understanding of the material. ",
                        "id": "external-import-92d8e988-3d2d-4a37-b779-71b72d42af60",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "difficulty": 3,
                        "_createdAt": "2021-04-08T20:37:28Z",
                        "_type": "review",
                        "workload": 12,
                        "created": "2021-04-08T20:37:28Z",
                        "_id": "external-import-92d8e988-3d2d-4a37-b779-71b72d42af60",
                        "rating": 5
                    },
                    {
                        "course": null,
                        "body": "Reviewing the course halfway: Course offers a breadth of material covering the Network Science Book by Barabasi. Consists of only quizzes and projects. Quizzes are straight forward as they are open book and are most of the time directly from the course material. Projects are interesting and cover the use of NetworkX library in Python. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "rating": 5,
                        "workload": 6,
                        "id": "external-import-4c2178e9-8b0d-47a0-8044-4125cd8f5dc4",
                        "created": "2021-04-07T05:12:20Z",
                        "_id": "external-import-4c2178e9-8b0d-47a0-8044-4125cd8f5dc4",
                        "difficulty": 1,
                        "_createdAt": "2021-04-07T05:12:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review"
                    },
                    {
                        "_id": "external-import-9dd9855a-8aaa-4931-aeb3-d4eafba5e1e9",
                        "_createdAt": "2021-03-15T17:38:30Z",
                        "workload": 8,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "body": "I'm reviewing this class half way through because registration is coming up and it's a new class w/o any reviews yet. I'll update after it's over if anything changes. \n\nOverall, there isn't much work for this class. Grade is broken down as 35% quizzes and 65% projects. \n\nThere are weekly required readings and recommended readings. I do all the required readings and take detailed notes and it takes me about 2 hours a week. (I only do some of the recommended readings). Personally, I do the readings before the modules because they are more detailed. \n\nWeekly modules are basically just reading slides, and the slide are pretty much just a summary of the reading. The graphs and figures are straight out of the book. There are pretty much no lectures. You get a min. long video introduction at the start of each module, which is just the professor reading the intro slide of what you're going to learn in the module. Then you go through the slides yourself. Occasionally there will be a one or two minute video example in one of the (15 - 20) slides, but some modules had none. I can get through the modules in about 2 hours (again, I am a notetaker.)\n\nThere are weekly quizzes, open everything. And you don't even have to finish the quizzes in one sitting, they can be closed and reopened as many times as you wish until you submit. I usually do mine in one sitting and it takes about half an hour. There are also \"knowledge checks\" which are just ungraded practice quizzes, but they are not necessarily predictive of what will be on graded quizzes, so I don't always do them. \n\nThere are also 5 projects. Projects (so far) are structured like \"look up this function in Networkx (python package) and apply it\". You are given Jupyter notebooks and specific steps to follow. Nothing too intense. Projects are open for 2 weeks and then a week off before the next project (except it looks like the last 2 projects will be back to back). So far project grading is slow. \n\nMy overall estimate of 8 hours accounts for about 4-5 hours of regular weekly work, and about 8-10ish hours per project averaged over project and non-project weeks. (I'm terrible about estimating my time, but I did try to count this last week so that I could give an accurate estimate). \nOverall, I find the course material fascinating, but I'm also taking another class which is much more demanding of my time than expected, so I find myself not spending any \"extra\" time engaging with this material, which is a shame because it's so much more interesting to me than my other course. \n\nFinally, as this is the first semester that this course is offered, I'd expect it to get better. Maybe there will be more lectures in the future? But overall, fascinating material and definitely worth taking. ",
                        "id": "external-import-9dd9855a-8aaa-4931-aeb3-d4eafba5e1e9",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 4,
                        "created": "2021-03-15T17:38:30Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    }
                ],
                "id": "external-import-CS-7280",
                "created": "2022-07-05T23:23:15Z",
                "description": "Characteristics of real networks in nature and technology, network measurement methods, network analysis, evolving networks, dynamic network processes, co-evolution of structure and function.",
                "_createdAt": "2022-07-05T23:23:15Z",
                "tags": [
                    "NS"
                ],
                "programs": [
                    {
                        "acronym": "CS"
                    }
                ],
                "rating": 3.188679245283019,
                "difficulty": 2.943396226415094,
                "workload": 12.962264150943396
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "network-science-methods-and-applications"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}