{
    "props": {
        "pageProps": {
            "course": {
                "officialURL": "https://omscs.gatech.edu/inta-6450-data-analytics-and-security",
                "_rev": "959qsafI8uoLDPJecgklqH",
                "name": "Data Analytics and Security",
                "reviews": [
                    {
                        "_createdAt": "2024-08-15T19:07:00Z",
                        "rating": 2,
                        "id": "pFLUQlrbFHwNnw2bhVoww5",
                        "workload": 6,
                        "_id": "pFLUQlrbFHwNnw2bhVoww5",
                        "body": "Overall, this was a very easy course that is heavily backloaded with the final paper. Most of the assignments are very easy and will not take any time. The quizzes are also very simple as the questions are mostly taken directly from the lectures. The final paper/presentation could be very time consuming depending on your group, but as long as you start early when the project comes out it should not be that bad.\n",
                        "created": "2024-08-15T19:07:00Z",
                        "semester": {
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "authorId": "MBQeCEa32L2sc36g8XNAEg==",
                        "_updatedAt": "2024-08-15T19:07:00Z",
                        "course": null,
                        "difficulty": 2,
                        "_rev": "pFLUQlrbFHwNnw2bhVowsp",
                        "_type": "review"
                    },
                    {
                        "authorId": "lvbpBJESbe2FyVHsecRLUg==",
                        "semester": {
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2024-08-12T02:45:14Z",
                        "_createdAt": "2024-08-12T02:45:14Z",
                        "id": "WO6QCb0AdjGY7KsBRwDI4w",
                        "created": "2024-08-12T02:45:14Z",
                        "body": "The previous reviews were still true in Summer 2024. I'm providing this review for the purpose of providing tips for students who are more like me. I do not have a traditional CS Bachelor's background. This is my third class in the OMSCS program. I took this class as an introduction to learning about the security. Some, maybe majority of the, students in the section were in OMS in Cybersecurity.\n\nThe course lectures introduced a variety of topics which were new to me. However, I did not feel the learning experiences designed were helpful for me to internalize what was taught. The quizzes were on the lectures, but there was no expectation of thinking because all quiz questions could be answered by searching the slides. In fact, the response could be marked wrong if some thoughts were put into understanding the lecture. \n\nThere were two projects to choose from. Signing the nondisclosure agreement (NDA) did not limit your choice to that project. You could sign it early and get the data before you decide which project you would like to choose. NDA can be signed as soon as the semester starts. I had never worked with JSON files before so I appreciate my project experience in this class. I also suggest view the last two modules for the project, each had information on one project. I also felt the details expected on the midterm/proposal were to the level of a completed project rather than a proposal.\n\nThe instructor had weekly office hours. Some students got specific help and even code snippets, but some other students would not get a response other than \"I don't know,\" depending on the question.\n\nI felt the execution of the class was poor. The Canvas course material was made available throughout the semester instead of at the beginning, which I did not like. There were out-dated instructions and links in the course material. Students may ask questions on Ed and the response would be different from what was in Canvas. I would suggest reading Ed posts often. \n\nSome of my expectations as a student (stated in XXI. Student-Faculty Expectations No. 8-10) were not met. I did not feel grading cretiria were clear or grades were posted in a timely manner. For example, I could get different number of points deducted for the same reason on different assignments of the same type. Out of xxxx graded assignments, xxxx of them had grades released outside of the two week window as stated in the syllabus. Note there was also a ceiling effect since there was a deadline to release grades set by the university. TAs could discuss what was sent in a private message in the public forum, which led me to wonder if they were trained sufficiently. Letter grades seemed not to be criterion-referenced because the conversion was only posted after all grades were posted. For Summer 2024, directly copied from the announcement was:\nA: 86% and above\nB: 76% - 87.9%\nC: 66% - 77.9%\n\nAs for TAs, all previous reviews touched on a lot of aspects, so I will not repeat much. One difference could be that this semester, they specifically pointed out that there were re-grading of assignments unless it was a setting problem on the auto-graded quizzes. This meant any mistakes made by the TAs would not ever be corrected. I suggest reading the instructions carefully, treating any seem-like suggested examples or guidelines as required, listing out each question separated by a question mark in the discussion prompt and response to the question, leaning on the upper limit of the word count, posting on Ed publicly with any questions, reading Ed posts, and making sure the one-sentence response is easy to find plus a lot of details.",
                        "_rev": "WO6QCb0AdjGY7KsBRwDI14",
                        "workload": 12,
                        "_id": "WO6QCb0AdjGY7KsBRwDI4w",
                        "rating": 2,
                        "course": null,
                        "difficulty": 2,
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4"
                        },
                        "authorId": "PDq7LArpArj14f2A8Zf8QA==",
                        "difficulty": 1,
                        "rating": 1,
                        "course": null,
                        "_createdAt": "2024-08-06T21:11:38Z",
                        "id": "FYsk5S1Mp27IS8S7UXNUaJ",
                        "created": "2024-08-06T21:11:38Z",
                        "_updatedAt": "2024-08-06T21:11:38Z",
                        "_id": "FYsk5S1Mp27IS8S7UXNUaJ",
                        "workload": 10,
                        "_rev": "FYsk5S1Mp27IS8S7UXNUVC",
                        "_type": "review",
                        "body": "This course was one of the worst I've ever taken. The content was extremely disappointing, and I felt like I learned nothing. The videos provided were unrelated to the assignments and projects, making it difficult to follow the course material. Also, the quality of the videos was poor, with unclear audio.\n\nThe assignments were very easy yet ambiguous, often leaving me confused about what was expected. The quizzes are very easy and everyone get high grades in them, but, this led to an unfair grading system where the TAs and professor would randomly deduct points without clear reasons, just to create a grade distribution. So, even though the course is very easy, don't expect to get a good grade. There's a high chance you might end up with a lower grade than anticipated due to the arbitrary grading practices.\n\nAdditionally, the feedback on assignments and projects is often given so late that there's no time to apply it to future work. By the time we receive feedback, we've already turned in the next few assignments, making it impossible to make improvements. This delay gives them the chance to deduct points for the same issues repeatedly without giving you a chance to address them."
                    },
                    {
                        "id": "fAeIpsjyc2Ur13b6SsqKr4",
                        "_id": "fAeIpsjyc2Ur13b6SsqKr4",
                        "created": "2024-06-04T19:48:26Z",
                        "difficulty": 2,
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08"
                        },
                        "body": "This was the 2nd worst class I have taken in the OMCSY degree – the 1st being Software Development. The professor in INTA 6450 - Data Analytics and Security was nice but his lectures were mediocre. The good thing is the material – it is very easy to pick up. The problem with the class is how it is run by the teaching assistants. They grade the assignments inconsistently and often leaned toward scoring with a heavy hand. They would arbitrarily take points off for some innocuous reason and contradict the rubric. While other times not even look at your work and given 100%. They could not be trusted to do their jobs honestly and be not accountable for their mistakes. The worst was the lead TA. She set the tone for the group and was probably responsible for their group mindset – “birds of a feather”. I had to go over their heads on 2 occasions just to get things right.",
                        "authorId": "aPZWRF0jdwiFuFLkIpDaCg==",
                        "course": null,
                        "_updatedAt": "2024-06-04T19:48:26Z",
                        "workload": 8,
                        "_createdAt": "2024-06-04T19:48:26Z",
                        "_rev": "fAeIpsjyc2Ur13b6SsqKmJ",
                        "_type": "review"
                    },
                    {
                        "_updatedAt": "2024-05-10T22:12:29Z",
                        "created": "2024-05-10T22:12:29Z",
                        "_type": "review",
                        "course": null,
                        "_rev": "3r9rhykRH8FPhcRCRyo2O7",
                        "authorId": "clVfgmNhWigDU55wrxSU5Q==",
                        "id": "3r9rhykRH8FPhcRCRyo2Ri",
                        "_createdAt": "2024-05-10T22:12:29Z",
                        "workload": 5,
                        "semester": {
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z"
                        },
                        "difficulty": 1,
                        "rating": 3,
                        "body": "Project Activities 50% \nComputing Activities 20% \nLecture Activities 30% \n\nI think this the most easy course of I took (even easier than AIES, AIES was easy but took more time). \n\nAdvantages:\n\nThe entire project can be completed using Python, and for many assignments and projects, the instructor provides most of the code. You only need to modify or add new functions based on your objectives. It's quite straightforward.\n\nThere are 11 simple discussion activities during the lectures.\n\nDisadvantages:\n\nThe assignment requirements are vague. Although it's not specified that you need new functions, remember to include new functions in your exercises (some students reported losing points even when adding new functions, as their functions were deemed not particularly useful, which has been a point of controversy).\n\nTA responses are slow, and grading errors occur. When errors are found, TAs often do not apologize or respond, requiring persistent follow-up to correct the grades.\n\nUnlike my other courses, the same TA graded all my work throughout this course. Typically, grading is done randomly by several TAs or different TAs handle different parts of the assignment. This grading system in this course might introduce personal bias, making it less objective and fair.\n\nOther:\n\nIndividual proposals and group project are closely related. Group projects require forming your own teams, and choosing the right teammates is crucial. For group project, in addition to writing a 10-30 page paper, you also need to create a 10-20 minute video presentation (face not required).",
                        "_id": "3r9rhykRH8FPhcRCRyo2Ri"
                    },
                    {
                        "course": null,
                        "workload": 6,
                        "semester": {
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z"
                        },
                        "_id": "6aUBaJ9KGThTFNHH3ALgiE",
                        "_type": "review",
                        "created": "2023-08-07T14:43:16Z",
                        "_createdAt": "2023-08-07T14:43:16Z",
                        "id": "6aUBaJ9KGThTFNHH3ALgiE",
                        "authorId": "YGBVpPqQ29IPAxJfta30MA==",
                        "difficulty": 2,
                        "body": "Goods: The lectures were the easiest to watch, understand, etc. of any i've seen at the graduate level. The professor has skill at delivering content & it made me actually want to consume the lectures. There is an overall curve at the end of the class based on buckets, this semester it was approx. 3 total points.\n\nBads: Overall THE WORST led class I have been in, and this falls squarely with the TAs or the direction they were given - you can't tell which it is, to be fair. They were nit picky with grades to the point where the class did not accurately assess your mastery of content, but rather was an assessment of where you fell in their curve (which they do not advertise). Severe points were taken off the largest project in the class because it was 'wordy', which is straight opinion. Discussions were graded like academic papers, without that being clear in the assignment. TAs chose their own interpretation of syllabus policies rather than following it. \n\nOverall, just inconsistent leadership that felt like all grades were grasping at straws for something to take points off for. I get that its an 'easy' class with minimal coding, but that doesn't mean that feedback can be constructive to conduce mastery of the content - rather than nit picky & deducting just to keep everyone from having a high A. \n\nAdditionally - about 1/10th of the class, if that, is devoted to cybersecurity. The curriculum needs to be changed, and ASAP. Or retitle the class \"data science\" without security. ",
                        "_rev": "6aUBaJ9KGThTFNHH3ALgdI",
                        "_updatedAt": "2023-08-07T14:43:16Z",
                        "rating": 1
                    },
                    {
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "_updatedAt": "2023-05-11T12:39:12Z",
                        "_type": "review",
                        "authorId": "dkGbJ/23fOo1dX+pe6J8Qg==",
                        "workload": 3,
                        "difficulty": 1,
                        "_id": "3KqS0NOF6YxT8AZtXFU6jl",
                        "body": "This class is easy and you won't learn a single thing - However, the TAs in this course make it less enjoyable by grading arbitrarily. To make the class harder, they just take points off for random things without explaining in detail. They gave a 3 point curve this semester - while this course is already easy as hell the fact they give a curve is just outrageous to me",
                        "_createdAt": "2023-05-11T12:39:12Z",
                        "_rev": "3KqS0NOF6YxT8AZtXFU6h8",
                        "id": "3KqS0NOF6YxT8AZtXFU6jl",
                        "created": "2023-05-11T12:39:12Z",
                        "rating": 1
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN"
                        },
                        "body": "I do not recommend this course. The course has lectures, quizzes, small coding assignments that require handful of line changes at most, and two large essays.\nThe lectures are fine and informative. The quizzes are directly from the lectures and do not require honor lock so you can follow along while completing it.\nThe coding assignments generally take less than 15 minutes for each one as most of them are “make one unique change to the code adding some new functionality”. You are allowed to make any change to it essentially.\n\nThere are two essays, one being a solo assignment and the other being a team project. As many of the other reviews state, your grade on any give assignment is completely dependent on the TA that grades you. Some hand out 100s without verifying the quality while some mark off points without specifying where. After the first essay grades were released, the TAs declared no form of regrade request but provided them on an individual basis for students that complained.\n\nBoth essays are purely tedious the first having a 5-10 page requirement and the team essay have a requirement of 10-30 pages. The assignment requirements are succinct and vague, leading me to believe this is the equivalent of a creative writing course. I spoke with multiple other students who voiced similar concerns that there was not enough to write about since the requirements were so short so they were forced to include unnecessary details to hit the page requirement.\n\nAt the end of the course, they give a pretty significant curve to the extent that I believe very few students received a ‘C’ if any at all. I was given an arbitrarily lower grade on my first essay and with no regrade requests, I thought my chance at an ‘A’ was over but the curve pushed me up to one. Perhaps this is the experience that the teaching staff are trying to give to make it seem like a legitimate course - vague requirements, arbitrarily lowered grades, then a curve at the end to reassure students. Absolutely silly course that is simply busywork. Do not take it if you don’t have to. ",
                        "rating": 1,
                        "workload": 5,
                        "_updatedAt": "2023-05-11T03:52:15Z",
                        "_type": "review",
                        "_id": "AnVLGnCOep77YjL1szsSkG",
                        "_createdAt": "2023-05-11T03:52:15Z",
                        "course": null,
                        "authorId": "okT3XmTMhiVBuQGw0UfeAw==",
                        "difficulty": 2,
                        "id": "AnVLGnCOep77YjL1szsSkG",
                        "created": "2023-05-11T03:52:15Z",
                        "_rev": "AnVLGnCOep77YjL1szsSjP"
                    },
                    {
                        "_type": "review",
                        "created": "2023-05-04T04:17:02Z",
                        "body": "When your assignment is handed over to certain TAs, you are likely to receive a grade of B. This indicates that the course has been deliberately made more challenging by employing an unjust grading system, instead of focusing on improving the overall quality of the course.",
                        "_createdAt": "2023-05-04T04:17:02Z",
                        "rating": 1,
                        "id": "T0iuRlPz5judcr8VP9CsOI",
                        "authorId": "gyJBJ9Du6PgQZn7M7Nn2tA==",
                        "_updatedAt": "2023-05-04T04:17:02Z",
                        "difficulty": 5,
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "_id": "T0iuRlPz5judcr8VP9CsOI",
                        "_rev": "T0iuRlPz5judcr8VP9CsM0"
                    },
                    {
                        "_rev": "Ldi4P7GPT7eW6bdVk8k8Yg",
                        "rating": 1,
                        "authorId": "dkGbJ/23fOo1dX+pe6J8Qg==",
                        "_updatedAt": "2023-03-26T11:40:20Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "_id": "Ldi4P7GPT7eW6bdVk8k8Zl",
                        "created": "2023-03-26T11:40:20Z",
                        "_createdAt": "2023-03-26T11:40:20Z",
                        "course": null,
                        "body": "Easy class, but this is by far the worst class I've taken. The TAs are actually idiots and give deductions on grades without any explanation. Instructions for assignments are vague and the head TA is a hard grader for absolutely no reason. This class is definitely a low time commitment easy B and your chances for an A are random and at the mercy of the TA who grades you. This is my 8th course in the program and is by far the worst one I have taken.",
                        "difficulty": 1,
                        "workload": 3,
                        "id": "Ldi4P7GPT7eW6bdVk8k8Zl"
                    },
                    {
                        "workload": 2,
                        "course": null,
                        "_id": "I85e2pBlQ8Ku7mLFcYXoXY",
                        "body": "A very easy and low time commitment course. Easy to pair with other courses. \nOnly issue is the grading which completely depends on the TA. You would never understand why you got the deduction. I felt that grading was done to maintain the curve and I was the unfortunate  one to fall on the B grade level. This was my 9th course and never I have felt that marks deductions were not fair. Easy A if you do not fall under the head TA for grading. ",
                        "difficulty": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16"
                        },
                        "authorId": "YgSnZT0z8NbBCDO6xbz7bA==",
                        "created": "2022-08-17T02:06:28Z",
                        "_createdAt": "2022-08-17T02:06:28Z",
                        "_type": "review",
                        "_updatedAt": "2022-08-17T02:06:28Z",
                        "_rev": "I85e2pBlQ8Ku7mLFcYXoV7",
                        "id": "I85e2pBlQ8Ku7mLFcYXoXY",
                        "rating": 2
                    },
                    {
                        "_rev": "6nnaIduCkMaE6dpBOxMMHG",
                        "course": null,
                        "created": "2022-08-06T17:34:46Z",
                        "_type": "review",
                        "rating": 1,
                        "workload": 10,
                        "authorId": "/l/ztNjpTqS8kbDNvS8jgA==",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16"
                        },
                        "_id": "6nnaIduCkMaE6dpBOxMMKU",
                        "difficulty": 1,
                        "body": "Should have been fairly straightforward, but the head TA is super nitpicky and makes the whole experience fairly bad. Grades take forever to be released so you never really know where you stand.  So much busy work with no value. Given the opportunity again I would have not take this class. ",
                        "_updatedAt": "2022-08-06T17:34:46Z",
                        "id": "6nnaIduCkMaE6dpBOxMMKU",
                        "_createdAt": "2022-08-06T17:34:46Z"
                    },
                    {
                        "created": "2022-04-29T14:07:50Z",
                        "_createdAt": "2022-04-29T14:07:50Z",
                        "workload": 3,
                        "_id": "external-import-d09eb92e-63eb-4d3e-b10c-30c28a481efe",
                        "body": "You'll learn a little from this course if you're new to the area. You'll get an opportunity to learn a little R or Python, but there is no deep dive into anything. There are regular graded discussions which may take 30 minutes to think through the question and provide your thoughts on it.  No exams, only weekly quizes on the lectures. There is a group project. If you get a good group (I did) then it should be pretty easy. If you don't, I think its completely possible to do on your own if you have a bad group, you have some analytics programming experience and capable of writing a detailed paper.  Makes a good class to pair with a harder one.",
                        "id": "external-import-d09eb92e-63eb-4d3e-b10c-30c28a481efe",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review"
                    },
                    {
                        "id": "external-import-b381778e-e75e-41a1-9337-a10a4342f43e",
                        "created": "2022-04-26T12:50:36Z",
                        "_createdAt": "2022-04-26T12:50:36Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "_id": "external-import-b381778e-e75e-41a1-9337-a10a4342f43e",
                        "difficulty": 1,
                        "workload": 1,
                        "rating": 3,
                        "body": "I am in OMSCS and I took this course my last semester along with GA. When this class was first added to the list of available courses, I thought \"oh this sounds interesting\", but by the time I actually registered, I knew exactly what I was doing...I needed an easy class to pair with GA. I almost didn't take this, as it required a group project, but luckily I got a good group and we only needed to schedule meetings the last month or so of the class. And my groupmates were great! As this was my last semester, I didn't learn anything new, but modules open up enough in advance that you can work ahead if desired. The group project was totally open ended so there is potential to make it interesting, but we went for straight forward and easy. Professor is great and really involved, so if you take the initiative, you can learn from and interact with him a lot (so I hear), which is unusual for OMSCS. But after taking this class, I totally understand why we are only allowed 2 non-CS classes to count for the CS degree!",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "id": "external-import-114f5d51-e03c-4fd9-bbda-ccebe0977c08",
                        "created": "2021-12-29T17:29:19Z",
                        "rating": 4,
                        "workload": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 1,
                        "_createdAt": "2021-12-29T17:29:19Z",
                        "_id": "external-import-114f5d51-e03c-4fd9-bbda-ccebe0977c08",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "body": "This was a very easy class. I had it paired with AIES and didn't even need to put any effort except for the ENRON final project.\n\nThe class discussions were easy write ups. The quizzes were easy Ctrl + F from the lecture materials. The coding assignments were pretty easy, just changing some parameters and inputs to demonstrate the understanding of the code. I wish the lectures had done a better job of explaining the regression models. This was never explained in detail, but it appeared to be significant in data analysis.\n\nThe TAs and professor held weekly office hours which was very helpful in getting the direction while working on the ENRON project. This semester there was a new project introduced for extra credit. I didn't need to do that because i was easily sitting in 90+ range.\n\n"
                    },
                    {
                        "body": "This class was OK. No disrespect to the professor but the lectures need to be reworked. They are all over the place and make no sense sometimes. The project is also ok, but watch out for students who have no coding experience in your team as there seem to be alot here. ",
                        "created": "2021-12-17T04:38:21Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "difficulty": 1,
                        "_createdAt": "2021-12-17T04:38:21Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 3,
                        "id": "external-import-5d4d9e8e-96e8-4a11-80aa-928837917d0f",
                        "course": null,
                        "_id": "external-import-5d4d9e8e-96e8-4a11-80aa-928837917d0f"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 2,
                        "workload": 3,
                        "id": "external-import-4c20cf01-4efc-4c0d-9cc1-0534f5f2a1b2",
                        "created": "2021-12-14T03:07:31Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-4c20cf01-4efc-4c0d-9cc1-0534f5f2a1b2",
                        "body": "Class overall was light and is good to pair with another higher workload class. It consists of weekly lectures, quizzes, and sometimes simple programming assignments (R / Python). The crux of the class was the final project, which has you conduct an investigation on a large email corpus. This final project is a group project, and your experience may heavily vary depending on who you group up with. The grading of your project deliverables in this class highly depends on your TA, and is a total hit or miss - I've observed a few that were extremely low quality and I question how they got hired in the first place, and this is what ultimately swayed my rating of this class.\n\nAll that said, I recommend taking this class if you need a lighter workload semester. For purely educational value, the material felt superficial, and I suggest looking elsewhere if you're seeking a class that is more technically deep.",
                        "difficulty": 2,
                        "_createdAt": "2021-12-14T03:07:31Z"
                    },
                    {
                        "id": "external-import-6e3d4491-76e3-4075-8c25-ff27826b17f4",
                        "body": "I actually liked this class and the lectures. The professor was great and the pace of the class is reasonable. I learned a lot and it is rare for the prof to be involved.\n\nTAs did a decent job; however, It does depend on the TA you get though, i wish there was a way to reduce TA bias and that TAs should be aware of their grading. Other than that keep it up",
                        "_createdAt": "2021-12-06T20:08:12Z",
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-12-06T20:08:12Z",
                        "_id": "external-import-6e3d4491-76e3-4075-8c25-ff27826b17f4",
                        "difficulty": 3,
                        "course": null,
                        "workload": 10
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "body": "I’m an OMSCS student (for context). I’m about to finish this course and the best way I can sum it up is that I’m not really sure what this course focuses on as its main element and what I’ve learned. It touches on a lot of data related topics but doesn’t go into much detail on any of them. I took it as a second course this semester, but wish I had taken Digital Marketing or another non-CS course. It’s easy to get a good grade, but a waste of the tuition money tbh.\n\nPros:\n\n- Jeff (the professor) is great. He’s involved on Piazza, runs office hours regularly and is very active.\n- I have never looked at R before so this course provided me with a (very) light introduction\n- The team project - while easy - could be tackled in a number of different ways. You could try out some cool stuff around NLP and suchlike there. Also you could do it by yourself if you had to.\n\nCons:\n\n- Course quiz’s and assignments are very easy for individuals with basic programming skills\n- The course did not go into much detail on anything - I didn’t really learn anything\n- The security element is very small IMO, please don’t take this if you want to dive deep into infosec side of data analytics\n- My team for the team project was great, but as always it’s who you end up with\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "_createdAt": "2021-12-05T22:21:06Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 2,
                        "workload": 4,
                        "id": "external-import-7d8b2870-83cb-4928-9b35-7ad0cc142724",
                        "created": "2021-12-05T22:21:06Z",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-7d8b2870-83cb-4928-9b35-7ad0cc142724"
                    },
                    {
                        "created": "2021-12-03T03:23:22Z",
                        "_createdAt": "2021-12-03T03:23:22Z",
                        "workload": 5,
                        "body": "Horseshit class full of only lazy trash students who look for the easiest way out of everything - myself included.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-826dab65-6383-4bc6-87d1-1314d688d4a2",
                        "id": "external-import-826dab65-6383-4bc6-87d1-1314d688d4a2",
                        "difficulty": 1,
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "id": "external-import-9cfadc71-96e5-4388-abc7-1e6776291f50",
                        "created": "2021-11-21T03:00:34Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "Easy course but lots of pointless busy work and your grades largely depend on what TA you get assigned. You learn a little bit about some interesting topics but the lecture quality is pretty low ",
                        "_createdAt": "2021-11-21T03:00:34Z",
                        "_type": "review",
                        "rating": 2,
                        "_id": "external-import-9cfadc71-96e5-4388-abc7-1e6776291f50",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "course": null,
                        "workload": 3
                    },
                    {
                        "course": null,
                        "body": "The course was pretty easy. The professor was awesome! He was very active in the discussion boards, and he really knows his stuff. He was available every week for live office hours. I don't know any professor in the OMSCS program who commits that sort of time. The only downside is that there's a bit of luck on who grades your assignments. The proposal was a huge part of the grade. After the TA graded my proposal, it took me down to 91-92%, and therefore pretty much meant I had to get an A on the final project to get an A in the course. The quizzes are pretty easy. There's only one trick question per quiz, so you'll end up either getting a 100 on the quiz or just one wrong. Everything else is Ctrl-F from the PowerPoints. There is a wealth of information presented in the course, and the content will be a very good reference for practitioners.\nI'm kind of disappointed that many here gave 'Strongly dislike', y'all shouldn't rate the course based on the unfair grading from the TA's. Btw, completed the course with an A.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-7bfd4f96-d4cb-4a35-b505-4757024a3953",
                        "rating": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2"
                        },
                        "_id": "external-import-7bfd4f96-d4cb-4a35-b505-4757024a3953",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 1,
                        "created": "2021-08-10T01:46:11Z",
                        "_type": "review",
                        "workload": 5,
                        "_createdAt": "2021-08-10T01:46:11Z"
                    },
                    {
                        "rating": 3,
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "_id": "external-import-8ef6f738-2deb-4a81-a9ea-cc4b0c2cdd97",
                        "created": "2021-08-01T00:12:44Z",
                        "_type": "review",
                        "_createdAt": "2021-08-01T00:12:44Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 2,
                        "id": "external-import-8ef6f738-2deb-4a81-a9ea-cc4b0c2cdd97",
                        "course": null,
                        "body": "The quizzes and discussions are straightforward and easy to get full points. The R and Python exercises had no defined deliverable outside of \"make changes and document what you did\" so the grading for those, and the project papers, seemed arbitrary despite being generous. While I'm pretty sure I'll end up with an A, the class just made me feel a bit uneasy all semester because I never felt like I understood what they were expecting as the rubrics were vague to the point of uselessness. The example given for the final paper, which was written by someone who really, really got into it, he said it would get about a 95 which made me laugh a bit because I know my group didn't have that same passion about it. \n\nBetween the first paper and the final paper (they tie together) there was a great deal of granular data analytics that felt like it could have been left at a higher level with the same end result. \n\nThe professor was passionate about the topics and the material itself was interesting. I wouldn't have taken it if there were other offerings but I don't regret it. Made for a relatively stress-free summer."
                    },
                    {
                        "workload": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_id": "external-import-fdfd32ee-b8eb-4db8-8ff5-34f155bf5789",
                        "body": "Low quality, non-technical course. Most of the assignments are busywork. Quizzes are just an exercise in looking through slides for the answer - they don't help you learn anything. Expect to get ~1 question wrong per quiz because of 1-2 trick questions that aren't clearly answered by slides or lectures (basically for artificial difficulty). Terrible design. Not even worth the hassle of trying to ask for points back. Discussions are so trivial to your grade, you might as well do none of them because you can still easily get an A. R / Python exercises had very vague and unclear instructions, and the professor had us change the format of our submissions literally a day before the deadline.\n\nMy TA grader has graded my papers and discussions arbitrarily - had points deducted just because the TA felt like it I guess. No clear explanation provided as her comments felt like nitpicking for sake of nitpicking. I felt I put forth honest efforts in all of these assignments. Note that these discussions are worth 0.25% of your overall grade each, so they are completely trivial. Either way, I welcome the deductions because they're worth the comedic value - hilarious to think that this TA wastes that much time with these nits for 15 bucks an hour. Great job! In other courses with discussion / essay components, I've never lost points due to this sort of nonsense.\n\nGroup project is shaping up to be a pain (hint: it's just more busywork in the form of a 10 - 30 page group paper and a presentation). If you want an easy course where you'll actually learn something, try digital marketing. No problem with the graders there and no pointless group project.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "id": "external-import-fdfd32ee-b8eb-4db8-8ff5-34f155bf5789",
                        "created": "2021-06-22T18:32:48Z",
                        "_createdAt": "2021-06-22T18:32:48Z",
                        "_type": "review",
                        "difficulty": 1,
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2021-05-16T22:53:37Z",
                        "created": "2021-05-16T22:53:37Z",
                        "workload": 3,
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "rating": 2,
                        "_id": "external-import-fc88f249-8e49-4aea-9bef-96c1739eb005",
                        "id": "external-import-fc88f249-8e49-4aea-9bef-96c1739eb005",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "body": "This was a weird class, especially as something that's considered an elective for the OMS cybersecurity program. The class has the word \"security\" in it, but it has nothing to do with cybersecurity. I took this class because I didn't really have other options due to the severely limited elective offerings in the policy track. \n\nThe class touches on data science topics but never actually teaches you them, nor does it expect you to actually learn or apply them. \n\nHalf of your grade is based on discussions and open book quizzes that you can get 100% on using CTRL + F. The other half of your grade is based on a group project, so your experience and grade will vary on your group. \n\nMy group was a major pain in the ass, so that negatively impacted my experience in the class. I also feel like I didn't really learn anything. \n\nI paired this with another class and it was an easy A, so at least that's something. "
                    },
                    {
                        "course": null,
                        "_createdAt": "2021-05-15T16:58:27Z",
                        "_type": "review",
                        "rating": 3,
                        "created": "2021-05-15T16:58:27Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "body": "This class is very straightforward. Quizzes are straight from the slides, and the assignments are mainly just about putting in the effort. There are a few R exercises which just require altering some provided code and writing a short summary of your changes. Discussions are also mainly effort based. \n\nThe main deliverable in this class is a group project which involves a paper and presentation. Overall, it's pretty simple and grading is lenient. This is a great class to double up with another class. ",
                        "difficulty": 1,
                        "_id": "external-import-2d68e11e-aae2-47f1-81eb-4e2e31843337",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-2d68e11e-aae2-47f1-81eb-4e2e31843337",
                        "workload": 2
                    },
                    {
                        "created": "2021-05-11T05:59:46Z",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "course": null,
                        "body": "The course was very easy. Quizzes are straight from the slide. The assignments are straightforward and you get good marks even if you run the assignments and share the output. To get full marks, you have to make some changes (which could be any) and explain them.\nProject is simple, you just require a good team to work. Professor is nice and holds regular office hours and so does the TAs.\n\nYou may not end up learning much, but it's a good course to double up with another difficult course.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "_createdAt": "2021-05-11T05:59:46Z",
                        "id": "external-import-bbe2a447-deee-42a2-a71e-a2ed0964d09e",
                        "_id": "external-import-bbe2a447-deee-42a2-a71e-a2ed0964d09e",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "rating": 3,
                        "workload": 3
                    },
                    {
                        "id": "external-import-8ee73c52-250d-429d-b3b5-b50261f03bb4",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "body": "Its a good course and workload is on the lighter side. \n\nLectures are great, instructor is amazing and very supportive. Discussion are good and keep you interested in the content. There are also python and R exercises for you start learning it and not very complex.\n\nThere is an individual paper and a group project which takes majority of the time in the course. If you get a decent group and work at a good pace you should sail smooth in the whole course. Group project is in the second half of the semester. \n\nWatching lectures and participating in discussions should take 2-3 hours per week. Group project took more time for me though hence I have put higher time than rest of other reviews.\n\nOverall recommended.",
                        "workload": 6,
                        "rating": 4,
                        "course": null,
                        "created": "2021-05-10T02:24:36Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_id": "external-import-8ee73c52-250d-429d-b3b5-b50261f03bb4",
                        "_createdAt": "2021-05-10T02:24:36Z",
                        "_type": "review"
                    },
                    {
                        "workload": 2,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "id": "external-import-7c0745b5-032f-4fdb-aa99-8f4d496a1279",
                        "body": "It's a pretty easy class. Everything is graded fairly easy and should be an easy A. The quizzes are straight from the slides and it should be maybe 30 minutes to an hour on the weekly lecture assignments. The project can take a bit of time later on, but if you have a good group, then it will work out very well.  ",
                        "_createdAt": "2021-04-28T16:54:39Z",
                        "rating": 4,
                        "_id": "external-import-7c0745b5-032f-4fdb-aa99-8f4d496a1279",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-04-28T16:54:39Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null
                    },
                    {
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_id": "external-import-67f7c165-0ac9-4883-a1da-52f49f9c0dc7",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 3,
                        "body": "This is a very easy class that would be good to pair with a more difficult one. Overall, I spent about 2-3 hours every other week on it. \n\nThe lectures are generally released on a weekly basis and you have a week or two to complete the homework. Every lecture module comes with an open note quiz. The quiz questions are taken directly from the slides, and honestly you could just use ctrl + f instead of watching the lectures all together. There are a total of 12 discussion posts which are fairly light and usually ask your opinion or understanding of a certain subject. Honestly I found this to be be the most challenging part of the class - I'm a programmer, I'm not used to writing about my opinions and feelings! There are also 5 mini programming assignments (1 in python and 4 in R). Calling them assignments is kind of a stretch. As long as you can run the code successfully and make minor changes to it (I'm talking real minor - liking changing parameter values kind of minor) then you'll do fine. The class is offered to students from the cybersecurity program and because some of them have no programming experience they really hold your hand through all the programming required in the class. The major deliverable for this class is the course project. The project is fairly straightforward and is done in groups. The best part of the class is that there is no tests to study for!\n\nI'm not sure I'm learning that much from the class though. The lectures give a super high level overview of big data and data analytics, and I doubt I would be able to understand it all without taking previous classes on the subject. However, the TAs and office hours are super helpful if there's a topic you don't understand. Also, if you don't understand something and are too lazy to do anything about it, that's cool too. The quizzes are open notes and the coding assignments and course project have very little to do with the details of the lectures. The course is really what you make of it. If your taking two classes and your goal is to put in the minimal amount of effort required to get an A, that's okay but you might walk away without learning that much.\n\nOverall the class is great if your looking for a light course load. Having previous experience with python and R is a plus, but you could definitely come in knowing nothing about computers or statistics and you'll do just fine. \n\nGood luck! ",
                        "id": "external-import-67f7c165-0ac9-4883-a1da-52f49f9c0dc7",
                        "difficulty": 1,
                        "_createdAt": "2021-04-01T15:33:27Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 2,
                        "_type": "review",
                        "course": null,
                        "created": "2021-04-01T15:33:27Z"
                    },
                    {
                        "id": "external-import-f942eeac-3206-439a-90c5-0466a6bc9cff",
                        "course": null,
                        "body": "Overall, the class was very easy. There weren't a ton of projects and the grading was very lenient. As long as you attempt the work, then you will likely get an A on the assignment.\n\nThe content is essentially just an overview of various analytical methods and tools. You don't dive into the tools or techniques much or even have to implement them on your own. I really hoped that there was more content directly related to data analytics for security, but this was an easy A.",
                        "difficulty": 1,
                        "_type": "review",
                        "rating": 3,
                        "workload": 1,
                        "created": "2021-01-11T13:17:10Z",
                        "_createdAt": "2021-01-11T13:17:10Z",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "_id": "external-import-f942eeac-3206-439a-90c5-0466a6bc9cff",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "created": "2020-11-18T05:04:04Z",
                        "_createdAt": "2020-11-18T05:04:04Z",
                        "rating": 5,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "body": "This class is the easiest class on the OMS Cyber - Policy track. The grading is also leniently done. Easy A",
                        "id": "external-import-24f05733-ea2c-47c8-95a4-2871d06273ec",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "difficulty": 1,
                        "course": null,
                        "workload": 3,
                        "_id": "external-import-24f05733-ea2c-47c8-95a4-2871d06273ec"
                    }
                ],
                "_updatedAt": "2022-08-25T05:36:16Z",
                "tags": [],
                "creditHours": 3,
                "_type": "course",
                "isFoundational": false,
                "_id": "external-import-INTA-6450",
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/27b3f216ee92dda6895beec37dff9efe788ca9a7.pdf",
                "created": "2022-07-05T23:23:15Z",
                "_createdAt": "2022-07-05T23:23:15Z",
                "codes": [
                    "INTA-6450"
                ],
                "isDeprecated": false,
                "slug": "data-analytics-and-security",
                "id": "external-import-INTA-6450",
                "syllabus": {
                    "file": {
                        "_type": "file",
                        "asset": {
                            "_ref": "file-27b3f216ee92dda6895beec37dff9efe788ca9a7-pdf",
                            "_type": "reference"
                        }
                    }
                },
                "programs": [
                    {
                        "acronym": "CS"
                    }
                ],
                "description": "Explores use of big data techniques to problems at the national and international levels. Topics may include cybersecurity, surveillance, economic development, behavioral prediction and manipulation.",
                "rating": 2.4375,
                "difficulty": 1.53125,
                "workload": 4.625
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "data-analytics-and-security"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}