{
    "props": {
        "pageProps": {
            "course": {
                "created": "2022-07-05T23:23:15Z",
                "_id": "external-import-ISYE-6650",
                "programs": [
                    {
                        "acronym": "AN"
                    }
                ],
                "_type": "course",
                "syllabusUrl": null,
                "id": "external-import-ISYE-6650",
                "description": "An introduction to basic stochastic processes such as Poisson and Markov processes and their applications in areas such as inventory, reliability, and queueing.",
                "tags": [],
                "reviews": [
                    {
                        "course": null,
                        "_id": "EMDrCE8zqCAoxcS5bZqdgO",
                        "authorId": "3n38FtPyaXCdXuEjPpK21w==",
                        "body": "For some context, this was my 8th class in the course, I have an engineering background, and I made an A in the class. I had exempted one class and used this as my free elective. The class challenged me more than I expected and I feel that it did a good job of helping me really learn some stats concepts where I was weak. I took Simulation before this class, and I feel that helped me. The professor and TA's were very helpful and engaged in the online discussion boards. The professor provides a pdf book that I used quite a bit. I would not buy the recommended text; just use her book instead. ",
                        "difficulty": 4,
                        "semester": {
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester"
                        },
                        "_createdAt": "2023-12-18T21:31:01Z",
                        "_rev": "EMDrCE8zqCAoxcS5bZqder",
                        "_updatedAt": "2023-12-18T21:31:01Z",
                        "workload": 10,
                        "created": "2023-12-18T21:31:01Z",
                        "rating": 4,
                        "_type": "review",
                        "id": "EMDrCE8zqCAoxcS5bZqdgO"
                    },
                    {
                        "_rev": "j07GwiPkUVDQQ5A5oG1TbA",
                        "course": null,
                        "body": "I liked this course and I agree materially with the other five-star reviews to date. \n\nThis is a great course for what it is, namely, a challenging, math-heavy, pen-and-paper course in applied probability. \n\nYou'll want to be comfortable with calculus before you start. Linear algebra is also necessary but used but more sparingly. Probability is reviewed during the first half of the class, but the review is thorough and moves very quickly.  The less you need to re-learn the fundamentals during the course, the better off you'll be. \n\nI thought that the professor and TAs did an excellent job. Lectures are clear and topical and the problem sets are well thought-out. You can tell that Prof. Kim has put a lot of work into this course and wants her students to get a lot out of it. She is also unusually accessible for this program. \n\nOne point that others haven't made: the class puts significant weight on the process the student uses to reach the answer. This means that you need to upload your scratch work immediately after every quiz and exam, meaning that you need to take your quizzes and exams near a scanner (or find some other way to upload them quickly). This is important, and they are inflexible on this point; in many cases you will receive no credit for a *correct* answer if support is not provided. So, make sure you upload those notes!\n\n",
                        "created": "2023-12-17T02:36:21Z",
                        "rating": 5,
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "workload": 12,
                        "_id": "j07GwiPkUVDQQ5A5oG1Tcw",
                        "_updatedAt": "2023-12-17T02:36:21Z",
                        "id": "j07GwiPkUVDQQ5A5oG1Tcw",
                        "_type": "review",
                        "difficulty": 4,
                        "_createdAt": "2023-12-17T02:36:21Z",
                        "authorId": "/hCx8RYQosZA5ql4RDGsUg=="
                    },
                    {
                        "difficulty": 3,
                        "course": null,
                        "workload": 10,
                        "_id": "EMDrCE8zqCAoxcS5bM8qun",
                        "body": "This class is not as bad as some review indicated below, and it's mostly a math class instead of coding (only very little python code for maybe 3 homework). My background: 5th class in OMSA, engineering background, and working FT in early 30. \n\nSince it's the first semester that this class is offered online, I could definitely feel everyone (professor and TAs) are still learning how to run an online class, and there are some issues here and there. For example, duration (and maybe difficulty) of MT1 was probably too short. As someone who normally finishes exam with plenty of time to spare, I finished the exam right on time with no time to go back and check answers. This caused many students to have \"bad\" grade (avg is like 68) and presumably dropped out, but the grading is changed so that you can come back from completely failing midterm 1 and the duration and difficulty of MT2 and final were much more friendly. Good number of practice problems were also provided for MT2 and final. \n\nWeekly knowledge check is only worth 5% but it requires Honorlock which is kind of annoying but not the end of the world. You can normally get close to full points on those. \n\nHomework (15%) is weekly except for exam weeks and you get 2 drops. You definitely need to spend some extra time on googling or watching office hour video to get an idea about how to tackle some of the problems. The grading of hw is weird (selected problems graded and others graded on completion only) but I don't have a feeling towards it. The grading is definitely on the more generous side, so scoring close to full point on hw really isn't too difficult either. \n\nContent-wise, it's math heavy but doable with my engineering background. I can also tell that professor Kim is passionate about the content and want us to succeed. Communication from TA is ok in that you can get your questions answered but it may take a few days. \n\nOverall, I enjoyed the class because the content is interesting, class is challenging, and I really learned a lot. ",
                        "created": "2023-12-14T18:49:16Z",
                        "_createdAt": "2023-12-14T18:49:16Z",
                        "rating": 5,
                        "authorId": "UedSscwS0cBt+8Ro8Zfayw==",
                        "id": "EMDrCE8zqCAoxcS5bM8qun",
                        "_updatedAt": "2023-12-14T18:49:16Z",
                        "_rev": "EMDrCE8zqCAoxcS5bM8qtG",
                        "_type": "review",
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        }
                    },
                    {
                        "course": null,
                        "id": "EMDrCE8zqCAoxcS5bLYtTn",
                        "_updatedAt": "2023-12-14T15:21:13Z",
                        "difficulty": 5,
                        "_id": "EMDrCE8zqCAoxcS5bLYtTn",
                        "rating": 2,
                        "_type": "review",
                        "_createdAt": "2023-12-14T15:21:13Z",
                        "workload": 12,
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "_rev": "EMDrCE8zqCAoxcS5bLYtSG",
                        "created": "2023-12-14T15:21:13Z",
                        "authorId": "xR90pnS407p85EyVN1STcQ==",
                        "body": "As many people are stating below, I've never written a review before, but I wanted to present my final thoughts and some constructive feedback on the course. Overall, the course material is interesting. The instructor and TAs are very helpful, understanding, and really tried their best to adjust things that were unfair or weren't working well during the course. This is the first time this course has been implemented in an online setting apparently, so there were a TON of growing pains to work out.  I think EVENTUALLY this course will be great, but we were the guinea pigs, and I'm hoping the grading will reflect that. This course is HARD. I've taken a lot of courses in my life, and I have always considered myself to be great at math, but this course just killed me.  The general format of the class is weekly Knowledge Checks based off lecture modules that are proctored. They are 5 questions, generally simple, but you will will need to show your work on scratch paper and upload as a pdf after the proctored quiz is over. You normally get 2 attempts to answer. In total, the weekly Knowledge Checks account for only 5% of your total grade. One of the Knowledge Checks was a bonus, and if you do it you will most likely get a the whole 5% for this section. My feedback on this part of the course is that these quizzes are helpful, but for the amount of time and energy it takes to do them, the percentage is too low. There were also a lot of times an answer could be marked wrong simply because of rounding to a certain number of digits in your answer although they would go back and correct them. In my opinion, these should not be proctored. This should just be an open book, open internet, reinforcement of your learning to truly commit the subject to memory for the sake of the student. I would make the quizzes with unlimited attempts, with no \"show your work\" examples, with more theoretical questions, non-proctored, and the credit is basically just an incentive for completing the modules. Now for homework. Overall, there is weekly homework for this course worth 15% of your total grade and you should absolutely go to or watch all office hours.  They are extremely helpful and a must if you are struggling with the material.  The criticism of this part of the course is that the gap from lectures to homework is VERY WIDE. I always felt like I understood the lectures, but the homework was overwhelming. It just didn't feel like there was a pathway to even understand where to start on a lot of questions. I know for me, the notation and structure of probability math was really hard to learn. I often was overwhelmed simply with understanding the notation of the problem or what was being asked. I am an older, working professional student who hasn't done this type of probability before. I eventually picked most of it up by the end, but it is easy to see a problem and just lose hope, because you don't understand. There needs to be some material to mimic or learn from to help with homework, but I also think a live discussion where the material can be broken down into its smallest parts is needed.  Yes there are office hours, but I still think one live session a week with either the professor or TA to go through examples SIMILAR to homework is needed, basically an extension of the lecture material. Students need to understand the map of decision making to be successful, and I never felt like I understood all the exceptions or things to consider in final answers. I also think homework should be worth way more. This class is exam HEAVY.  There are 3 exams which will be worth 80% of your total grade. This class should focus way more on the individual homework side where learning really takes place.  CSE6040 does a really good job at this. They make homework worth 50% and exams are 50%. They also weigh the exams for the learning curve. CSE6040's exam 1 is weighted 10%, exam 2 is weighted 15% and the final is 25%. So if you bomb the first couple while you are learning, it weighs your final knowledge more without KILLING your overall grade.  It's the perfect grading weight if you ask me. This class really needs to be like that, because the first exam will kill your self-esteem unless they improve the prep material before hand. Exam 1 had a class average score of like 57% or something before manual regrading took place. I think almost half the class dropped by the end.  The exams are mostly fair, but I also think they expect people to be faster. I get that there are people who can finish these types of exams quickly, but there are two demographics in these courses. Active students who are very familiar and close to the material since they have been in school recently and the rest of us that are older and have been out of school for potentially a decade or more.  I constantly felt like I probably needed at least 1 more hour for every exam (at least). I'm not sure why they can't extend the time. I often received low scores, because I never even got to certain questions. Also, I think all exams should move to open book/open internet in every course. The reality is we will have access to those things in the real world. Make the questions more theoretical or harder, but give us access to the real-world tools we will always have when attempting to do this work where it actually matters. I think it is an old-school mindset not to allow it. Open internet is just a modern-day version of a super calculator.  Lastly, I liked the content of this course. I wish I felt like there were more concrete steps to help you learn the material and answer these questions in a real-world scenario. I also felt a bit misled because I thought it was going to be a coding course. There is basically no coding at all. It's just a difficult probability math course."
                    },
                    {
                        "authorId": "CEIGYVyIqPsZQIhIgvrwmQ==",
                        "_updatedAt": "2023-11-06T16:44:26Z",
                        "course": null,
                        "_rev": "WLNGeF4BdCdV5CELX67off",
                        "id": "WLNGeF4BdCdV5CELX67oiJ",
                        "created": "2023-11-06T16:44:26Z",
                        "body": "**Seriously not for the faint-hearted**\n\nI love this course because it really drills you though the theories in Probability. But as I said it's not for the faint hearted because many of OMSA students are seriously never prepared for such mathematical maturity in life. \n\nIn Piazza students are actively complaining there's a distinct gap between lectures and test materials. Any Math undergraduate from a Top 20 University will tell you that's life, deal with it. \n\nIf you, for a moment of a second, think your Statistics is not up to scratch, please strongly consider ISYE 6644 Simulation as your Operations Elective course. No one will fault you for that. ",
                        "_id": "WLNGeF4BdCdV5CELX67oiJ",
                        "workload": 16,
                        "difficulty": 3,
                        "semester": {
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "_createdAt": "2023-11-06T16:44:26Z",
                        "rating": 5
                    },
                    {
                        "difficulty": 5,
                        "rating": 2,
                        "workload": 15,
                        "_createdAt": "2023-10-26T17:13:00Z",
                        "authorId": "teAPUehvjC9+FFt+o3TpXA==",
                        "body": "I agree with the other reviewers thus far that this course has a large gap between the material covered in lectures vs. the material covered in the homework/on exams. It is relatively easy to follow along with the examples in lectures and to understand how the applications of the formulas work, however in the homework assignments what is expected of you to know how to answer the questions seems like a much higher standard of material. The homework takes me an average of 6-8 hours each week, sometimes more depending on the questions. The first exam was difficult - not impossibly so, but we were only given 90 minutes to complete the exam, so a lot of people had to leave questions entirely blank which ended up resulting in a class average score of 60.  The professor mentioned there would be a curve at the end of the semester, but so far this class is probably my worst performance in the OMSA program, and this is my 7th course.",
                        "_type": "review",
                        "id": "cRpbhZI131SCxVbpuvbByG",
                        "created": "2023-10-26T17:13:00Z",
                        "course": null,
                        "_id": "cRpbhZI131SCxVbpuvbByG",
                        "_rev": "cRpbhZI131SCxVbpuvbBuc",
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "_updatedAt": "2023-10-26T17:13:00Z"
                    },
                    {
                        "_rev": "1iGxZpbv2uESlZ562C6XbI",
                        "_createdAt": "2023-10-23T02:20:31Z",
                        "_type": "review",
                        "created": "2023-10-23T02:20:31Z",
                        "workload": 15,
                        "authorId": "D2x+aCsqhJBwgUXFFOtnpA==",
                        "body": "I've never written a review before but I had to for this class. This is my final course in the program and I am so disappointed I chose it. The gap between lectures and homework/tests is MASSIVE. While watching the videos, it appears as though you understand what is going on (sometimes, honestly) but then the homeworks seem completely different.\n\nThe class average for the midterm was less than 60 and no one received a perfect score. There are weekly, time-consuming homeworks and quizzes. I'm going to stick with it only because I'm ready to graduate already but my goodness...",
                        "rating": 1,
                        "course": null,
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "id": "1iGxZpbv2uESlZ562C6XcH",
                        "difficulty": 5,
                        "_id": "1iGxZpbv2uESlZ562C6XcH",
                        "_updatedAt": "2023-10-23T02:20:31Z"
                    },
                    {
                        "id": "CQAQv69BQKYgSKj0dFdkfO",
                        "_rev": "CQAQv69BQKYgSKj0dFdkc3",
                        "_updatedAt": "2023-10-17T13:54:15Z",
                        "body": "The course is crazy. This is my last course in OMSA and I think I had to drop it to save my GPA. The midterm average is under 60s. The assignment is marked on completion not correctness, you know why? The assignment is crazily long and hard, and weekly. The sample exam only covers partial chapters. Each quiz is monitored and I had to lose several quizs due to travelling since my only computer laptop cannot install the software and my destop cannot be travelling with me. \n\nThe content is interesting but the assignment and exams are so hard. I would not recommend this for any one who did not have strong stat and math background. ",
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "created": "2023-10-17T13:54:15Z",
                        "difficulty": 5,
                        "course": null,
                        "_id": "CQAQv69BQKYgSKj0dFdkfO",
                        "_createdAt": "2023-10-17T13:54:15Z",
                        "rating": 1,
                        "workload": 15,
                        "authorId": "B0d8KvaO128kGTqCM3oKgQ==",
                        "_type": "review"
                    },
                    {
                        "body": "The new online implementation of this course is a disaster. There is no material bridging the gaps between the basic lectures and much more advanced homework, quizzes, and midterms. The pace at which things are due leave no spare time if you have to spend many hours researching and looking up information that the class skips through. Unrealistic expectations towards time management. Midterm 1 mean and median scores were both at 57%.",
                        "difficulty": 4,
                        "course": null,
                        "workload": 14,
                        "created": "2023-10-12T01:34:31Z",
                        "_rev": "UQHMwHuNAfApTAKWK0NpS6",
                        "rating": 1,
                        "_id": "UQHMwHuNAfApTAKWK0NpTe",
                        "_createdAt": "2023-10-12T01:34:31Z",
                        "_updatedAt": "2023-10-12T01:34:31Z",
                        "id": "UQHMwHuNAfApTAKWK0NpTe",
                        "authorId": "y1JhvPDLUh+xLtZPO1ogQA==",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        }
                    },
                    {
                        "course": null,
                        "_rev": "01wfI7k7OQ2bW4hsNm2QpR",
                        "_createdAt": "2023-03-10T02:04:00Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "difficulty": 5,
                        "id": "01wfI7k7OQ2bW4hsNm2QtF",
                        "created": "2023-03-10T02:04:00Z",
                        "workload": 12,
                        "body": "The best course I had ever in GT. The professor taught the course since 2011. She had a very clear view of the course/workload/timeline in mind! (unlike others just follow what slides says) There isn't slides. She will use the whiteboard through out the semester. Student can follow the class in every derivation and example problems. Yes, no skip of derivation for any lemma. It's a fairly challenging topic but the whole learning experience make it so smooth. There are two midterms, one final exam and weekly homework.",
                        "_type": "review",
                        "_id": "01wfI7k7OQ2bW4hsNm2QtF",
                        "_updatedAt": "2023-03-10T02:04:00Z",
                        "rating": 5,
                        "authorId": "9sciAld03+UQM1ZhhN4YZg=="
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_id": "external-import-523385e2-61a2-4c03-ac94-759cf21b4707",
                        "body": "If you have a stats background, or just 1 course in undergrad, this course is a piece of cake. ",
                        "_type": "review",
                        "created": "2020-08-14T22:44:04Z",
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-08-14T22:44:04Z",
                        "course": null,
                        "rating": 4,
                        "id": "external-import-523385e2-61a2-4c03-ac94-759cf21b4707",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "difficulty": 2
                    }
                ],
                "_updatedAt": "2022-08-24T17:41:15Z",
                "isFoundational": false,
                "_rev": "959qsafI8uoLDPJecfUYQP",
                "codes": [
                    "ISYE-6650"
                ],
                "isDeprecated": false,
                "name": "Probabilistic Models and Their Applications",
                "creditHours": 3,
                "_createdAt": "2022-07-05T23:23:15Z",
                "slug": "probabilistic-models-and-their-applications",
                "rating": 3.1818181818181817,
                "difficulty": 4.090909090909091,
                "workload": 12.363636363636363
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "probabilistic-models-and-their-applications"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "gsp": true,
    "scriptLoader": []
}