{
    "props": {
        "pageProps": {
            "course": {
                "id": "external-import-ISYE-6740",
                "created": "2022-07-05T23:23:15Z",
                "isFoundational": false,
                "_id": "external-import-ISYE-6740",
                "programs": [
                    {
                        "acronym": "AN"
                    }
                ],
                "_type": "course",
                "tags": [],
                "_updatedAt": "2022-08-24T17:17:48Z",
                "codes": [
                    "ISYE-6740"
                ],
                "name": "Computational Data Analysis: Learning, Mining, and Computation",
                "slug": "computational-data-analysis-learning-mining-and-computation",
                "_rev": "vLev53Cwnp4JOI2CCHijHV",
                "_createdAt": "2022-07-05T23:23:15Z",
                "syllabusUrl": null,
                "isDeprecated": false,
                "description": "Theoretical/computational foundations of analyzing large/complex modern datasets, including the fundamental concepts of machine learning and data mining needed for both resesarch and practice.",
                "creditHours": 3,
                "reviews": [
                    {
                        "rating": 5,
                        "workload": 10,
                        "course": null,
                        "authorId": "+f0pupb29VclcTpEosLxyg==",
                        "semester": {
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08"
                        },
                        "_rev": "uSG6j0nzFMARMpT3ZcHoV2",
                        "_updatedAt": "2024-07-28T09:56:23Z",
                        "difficulty": 4,
                        "created": "2024-07-28T09:56:23Z",
                        "_id": "uSG6j0nzFMARMpT3ZcHoZ0",
                        "_createdAt": "2024-07-28T09:56:23Z",
                        "_type": "review",
                        "id": "uSG6j0nzFMARMpT3ZcHoZ0",
                        "body": "Really learned a lot from this course from a theory to code implementation.\n\nHomework: A total of 6 homeworks which make up 70% of your grades. Homeworks are a good balance between theoretical questions (think why would we use this algorithm / derive this equation) and practical coding questions (write up the KMeans algorithm from scratch). Homeworks are generally tougher for the first 3 and subsequently gets slightly easier. Start your homeworks early because it really is a time-sink as you also have to present the homework in a report format. Marking is generally lenient\n\nProject: Project makes up the remaining 30%. In my opinion, the project seems easier than homeworks because you can use packages to solve the problem you have specified. \n\nPre-reqs needed: Linear Algebra and Multivariate calculus. Do not skimp on this because it definitely is needed for the homeworks in solving the theoretical questions.\n\nI will highly recommend this course because it really does provide the theoretical rigour as well as the difficulty from coding."
                    },
                    {
                        "created": "2024-06-19T23:02:05Z",
                        "authorId": "lfyPLYw7RL2qliLO1CLJng==",
                        "difficulty": 4,
                        "workload": 16,
                        "_createdAt": "2024-06-19T23:02:05Z",
                        "rating": 5,
                        "id": "4D6P39Rjh8DQpER49Ivm2S",
                        "_id": "4D6P39Rjh8DQpER49Ivm2S",
                        "_updatedAt": "2024-06-19T23:02:05Z",
                        "course": null,
                        "semester": {
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_rev": "4D6P39Rjh8DQpER49Ivlxf",
                        "body": "This course teaches machine learning, involving both theory and applications, mostly uses bishop's book.\n.\n1. Homework: Most homework has a small part of math proof / hand calculations (say about 20%), a part that you can do some sklearn stuffs, and occasionally will ask you to code down the algorithm. The questions had good quality, mostly clearly stated and the objectives are clear. Grading is lenient but fair. Typically it takes up one to two full days to finish it.\n2. Project: Another highlight of the course. You can pair up with others or do solo. A lot of flexibility, and a good place to apply thing learned in course.\n3. Lecture: Very high quality lectures with enough math rigor. Professor Xie does a phenomenal explaining the ideas with using clear mathematical formulations. The way the topics are organized also demonstrates a significant amount of effort being put in designing this course.\n4. TAs: Phenomenal teaching team. Responsive and very helpful to questions, willing to give out additional materials.\n.\nFinal remark: In iCDA, you get to kind of know the ML landscape. In CDA, one sees more of the inner workings. I enjoyed this course a bunch, probably the most well-organized course in the program. Highly recommend it (at least if you have a solid undergraduate linear algebra, probability theory).",
                        "_type": "review"
                    },
                    {
                        "id": "dqLk8bhtx103SwqVgRxVOk",
                        "created": "2024-05-09T18:43:55Z",
                        "_type": "review",
                        "body": "Best course I've taken so far. Bottom line: this will teach you the math and coding behind most basic machine learning algorithms. It's essentially the flagship data science class. Easier to take it after ISYE 6501 and CSE 6040. This class was probably harder before chatGPT, but will still challenge you. Chat cannot do the assignments - it will get stuff wrong and you have to double check it, so even if you opt to use chat you end up learning a lot. \n",
                        "_id": "dqLk8bhtx103SwqVgRxVOk",
                        "rating": 5,
                        "difficulty": 4,
                        "course": null,
                        "authorId": "cyXKgHsaBlqraVWSRsGeSw==",
                        "_updatedAt": "2024-05-09T18:43:55Z",
                        "semester": {
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "workload": 12,
                        "_createdAt": "2024-05-09T18:43:55Z",
                        "_rev": "dqLk8bhtx103SwqVgRxVKu"
                    },
                    {
                        "_createdAt": "2024-01-10T20:45:09Z",
                        "authorId": "oI/ZNriAtlOWVqKKTb3FUw==",
                        "_updatedAt": "2024-01-10T20:45:09Z",
                        "_rev": "4keuKbsqATyStV7zC6aCN9",
                        "body": "This was a great course. A very strong range of algorithms which you get to code for each one (sometimes from scratch) with strong math proofs and demonstrations behind each topic. Don't stress about the math it's nothing too crazy just abstract derivatives (chains rules, log properties), Lagrangian multipliers (but the professor always goes over the math very well for each algorithm). While the course certainly covered these topics in depth, it wasn't the focus (about 20% of the points in HWs). The lectures were very well balanced in theoretical, math and practical terms. Unlike other courses where you never have to see the lecture videos, here it's an absolute must, it will help you immensely in doing the homework assignments (6 total), you also definitely should use the starter code skeletons for each topic and homework assignment. You learn about a bunch of machine learning and stats algorithms, from an overview of what they are, do and used for, to the their objective function, what they optimize and finally how to use it in Python or matlab. Course deals a lot with images, so a lot of the time you aren't working with traditional dataframes rather their favorite is a series of Yale face pictures reduced in dimensions for modelling. I had never worked with images so learning how to get rows and columns from a picture was tricky but it's not too bad if you have worked with Python before. This was my third course i took it simultaneously with DataViz and Computing for Data Analytics. Definitely a mistake you should deff take CfDA before this class and NEVER partner it up with DataViz, I got an 88 in this class which is a flat B. But I can genuinely say I learned a ton and it was worth the suffering.",
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 10,
                        "created": "2024-01-10T20:45:09Z",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "_id": "4keuKbsqATyStV7zC6aCPb",
                        "rating": 5,
                        "id": "4keuKbsqATyStV7zC6aCPb",
                        "course": null
                    },
                    {
                        "_rev": "jqVEww7I7cd4nQ13NJ2U8V",
                        "id": "jqVEww7I7cd4nQ13NJ2UA3",
                        "body": "Great course! I think it's a must! Great intro to various ML applications. I combined it with MGT 8803 which made the time commiment restricted. I wish i had more bandwidth to provide towards this course. It was a tough course for me because of lack of bandwidth but overall a great course. Make sure to find a good teammate for the project. ",
                        "authorId": "+jTAa/Y57/V1BqtRCslpQA==",
                        "_id": "jqVEww7I7cd4nQ13NJ2UA3",
                        "rating": 5,
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "created": "2024-01-09T06:03:38Z",
                        "course": null,
                        "workload": 14,
                        "_updatedAt": "2024-01-09T06:03:38Z",
                        "difficulty": 5,
                        "_createdAt": "2024-01-09T06:03:38Z"
                    },
                    {
                        "created": "2023-12-13T22:00:52Z",
                        "_id": "EMDrCE8zqCAoxcS5bIcDkE",
                        "difficulty": 4,
                        "_createdAt": "2023-12-13T22:00:52Z",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "_updatedAt": "2023-12-13T22:00:52Z",
                        "course": null,
                        "workload": 11,
                        "rating": 4,
                        "id": "EMDrCE8zqCAoxcS5bIcDkE",
                        "body": "My background\n\nTook this course immediately after IAM and iCDA. Self-studied linear algebra. Minored in CS for undergrad, graduating five years ago, work as a data scientist. Very comfortable in Python, totally new to LaTex.\n\nHighlights: \n\n- Homeworks do a good job of forcing you to learn a ton of novel concepts in machine learning. In a perfect world, students would code every ML model from scratch without sci-kit learn, but I think the right trade-off between breadth and depth is made here to explore more models later in the course.\n\n- I spent 11 hours/week on the class, with the exception of a lull in the middle. A mid semester break coincides with the easier middle assignments which is a nice respite.\n\n- The project does a great job of letting students take the training wheels off. You learn a ton of models, pick a new dataset, and have to navigate the ambiguity of picking the models that make the most sense for your research question.\n\n- TAs did a great job leading forum discussion and answering questions. Alfie was a remarkable head TA.\n\nAreas of Improvement:\n\n- The total lack of grading on code quality isn't setting students up for success professionally. I would setup an auto-grader for the coding portions like in iCDA and keep the LaTex reports for visualization and discussion.\n\n- After iCDA and IAM, the two hour multi-topic lectures feel indigestible. The actual content is good and concepts are well explained, but scrubbing through the video to find the five minute excerpt relevant to what you're currently working on is so cumbersome.\n\n- I know the purpose of the mathematical proofs/derivations is to build an intuition for how and why the algorithms work, but I was so underwater on calculus that I didn't learn a thing. I'd replace these with more exercises that force the student to perform the computation of an algorithm of a toy dataset by hand. Doing this for AdaBoost was a highlight of the last homework.\n\n- Institute peer reviews to speed up the grading cycle. By the time I got my 79/100 grade back for my first assignment, I had already submitted the second and was well into the third. Makes it hard to course correct! (Note I still managed a low A in this course, if you put in the effort, you will be fine). Also I learned a lot doing peer reviews for the final project, it's also a learning opportunity to see how others approach the assignments.\n\nThe resources that helped me the most (I have no relationship to any of these resources, my opinions are my own, wasn't paid to endorse):\n\n- Mike Cohen's Linear Algebra: Theory, Intuition, Code does a marvelous job explaining everything up through Eigendecomposition, which in my opinion is 95% of all the LA you need for this course.\n\n- Every week that went by, I watched the professor's lectures less and less and Josh Starmer's Stats Quest Youtube Channel more and more.\n\n- Overleaf (student plan $9/month) probably saved me two to three hours of LaTex formatting time per project.\n\nGeneral Recommendations\n\n- The quality of your code is totally irrelevant to your grade on each homework. TAs are opening your PDF report and going off its contents alone. Any hour you can spend polishing the report, notation, visuals etc. is going to have a positive impact on your grade where a code refactor will not.\n\n- I wish I had known how much multivariable calculus was necessary to complete the 1-2 proofs in each assignment. If you're like me and taking this hot off the OMSA intro courses, you may be in the same boat. IAM and iCDA both provide a gentle introduction to Linear Algebra but little to nothing on multivariable calc, so you may want to brush up.\n",
                        "_rev": "EMDrCE8zqCAoxcS5bIcDih",
                        "authorId": "kIKa6VFkh7VonzhyIGkk5w==",
                        "_type": "review"
                    },
                    {
                        "_id": "izKdQKGWKnehyWbkvWRbuU",
                        "difficulty": 3,
                        "course": null,
                        "created": "2023-04-28T15:23:04Z",
                        "_updatedAt": "2023-04-28T15:23:04Z",
                        "_createdAt": "2023-04-28T15:23:04Z",
                        "_rev": "izKdQKGWKnehyWbkvWRbqt",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "authorId": "mprzBRYbbr58cGeRJhueGw==",
                        "id": "izKdQKGWKnehyWbkvWRbuU",
                        "_type": "review",
                        "rating": 5,
                        "workload": 14,
                        "body": "Overview:\nI am in my final semester (other than the practicum) and this has been one of my two favorite classes in OMSA (along with Data Mining, IE-7406).  I would recommend this to EVERY OMSA student.  This class is the reason you want to go into Data Analytics and Data Science.\n\nMy Background:\nSo everyone knows where I am coming from....  I am only a marginal Python programmer and weak in probability/statistics, but I am very strong in calculus, linear algebra, and analytic modelling.\n\nCourse Layout: \n6 Homeworks - generally due every 2 weeks, and 1 Project due at the end of the semester.  NO Exams!  \n\nPersonal Notes:\nI was originally intimidated by this class because it seemed to be a high level coding class where you are re-creating already developed models from scratch - and solving complex coding problems is distinctly not my strength.  While the building models from scratch is generally true, it turns out that most of the code you need is provided to you in the sample code examples.  Furthermore, after the first 2-3 homeworks, you are using generally using packages rather than recreating the wheel.  In fact, by the second half of the semester, I was only having to work on this class about every other week because I would be able to finish the lectures and the homework the first week and wouldn't have anything to do until the next set of lectures/homework was released at the end of the second week.\nOverall, this class has been much easier than I originally expected/feared and has turned out to be one of my favorite classes in the entire program.\n\nChallenges/Observations:\n1.  The grading is very lenient, so don't avoid this class because you don't think you can pass it.  It is almost impossible to get less than a B if you put a good faith effort in doing the homework and you turn all the assignments in.  Right now, I think the class average is about a 96.\n2. The theoretical questions can be tough.  If you don't have a strong math background they will take a good bit of time.  I found that the statistics based questions generally took me several hours to research and answer (Google is a Godsend!).  For me, the proofs based on derivatives and integrals were not very difficult, however.\n3. If you have experience using analytical models, the modeling questions are straightforward.  If you don't have a strong background in analytic modelling, I would recommend taking the Data Mining class first.  While most of the problems there are based in R rather than Python, that course is really an applied analytic modelling course. It will give you a GREAT background in what each type of model is doing and how it works.\n4. Get comfortable with linear algebra!  The first half of this course is converting linear algebra equations to Python code.  If you don't understand the linear algebra, it makes everything else that much more difficult.  Even though I have a good background in linear algebra, I did brush up on it before starting the class, and that review helped immensely.\n5. Pick a project early!  I built on a project I started for IE 7406. That way, even though I had to convert the code from R to Python, I already had the foundation laid and could work on some more sophisticated aspects of the problem I could not get to in that class.  If you don't have something already handy, don't wait until the end of the class to pick a project.  This is also where having taking IE 7406 would help.  You learn MANY more modelling techniques in that course, so you will have a larger toolbox to choose from for your project.\n6. Do not plagarize/cheat!  The professor is very serious about this.  If you need to use some some small sections of code you find online to help finish your homework that is fine but provide attribution in your script!!!  There have been some people get in big trouble this term for plagarizing code.\n7. There are tons of office hours - typically several per day.  Take advantage of them.  Even if you can't attend them in person, they are recorded so that you can listen to them later.   That is typically what I did.\n8. Read the ED discussions regularly.  If you are stuck on a homework, it is a given that a bunch of other people are stuck at the same place.  There were always helpful tips and hints in ED.  A lot of times people would post their graphical outputs as part of thier questions, and comparing your output to these would give a great indicator of whether your code was correct or not.\n\nBest of luck and enjoy this course!"
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z"
                        },
                        "body": "Professors videos have low sound quality and her thoughts are often all over the place. A lot of the actual learning and understanding came from the TAs through ed discussion or the many office hours that you can attend and ask questions. ",
                        "_updatedAt": "2023-04-26T17:21:22Z",
                        "_type": "review",
                        "course": null,
                        "id": "PN0LsucFHRjXEo6GoxJLX8",
                        "rating": 4,
                        "authorId": "eS/hfZfXrmyKAfuOqr5qng==",
                        "_rev": "PN0LsucFHRjXEo6GoxJLVk",
                        "_id": "PN0LsucFHRjXEo6GoxJLX8",
                        "created": "2023-04-26T17:21:22Z",
                        "difficulty": 4,
                        "workload": 15,
                        "_createdAt": "2023-04-26T17:21:22Z"
                    },
                    {
                        "workload": 8,
                        "authorId": "YcRCrpL/0MAbjrBk0BQjiA==",
                        "_updatedAt": "2023-01-18T18:40:50Z",
                        "body": "Challenging, but interesting and engaging. Homework assignments were tough and took a lot of effort, but in many cases were very satisfying because they functioned more like labs: you get to see your work function in some real way - as an image compression algorithm, face recognition tool, etc. and don't have to wonder if you did it right. \n\nTwo minor complaints - one is that the course was too heavy on mathematical theory for the name \"Computational Data Analysis.\" This is a professionally-oriented degree where the academic derivations aren't going to be as valuable to 90% of students as the practical ramifications.\n\nThe second is that some of the homework problems should be explained better. For example, you might be provided parameters for generating training data as well as for developing a model, but it's unclear what information should be treated as unknown for which step. So sometimes the already challenging assignment begin with an hour or two of head scratching and deciphering cryptic hints from TAs just to figure out what you're supposed to be doing.",
                        "created": "2023-01-18T18:40:50Z",
                        "rating": 4,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3,
                        "course": null,
                        "id": "2Vx1PvkVoQ26NIDGicFkSy",
                        "_rev": "2Vx1PvkVoQ26NIDGicFkQY",
                        "_id": "2Vx1PvkVoQ26NIDGicFkSy",
                        "_createdAt": "2023-01-18T18:40:50Z",
                        "_type": "review"
                    },
                    {
                        "_createdAt": "2022-05-03T20:11:17Z",
                        "_id": "external-import-b06320a8-4cf7-4d6b-8cd0-71019111af76",
                        "body": "Superb!",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-b06320a8-4cf7-4d6b-8cd0-71019111af76",
                        "created": "2022-05-03T20:11:17Z",
                        "rating": 5,
                        "workload": 12,
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        }
                    },
                    {
                        "id": "external-import-3c28624d-d574-4cdb-b6a9-a466730fb281",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "body": "This is a must for OMSA folks. Thoroughly enjoyed the content, homeworks, and project. The teaching team were fantastic. No background in maths nor stats but learnt a lot and managed to survive with an A.",
                        "_createdAt": "2022-02-17T03:29:15Z",
                        "course": null,
                        "created": "2022-02-17T03:29:15Z",
                        "_id": "external-import-3c28624d-d574-4cdb-b6a9-a466730fb281",
                        "difficulty": 3,
                        "rating": 5,
                        "workload": 15,
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        }
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 15,
                        "semester": {
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-fba3c864-ecbe-47b8-a3f9-b87636d64825",
                        "body": "Overall I thought this class was a good challenge. For practically every assignment, there was at least one part where I felt completely incapable of completing that portion of the assignment upon first glance, but after examining the demo code and participating in Piazza, it was feasible.\n\nI took this class straight off the core requirements (6501, 6040, 8803), and I would say I wish I had a bit more of a math background before getting in. I have taken up to calc II, linear algebra, and a probability / stat course (though that one was ~5 years ago), which I thought would be enough to learn key points on the fly. I ultimately was able to get an A, but I straight-up didn't answer questions worth 15 and 35 points (out of 100) on two homeworks despite hours of trying to understand the math. The math proof questions I was able to answer I would admit I didn't understand in great detail. I think the main gap was a lack of strong probability / stat understanding, and an extremely weak grasp of multivariate calc (which I'm taking over winter break for future classes). That said, understanding linear algebra did make the class a lot easier, especially early sections where you're coding based on linear algebra equations in lectures and demo code. Python programming ability is also crucial (my main experience was 6040 where I got a comfortable A).\n\nDue to my specific context the main things I've taken away are:\n- Being comfortable using LaTeX to write math expressions.\n- Being comfortable using sklearn ML packages, with a better understanding of specific parameters to tune these.\n- Being less intimidated by math notation when trying to understand how ML algorithms work.\n- Implementing ML algorithms from scratch, when relevant, based on math notation in online resources (I had to do this for my project).\n- Better understanding of some algorithms we cover in more detail in this class when compared to 6501, like logistic regression, SVM, etc.\n\nThings I didn't take away that I expected to:\n- A deep understanding of how many ML algorithms work behind the scenes (again, due to my own math abilities coming in). I do feel more comfortable in understanding these algorithms at a high level and doing deeper research if needed, though.\n\n\nUltimately, I think I'm going to go in a less theoretical machine-learning direction with the program after taking this class (I was originally hoping to take HDDA and DL; now I'm looking at BD4H and DBS). That said, I'm glad to have had this experience, and I do think this class is a great option even if you're not super interested in going deep down a machine-learning track in OMSA. \n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "course": null,
                        "id": "external-import-fba3c864-ecbe-47b8-a3f9-b87636d64825",
                        "created": "2021-12-21T14:31:23Z",
                        "_type": "review",
                        "_createdAt": "2021-12-21T14:31:23Z",
                        "rating": 4
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_id": "external-import-5d4cba45-5a89-43f7-b582-8029130485c4",
                        "body": "I liked this course a lot!\n \nThe focus on 'from scratch' machine learning was really cool (and refreshing, after 6501/6040), and I thought the TAs were very responsive and helpful. There's so many office hour sessions, so I always felt like I could talk to someone in person, which helped for some tricky assignments (looking at you EM algorithm).\n\nThe grading did feel a bit lenient though. If I had a suggestion, it would be to make that a bit stricter...would make it a bit easier to tell where I actually got things wrong, and where my grader was being nice.\n\nAll in all though, this was a great ML 101 type course, and I'd recommend it to any aspiring data scientist.",
                        "difficulty": 3,
                        "created": "2021-12-20T00:01:23Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "course": null,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-12-20T00:01:23Z",
                        "id": "external-import-5d4cba45-5a89-43f7-b582-8029130485c4"
                    },
                    {
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_createdAt": "2021-12-18T02:44:46Z",
                        "_type": "review",
                        "created": "2021-12-18T02:44:46Z",
                        "_id": "external-import-562eb052-f434-4759-95ef-8922e0eeb125",
                        "body": "This is one of the best courses in this program. I believe its a great extension to the 6501 course. \n\nValue added from this course:\na) Helped me understand the 'WHY' behind each algorithm.  \nb) Made me think about selection of algorithm based on the structure of the data\nc) Made me confident about tricky aspects like hyper-parameter tuning, feature selection, etc.\nd) Made me comfortable with the mathematical concepts and this makes understanding papers easy.\n\nMath Prereq:  I took simulation in prior semester so the required calculus and probability concepts were covered . In addition, I just spent 10hrs on Multivariate Calculus and one weekend on Linear algebra concepts.\n\nClass experience: The TAs are really good and active. Prof X also holds OH once every week to resolve any doubts. Assignments are made so as to help students assimilate the concepts from the lectures. Also, I found the lectures interesting (contrary to other reviews here)\n\nThis is a fantastic course and helped significantly improve my ML fundamentals. Without this course, the OMSA experience would remain incomplete in my view.\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "id": "external-import-562eb052-f434-4759-95ef-8922e0eeb125",
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "rating": 5,
                        "workload": 18
                    },
                    {
                        "_createdAt": "2021-12-07T17:09:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 2,
                        "_type": "review",
                        "body": "Having taken both DMSL and CDA, I could see why people prefer DMSL over CDA.\n\nHowever, let me offer you a different perspective. \n\nDMSL is about practical aspects. However, would you feel confident after taking DMSL what a support vector machine is? No, I can't. DMSL is literally a paper-pushing course that you apply, you leave. I don't retain much information there even though it was a well-taught course.\n\nCDA however, brings you a deep dive. It's tough, yes. But it equips you the confidence and the ability to DEFEND your models in front of the auditors and management and argue why your models work. \n\nThat's the value proposition of this class, and explains why my pay got augmented when I manage to take this class and got promoted in a more specialist role. \n\nI will be taking HDDA and DL next to complete my ML theory-driven knowledge.",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_id": "external-import-61bd3f5f-7ac9-424a-8324-286757861807",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 5,
                        "workload": 16,
                        "id": "external-import-61bd3f5f-7ac9-424a-8324-286757861807",
                        "created": "2021-12-07T17:09:57Z",
                        "course": null
                    },
                    {
                        "workload": 20,
                        "_id": "external-import-ab091379-bc36-43ca-91a2-de030067091a",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-ab091379-bc36-43ca-91a2-de030067091a",
                        "created": "2021-11-12T00:23:52Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-11-12T00:23:52Z",
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "difficulty": 4,
                        "course": null,
                        "body": "I absolutely loved this class. Homework assignments require a significant amount of time but that's where I always learned the most. Following along in Piazza is a must, but other students always had the same questions and the TAs and prof. were extremely responsive, helpful, and willing to take the time to explain every single question asked. Lectures are helpful too, but it's not required that you watch every minute of them to complete homework assignments. No exams. Overall this was an incredible class that truly expanded my knowledge of ML. Being solid in Python was a huge help.",
                        "_type": "review"
                    },
                    {
                        "workload": 20,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "created": "2021-09-19T19:14:37Z",
                        "course": null,
                        "body": "****DO NOT TAKE THIS CLASS IF YOU ARE NOT EXTREMELY COMFORTABLE WITH IMPLEMENTING LINEAR ALGEBRA IN CODE****\n\nThe material in this class is very interesting and provides a ton of insight into how machine learning algorithms work and the math behind them. However there are some issues with the structure of the class, which get in the way of learning. Homeworks are due every two weeks and the first few have taken me 20-ish hours to complete each. The instructors assume you have a very solid grasp of linear algebra and implementing it in code, and there is little guidance provided in actually implementing the algorithms in each homework. General Python knowledge is also very important. There have been multiple occasions where I've spent 1-2+ hours just loading and transforming the data before beginning the actual assignment. Unlike the notebook homework structure of CSE-6040, only raw files are provided to you and you have to figure out yourself how to get it in the appropriate format.\n\nIssues I have with the class are as follows:\n\nTerrible lecture structure: Every other class I've taken in OMSA has had lectures split up into several smaller pieces, which makes it easy to make sure you understand each concept before moving on, and is very helpful when you need to go back and review a certain topic. In this class, lectures are 45-75 minutes long and are essentially the professor sharing her screen and narrating over the powerpoint. It's difficult to follow and nothing is indexed, so if you want to review something you'll need to scrub through a video to locate it.\n\nContradictory information: Multiple times the information provided by TAs on Piazza contradicts that which is provided in the lecture. For example, the ISOMAP lecture says to create an adjacency matrix of the l-2 norms, whereas the Piazza TA answer is that the adjaceny matrix should be 0s and 1s. It's very frustrating when topics that take a significant amount of effort to understand have contradictory information provided by professors and TAs.\n\nWhile the class overall is very interesting, the structure could use some serious improvement.",
                        "_createdAt": "2021-09-19T19:14:37Z",
                        "rating": 2,
                        "_id": "external-import-deaa7af3-3e36-48a1-b2a7-d7fdcb744214",
                        "difficulty": 5,
                        "id": "external-import-deaa7af3-3e36-48a1-b2a7-d7fdcb744214"
                    },
                    {
                        "workload": 10,
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "id": "external-import-e7000597-7fdd-46ab-8def-faf7f5c55622",
                        "body": "I took the course during the summer after taking ISYE7406 DMSL. I can see the pros and cons between these two courses clearly. \n\nIn terms of practicality, DMSL is a big winner. CDA is focusing a lot more on the details implementation of specific algorithms, but not how to solve the real-world problem systematically. \n\nFor the assignments, CDA is more coding-oriented. It is extremely difficult to read the HW instruction and implement the solution without closely following Piazza. A lot of important details need to be clarified. DMSL is more like an open-end assignment, which give you more flexibility but still subject to the quality of peer reviews. It doesn't mean that TA grading in CDA is better than peer reviewers in DMSL. Peers in DMSL are from diverse background. Some have a lot of practical experience; some are not.\n\nProject. DMSL has prepared the assignments as building blocks for you to successfully create the project. CDA is just a project without much guidance unless you spend time attending office hours discussing with the TAs. DMSL is a clear winner in terms of experience. CDA is still pretty much focusing on the technicality of the project.\n\nIn summary, if you want to learn how the library really work inside-out, CDA is your best bet. If you want to learn a systematic way of solving problems, DMSL will clearly give you one.\n\n\n",
                        "difficulty": 3,
                        "_createdAt": "2021-08-07T20:33:57Z",
                        "rating": 2,
                        "_type": "review",
                        "created": "2021-08-07T20:33:57Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-e7000597-7fdd-46ab-8def-faf7f5c55622",
                        "course": null
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 3,
                        "course": null,
                        "workload": 25,
                        "_id": "external-import-9a4ad17e-520a-43fe-81dd-f436fc2f0535",
                        "created": "2021-07-15T17:03:58Z",
                        "_type": "review",
                        "_createdAt": "2021-07-15T17:03:58Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "Good things:\n- interesting assignments\n- a lot of TAs sessions to ask question regarding a homework task (the answers though sometimes contradict each over and common sense)\n- professor has weekly OHs and it feels like a real class. Professor is very nice and engaging \n- generous grading (hell yeah! It feels very rewarding to get good grades for hard work)\n\nBad things:\n- lectures: a lot of extra words, long-long bla-bla-bla in bad English, boring and sad\n- math derivations\n\nThings to improve: maybe write down short-sweet scripts to lectures (a-la prof. Sokol style) and read them instead of improvising. Would be worth doing considering there are about 400 ppl in the summer class. 400 ppl watching the same bad stuff... It is kind of disrespectful to provide such bad quality content, IMHO.\n\nP.s. I took the class in the summer, I wouldn't recommend doing so though. There are only 5 hws (with the 5th hw being very hard and time consuming) vs 7 in the full semester . You would benefit from doing more hws. No material is left out for the summer, instead it squeezed to fit shorter schedule.",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester"
                        },
                        "id": "external-import-9a4ad17e-520a-43fe-81dd-f436fc2f0535",
                        "difficulty": 4
                    },
                    {
                        "workload": 15,
                        "id": "external-import-2c1d0961-1346-41f7-ae90-d1a0ba34e6d9",
                        "created": "2021-05-10T17:31:58Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 4,
                        "_id": "external-import-2c1d0961-1346-41f7-ae90-d1a0ba34e6d9",
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "This course can be viewed as advanced statistical learning course where you learn a bunch of new and advanced machine learning methods, in addition to in-depth dive into other methods you are already familiar with from previous courses. It balances well between the theory and practice, and helps you understand the math behind the algorithms while at the same time giving many interesting applications that help you understand how these will be implemented in real world. The assignments are excellent and are the best aspect in this course. While they are challenging and time consuming, the instructions are clear with well-defined goals and there are hardly any ambiguity or errors, so you will be spending the time on solving the problems rather than trying to understand what is required by the question like what many other courses make you go through (such as DVA). The professor is very engaging, holds weekly office hours, and posts walk-through videos for each assignment, and is very active on Piazza more than any other professor in OMSA (from my experience). The TAs are very responsive and professional. \n\nSo, with all the positives above why I gave it 4/5? This is because the quality of the lectures in my opinion are very inferior compared to the other great aspects of this course. For most topics, I relied on external resources to understand rather than on the videos. I think that they will be much better if they follow the short-videos style of other courses (example simulation), and started with some background on the subject rather than diving straight into math. I am not saying however to abandon the math as I found it to be very interesting and helpful to enhance the understanding, but it is better to start by giving some intuition so that the math will make sense. Also, another thing that was extremely disappointing is that the final project, which is worth 40% of the entire course grade, was graded without giving any feedback, so you simply get your grade in the last day of class with no explanation at all, just the grade!!! \n\nAll in all, one of the best courses in OMSA, and is recommended to anyone who aims at a career in ML. However, be aware that some assignments rely heavily on linear algebra and statistics, so expect to put extra time if your background is not strong in these. ",
                        "difficulty": 4,
                        "_createdAt": "2021-05-10T17:31:58Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "_type": "review",
                        "_id": "external-import-1431a526-d0c9-4f32-bf11-8195ba9f03ae",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "body": "I had a very hard time in this course, but also had some fun as well. I'm rating this neutral because there are some really neat things in this course but also some really poor execution.\n\nWhat you can expect:\nProfessor Xie is energetic and clearly passionate about the topic. Her enthusiasm really helped when I was struggling with the material, I found her explanations somewhat helpful, but she explains things at a level that you will either understand, or not. \n\nThe class is entirely homework based plus 1 large project. The grading seems to vary with homework worth 60-80% and the remainder assigned to the project. Spring 2021 started at 80-20, but was ultimately adjusted to 60-40.\n\nI found the homework to be interesting, but weighted too heavily on the theory, to the point of reducing the value of the assignment. I learned a few things, but very little was presented in any real-world application. The project was open, which filled part of that gap. \n\nThe class would be much better if it were more application focused and less theory focused. \n\nSkills needed to succeed:    \nStrong foundation in Python     \nStrong foundation in Linear Algebra     \nDecent Calculus     ",
                        "difficulty": 5,
                        "_createdAt": "2021-05-07T18:19:32Z",
                        "id": "external-import-1431a526-d0c9-4f32-bf11-8195ba9f03ae",
                        "created": "2021-05-07T18:19:32Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "workload": 20
                    },
                    {
                        "id": "external-import-79b207f6-241e-4491-9c4b-652f74ccf4d5",
                        "difficulty": 4,
                        "workload": 15,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "body": "It seems like this class has changed frequently over time, this review is for the **Spring 2021** semester.\n\nThis was my 6th class after the 3 Core classes, MGT6203 and Simulation. It was absolutely my favorite class so far, and also the hardest. Expect linear algebra and calculus on almost every assignment with some kind of derivation involved, as well as coding work. \n\nProf. Xie has that casual brilliance you see when people _really_ know their stuff. Her explanations in lecture videos, office hours and Piazza were thorough and well presented. For better or worse she does not 'dumb down' content so when dealing with a new topic that you may have less experience with it can sometimes be hard to follow and require additional research to build up that comprehensive knowledge. Sometimes that could be frustrating, but I always found it valuable and worthwhile. \n\nThe flow of the class was great, 6 homework assignments and a group project. This semester the HWs counted for 60% of the grade and the project 40%, with extra credit possible on most homework assignments. The lack of high-stakes exams I felt gave a great opportunity to really dive deep into the concepts as you are working through the assignments and gave me a sense of a more balanced workload week to week. \n\nContrary to what some other reviewers experienced, I found that the class did not get easier after the halfway point, the class switches from unsupervised to supervised algorithms and while packages are used more liberally and some individual homework questions are simpler I found the math work more than made up for the difference, with HW6 and HW4 being the hardest for me.\n\nContent usually consisted of 1-2 hour long videos, a follow up homework guide video (30-40 mins) and office hours by the professor and the TAs weekly (I only watched the professor office hours, these were also usually around an hour long). \n\nGrading felt very generous (dare I say **too** generous?) but most of the class consisted of pretty motivated individuals and it seemed like everyone was really working hard to understand the material. \n\nAs for downsides, there was sometimes some poor phrasing/wording/grammar in the assignments themselves, sometimes needing some extra clarification from a TA later. Group projects are group projects, we all know the downsides there, even with a strong group like I had. Overall though, I feel much smarter after this class than before it and I highly recommend anyone at OMSA try to fit it in to their class plan. \n\n\n\n\n\n",
                        "_id": "external-import-79b207f6-241e-4491-9c4b-652f74ccf4d5",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-05-03T17:04:31Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "_createdAt": "2021-05-03T17:04:31Z",
                        "rating": 5,
                        "course": null
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-7ba27cf4-c1f9-4c3e-be18-2a14088c0ae6",
                        "course": null,
                        "_id": "external-import-7ba27cf4-c1f9-4c3e-be18-2a14088c0ae6",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "body": "Course structure: 6 homeworks (60% of grade), 1 project (40%), and 0 exams. Yes, 0 exams. HWs can be difficult and time consuming, but by the time you finish them, you'll have learned a lot.\n\nProf Xie is awesome. I've taken 6 classes so far and she was without question the professor that engaged most with students. Clearly loves and material and knows it well. Does a great job teaching it both in the lectures and in her office hours. TAs are also very active and usually very helpful.\n\nI was familiar with a lot of ML concepts before taking this class, but hadn't done anything rigorous like actually derive/code an algorithm. It probably saved me some time. I was also relatively comfortable with Python, which definitely helped. I could definitely see this course taking more time for people with less familiarity with the material or less comfort in Python.\n\nI would highly recommend this course to anyone considering it.",
                        "_createdAt": "2021-04-28T23:09:55Z",
                        "created": "2021-04-28T23:09:55Z",
                        "rating": 5,
                        "workload": 12,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        }
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "This is a very good course. I think the difference between CDA and ML from CS is that there is much more theoretical aspect in CDA. At least one question per homework asks you to do the algorithm by hand so you truly understand what the algorithm does. Homework 1-3 are very tough but after Homework 4, the difficult drastically decreases. So you're worried about you performance in the beginning, don't sweat it and you'll be fine! Professor Xie is amazing. She's definitely the most engaging professor I've met throughout all my time in this program.",
                        "_createdAt": "2021-03-21T19:48:50Z",
                        "id": "external-import-4f31c2fd-f686-4421-8040-0d8ce9c5f68e",
                        "created": "2021-03-21T19:48:50Z",
                        "course": null,
                        "workload": 15,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "_id": "external-import-4f31c2fd-f686-4421-8040-0d8ce9c5f68e",
                        "difficulty": 4,
                        "rating": 5
                    },
                    {
                        "_id": "external-import-0ff616c0-9495-4525-b79f-9ffc62972b90",
                        "_createdAt": "2021-03-08T01:37:56Z",
                        "id": "external-import-0ff616c0-9495-4525-b79f-9ffc62972b90",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "rating": 3,
                        "workload": 20,
                        "body": "Cleared due to OMSCentral Owner being greedy.",
                        "created": "2021-03-08T01:37:56Z",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review"
                    },
                    {
                        "rating": 5,
                        "course": null,
                        "body": "This is a deep-dive and much more in-depth version than machine learning course in OMSCS. Homeworks really force you to understand  inner details and the math behind ML algorithms, some of them asks you to implement the algorithm by-hand. \n\nI am so grateful took this class in my last term, so I can peacefully graduate from this program knowing that I finally understood the math behind popular ML algorithms.\n\nProfessor Yao Xie and TAs did great jobs, very responsive in piazza. I've graduated from both OMSCS and OMSA programs, Professor Xie is the one rare Professors in this program which always there for you in Piazza, directly answering questions. Kudos for them.\n\nHighly recommended for anyone who wants to do ML jobs.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_id": "external-import-b96f0dc5-51bc-424e-a5ed-115ede066c45",
                        "_createdAt": "2020-12-28T17:33:32Z",
                        "created": "2020-12-28T17:33:32Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 15,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "difficulty": 4,
                        "_type": "review",
                        "id": "external-import-b96f0dc5-51bc-424e-a5ed-115ede066c45"
                    },
                    {
                        "_createdAt": "2020-12-07T22:27:46Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "created": "2020-12-07T22:27:46Z",
                        "rating": 4,
                        "_id": "external-import-a1d18dd1-5598-480c-bff0-7cd6ccf720be",
                        "difficulty": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "body": "The course is front loaded, expect to spend 20+ hours if your programming/math is a bit weak the first few weeks. After that, it does ease up a bit. Found myself watching YouTube videos for more intuitive explanation before watching and diving into the lectures which are notation heavy. Professor seems very active on Piazza and hosts TA sessions. ",
                        "id": "external-import-a1d18dd1-5598-480c-bff0-7cd6ccf720be",
                        "_type": "review",
                        "workload": 20,
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        }
                    },
                    {
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "_id": "external-import-bb23d943-198b-4b1d-b36e-fff0a6f5870b",
                        "body": "This was my third course in OMSA. Professor is very sincere in her efforts. She is active on piazza. She is one of very few professors who holds weekly office hours. All TAs have weekly office hours too. Basically there is at least one office hour every day. So it is easy to ask for help if you need to understand something immediately. Grading is fair and easy to get a A with some sincere efforts. Gives a good overview and understanding of many commonly used machine learning algorithms. \nHowever initial lectures are difficult to understand. Needs some initial efforts. It is much easier if you listen to Andrew Ng's lectures to understand the concepts. \nThere are 6 assignments  and a project. The first three assignments require you to implement model code from scratch ( cannot use libraries), so the first 3 assignments are more difficult than the last three.  Each assignment has mathematical concept questions as well as coding. She however gives demo codes with all the lectures which helps with the assignments. If you understand the demo codes it is easy to complete the assignments. She also gives homework explanation videos which helps with the assignments.\nProject can be done individually or in groups of 3. Choose your teammates wisely. Project was the most satisfying part of this class. ",
                        "difficulty": 4,
                        "_createdAt": "2020-11-29T00:45:33Z",
                        "_type": "review",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 20,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-bb23d943-198b-4b1d-b36e-fff0a6f5870b",
                        "created": "2020-11-29T00:45:33Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 5,
                        "course": null,
                        "id": "external-import-6d4343c4-1dd9-4048-b7d7-a978cd2c9577",
                        "workload": 20,
                        "_createdAt": "2020-11-23T04:33:34Z",
                        "_type": "review",
                        "_id": "external-import-6d4343c4-1dd9-4048-b7d7-a978cd2c9577",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "created": "2020-11-23T04:33:34Z",
                        "body": "Too many books as references, which kind of makes you not even want to touch them or look for answers in them as it makes you look forever. Frustrating. The workload is easily about 20 hours per week. The lectures are very boring and not engaging at all, which also makes you not want to watch them. Also very frustrating because getting the lectures out of the way is a dragged out agony. Hard technical things are presented in a language that you won't understand easily. If you'll take it with another heavy class - you're screwed. "
                    },
                    {
                        "difficulty": 4,
                        "_createdAt": "2020-11-17T17:36:23Z",
                        "rating": 4,
                        "workload": 15,
                        "_id": "external-import-bcee0cc7-3e42-4491-ae5f-91366eb4de60",
                        "body": "This was a reasonably good course.  Dr. Xie is very committed to posting on Piazza and holds regular weekly office hours.  The TAs offer office hours most days, so there is plenty of opportunities to get help.  Despite the name, the course spends a significant amount of time on theory and mathematical proofs for various algorithms.  This can be challenging.  Most homework assignments include both a theoretical and practical (programming) component.  The initial programming assignments are from scratch,  with the most challenging being implementing the Gaussian mixture models from scratch.  The later assignments allow you to use packages like scikit-learn. \n The course can be done with either Matlab or Python.  It seemed to me that Matlab was emphasized early in the course, and Python more later.  The TAs for this course were OK, but a little disorganized.  They had a propensity to say “You’re overthinking”, to which I want to scream “Or you are under-explaining.”  I find the “overthinking” comment infuriating.  The project for this course was pretty much whatever you wanted to do ML on.  I enjoyed that the best.  The first and the last homeworks were the most challenging.  Some of the homework assignments can be long and difficult, but can be completed in the 2 weeks.  It is important to get started on the homework as soon as it is available so that you can spread the work out.  There are several opportunities for extra credit.  If things hold, I will complete the course with close to or slightly over 100%.  This was my 8th course in the OMSA program.  Again, a tough course, ok TAs, very good Professor.  Good luck.",
                        "id": "external-import-bcee0cc7-3e42-4491-ae5f-91366eb4de60",
                        "created": "2020-11-17T17:36:23Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review"
                    },
                    {
                        "workload": 10,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-f9c00b1c-45f6-48d0-8738-f4db7f2fc68f",
                        "_createdAt": "2020-08-12T17:31:18Z",
                        "course": null,
                        "_type": "review",
                        "_id": "external-import-f9c00b1c-45f6-48d0-8738-f4db7f2fc68f",
                        "body": "Taking this class over the summer was difficult, because it was a lot more work than anticipated. Most of the time is spent on doing the homework, and the lectures were often too high-level.  The project was good, but I had a good team and we all split responsibilities evenly. \n\nI was hoping for a class to really get a deeper understanding of different AI/ML methods, but that was not the case. Just disappointed in how it turned out. ",
                        "created": "2020-08-12T17:31:18Z",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 2
                    },
                    {
                        "body": "Taking this course in the summer is very difficult. The assignments are graded very easily, but to adequately learn all the information it will take a significant amount of time. Great concepts though. Also, I received an A",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2020-08-10T13:21:23Z",
                        "workload": 25,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-35d6d680-5f69-4862-97e1-5baec8db3606",
                        "_type": "review",
                        "id": "external-import-35d6d680-5f69-4862-97e1-5baec8db3606",
                        "difficulty": 5,
                        "_createdAt": "2020-08-10T13:21:23Z",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_id": "external-import-ba16791d-ce7b-4dad-be05-4cf31c85efd8",
                        "body": "1. Difficulty: The course content is relatively harder comparing to the introductory and basic courses. However, It's very easy to get an A. In fact, it is too easy. I doubt if the true performance can be differentiated by the grades.\n\n2. Project: could have been due earlier so that TAs have more time look into the details and give a mark that can truly reflect the quality of work.\n\n3. Homework: probably you will spend most of the time working on the homework rather than trying to get a deeper understanding of the course materials. The homework does help us understand the concepts to a certain extent. \n\n4. Course Videos: There are a lot of theories rather than teaching the practicals, such as model selection, hyper parameter tuning. The notations used could be inconsistent sometimes and it's harder to understand them. \n\n5. Office Hours: There are so many of them!!! Professor and each TA has one office hour every week. I didn't attend any due to time zone difference. Also don't feel the need to watch them later as I don't know which one to watch and most of the questions will be clarified in Piazza.\n\nOverall, taking this course in summer can be intense. I would recommend to take it in fall or spring to have a better pace and more time to grasp all the concepts. I would also recommend to spend more time on the project, as you are dealing with a real-life problem and you could use more time to solve all sorts of problems a data scientist could face.",
                        "difficulty": 3,
                        "rating": 4,
                        "course": null,
                        "workload": 4,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-ba16791d-ce7b-4dad-be05-4cf31c85efd8",
                        "created": "2020-08-04T06:17:07Z",
                        "_createdAt": "2020-08-04T06:17:07Z",
                        "_type": "review",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester"
                        }
                    },
                    {
                        "body": "Its very easy to get an A in this course. Content is good and I definitely learned a lot about the math behind different ML techniques. ",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "difficulty": 2,
                        "_createdAt": "2020-08-04T02:20:35Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-91775cc3-4abe-4ab9-8ba4-9a1e2943a245",
                        "created": "2020-08-04T02:20:35Z",
                        "_id": "external-import-91775cc3-4abe-4ab9-8ba4-9a1e2943a245",
                        "rating": 3
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "workload": 10,
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2020-07-29T16:52:18Z",
                        "body": "I enjoyed the course, but like others have said, some of the material is not presented in the best way. There's a lot of good content and I learned a lot, but most of what I learned came from exploration and readings on the internet. \nI found the homeworks really useful in cementing in my learning of the material and actually learning how the models/approaches worked. The lecture videos went in depth in the math behind the models, and sometimes too much so. In some places the notation was inconsistent and unclear, but ultimately those issues were smoothed out with announcements and explanations on Piazza.\nIn the summer session we had five homeworks and a final project, with each assignment due two weeks apart. Typically I would wait until the weekend a project was due and crank out ten hours of work in 2 or 3 days, but it definitely would've been more efficient to spread my effort across the two weeks we were given. \nThe TA's graded really easily and we got 3 one-week homework extensions (normally only 2), which made earning 80% of the grade relatively easy. The final project was pretty simple too and gave us freedom to pick a topic of our choosing. Didn't start on that until after homework 5, but it was released a few weeks into the semester so I imagine you could finish it really early if you wanted to.",
                        "_createdAt": "2020-07-29T16:52:18Z",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester"
                        },
                        "_id": "external-import-8656ccda-7b58-4639-a5b0-589f26fe3308",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-8656ccda-7b58-4639-a5b0-589f26fe3308",
                        "rating": 4
                    },
                    {
                        "id": "external-import-6bef5b89-e3be-41e2-a28c-2bc632eadbc0",
                        "rating": 5,
                        "_id": "external-import-6bef5b89-e3be-41e2-a28c-2bc632eadbc0",
                        "body": "Take-home message: Excellent contents, good workload, and easy to get an A. You can learn fundamental machine learning algorithms by doing assignments, reading books, watching YouTube, asking Professors and TAs, not by watching lecture videos.\n\nContent:\n\tThis course covers lots of fundamental machine learning algorithms such as K-means, SVM, boosting algorithms. These algorithms concepts are always tested in interviews and you will benefit a lot by taking this course.\n\nWorkload:\n\tIt’s quite even spaced. This course has 7 biweekly assignments and 1 take-home final exam (open book, 10 days to finish).\n\nScoring:\n\tYou will get a high score (90+) if you put 8-hour efforts on this course. \n\nCourse overall\tpros: \n\n1. Professor and TAs are very responsive on Piazza. The side effect is that you may spend 1-2 hours reading Piazza posts when homework is not clear.\n\n2. You will get solutions to all assignments. Solutions are helpful because you do not get comprehensive assignment feedback by TA.  \n\n3. You will learn lots of math proof that pushes you to read books, ask TAs or search Google. Half of the assignments are math problems that are difficult for me but I can always find answers after several hours.\n\nCourse overall\tcons: \n\n1. Lecture video teaches algorithms with lots of terms/math that is super difficult to understand. Basically you cannot learn algorithms by lecture videos. I highly recommend you use Piazza, Youtube, and books to learn these fundamental/popular algorithms.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "created": "2020-05-02T18:14:09Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_createdAt": "2020-05-02T18:14:09Z",
                        "course": null,
                        "_type": "review",
                        "workload": 8
                    },
                    {
                        "course": null,
                        "workload": 10,
                        "id": "external-import-2ac316ee-dd3c-43a1-ad15-371470880ecf",
                        "created": "2020-04-27T20:16:25Z",
                        "_id": "external-import-2ac316ee-dd3c-43a1-ad15-371470880ecf",
                        "body": "My 8th class in the program. This was a good class for a survey of machine learning methods that goes into more detail than ISYE 6501 and 6040. It felt like a fusion of both classes, taking in about the level of algorithmic detail of 6040 and the modeling power of 6501.\n\nPros: \n\n1. Not an overwhelming workload even for your average OMSA student (learned coding through MOOCs, might be rusty/underqualified on their multivariate calculus, not really sure what a subspace is or what eigenvectors have to do with anything).\n\n2. Many practical topics covered with practical assignments I will likely reference in the future.\n\n3. TAs and Professor were incredibly patient with students who do not understand the prerequisite math needed to get through proofs which for me was very important. The professor was at her office hours every week, which I haven't seen in any other courses I've taken\n\nCons:\n\n1. Lecture videos were not great. Prof Xie does have an accent and kind of reads of slides\n\nOverall, this class was great but it makes me wish I invested more learning the background math needed to truly grasp topics like optimization, MLE etc.. ",
                        "_createdAt": "2020-04-27T20:16:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_type": "review",
                        "workload": 10,
                        "_createdAt": "2020-04-26T04:20:23Z",
                        "_id": "external-import-ab55ea53-d62c-48b7-8e9c-c9b69e1363a1",
                        "body": "TL;DR Good course, just the right amount of difficulty to stay engaged.  Largely of review of ML models from the foundational courses, but goes more in depth in the math, to included proofs.  Course load was perfectly balanced, as all things should be. \n\nLonger version: My greatest criticism of the OMSA is that there's too much overlap between courses, and this class is no exception.\n\nThat said, the course does dive into the math a bit more, and many of the homeworks involved a fairly difficult math proof.  These multivariable/linear algebra proofs were the hardest part of the course for me. Thankfully, one of our TAs walked through these proof problems in his office hours which helped me a lot.  There were 7 homeworks, one due every two weeks (extended to 3 weeks once the COVID-19 pandemic started.)  We were also given one 1-week extension to use even before the pandemic started.  I think the bi-monthly rate is the perfect frequency of homework. \n\nBoth the class slack channel and Piazza were also very active and helpful (Slack tends to get faster responses from peers, but use Piazza of course for contacting instructors.)\n\nFor about the first half of the semester we were required to code the algorithms (clustering, PCA, Naive Bayes) by hand, no scikitlearn.  By the second half we were allowed to use these libraries for some of the more involved models such as random forests.  I thought this was a perfect balance.\n\nMoving on to the lectures: Prof. Xie's lectures can a little hard to understand at times due to the poor text transcription and her accent combined with the technical terms.  However, I still enjoyed them, and Dr. Xie herself is very active, friendly, and helpful on Piazza.  She was very accommodating to the COVID-19 pandemic, extending homework deadlines and announcing a curve on the course grade a week or two prior to the close of the semester. Obviously the COVID situation could be a one-off and she may not need to make such accommodations again, but I bring this up to prove that she's very reasonable in general.\n\nWe only had one exam, a cumulative, open book, open note final that I found relatively easy. It was a good representation of the material covered.  As long as you completed the homeworks, you should be fine.  \n\nIn summary, the coursework was well-designed, both in frequency (bi-monthly) and coverage of material.  The TAs also helped with the most difficult parts.  The course content is largely a review of models covered in ISYE 6501 and elsewhere, but you'll walk away with a better understanding of how the math works.  Dr. Xie is a great professor, and very engaged and committed to helping her students succeed.  5/5, would take again.\n \n\n",
                        "difficulty": 3,
                        "id": "external-import-ab55ea53-d62c-48b7-8e9c-c9b69e1363a1",
                        "created": "2020-04-26T04:20:23Z",
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-ef03a33b-719f-4eba-879e-2b8e51c52dba",
                        "_createdAt": "2020-04-02T15:24:37Z",
                        "_id": "external-import-ef03a33b-719f-4eba-879e-2b8e51c52dba",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "I did not like the way this course was taught. Being the one ML course in the OMSA program, I was very excited to sign up. Unfortunately as it turns out, I did not learn much from the lectures. \n\nPro's:\nThe professor and TA's are very lenient with grading, so it's not hard to get an A. \n\nCon's:\n\nWhile I'm well on track to get an A in this course, I don't feel like I truly learned much from the class. Most of the time, I check the videos to see what the topic is, try to watch the videos, get thoroughly confused, then move on to search for better lectures on the topic.\n\nThe lecture videos need some cleanup - some videos not in sync with slides (i.e. the prof's words in the video not matching what was being shown on the slide). \n\nHomework is hard, but I feel that it is hard only because I did not learn from the lectures. Each HW took me about 10-15 hours to complete, and required lots of google searches to understand the topic.\n\nThe lecture videos are 99% made up of the professor simply reading quickly through loads and loads of mathematical theory. A lot of times, I find myself staring at the slide and not knowing which part the prof is at. \n\n---------\n\nTo be clear, I don't personally dislike Prof Xie or the TA's. I think their hearts are in the right place. But I do think this class has a long way to go in terms of improvement.",
                        "difficulty": 4,
                        "course": null,
                        "workload": 20,
                        "created": "2020-04-02T15:24:37Z",
                        "_type": "review",
                        "rating": 2,
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        }
                    },
                    {
                        "id": "external-import-8566d4c6-121e-4c2a-9427-98a8e5197fcd",
                        "created": "2020-03-21T23:47:24Z",
                        "workload": 15,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester"
                        },
                        "difficulty": 3,
                        "_createdAt": "2020-03-21T23:47:24Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-8566d4c6-121e-4c2a-9427-98a8e5197fcd",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "body": "Really enjoyed the layout of the course. Professor Xie and her TAs were very helpful with the students to understand the material and help with any programming issues. They're really flexible with the course work and are very cognizant of student feedback. Since workload is a mix of math/stats theory and programming, TAs were flexible with what language you submitted your work (python, matlab, R, etc.)\n\nExams were open-book and take-home. I had a particular issue where I believed I was misgraded in one question of an exam, and the TA did give a proper regrade. They weren't easy but not impossible either. If you understand the content, you'll be in good shape. \n\nI did gain some proper insight into the content of the coursework, and I was able to pick up some programming things as well into my day job. Overall, I'd recommend this class if you're comfortable with learning theoretical math and its applications."
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "This was the first semester it was offered online so it did have some bugs….but overall not bad.  The TA’s did a great job and were very helpful.  Professor Xie (who has a heart of gold) is one of the few Professors in the program to have office hours and will work with the students to understand the concepts.  ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "created": "2020-02-25T19:05:33Z",
                        "_createdAt": "2020-02-25T19:05:33Z",
                        "course": null,
                        "workload": 15,
                        "_id": "external-import-6dae81b4-35d9-4940-aee4-a9dc5da847f6",
                        "difficulty": 3,
                        "rating": 5,
                        "id": "external-import-6dae81b4-35d9-4940-aee4-a9dc5da847f6"
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "_createdAt": "2020-01-02T19:16:12Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-80e96019-b191-46f2-bd2d-be32466d9ea9",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "rating": 5,
                        "created": "2020-01-02T19:16:12Z",
                        "course": null,
                        "_id": "external-import-80e96019-b191-46f2-bd2d-be32466d9ea9",
                        "body": "I had a lot of fun in this class. The homeworks and exams were set up well, with the intended purpose of teaching us how different algorithms work behind the scenes and/or giving us a better intuitive understanding of how they work. They were just challenging enough to be interesting, and in my opinion tended to be on the easier side. The homeworks also got easier as the semester went on. They let use whatever coding language you wanted; I (and I think most others) used Python.\n\nThe exams were both take-home open-note and very similar to the homeworks but easier. Grading was pretty lenient on all homeworks/exams. I thought the lectures were good but not great. I'm definitely more of a learn-by-doing person, and that's how this class was set up. You could go through the whole semester without watching a single lecture and probably get just as much out of it.\n\nThere were a couple math proofs on the first homework and on the final exam, but they weren't too difficult. I had never done a proof in my life and I was fine.\n\nOverall this was a fantastic class where I learned a lot and got a relatively easy A. My only complaint is I think I would've learned more had it been a little harder, but I probably should be careful what I wish for."
                    },
                    {
                        "id": "external-import-cce2ac1e-622d-4a4c-9b5a-4d845c581606",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "created": "2019-12-13T17:11:15Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "body": "Overall I loved this course. It gave great explanations and homeworks for concepts that I have often heard of in data science but didn't truly understand. You are asked to implement many algorithms yourself through homework and take home tests. There is some math and derivations but not too much. I believe that this course is a great introduction into Machine Learning concepts that goes a little deeper than other classes.\n\nThis class was primarily conceptual though and did not go into practical applications through projects. It is different from the CS ML class in that way. \n\nI highly recommend this class as it is the one I enjoyed the most thus far. Homeworks and tests are all take home and you have 2 weeks to do each. They took me 5 to 15 hours  to complete. The workload isn't very high for the class. Lectures are great and are given online. There are \"TA cohorts\" that students are assigned to and each cohort has their own office hours, making for plenty of office hour review sessions.",
                        "workload": 8,
                        "_id": "external-import-cce2ac1e-622d-4a4c-9b5a-4d845c581606",
                        "_createdAt": "2019-12-13T17:11:15Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "workload": 10,
                        "body": "This course really helped me appreciate underlying concepts behind machine learning algorithms by way of teachings in this course.\n\nThe assignments were very well prepared and made me REALLY learn, understand & apply the fundamentals behind ML techniques. \nMost of the assignments required researching and thinking about ideas taught in classes and not just spoon feeding and getting answers to set questions.\nSo the course may not be for you if you are not really willing to spend extra hours researching on high-level topics taught during the course. e.g. some of the assignments required implementing ML algorithms by your own code. \n\nBefore taking the course I had a black-box approach on ML algorithms but now my perspective is vastly different (or atleast IMHO)\n\nDuring the course, I even begun to like reading technical papers/articles on machine learning algorithms, something which I used to find very challenging before taking this course. I hope I am able to continue this in future.\n\nAlso I found TA team working very well under extreme deadlines, while being very proactive in solving/answering queries & concerns in a very professional and humble manner.\n\nFormally, I found this to accurately represent what the course was about (I took this from course syllabus only) - \"The course is designed to answer the most fundamental questions about machine learning: What are the most important methods to know about, and why? How can we answer the questions such as “is this method better than that one' using asymptotic theory”? How can we answer the question 'is this method better than that one' for a specific dataset of interest? What can we say about the errors our method will make on future data? What's the “right” objective function? What does it mean to be statistically rigorous?\"\n\nCourse consisted of 5 assignments (25%), 2 midterms (40%) and 1 Final (35 %).\n\nAll the assigments were open book and I faced no issues in completing them\n(I only took this 1 course in Fall 2019 maybe that helped as well)",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-6d589525-6642-48b7-873a-d85115dfbbab",
                        "created": "2019-12-12T19:20:41Z",
                        "course": null,
                        "_id": "external-import-6d589525-6642-48b7-873a-d85115dfbbab",
                        "difficulty": 4,
                        "_type": "review",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2019-12-12T19:20:41Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        }
                    }
                ],
                "rating": 4.159090909090909,
                "difficulty": 3.659090909090909,
                "workload": 14.113636363636363
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "computational-data-analysis-learning-mining-and-computation"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}