{
    "props": {
        "pageProps": {
            "course": {
                "name": "Statistical Modeling and Regression Analysis",
                "_rev": "959qsafI8uoLDPJecfV9yz",
                "id": "external-import-ISYE-6414",
                "created": "2022-07-05T23:23:15Z",
                "isDeprecated": false,
                "_updatedAt": "2022-08-24T17:45:44Z",
                "tags": [],
                "programs": [
                    {
                        "acronym": "AN"
                    }
                ],
                "codes": [
                    "ISYE-6414"
                ],
                "reviews": [
                    {
                        "course": null,
                        "workload": 12,
                        "difficulty": 3,
                        "_createdAt": "2024-08-12T04:33:14Z",
                        "id": "FYsk5S1Mp27IS8S7UwUGyx",
                        "semester": {
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19"
                        },
                        "_type": "review",
                        "_id": "FYsk5S1Mp27IS8S7UwUGyx",
                        "authorId": "9kzcfiS2THy16C9a+/vGVA==",
                        "created": "2024-08-12T04:33:14Z",
                        "rating": 3,
                        "_rev": "FYsk5S1Mp27IS8S7UwUGtq",
                        "body": "I took this course in the summer of 2024. My main suggestion is to change the grade weightage by giving more importance to the four homework assignments. This would really help reduce the pressure to perform well on just the two exams. Also, I have to mention that some of my classmates were really disrespectful to Dr. Serban and the TAs, which made the class pretty unbearable for those of us who were trying to focus and learn. Below are some of the comments:\n\n\"Amazing. We are a technology school and we have to grade the papers by hand. Absolutely NUTS. This class is the peak of amateur hour. COMPLETE JOKE\"\n\n\"Cry me a river - the instructor team signed up for the job. If they didn't want to spend their summer reviewing honorlock videos that's on them.\"\n\n\"Since the TAs took it and some managed it in under 75 minutes when can the videos of their session be released so we can see how they better organized themselves than we managed to?\"\n\n\"I am literally hoping summer to end now because of this nonsense !\"\n\n\"Very well pointed out an example of a good and sensibly structured exam:  CSE604\"\n\n\"Yeah total bullshit.\"\n\n\"Pathetic timelines for the exam\"\n\n\"Thats annoying AF!\"\n\n\"They definitely are - their silence speaks volumes.\"\n\n\"Academia is littered with educators like this and make it unattractive to prospective students\"\n\nSo do we really have to come on this forum to bash the exam and course again? \n\"Yes I would hope so. This forum is setup to …….check notes….. discuss the class and exams!\"\n\n\"I included have sometimes been unprofessional in my responses here.\"\n\n\"one of the threads too about some BS etiquette and using that to possibly remove students from the course.\"\n\n\"I request considering the option of requesting additional resources from the ISYE department to meet this minimum educational responsibility.\"\n\n\"Kindly ensure that we do not receive incorrect peer review grades because of inadvertent errors by the evaluators because of \"not easy to use\" format.\"",
                        "_updatedAt": "2024-08-12T04:33:14Z"
                    },
                    {
                        "semester": {
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z"
                        },
                        "created": "2024-08-11T20:09:44Z",
                        "_updatedAt": "2024-08-11T20:09:44Z",
                        "difficulty": 3,
                        "_rev": "WO6QCb0AdjGY7KsBRvZ3cA",
                        "_type": "review",
                        "id": "WO6QCb0AdjGY7KsBRvZ3g2",
                        "rating": 3,
                        "course": null,
                        "body": "I was part of the summer 2024 section for this course, and if you've read past reviews both on here and on reddit, you'll see that was a bit of a roller coaster. While I definitely think there's room for improvement in this course, and many of the gripes are legitimate, I wouldn't necessarily let those reviews scare you away from taking it depending on your situation. If your goal is to learn regression at a deeper level, this course will definitely provide you that, and I found the workload very light compared to other courses which also may be appealing to some. However, if you're looking for an easy A and care heavily about your GPA, the exams may make that difficult for some. \n\nStarting with the lectures, I didn't experience any issues with audio quality that others had mentioned. The professor has a thick accent, but I was mostly able to understand her and was able to refer to the transcripts if I couldn't make out a word. I also found the lectures to be pretty well organized/structured, as many of the modules follow a similar approach. Despite the chaos, it seemed many students on piazza agreed that they found the lectures informative. I will say that there are certain topics that she could explain better and did involve me having to google to understand it deeper, but I didn't find that to be a huge burden. Additionally, the amount of statistical properties thrown your way may be daunting at first, but it settles down, and you don't really need to understand the \"Why\" behind those properties to do well in the class. You can just write them down on your cheat sheet for the test questions on them. If you took simulation or the pre req statistics course you'll probably understand it better.\n\nAnother thing about this course that many don't seem to mention is the pacing. I took this in the summer and I still found the workload/pacing to be very light compared to other courses. There were four modules released every two weeks (three weeks for module 2), each with a homework. There was also no material released on exam weeks which was really appreciated. I was often able to get the videos and hw done in one week and then have the following week to either review the material or take a break from the course.\n\nThen there's the exams, and this is where the course could really use some improvement. It's 40% theory and 60% coding and people had legitimate gripes with both sections. As many have mentioned, the wording of some of the multiple choice questions seem to be designed to trick you. You may understand the concept, but the way the question is worded may make it hard to follow what it's actually asking. I think these should be improved, although thankfully it's less than half your exam grade. Through reviewing the lectures and making a detailed cheat sheet, I was able to score in the upper 80s and 90s on the two multiple choice sections so I think it's doable with sufficient preparation, but still not the best way to test people IMO. \n\nFor the coding portion, there didn't seem to be issues in past semesters but for whatever reason, this semester these exams were also flawed. My biggest gripe is that they don't allow open internet on these, so if you don't know how to code something and it's either not in the lectures or just hard to find, you're kind of stuck, and then subsequent questions are affected. Coming into this class with some background in R would be useful to ease the stress of issues like that, but mostly all the code should be available in the notes. I think making it open internet like in CSE 6040 is the best route forward to address this concern as coding in the real word is also open internet. The big issue with the midterm was timing as many people didn't finish. I barely finished but if you had trouble with your code at any point I think it would've been real difficult to impossible to complete this in time. They seemed to recognize their mistake and gave everyone 5 points back, and additionally offered an open internet replacement midterm if you wanted. This is the period when piazza got pretty nasty between the professors/TAs and the students, as you'll see plenty of mention of it on here and reddit. For the final, I didn't find the timing to be an issue but this is where I experienced a coding issue that wasn't covered in lectures. There was a data type issue that needed to be debugged and again open internet would've been really valuable here. Another gripe people had was the material covered was harder, as an algorithm that was lightly covered in lecture, but never in homeworks, showed up. I personally think anything covered in lecture is fair game and that question could be solved by referencing the lecture code. The scores on the final were also very low and they ended up curving the whole class by 5% in addition to the 5% midterm bump (A is 85+, B is 75+, etc). \n\nIn summary, I think there are some improvements needed in the exams such as more fair multiple choice questions, and open internet coding exams with sufficient time offered, but you'll definitely come out of this course with a deeper understanding of a very important topic. My best advice is to ignore the chaos, study the lecture notes and code thoroughly enough so that you feel sufficiently comfortable, and you'll be able to do well. If you're super worried about your GPA and don't want to experience the exam stress, then I also understand why someone would skip this and learn it elsewhere, but I truly believe doing well is possible with the right preparation.",
                        "_id": "WO6QCb0AdjGY7KsBRvZ3g2",
                        "_createdAt": "2024-08-11T20:09:44Z",
                        "workload": 7,
                        "authorId": "cRXz1sFin0M1pGkQUS9Ykg=="
                    },
                    {
                        "workload": 12,
                        "authorId": "OURQBV6RW/nYmubrd+kEYw==",
                        "_createdAt": "2024-08-08T04:32:04Z",
                        "course": null,
                        "id": "WO6QCb0AdjGY7KsBRipDco",
                        "semester": {
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19"
                        },
                        "_id": "WO6QCb0AdjGY7KsBRipDco",
                        "_type": "review",
                        "created": "2024-08-08T04:32:04Z",
                        "_updatedAt": "2024-08-08T04:32:04Z",
                        "difficulty": 4,
                        "body": "I am disappointed that GT continues to endorse a professor who does not appear to enjoy teaching. All quotes are from public Piazza posts by either Dr. Serban or her TAs.\n\n“… you will get 0 points, and there will be no exceptions.”\n\n“we will not provide samples or any additional support.”\n\n“What I would also suggest is that we’ve had within some Piazza threads a surfeit of external and deficit of internal blame attribution (for those of you interested in psychology) in pondering the open-ended question if I did not perform as well as I liked on the Midterm, what is the cause?”\n\n“Yes, it may be stressful to perform under time limits, but isn't this what you should expect from your job also? Don't you have timelines, deadlines and work cramped within short times to deliver for your job?”\n\n“There are several reasons we use timed exams. One is that the instructor team can review the honorlock videos. There are many situations when we need to do so. We have limited amount of time to review many hours of videos for several students.”\n\n“Third, a timed exam within a reasonable time doesn't drag the exam for hours. I don't think you (or at least some of you!) would want to spend hours at end for taking exams. I am sure you have better things to do than siting 4 hours to take an exam.”\n\n” every single TA takes the exam before it's released. I personally took it and it took me 75 minutes to complete and was very simple.”\n\n“If you want an apology from me personally for something, drop me a private post and I’ll probably extend you one (the probability is high). If you feel you need to apologize … I would suggest doing that, also privately. “\n\n“We review every Honorlock video in detail and can see exactly everything you do and say during the exam as well as everything that happens on your screen during the exam. We can verify every comment you say to us and check if it's correct or not very accurately using Honorlock.”\n\n“We (the instructor team) have been informed that we will need to submit such cases to the Office of Student Integrity, which will follow up with various warnings or disciplinary actions.”\n\n",
                        "_rev": "WO6QCb0AdjGY7KsBRipDYw",
                        "rating": 2
                    },
                    {
                        "workload": 30,
                        "course": null,
                        "body": "I think after all the exams and everything, I remembered the name of the Head TA - Olaoluwa Dami Alebiosu, better than any of the course content this summer.\n\nWill try to be as neutral as I can. The rest of the reviewers will probably express themselves better. ",
                        "_updatedAt": "2024-08-05T04:54:35Z",
                        "difficulty": 3,
                        "_createdAt": "2024-08-05T04:54:35Z",
                        "created": "2024-08-05T04:54:35Z",
                        "rating": 3,
                        "authorId": "CEIGYVyIqPsZQIhIgvrwmQ==",
                        "_type": "review",
                        "_rev": "2IKTrcBTPXc7cMTx6xnlgY",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME"
                        },
                        "_id": "2IKTrcBTPXc7cMTx6xnllp",
                        "id": "2IKTrcBTPXc7cMTx6xnllp"
                    },
                    {
                        "workload": 18,
                        "course": null,
                        "authorId": "R18Z4PD1uA4Ul+v9vbqxPx8wIfcOGIy7N4hHtNtdIDY=",
                        "_updatedAt": "2024-07-28T08:53:07Z",
                        "difficulty": 5,
                        "id": "nAphTJxjOsHb6vxQhw0yT8",
                        "_rev": "nAphTJxjOsHb6vxQhw0yPq",
                        "_type": "review",
                        "created": "2024-07-28T08:53:07Z",
                        "_id": "nAphTJxjOsHb6vxQhw0yT8",
                        "body": "The course content is great however the exams are really bad. They are literally designed to trick you, super random sentences from the lecture. \n\nThe coding exam is terrible: All the HWs you do have nothing to do with the final exam. + You are expected to submit HTML; if you fail to do that they will take 15% of your grade. They want HTML to grade the assignments easily but sometimes we face problems submitting HTML. \n\n\nNo words can describe how I am disappointed in this course. I wish I never took. And I advise anyone not to take this course unless  you don't care about your grade because the grade that you take in this course doesn't reflect your knowledge. \n\nAgain: PLEASE do NOT take this course. I had course regression classes before this one, I thought this would be little easier. But again, the grade that you take from this course doesn't reflect your actual knowledge. \n\n\n",
                        "_createdAt": "2024-07-28T08:53:07Z",
                        "rating": 2,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME"
                        }
                    },
                    {
                        "created": "2024-07-27T19:41:20Z",
                        "_createdAt": "2024-07-27T19:41:20Z",
                        "workload": 8,
                        "rating": 2,
                        "body": "I echo a previous review that this course about the tests being more about testing your ability to catch trickily posed questions with single inconspicuous word changes intended to trip you up- rather than exhibit a grasp of the fundamental content. I found the lecture structure confusing because the content would be repeated in a new slide, and you are left asking the question- wait- how is this different than before? Is it building on top of previous concepts, or is in a different context? That's for you to figure out- and seek out material online to make things clearer for you. \n\nThe one positive piece was ample code examples to get a hang of how to implement these models. ",
                        "course": null,
                        "authorId": "jkLSZqNuesHSn2QYNUCqGg==",
                        "_updatedAt": "2024-07-27T19:41:20Z",
                        "_rev": "9YUFVueJbrXoXfaqkbhiQm",
                        "id": "9YUFVueJbrXoXfaqkbhiUR",
                        "_type": "review",
                        "semester": {
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z"
                        },
                        "difficulty": 4,
                        "_id": "9YUFVueJbrXoXfaqkbhiUR"
                    },
                    {
                        "_rev": "d6xkJgk0Tc3xRKbZFFXrAD",
                        "rating": 2,
                        "authorId": "BG+tJP2fUCDLR8UJSpTNvw==",
                        "_type": "review",
                        "course": null,
                        "workload": 7,
                        "_updatedAt": "2024-05-10T03:39:33Z",
                        "id": "d6xkJgk0Tc3xRKbZFFXrBh",
                        "_createdAt": "2024-05-10T03:39:33Z",
                        "_id": "d6xkJgk0Tc3xRKbZFFXrBh",
                        "body": "The only advantage of this class is that it covers the basics of regression analysis. THIS CLASS SHOULD BE FUNDAMENTALLY REDESIGNED. First of all, the assignments, the quiz format requires English reading comprehension rather than a fundamental understanding of regression analysis. Also, the coding assignments are not very long and not difficult, but since they are mutually graded by three people, there is a possibility that you will receive a grade that you cannot understand.\n\nThe biggest problem is the exam. Like the assignments, the quiz format depends on English reading comprehension, and you must pay attention to the small differences in each word. This class is a regression analysis class, not an English reading class. Also, the coding exam basically only requires copying and pasting sample code, so it is not really an exam. The exam system is also a problem, as you need to upload an HTML file within the time limit, but even if you are unable to output the HTML file due to some trouble such as Rstudio crashing, you will be penalized if the time limit is exceeded, so there is an element of luck involved. Another problem is that the exam includes parts that are not covered in the assignments or practice questions. You are not allowed to search the Internet, so if you don't know the code, you're stuck there. In this case, it would be better to make it an open internet exam like CSE6040 Computing for Data Analysis, or to replace the coding exam with a project submission.\n\nAgain, THIS CLASS SHOULD BE FUNDAMENTALLY REDESIGNED. You should know that your grade in this class does not necessarily reflect your understanding of regression analysis. Unlike this class, ISYE6644 Simulation and Modeling has clear lecture slides, and the assignments and exams are in quiz format but still test essential understanding, making it a world of difference. I hope that the design of this class will be fundamentally improved by following the example of ISYE6644.",
                        "created": "2024-05-10T03:39:33Z",
                        "semester": {
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z"
                        },
                        "difficulty": 3
                    },
                    {
                        "body": "Testing methods of this course are outdated - \"True or False\" Quizzes, which are based on rote memory of concepts, is irrelevant in learning. Poor course delivery, even though the concepts/content covered are good.",
                        "rating": 1,
                        "_updatedAt": "2024-05-04T11:53:21Z",
                        "id": "kxVXHSgulMmyM4LLrYZboe",
                        "created": "2024-05-04T11:53:21Z",
                        "_type": "review",
                        "difficulty": 1,
                        "_id": "kxVXHSgulMmyM4LLrYZboe",
                        "_createdAt": "2024-05-04T11:53:21Z",
                        "authorId": "FuClN+3HhNzjDekuiFj83w==",
                        "semester": {
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z"
                        },
                        "_rev": "kxVXHSgulMmyM4LLrYZbm9",
                        "course": null,
                        "workload": 12
                    },
                    {
                        "_rev": "Pm4H4xdFhHJgzHn4ZjpK6u",
                        "workload": 10,
                        "body": "Seeing so many negative reviews here, I want to add my 2 cents. I loved this course. My background in statistics was really weak and there's something really simple and clear in Dr. Serban's approach to the material. I feel like I have a much much much clearer understanding of hypothesis testing and inferential statistics than I've ever had. Because of the structure of the assignments and the demands of other courses I was taking, I had to approach some assignments/exams to just try to get the good grade even if I didn't quite grasp all of the concepts, but I wished I could devote more time to some of the lectures, example code, and studying for this class as I believe a lot of the concepts of goodness of fit, model assumptions, statistical tests, etc would be useful for job interviews.\n\nTAs were super fair, revised exams grades when question wording was unclear or could go multiple ways, strict about hard deadlines, but understanding with me when I made a submission error.\n\nWish I could have dedicated more time to this course. I really enjoyed it.\n\nThe tests were challenging and I failed the first one (!), but once I better understood how to study, set up my cheat sheets (allowed for the closed book section), and set up my notes for the open-book section, I did great in the course. Another grade-saving tip: there are \"quizzes\" that you have to complete as part of the homeworks, you can take as long as you want up to the deadline and close and re-open the quiz as long as you don't submit; I filled this out at the same time that I watched the videos. So I knew what to look for before I started a video.",
                        "_updatedAt": "2023-12-18T15:44:04Z",
                        "_createdAt": "2023-12-18T15:44:04Z",
                        "id": "Pm4H4xdFhHJgzHn4ZjpKAI",
                        "course": null,
                        "_type": "review",
                        "created": "2023-12-18T15:44:04Z",
                        "rating": 4,
                        "_id": "Pm4H4xdFhHJgzHn4ZjpKAI",
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "authorId": "wy0OfLVE7VHgo0sBgulk4Q==",
                        "difficulty": 4
                    },
                    {
                        "course": null,
                        "_createdAt": "2023-07-23T21:05:04Z",
                        "workload": 8,
                        "_id": "2i4ajiwomZ7VzWFjXiBqfW",
                        "rating": 1,
                        "_updatedAt": "2023-07-23T21:05:04Z",
                        "body": "Fairly simple concepts turned into a quagmire of confusion. Required class in a sense that it is one of the classes you can take for your statistical/math related courses. It covers actually pretty important topics for Regression and should be a staple class in OMSA unfortunately the professor's lectures and course material are severely lacking. As far as the concepts discussed? 10/10, class itself? 1/10. Difficulty? 3/10, as long as you refer to the quizzes and take notes from the video transcripts you will be fine. Practice a lot on the homeworks as well.",
                        "id": "2i4ajiwomZ7VzWFjXiBqfW",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z"
                        },
                        "created": "2023-07-23T21:05:04Z",
                        "difficulty": 1,
                        "_rev": "2i4ajiwomZ7VzWFjXiBqcs",
                        "_type": "review",
                        "authorId": "qMQ3xZThRVxmvApLTd13sw=="
                    },
                    {
                        "id": "bKSRXDuTtNOB1Cc928QakZ",
                        "body": "Worst class of the 5 classes I've taken.  The T/F portion relied on memorization of useless/arcane information.  Do we really need to memorize the formula for df for each test?  The underlying distribution for estimators? Why?  Also, the questions were very misleading.  The coding portions ask you to do things in R you weren't expecting.  If you are new to R, you may suffer.  All in all, I did not learn a single thing about regression.  I memorized stuff that will soon be forgotten, wasting my time and money.  Shame on you, Georgia Tech",
                        "rating": 1,
                        "_updatedAt": "2023-05-11T20:57:01Z",
                        "difficulty": 4,
                        "created": "2023-05-11T20:57:01Z",
                        "_rev": "bKSRXDuTtNOB1Cc928QahC",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN"
                        },
                        "workload": 10,
                        "_id": "bKSRXDuTtNOB1Cc928QakZ",
                        "_createdAt": "2023-05-11T20:57:01Z",
                        "course": null,
                        "authorId": "Z8TlWsSKRBmlMYMuCpR+dA==",
                        "_type": "review"
                    },
                    {
                        "_updatedAt": "2023-05-07T09:01:08Z",
                        "created": "2023-05-07T09:01:08Z",
                        "rating": 1,
                        "_id": "va4OapxbtwGpPko6Q0NU3l",
                        "_type": "review",
                        "workload": 8,
                        "_rev": "va4OapxbtwGpPko6Q0NU1S",
                        "course": null,
                        "authorId": "9YgQ6PHScp/pLn+aRNWnyA==",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "body": "Just take a different class, it's not worth your time.\n\nIt isn't particularly difficult, but the prior comment from December is correct and the exams frustratingly feel like they're designed to force you to memorize the obscure intention behind the professor's wording rather than just understanding the problem at hand. Again, not hard, just frustratingly tedious without clear learning in mind. \n\nThe TA's also give inconsistent answers to the mistakes, and you never really see the professor for the course. I feel I learned nothing but rote memorization related to regressions, and it's structured in a very dry way where you work with regressions at the same level that you do in the intro courses.\n\nI don't feel like I gained anything out of this course. Like MGT 6203, I feel this class needs to be completely revamped or just dropped and I want my money and time back for it.",
                        "difficulty": 3,
                        "id": "va4OapxbtwGpPko6Q0NU3l",
                        "_createdAt": "2023-05-07T09:01:08Z"
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx"
                        },
                        "id": "ojGpuoLqWcC94EPn3e2AzR",
                        "_updatedAt": "2022-12-20T23:18:57Z",
                        "_id": "ojGpuoLqWcC94EPn3e2AzR",
                        "authorId": "/cRQQTXfbOQswHO6sD6b2w==",
                        "rating": 1,
                        "course": null,
                        "body": "Worst class I've taken in OMSA so far. Dr. Serban's video lectures are full of mistakes. Multiple choice portions of exams are full of \"gotcha\" language, double negatives, and \"always\" this or \"never\" that type questions. Practice exams do not resemble content on actual exams. I have no idea what I actually paid for with this course.",
                        "created": "2022-12-20T23:18:57Z",
                        "difficulty": 2,
                        "workload": 10,
                        "_createdAt": "2022-12-20T23:18:57Z",
                        "_rev": "ojGpuoLqWcC94EPn3e2Avg"
                    },
                    {
                        "_type": "review",
                        "_updatedAt": "2022-12-17T19:36:25Z",
                        "id": "j7jxVlxURPwTRn3W21pmEc",
                        "_createdAt": "2022-12-17T19:36:25Z",
                        "body": "Unfortunately, this course is a huge disappointment.  Such massively important subject matter in analytics is given such a bad representation for a graduate-level class by ISYE6414-OAN.  \n\nAll the comments about context, e.g., an overwhelming number of typos in the lecture materials, and poor delivery, e.g., a lack of structure or cohesiveness in the actual lectures, are sadly true.  However, that is pretty much the norm for the GAT OMSA program and its extremely dated material.  Four years in a big deal at an Institute of TECHNOLOGY even if it is the topic of regression. So many pertinent examples from the recent timeframe that could bring the topic to life.\n\nWhat I must emphasize is how extremely inadequate the content is for this course.  Basically, the course is simple regression, multiple regression, logistic regression, and Poisson regression.  You could absolutely argue that simple and multiple regression are more than half of the material.  This just does not make sense for me.  Those are certainly undergrad topics and were also heavily emphasized in the earlier catch-up course requirements (ISYE6501 and MGT6203) for the program.\nThere are some importance nuances to Poisson regression, but where are mixed models and random effects found in other graduate programs?  They are crammed into a meaningless optional series of slides to download called Module 6.  How about applications leveraging Bayesian techniques to generate regression models.  Where is the Big Data?  These are what all the AI/ML professionals are talking about with real world problems in 2022.  These are also nowhere to be found in the curriculum.\n\nGiven the simplified course material, there appears to be a need to somehow deflate grades.  Therefore, the evaluations leverage the \"tricky wording\" or \"hectic programming\" testing that others have already explained.  Are true/false questions leveraging double negatives a realistic assessment for a graduate program that is meant to create data science/analytics professionals?   This template is designed for learning how to game the tests as opposed to acquire skills and know-how for the workplace.\n\nAgain, ISYE6414 is a massive disappointment given the supposed prestige of Georgia Tech. Start fixing that by getting a decent textbook (which there are many) and teach from that structure.  Then make the programming work part of a structured lab requirement as well as a series of examples in the lectures.  Academic staff and the teaching assistants should be involved in these labs.  There would be actual participation in the office hours.  I think students would also learn something to take forward.\n\nThis class is isolated from the overall \"interdisciplinary\" program with no plan on how it fits other than being an important topic.  Where is there one single reference to any other course?  That says it all.        \n",
                        "authorId": "idzxyHjQLb2yEnX6501PNg==",
                        "course": null,
                        "difficulty": 3,
                        "_id": "j7jxVlxURPwTRn3W21pmEc",
                        "semester": {
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "created": "2022-12-17T19:36:25Z",
                        "_rev": "j7jxVlxURPwTRn3W21pmBv",
                        "workload": 6,
                        "rating": 1
                    },
                    {
                        "_updatedAt": "2022-12-15T03:03:28Z",
                        "_rev": "j7jxVlxURPwTRn3W1vbDuU",
                        "_id": "j7jxVlxURPwTRn3W1vbDxB",
                        "id": "j7jxVlxURPwTRn3W1vbDxB",
                        "course": null,
                        "_type": "review",
                        "authorId": "Jp6LPDDpZQ6O6BKJyCgsmw==",
                        "body": "I learned a lot in this class! I liked the very structured layout of the course, and the steady progression of the course work. I thought the homework was a reasonable amount of work, to learn the materials. \n\nThe course really needs some improvements in the lectures. They are hard to follow, and I think that they can be made with clearer audio quality. It's a bit absurd to have to use the transcripts with the video. I would much rather just have a textbook to read. In fact, I did rent some so that I could study. \n\nAdditionally, the true/false questions and the multiple choice can sometimes be unclear, and open to interpretation. If the team continues to use the sorts of questions, I would suggest keeping these focused on more overarching ideas, instead of nitty-gritty details. I think this class would be better served by a different testing methodology. The coding sections seem to be pretty good overall, but I think the questions should be open ended as opposed to MC or T/F.",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "_createdAt": "2022-12-15T03:03:28Z",
                        "difficulty": 2,
                        "rating": 3,
                        "created": "2022-12-15T03:03:28Z",
                        "workload": 3
                    },
                    {
                        "_createdAt": "2022-12-12T16:59:41Z",
                        "created": "2022-12-12T16:59:41Z",
                        "rating": 5,
                        "course": null,
                        "body": "Man, some of the reviews are surprising, but I tried to put myself in the shoes of someone who is still relatively new to the program. I think, had I taken this class early on when I was still getting used to R, I would have struggled with the tests. I am in the latter half of my time at Georgia Tech in the Analytics track, and I found this class to be one of the best I've seen. \n\nFrom a pedagogical perspective, Dr. Serban is the best I've had. It is clear from the layout of the course and the layout of each homework assignment that she is trying to teach you the proper steps to go through to complete a regression analysis. I think her teaching is so clear and step-by-step that I have all her transcripts and slides saved to refer to when I want to review them. Dr. Serban goes through each part of regression analysis so you understand what every aspect is, how it's calculated, and why it is important. \n\nIt is true, tests make up 85% of the class, but I understand why. The homework assignments are literally copy/paste from lecture notes. You're just applying what you've learned. She gives the exact code that is necessary to complete the assignments. Consequently, it is easy to see why the tests make up so much of the grade. Tests for Fall 2022 were 40% closed book and 60% open notes (not open internet). 60% of the test was coding through a dataset. You could have all your old homework assignments printed out, all her lecture notes, all the slides. Just no internet. \n\nI would agree that the closed book portion (true/false and multiple choice) was difficult, often referring to minutia in the lectures, which I learned after the first test. First test I earned a 32/40 on the T/F, MC. Second was 39/40.  The final is comprehensive but skewed towards the content covered between the last midterm and the final. ",
                        "_updatedAt": "2022-12-12T16:59:41Z",
                        "difficulty": 3,
                        "id": "r3d1aiqzQ9Ksc47oCOovFz",
                        "_rev": "r3d1aiqzQ9Ksc47oCOovCD",
                        "_type": "review",
                        "_id": "r3d1aiqzQ9Ksc47oCOovFz",
                        "authorId": "nyvbgLPSSRtY+wRtwj9Lyw==",
                        "workload": 8,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "created": "2022-12-12T00:50:22Z",
                        "semester": {
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z"
                        },
                        "_id": "RKayskk75aI0pbjX1j6hAb",
                        "rating": 2,
                        "authorId": "D2x+aCsqhJBwgUXFFOtnpA==",
                        "difficulty": 2,
                        "course": null,
                        "workload": 5,
                        "_updatedAt": "2022-12-12T00:50:22Z",
                        "_createdAt": "2022-12-12T00:50:22Z",
                        "id": "RKayskk75aI0pbjX1j6hAb",
                        "body": "I've come to realize that it's either you love 6501 and can't stand 6414 or you can't stand 6501 and love 6414. I am the former. I aced 6501-- the material was laid out perfectly. The exams, while tricky sometimes, made and sense and I was always able to figure out what trick Dr. Sokol was trying to pull. 6501 and I meshed well.\n\n6414 however...is a different story. The lectures were awful. I simply read the transcripts and if I was on a crunch for time, I would watch the lecture videos on 1.5x. This was not the issue for me. For me, I could not stand the exams. I would read the transcripts, take notes, and make and study flashcards. I took the practice exams and knowledge checks and reviewed why I got some answers wrong. I would take my time taking the exams and without fail, I would always score around a 29/40. The exam questions are tricky but unlike 6501, they test on small details as opposed to overarching theory. This led me to constantly test poorly even though I fully understood the material. I found this extremely frustrating and quite demoralizing. \n\nOverall, the class is useful. The topics are interesting and definitely important to know. I wish the exams could be revamped to test more theory and less specifics and semantics. ",
                        "_rev": "RKayskk75aI0pbjX1j6h5l",
                        "_type": "review"
                    },
                    {
                        "_rev": "kbAyqBdRd6lLWxzYV2rX3E",
                        "_id": "kbAyqBdRd6lLWxzYV2rX7j",
                        "created": "2022-11-02T01:11:42Z",
                        "course": null,
                        "authorId": "zMIO/nn4YR8jwmUUVHJqmA==",
                        "_updatedAt": "2022-11-02T01:11:42Z",
                        "_createdAt": "2022-11-02T01:11:42Z",
                        "id": "kbAyqBdRd6lLWxzYV2rX7j",
                        "rating": 2,
                        "workload": 7,
                        "difficulty": 4,
                        "body": "Disclaimer: I'm from a non STEM undergrad, this course is likely a cakewalk for anyone who had significant math exposure in undergrad.\n\nDifficult only because the exams are very disjointed from the classes and the homework assignments. Professor Goldsman is nice, and he genuinely seems to care about his students, but the material he teaches and the homework assignments are more focused on R, but the exams suddenly go into detail for proofs and calculus that are neither discussed in class nor mentioned in the homeworks.",
                        "_type": "review",
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "semester": {
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "course": null,
                        "rating": 4,
                        "workload": 7,
                        "_id": "0afsBMj0Y69zTe9IVaczda",
                        "_rev": "0afsBMj0Y69zTe9IVaczZg",
                        "body": "Pros:\nI really enjoyed this class. I actually feel like it should be a required core class, because truly understanding regression analysis will really help you to understand a lot of the other courses in the program. The homework really reinforces the lectures, and the exams were pretty fair, if not a bit tricky sometimes with the wording. \nCons:\nDr. Serban speaks at breakneck speeds. I had to listen to the lectures at .5 speed to understand, and just ended up reading the slides and transcripts. The lectures also aren't very engaging, but there is a ton of information in them, so reading the transcripts and slides is very useful.",
                        "difficulty": 2,
                        "_updatedAt": "2022-08-30T13:38:00Z",
                        "id": "0afsBMj0Y69zTe9IVaczda",
                        "_createdAt": "2022-08-30T13:38:00Z",
                        "_type": "review",
                        "authorId": "iOWRAO0grwcHqvrXDMBjrg==",
                        "created": "2022-08-30T13:38:00Z"
                    },
                    {
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "id": "zXCRg2R6GuoOVXI921m1nL",
                        "authorId": "+TLlhMaVp/ThdsSdOgScig==",
                        "created": "2022-08-20T04:32:52Z",
                        "rating": 2,
                        "_updatedAt": "2022-08-20T04:32:52Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2"
                        },
                        "workload": 12,
                        "body": "I have mixed feelings on this class. I really wanted to like it - the content is interesting to me and I see a lot of applicability to use it in my job, but I thought it was poorly taught. \n-The videos are know to have had terrible sound quality for years, but are never updated\n-The lectures are uninteresting and presented without real explanation as or intuition as to how they compliment each other\n-I found the TA's to be frustrating in that they would take a while to answer, would answer questions with other questions (unhelpful), or mark student concerns/questions as \"resolved\" when the student didn't think they were be resolved. \n-The 2 tests accounted for 85% of your entire grade, but the homework and quizzes are quite time consuming. I felt like those should have been worth at least 25% of the grade due to the time commitment\n\nIf you're up for teaching yourself the material with youtube/statquest/penn state among others, I think you'll like the topic, but don't get your hopes up for an engaged teacher or enjoyable lectures. \n",
                        "_id": "zXCRg2R6GuoOVXI921m1nL",
                        "_createdAt": "2022-08-20T04:32:52Z",
                        "_rev": "zXCRg2R6GuoOVXI921m1lk"
                    },
                    {
                        "created": "2022-05-09T04:49:44Z",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-f277bf42-f85e-444c-aedc-07e948743417",
                        "_type": "review",
                        "workload": 6,
                        "id": "external-import-f277bf42-f85e-444c-aedc-07e948743417",
                        "difficulty": 2,
                        "_createdAt": "2022-05-09T04:49:44Z",
                        "body": "Easy, enjoyable class. Much of the content was familiar if you've already taken ISYE 6501, but this class does go far deeper into the math and assumptions behind the models. I almost never watched the lecture videos, instead I would download the slides and transcript and read along + take notes that way. Very easy to do well on the coding sections of HWs and exams, multiple choice is harder but weighted lower. For exams, I was generally able to ace the coding sections and get ~80 to 85% on the MC (with pretty minimal effort into studying) and secured an A in the class.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1"
                        },
                        "course": null
                    },
                    {
                        "workload": 8,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-3ca20c8b-55de-42f1-bcf9-e999ab7b1d45",
                        "created": "2022-05-07T20:41:22Z",
                        "difficulty": 3,
                        "course": null,
                        "_id": "external-import-3ca20c8b-55de-42f1-bcf9-e999ab7b1d45",
                        "_createdAt": "2022-05-07T20:41:22Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "This course has a bad rap, undeservedly in my opinion. \n1. People complain about the peer grading, but this class has a specific rubric to follow, unlike prior courses such as ISYE 6501 where the difference between a 100 and a 90 is a subjective \"did this student appear to go above and beyond\". This is an improvement.\n\n2. Another complaint is the unfair MC. If English is not your first language, I can take these complaints legitimately. Otherwise, MC is 40% of the tests, meaning you can get a 75% on your MC section and still get an A on the test. In practice this is missing 6-7 questions out of 25-30. This is DOABLE. Those who complain about MC tanking their grades probably failed easy parts of the coding section and are looking for excuses.\n\n3. The Coding Sections. First MT, I finished with 2 hours to spare, Second MT w an hour, Final w an hour to spare. There are no gotchas. If you download the coding examples freely available in the documents section of Canvas and are comfortable with using ?function in R/thinking on your feet, you should be able to get close to a 95-100 on these sections.\n\nTo conclude, don't be scared by the reviews you may see here. The course is pretty good, not perfect, but certainly LIGHT YEARS better than the disaster that is 6501.",
                        "rating": 4
                    },
                    {
                        "_createdAt": "2022-05-07T18:45:54Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "course": null,
                        "difficulty": 3,
                        "rating": 1,
                        "workload": 9,
                        "body": "A course where you will feel lost from the beginning, the lectures are not good and the exams do not show your knowledge of the subject, do not waste your money with this course.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-42bde6ae-afe8-4d1c-80ee-76a45253b8aa",
                        "created": "2022-05-07T18:45:54Z",
                        "_type": "review",
                        "_id": "external-import-42bde6ae-afe8-4d1c-80ee-76a45253b8aa"
                    },
                    {
                        "id": "external-import-15edd7f5-633d-48bd-b9be-21c6a51cf1ec",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "_createdAt": "2022-05-06T14:43:06Z",
                        "workload": 6,
                        "body": "To those that hated the exams because it seems to be poorly written...\n\n# Congratulations, you've been \"Serbanated\".\n\nThis exam teaches us how to be street-smart, and to be able to think critically, not just book-smart - something that you can memorize and regurgitate - that's (ironically) true for B-track classes. \n\nWelcome to the *art* of the Analytics.\n\nAgree with the below reviewers that this class should be replaced in lieu of MGT 8803. ",
                        "created": "2022-05-06T14:43:06Z",
                        "rating": 5,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-15edd7f5-633d-48bd-b9be-21c6a51cf1ec"
                    },
                    {
                        "_id": "external-import-c0cbef81-6b17-4959-bf68-588104bc7dfb",
                        "body": "**tl:dr** course is NOT THAT BAD, folks just need to step up their game. Im sorry but it is the truth. \n\nBefore I took this course, I read the reviews here and I was mortified by what I read, so going into the course, I was worried. \n\nNow, it is a shame that this course gets as much hate as it does because it is not that bad. As an analyst at a big bank, I've got to be quick on my feet and new learn things as the need arises so when I think about the pacing of this course I found the material pacing to be pretty doable (compared to a course like ISYE-6501 where its just material in and material out week after week). This gave me enough time to actually go in-depth a little bit and understand more about the different topics like SLR, MLR, Stepwise, and the various Var Selection techniques. Seriously, they should do away with MGT-8803 as a mandatory course and swap it out with this one. \n\nPros:\n1. Good pacing (sometimes too good, could be slightly sped up)\n2. Exam questions were fair (seriously, compared to Sokol's questions, Serban's were pretty tame and not that tricky, just have to read carefully and think critically, after all this is a graduate level course in Analytics)\n3. Coding section (not too difficult if you have experience in programming especially in R)\n4. FANTASTIC TAs. I must've lucked out and had a great group of TAs because they were awesome, and knowledgeable.\n(Seriously, one guy asked a lot of repetitive questions that could've been searched back in the notes, but the TAs were still patient and answered him. This isn't a bad thing as it provides an opportunity for other learners to review the content so shoutout to him )\n5. Good balance of homeworks and knowledge checks \n\nCons:\n1. Coding sections of the exam were too long. Not difficult, just long and tedious. \n2. I will side with everyone here and say that the videos were indeed very dull. Read the transcripts side by side with the powerpoints and review the powerpoints as you prep for exams. \n\n\n**Disclaimer: I come from an Econ/stats background where two of my undergraduate courses were heavily focused on Statistics and Econometrics**\n\n",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-c0cbef81-6b17-4959-bf68-588104bc7dfb",
                        "created": "2022-05-06T14:09:18Z",
                        "difficulty": 1,
                        "workload": 10,
                        "course": null,
                        "semester": {
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2022-05-06T14:09:18Z",
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "_id": "external-import-b946cab9-fab5-43b9-bc7a-cf19e5f0c11f",
                        "body": "A lot of strong criticism of this course, and my thought the entire time was \"this should be mandatory for this program.\" I think this provides a very strong foundation of concepts that are quickly reviewed or glossed over in other courses. I understand the frustration on wording things, but in business settings, you need to be able to adapt and answer questions no matter how they are presented to you. \n\nI do think the material was dry at times, but the homeworks pulled no punches, they were straightforward and if you understand the material, and can write a little bit of R, I think this course is very fair and should be taken by everyone.\n\nMy biggest recommendation is that people save this for the Summer term as taking it in the spring actually felt like there were \"dead\" zones of material. I think it would be perfectly paced to take in the summer and I wish I would have rearranged my courses to accomodate for that. ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_createdAt": "2022-05-06T13:11:50Z",
                        "workload": 7,
                        "id": "external-import-b946cab9-fab5-43b9-bc7a-cf19e5f0c11f",
                        "created": "2022-05-06T13:11:50Z",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_type": "review"
                    },
                    {
                        "workload": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2022-05-04T16:33:13Z",
                        "id": "external-import-c769e907-525a-4323-8f81-be63af800542",
                        "created": "2022-05-04T16:33:13Z",
                        "body": "Like what others said, the material is easy, I have learnt all the knowledges before. The key for success (A) is to be very good in English, so when there are tricky wordings, one has higher chance to figure it out. The wording game has been played everywhere in this course, I felt that the material is too easy that everybody could get an A, so there has to be a way to distinguish students, and testing proficiency of English become the solution. \n\nThe way of wording games are for example, use fancy word for basic yes/no ideas, so if you don't know the fancy word (most none native speaker), too bad. T/F question of if XYZ should be blue not red, where in fact XYZ does not exist in the first place, so answer is False... Multiple choice questions asking to select the True ones following another question asking to select the False ones and the very next question will switch to select True ones. Well, it is the students' responsibility to read the questions carefully, but, to me, I felt this should not be played with Master's students... I'd rather have some essay questions, or have some projects to work on.\n\nI'm expecting an A for this course, it does systematically brushed through the regression models, especially the assumptions and Gof parts of them. But I felt it could be a much better course than what it is now.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "_id": "external-import-c769e907-525a-4323-8f81-be63af800542",
                        "difficulty": 2,
                        "rating": 1,
                        "course": null
                    },
                    {
                        "created": "2022-04-29T15:18:49Z",
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "body": "Exams are truly poorly written. You can understand the material and regression but still miss questions because of the way the test is written. I found myself always having to think of cases in which certain questions were/weren’t true. They are asking true or false questions for things that should really be essay questions. \n\nThe test don’t really test on knowledge or whether you actually learned anything, they are more so testing on whether you memorized the exact wording in the video. Video quality are really bad as well. I think the class needs an entire reboot.",
                        "_type": "review",
                        "_createdAt": "2022-04-29T15:18:49Z",
                        "_id": "external-import-c90c5c57-bac0-4453-9240-2975e648b672",
                        "id": "external-import-c90c5c57-bac0-4453-9240-2975e648b672",
                        "rating": 1,
                        "course": null,
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "difficulty": 2,
                        "_createdAt": "2022-04-23T15:48:51Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 2,
                        "body": "Really bad class. I learned way more about regression in DMSL and 6501 than I did in this class. The actual content isn't hard, but the lectures are pretty much useless and the tests are unfair. Past students have compiled all the lectures into a single Google Doc and use that instead of watching the lectures.\n\nWith regard to the tests, a lot of the questions are \"gotcha\" questions. As a simple example, a T/F question might say something like \"Logistic regression is an unsupervised algorithm for classification problems.\" The answer being false, since it's supervised. This is not an actual or hard example, but the point being is that the questions will often hinge on a single word, so you must read very carefully - and if English is not your first language, good luck.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 10,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "id": "external-import-98841d4c-20ea-4ac2-9977-8f1a25563239",
                        "created": "2022-04-23T15:48:51Z",
                        "_type": "review",
                        "_id": "external-import-98841d4c-20ea-4ac2-9977-8f1a25563239"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "difficulty": 2,
                        "created": "2022-04-22T02:55:45Z",
                        "_id": "external-import-b1cab283-5768-4e94-9737-ef272c858beb",
                        "_createdAt": "2022-04-22T02:55:45Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "body": "I find the previous reviews of this course to be a little unfair. The lectures can be dry, and the audio quality is low, but people need to get out of here with saying stuff like \"unwatchable\" or \"unlistenable\". The hyperbole says more about the reviewer than the class itself.\n\nThe content of this class is exactly what you need for a regression class. They explore the more frequently used GLMs, explore the assumptions & the statistical underpinnings, and you apply these concepts in R. Pretty straightforward. If you are looking to become, or are working as a corporate data scientist, I consider these topics a must. My biggest problem with the class is that it doesn't get into more advanced topics in regression.\n\nThe course is not particularly difficult: if you complete the homeworks the open-book examinations should be straightforward. If you take your time with the self-assessments the closed-book exams should be manageable. I think the biggest complaint people have with the closed book is that the questions attempt to \"trick\" you by leading to a false solution. If English isn't your first language I sympathize, otherwise I think this is par for the course with a university-level exam. Read each question carefully.",
                        "id": "external-import-b1cab283-5768-4e94-9737-ef272c858beb",
                        "_type": "review",
                        "workload": 12
                    },
                    {
                        "created": "2021-12-20T21:38:30Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_createdAt": "2021-12-20T21:38:30Z",
                        "workload": 7,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "body": "Overall, I thought this course was just okay. I did my undergrad at Georgia Tech in Industrial Engineering and took a regression & forecasting class during that time and I think I learned more in that class.\n\nI definitely recommend just reading the lecture transcripts and following those along with the powerpoint slides over listening to the lectures. It is much faster this way and I took notes in a notebook from that exercise. It still does take quite some time to go through it all, though.\n\nThe homeworks have two parts: a multiple-choice & true/false quiz and an R coding portion. For the MC/TF section, it's super helpful to have the powerpoint slides/lecture transcripts in front of you to ctrl + f to find the relevant section. For the R coding section, for the most part, you can find similar code in the lectures slides; however, it does take a while to complete that portion of the homework, with both coding and writing out explanations to answer the questions. Definitely learn how to work R Studio (or Jupyter Notebook) in advance with knitting your assignment together so that you are prepared to turn your homework in on time.\n\nThe tests are set up the same way as the homeworks: a MC/TF section (where you can make a crib sheet) and an R coding section (open book, meaning you can look at lecture notes, past homeworks, etc. but not open internet so you cannot google anything or go to stack overflow).\n\nThere are a lot of complaints about the quality of the lecture material and I'd agree (like I said, I think I learned more in the GT undergraduate class in this topic). There's also a lot of complaints about the unfairness of vague questions that could go either way (especially true/false questions). I think I'd agree here as well (it's hard to truly gauge a student's understanding with a true/false question since they have a 50% chance if they just guess). \n\nI would still recommend this class for a fairly easy statistics elective that is \"doable\" without too much pre-requisite knowledge.",
                        "id": "external-import-c58473e9-6d6d-4229-af42-dd8906641bb6",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "rating": 3,
                        "_id": "external-import-c58473e9-6d6d-4229-af42-dd8906641bb6"
                    },
                    {
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_id": "external-import-ca4f5872-ba40-48de-955a-d0148b3e70e9",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "id": "external-import-ca4f5872-ba40-48de-955a-d0148b3e70e9",
                        "created": "2021-12-16T21:35:53Z",
                        "course": null,
                        "workload": 10,
                        "body": "I really loved this course. I enjoyed the material a lot. I had to study quite a bit before each exam in order to prepare for her multiple choice and T/F questions, but to be honest, they're not that difficult. I got an A in the course. I really liked the HW and exam structure because the questions are very very specific. They never leave your head scratching like \"what kind of answer am I supposed to write here? What are they looking for?\" like some other professors do that love giving open-ended questions and then people are forced to spend hours on piazza or going to office hours to figure out what the heck they want. I also liked that because the questions were so specific, there was not enough room for peers to take off points out of laziness or maliciousness like in some other courses were everything is left to the peers' subjective opinions. I really hate courses structured that way. Thus, I loved Dr. Serban's Regression Analysis course very much. She also gives lots of good advice throughout her lectures if you are paying attention: \"do not this, avoid that, always do this, etc.\"  In fact, I might go over all the materials again as a refresher.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_createdAt": "2021-12-16T21:35:53Z",
                        "_type": "review",
                        "rating": 5
                    },
                    {
                        "_createdAt": "2021-12-15T18:16:57Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 1,
                        "body": "This is a prime example of where the material (on paper) is incredibly important to analytics, but the delivery basically kills the packaging of this material as an actual class.\n\nWhy is this class so horrible? Let me count the ways...\nIt's purely a money grab by the University. The teacher is non existent. The material is HORRIBLE!! The lectures are impossible to watch, and they are riddled with errors. I kid you not, there was an ever growing pinned post thread on Piazza for lecture (and other class material) errors. The lecture material was also BLOATED to no end.. Hundreds of pages of slides that had little to no sequential flow. The HWs were OK, but you had to constantly search the internet to find answers since the lectures were so poorly constructed.\n\nAs for the exams... wow, what an archaic and outdated philosophy. The exams were divided into 2 parts. FIRST PART: Coding. Imagine having lecture material, HWs, practice exams and knowledge checks reinforce a certain subset of topics. Then, imagine an exam that tests on a completely different subset of topics... And then, imagine having to code like a mad person for 2-3 hours straight. Oh, and you can use all the material you need, you just can't go online to figure out a coding item if you're stuck... PART 2 is just unnecessary. This is the true/false and multiple choice piece of the puzzle. Again, the HWs, practice exams, etc. reinforce a certain subset of material. Then, the exam comes along, and it's a bunch of topics (albeit in the vast wasteland of lecture material) that were never focused on.  The worst part is that the questions are designed to trick you. You can tell that they spent considerable amount of time designing questions where it could go true or false (depending on the way the question was read), and the MC always had 2-3 correct answers (and the correct answer was vague and had to do with understanding the 'trick' in the question as opposed to understanding an actual analytics concept)..\n\nI know I read these reviews for practical advise, so here's my 2 cents.\nIf you want to know more about regression, read one of the many wonderful books on the topic. You'll get more out of 4-5 hours of a good book on regression in analytics then this class will provide to you. If you need to take this class to fulfill an elective (no other choices interest you), then here's the best way to survive this class.  If you are good in R, then make sure you score 100% on the coding HWs. Get a good study partner to compare notes for the TF/MC parts of the HW. For the exams, make sure you study all the coding concepts, not just the ones that are the focus of the class activities. As for the TF/MC part of the Exams, make sure you make a robust cheat sheet (you get to have a double sides cheat sheet), for the questions could come from anywhere within the 100s of lecture slides. Make sure you read the question multiple times and look for the 'trick'. Don't get frustrated by the ridiculous nature of the exam. Seriously, the questions are sometimes as simple as \"what is 2 plus 2?\" But, there's usually some trick in there..\n\nIf you're not great at R, make sure you do all the R exercises.. there are some in the lectures, but also lots of example code in the material provided. You're on you own a bit, and the persons that put together the code leave little or no comments.. However, prepping the coding material prior to the exam will give you a shot at finishing within the time allotted... It is amazing how 30 mins can be eaten up pretty quick if you do not know a concept. Plus, many of the questions build upon previous code, and if you're stuck on a question, you can't always just move on.\n\nGood luck to all that have to take this horrendous class!!",
                        "course": null,
                        "workload": 8,
                        "id": "external-import-0a6d9425-9ec7-494a-b10c-a38b8a5bd78b",
                        "created": "2021-12-15T18:16:57Z",
                        "_id": "external-import-0a6d9425-9ec7-494a-b10c-a38b8a5bd78b"
                    },
                    {
                        "course": null,
                        "body": "**Pro:**  \n+Interesting subject matter  \n+Coding Homework (can be done in R or python)  \n+Good examples in class  \n\n**Con:**   \n-Not the best at explaining the material (ex. there are many similarities between simple linear regression and multiple linear regression, a single slide showing these similarities and few differences would have been great, instead she basically just repeated the lecture on simple linear regression verbatim, I actually thought I was watching the wrong video)  \n-MC and TF homework and tests are made to trick you. I think because it is a masters class they wanted to make it hard but they don't test it in a way that promotes learning.\n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-b419aab7-5096-45c7-baa9-9ddab6fea203",
                        "created": "2021-12-13T16:08:06Z",
                        "difficulty": 3,
                        "rating": 3,
                        "_type": "review",
                        "_createdAt": "2021-12-13T16:08:06Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 8,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_id": "external-import-b419aab7-5096-45c7-baa9-9ddab6fea203"
                    },
                    {
                        "id": "external-import-a89f63ed-93a7-4546-9256-c6e2d4b90b3b",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "_id": "external-import-a89f63ed-93a7-4546-9256-c6e2d4b90b3b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-12-03T17:09:41Z",
                        "created": "2021-12-03T17:09:41Z",
                        "body": "Horrible lecture materials. Videos are impossible to watch, had to read transcripts instead, which are based on the lectures so you get the same poorly structured sentences in English. \nTAs grade exams harshly and it takes them forever (why not do it like in 6203?). Never saw the professor on Piazza. \nOverall very confusing material. There is plenty of material on this subject online, but you have to read prof. Serban crappy lectures to get through the class.\nThe course could have been better, but instead made so bad... That is not GT quality.",
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "_type": "review",
                        "rating": 1,
                        "workload": 10,
                        "difficulty": 3
                    },
                    {
                        "_type": "review",
                        "id": "external-import-fce4187c-2e82-46a4-a7ba-d518b5dc56d7",
                        "created": "2021-11-12T00:28:14Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "Very poorly structured class; lectures are all over the place and divided into a bunch of different videos that are very difficult to follow/ very unorganized. Quizzes test very specific parts of the lectures instead of the broad concepts which is very frustrating. Questions on quizzes and exams are MEANT to trick you which never helped me retain a single thing. T/F questions will have the tiniest caveat that makes them False even though 99% of the statement is True. Response time on Piazza was absurdly long/sometimes nonexistent. Overall, I do not recommend this class.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_id": "external-import-fce4187c-2e82-46a4-a7ba-d518b5dc56d7",
                        "difficulty": 2,
                        "workload": 8,
                        "_createdAt": "2021-11-12T00:28:14Z",
                        "rating": 2,
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "body": "I rated this class as Medium only because the multiple choice questions on the homeworks, midterm, and final can be tricky. Also, if this is the first exposure to detailed regression analysis, it could be considered difficult. By the time I took this course, I not only had taken several courses involving detailed regression applications, but have also used it in my job. \n\nThe lectures are at times like watching paint dry, but there are answers to the homework questions that may not be in the slides. Each of the homeworks has two parts: True/False/multiple choice and R Coding with explanation write-up. It really isn't too much work, and I think is the perfect course to take over the summer. I took this with my practicum, and while it could be stressful around the midterm and final, I didn't find the workload too heavy.\n\nOne thing that can be good or bad is that all of the coding parts of the homework are peer graded. If you get a person with too much time on their hands, you can get shafted on this. The good thing is that homework is only 15% of the total grade. \n\nThe midterm and final count for 40% and 45%, respectively, of the overall grade, so it is important to put in the time studying. We were allowed \"cheat\" sheets for both, and it helps to put in the effort on creating these study aids. \n\nLast tidbit I'll add, is that the Professor does not seem to curve. So as long as you are okay with a 88.9% being a B, then I don't see a reason not to take.",
                        "_createdAt": "2021-08-12T18:25:45Z",
                        "id": "external-import-359dbc35-c45e-46a1-ab9b-01761fde0625",
                        "created": "2021-08-12T18:25:45Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "workload": 8,
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_id": "external-import-359dbc35-c45e-46a1-ab9b-01761fde0625",
                        "_type": "review"
                    },
                    {
                        "_type": "review",
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 4,
                        "course": null,
                        "_createdAt": "2021-08-03T15:07:30Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-90dc1db1-1e42-4e97-9162-9b1fea1365d0",
                        "created": "2021-08-03T15:07:30Z",
                        "_id": "external-import-90dc1db1-1e42-4e97-9162-9b1fea1365d0",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester"
                        },
                        "body": "Regression is one of the most important concepts in analytics. I'm glad I took this course after I was on the fence, as I learned a fair bit and (slightly) improved my skills with R. The course content is generally well designed and organized, with plenty of real-world examples offered in the lectures/slides.\n\nOn the other hand, as others have mentioned, the lectures are presented very monotonously. A little enthusiasm (or, alternatively, room to go off-script sometimes) would have gone a long way. Some students only read the transcripts, and I understand why. No voice intonations or extra enthusiasm for interesting or important concepts was present. That was disappointing. \n\nI thought the homeworks and exams were very reasonable. The key is to make good cheat sheets for the closed-book portion, and a good R-code index for the open-book portion. I don't recall any huge curveballs on the exams either, and you can have homework/practice exam solutions pulled up while you complete the open-book portion. With the lecture transcripts available, you can pretty much cntrl+f the homework questions.\n\nTLDR: good/important course content, poor lecture videos, reasonable homework and exams.",
                        "difficulty": 2
                    },
                    {
                        "difficulty": 3,
                        "rating": 4,
                        "body": "Most of the Cons mentioned here are rather true. The wording in the lectures and typos in the transcripts can be frustrating. I stopped watching the lectures because of the sound quality issues. The lectures are delivered by rather bland script reading, which is fine. The issue about the sound quality and frustrating wording can a problem.\n\nThere was some frustrating for me in terms of interpretation. There are things said in the lecture that seem normative but is represented as relative in the homework/exam, for instance. This may be the result of my overthinking it or maybe the wording of the homework/exams/lectures really is less than optimal. But it was a bit frustrating.\n\nThe homework is fairly easy. The exams resemble the homework. The R portions of the exams are much easier than the homework. But there is probably unnecessary frustration and anxiety caused by the lectures issues given that the exams are so heavily weighted.\n\nOverall, I learned a lot and enjoyed the homework.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        },
                        "_id": "external-import-07bc9f12-50d0-4b87-bff6-4f91a6c20695",
                        "id": "external-import-07bc9f12-50d0-4b87-bff6-4f91a6c20695",
                        "_createdAt": "2021-08-02T14:22:26Z",
                        "workload": 10,
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-08-02T14:22:26Z"
                    },
                    {
                        "created": "2021-07-31T23:13:59Z",
                        "difficulty": 2,
                        "workload": 7,
                        "_id": "external-import-33bb719d-6324-4693-9ee7-db78b78a2280",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-07-31T23:13:59Z",
                        "_type": "review",
                        "rating": 4,
                        "id": "external-import-33bb719d-6324-4693-9ee7-db78b78a2280",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "This class is mostly good, I got a decent amount out of it but there are a few caveats that must be made mention of. \n\nFirstly,  the videos. They're terrible. Not because of Prof. Serban's accent, but because of the constant halting starts and stops through every single topic, it is so mentally exhausting to follow along with that 20 minutes feels like 3 hours. Fortunately, students from previous semesters have compiled transcriptions of all the videos and as such I didn't watch any videos beyond the first attempts at the start of the class. The notes had everything I needed to do well in the exams and homeworks. \n\nSecondly, it is important to have had previous exposure to many basic statistic topics to really be successful. Officially that is true of the entire OMSA program but some classes will hold your hand more on that front, (e.g. Simulation boot camps). I wouldn't recommend taking this class as your first statistics class in the program if you have no previous experience with things like hypothesis tests, probability distributions and their various properties, this will help ease any confusion when it comes to specific properties of regression statistics that arguably aren't covered strongly in the class from first principles.  \n\nTaking the above two points into account, I think this is a pretty good, though perhaps too lightweight, class. I learned more about regression than I knew before the class, all those funny numbers in the output of the lm() function in R have meaning to me and I got to reinforce some previously learned statistical concepts, it's hard to complain too much about that.\n\nThe structure of the class is fairly simple, for Summer there were 4 homeworks each with a multiple choice and coding component completed separately and two exams, also with both a multiple choice and coding component. Exams made up the vast majority of the grade (85% in total) so be prepared for some high stakes testing. As I mentioned above the course felt lightweight, even over a summer semester, it probably would have been possible to cram in the optional extra material as part of the main course which could have been nice.\n\nIf you need a stats elective and aren't sure what to take, consider Regression after taking into account the negatives I highlighted above. \n\nEDIT: Updating this review to comment on the fact the TAs were high quality throughout and Aymee, the head TA, was on top of things the whole semester. That's not always case!\n\n",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2"
                        },
                        "course": null
                    },
                    {
                        "id": "external-import-63d2d81f-22b7-4b00-81e1-4407be161c6c",
                        "body": "The negative aspects of the course that are mentioned in other reviews are very fair. For reference I should be getting an A.\n\nPros - The material is very interesting and I felt like I learned a lot, just not as much as I was hoping to. This group of TA’s are up there with the SIM TA’s as some of the best in the program for me so far. They’re very responsive on piazza and take the time to really explain things. The course goes at a very relaxing pace so it’s a good option to pair with another harder course. Coding homeworks really helped you learn the material and drive home the concepts. Coding portion of the exams also felt fair despite feeling like they should have added an extra 15-30 minutes to the timer.\n\nCons – The course felt too easy at times. I could go weeks without touching the course materials. Lectures could be greatly improved. Homeworks are due every 2-3 weeks depending on the module, and it really felt like they could have added another module or two to the course, especially when they have an optional one at the end. M/C and T/F questions make me feel bleh. Professor very rarely participates in the course/on piazza so really it felt like another course run by TA’s. \n\nNonetheless I have to say I enjoyed the course overall despite its flaws. It was low stress and taught me a lot about regression. Hopefully they improve it in the future for everyone else. ",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_id": "external-import-63d2d81f-22b7-4b00-81e1-4407be161c6c",
                        "_createdAt": "2021-05-07T20:00:46Z",
                        "created": "2021-05-07T20:00:46Z",
                        "_type": "review",
                        "rating": 4,
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "_type": "review",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-73413307-313b-496b-ba6a-1cc1ca291ae4",
                        "created": "2021-05-06T17:54:51Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-05-06T17:54:51Z",
                        "course": null,
                        "workload": 8,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "rating": 4,
                        "_id": "external-import-73413307-313b-496b-ba6a-1cc1ca291ae4",
                        "body": "Despite many of the flaws pointed out repeatedly in previous reviews I think this was an interesting class, in which I learned quite a bit. Yes, the lectures are tedious and you are far better served reading transcripts (and the crowdsourced bible - which isn't always completely up to date with some critically new sections), but combining that approach with office hours was a solid way to learn the material.\n\nI liked that the homeworks were based on the lecture material (vs. forced googling of functions/code/concepts) and that those HWs translated more or less directly to the tests, and I liked that the coding portions of each were broadly practical in nature without (too many) surprises that we had not been prepared for. It did make me feel like I was learning the concept and then applying it.\n\nI, like others, did not think the T/F and MC portions of the HWs or test were representative of the knowledge gained, and if you are the type of person who cannot stand getting a B in an overall course mostly because of poor performance on narrowly specific multiple choice questions, despite feeling like you have a solid grounding of the material, then I can see how this class might drive you crazy. Mean grades on T/F, MC portions of tests were routinely in the low 80s and in many ways 10-20 hours extra studying wouldn't have helped. Grade inflation isn't always the answer but it might help a bit in this class...  If it were me I'd weight the coding sections more heavily (70/30) and give a bit more weight to the HWs and it would probably reverse half the negative opinions on this site. "
                    },
                    {
                        "_createdAt": "2021-04-28T23:33:14Z",
                        "workload": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "created": "2021-04-28T23:33:14Z",
                        "_type": "review",
                        "rating": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "body": "Regression is definitely an important topic for anyone interested in analytics. Unfortunately, I don't think this is a particularly good class when it comes to teaching it.\n\nThe effort you put in and your knowledge of the material don't feel like they translate as directly to a good grade as they do in some of the other OMSA classes like CDA and HDDA. That said, I don't think this class requires much effort. I probably spent less than 10 hours per module (there are 5), plus another 10 or so studying for/taking each exam.\n\nI rated the difficulty as medium not because the topics are hard, but the evaluation is so poor. You grade will be determined by the exams, and in my opinion they aren't well done. With more straightforward exams, I'd rate this class easy or very easy.\n\nThe True/False and multiple choice questions don't seem to me like they are designed to test your understanding of core concepts as much as they test specific details of definitions or rules and whether you can read carefully without getting tripped up. Make a very detailed reference sheet for the exam and read very slowly and carefully. Then re-read again just to be safe.\n\nThe coding part for homeworks is very straightforward. For the most part you just take adapt code from lecture examples and apply it to the answer the questions in the hw. If you got through ISYE 6501, this should be more than manageable.\n\nUnfortunately, the coding part of the exams sometimes ask you to use a function that may not have been presented very thoroughly in lectures (if at all), so be careful. Make sure you're comfortable with every function presented in lecture, even if the professor glosses over it.\n\nMake sure you're comfortable searching and reading the R documentation in Rstudio (\"?function\" and \"??function\"). You're not allowed to google to find functions during the exam, but if you're stuck you can look them up or search for them in the Rstudio help. It saved me a few points on the final when it asked for something I swear wasn't covered in lectures (of course maybe I just missed it among the mountain of slides in this course).\n\nI also found it helped to create a table of contents of sorts with what functions/models/questions are asked in each homework and practice exam. Then when you're working on the real exam, if you're stuck on a question, you should be able to quickly track down the needed code from a prior example. Despite having 1.5-2.5 hours for the coding exams, I used all the available time for exams 2 and 3.\n\nEdit: I'm current taking MGT 6203 and the course begins with an extremely basic module on regression. While I wasn't a huge fan of the instruction in Reg - when compared to 6203, I think Reg is much, much better, especially when it comes to the homework assignments. I had initially rated the class \"Dislike\", but grading within the context of the other classes, I'm bumping this up to \"Neutral\".",
                        "course": null,
                        "_id": "external-import-76001719-3446-4f06-8f70-d9ae6e12fd9a",
                        "id": "external-import-76001719-3446-4f06-8f70-d9ae6e12fd9a"
                    },
                    {
                        "created": "2021-03-27T19:44:00Z",
                        "workload": 12,
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "body": "I felt compelled to write a review for this course. Regression is in many ways the foundation of data science. I have taken the 3 required courses for OMA and thought that CSE6040, ISYE6501 were very good (especially I enjoyed Dr. Sokol's class a lot). I though MGT8803 was a bit of a drag (especially the content for accounting and the presentation for finance were boring as hell, however supply chain and marketing presentations were good). Once I finished the 8803 class, I have been able to look at everything around me through that lens and has been rather useful (especially understanding balance sheets, cash flows, present value, future value etc has been useful in understanding the stock markets). I struggled through all 3 classes at various points but managed to score A's in all 3.\n\nComing to Regression Analysis, I was very excited to take this class since it is the first class where we'd deep dive into a key aspect of data science. We are heading into the second midterm next week and I would say this class has been disappointing and underwhelming at best in terms of both content and the presentation. In all my previous classes, after having gone through the videos and gaining a basic understanding of the concepts, I read more on the topic and saw a lot of videos of youtube and took a lot of notes from them as well. While I understand that as grad student we have to do a lot of additional work ourselves to gain a deep understanding of the topic, this is the first class where I felt that the material covered didn't provide a good foundation of the concepts. Example: the way MLE was covered in logistic regression part is so bad that I didn't understand it after listening to it more than a handful of times. As important as a formula may be, can we not get a good visual of what it is that we trying to learn before diving head first into it? I would myself have dismissed these things as the student not wanting to learn previously, but given how many videos there are on youtube which provide excellent visuals and explanations of concepts, I can't imagine why a paid graduate level course doesn't do the same? I mean, we can do pretty much all the model creation, prediction, estimation etc in R. It would do the student much more good to understand (visually or using words), what the concept is, rather than trying to simply learn the formulae. If you don't believe this, watch the 3brown1blue channel for the visualization of linear algebra, you would see the subject in a whole new light and wouldn't forget ever what linear algebra is and how and why it is useful. Another example would be the statquest channel for things like linear regression, logistic regression etc.\n\nOften times, there is cursory commentary provided by the prof and then concludes with 'the information on it provided in the slide'. It is ironic that I have to write this as someone who also has an accent but the prof is difficult to understand and I have to always follow along with the transcript. This would hardly be a problem if the material presented is good but alas!\n\nI hope the class is restructured, more inspiring content is added and more time is spent on explaining the concepts. For now, I just want to finish the class and spend the summer learning more about regression elsewhere since I hope to start using it in my present work.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "id": "external-import-641f59e9-16a1-4271-bb4a-e88037b0b2c3",
                        "rating": 2,
                        "_createdAt": "2021-03-27T19:44:00Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_id": "external-import-641f59e9-16a1-4271-bb4a-e88037b0b2c3"
                    },
                    {
                        "_type": "review",
                        "_id": "external-import-9874d80e-816b-4d27-8f22-5f1e6ceabf4a",
                        "body": "I think this course is underrated. As someone who took different variations of regression for 4 times in undergrad, this course is my favorite. The course is highly structured. Unlike many other courses, the codes are provided in lecture slides so you don't need to Google around (I always struggle with R). The lectures are not bad at all. However, the downside is that this course spent way too much time on univariate regression. I wish it could touch more on advanced topics in regression, panel regression or something. Overall I recommend this course to everyone.",
                        "difficulty": 2,
                        "_createdAt": "2021-03-21T19:52:38Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "created": "2021-03-21T19:52:38Z",
                        "rating": 4,
                        "workload": 6,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-9874d80e-816b-4d27-8f22-5f1e6ceabf4a"
                    },
                    {
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-9c87d79e-b877-4e76-908b-fb338c9cae4a",
                        "_type": "review",
                        "rating": 2,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "_id": "external-import-9c87d79e-b877-4e76-908b-fb338c9cae4a",
                        "body": "5-homeworks (T/F and coding portion). Three exams. \n\nPROS:\n\nLots of opportunity for regression analysis in R (i.e., hands-on practice)\n\nLots of good study material: knowledge checks, homework’s, practice exams\n\nFormat of practice exams prepares you well for exam\n\nTA's were knowledgeable & kind\n\nI appreciated that the video lectures were split between: (1) introducing and explaining topics and (2) real world examples (implementing the code, reviewing the output, interpretation)\n\nCONS:\n\nHands down THE WORSE PowerPoint slides I've ever encountered. I loathe them. On their own (i.e., without listening to videos) they are useless. Additionally, they contain grammatical & spelling errors (unacceptable) and they divided into many subsections (e.g., module 4 has 21 different PPT files). If you need a 500-page transcripts document to accompany your PPT slides, there may be something wrong! The slides actually made me angry! Slides are not of Georgia Tech quality. They are poo and do not aid in the learning experience. In fact, I'd say they de-aid-ed my learning experience.\n\nLittle to no interaction by professor. Almost 100% TA lead (and they do a good job)\n\nSlow response time on Piazza! Sometimes days...\n\nDoesn't always cover the why or reasoning \n\nOther courses can and do present the material better and more thoroughly \n\nCoding portion of exam would focus on a topic we barely touched on in lecture (last 5-slides of 160 slide deck) and did not practice coding at all (e.g., random forests). This approach seemed more like a scramble/superficial exposure to a topic.--and counterintuitive to the learning process for me.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "created": "2021-03-06T00:14:27Z",
                        "workload": 8,
                        "_createdAt": "2021-03-06T00:14:27Z"
                    },
                    {
                        "workload": 15,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "difficulty": 4,
                        "_createdAt": "2020-12-28T04:19:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "id": "external-import-af679000-0186-416b-bbdc-8e9d69186e57",
                        "created": "2020-12-28T04:19:25Z",
                        "_id": "external-import-af679000-0186-416b-bbdc-8e9d69186e57",
                        "rating": 4,
                        "body": "Overall I learned a lot from this course. I have basic regression knowledge coming in and this course expanded my knowledge greatly on advanced regression concepts.\nI appreciate that this is an applied course, which requires hands-on R experience. The lectures go over many R examples and the R files were provided for you to follow.\nIt is hard to get an A in this course due to the difficulty of the multiple choice portion on the HWs/exams. But it was fair and I balanced it out by doing well on the coding portions."
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "workload": 20,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "_id": "external-import-1c11a476-867c-443b-9874-b5b8a6cdbd22",
                        "body": "**Tl;dr:** This course is a must-take for aspiring data scientists despite some hiccups here and there.\n\n\n# Course content\nYou will learn regression in-depth with this class. The models covered are linear regression, ANOVA, logistic regression,  Poisson regression, and variable selection techniques. You will also understand the mathematics behind the models, the assumptions if a regression model fits your data, and much more (confidence intervals, how to identify outliers...). After taking this course, I can say that I feel much more confident when I talk with my statistician colleagues. The only thing that I wish prof Serban covered is the algorithms to determine the logistic regression models' coefficients.\n\n# Teaching style\nProf. Serban can be a little bit dry, and her accent might be hard to get accustomed to, but she is doing a fine job. Yes, she reads from a script, but she generally goes straight to the point. The videos are not too long, nor too short, but consuming an entire module in one sitting can be a little too much.\n\n# Course structure\nThe course has 5 modules, and each module spans over two or three weeks. You'll have 5 homework which consists of a coding part (6501 style but with clearer instructions/expectations) and an MC part. Some say that the multiple-choice questions use tricky wording, but I disagree: the questions require you to think, if you understand the concepts, you'll get the right answer.\n\n# Exams\n3 exams: 2 midterms and 1 final. Each exam consists of two parts: one coding part and one MC (like the homework). Both are proctored and timed. The coding is open book, but not open internet (you can still go on edX, however). The coding part can be stressful, as you'll have barely enough time to knit your markdown file before you are out of time. Suggestion, prepare an R file with all the useful formulas before the exam so that you can copy-paste lines of code. Also, you are allowed to use cheat sheets during the MC part. Finally, you have about a week to complete both exams.\n\n# Prerequisite\nAn OK knowledge of R is required (basic for loops, how to create a function), but nothing too fancy. If you survived in 6501, you'll be fine. You also need to have a decent knowledge of stats and probabilities (mostly stats). Some linear algebra background could be handy (matrix multiplication, the inverse of a matrix): if you survived 6040, you'll be fine. There is a bit of calculus in some derivations, but it is mostly basic.\n\n# TAs\nI did not really attend the weekly office hours, but I watched a couple. They are mostly open discussions about the current module's topic. If you struggle, I recommend that you attend them. The TAs were also pretty responsive on Piazza. They sometimes went above and beyond with some of their posts.\n\n# Outside documentation?\nSome other reviewers mentioned that they were using resources from other universities. TBH, I don't see the point since the course is self-contained (no need to buy a textbook, either).\n\n# What could be improved?\nOthers mentioned it, but the sound quality of some lectures is beyond bad. Some videos are extremely quiet, while one was recorded with distortion. One TA said that it would be fixed, so who knows?\n\n# Conclusion\nI really enjoyed the class, and I would recommend it to anyone in the program. Note that I took it back in 2018 but had to withdraw for personal reasons. Thus, I can say that the new lectures are much better. Also, the homework was more enjoyable to complete. To sum up, **take this class if you want to gain a deeper knowledge of a basic but fundamental data science concept.**",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "difficulty": 3,
                        "rating": 5,
                        "_createdAt": "2020-12-07T22:19:34Z",
                        "id": "external-import-1c11a476-867c-443b-9874-b5b8a6cdbd22",
                        "created": "2020-12-07T22:19:34Z"
                    },
                    {
                        "created": "2020-12-07T17:28:14Z",
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-12-07T17:28:14Z",
                        "rating": 3,
                        "id": "external-import-eaf957f0-9ceb-47ce-8dc1-dda831022349",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_id": "external-import-eaf957f0-9ceb-47ce-8dc1-dda831022349",
                        "body": "I took the class after the recent restructure. Video lectures need polish. I don't agree with the exam structure as far as weighting goes, but content I am mostly good with. The final exam this semester was not a good match. The style of question was significantly different with much more emphasis placed on interpretation than previous exams or homework. This was mentioned by a TA, in office hours, that did not get posted in the usual place. Instead it was mentioned in a comment in a forum thread.\n\nThis could, and I think should,  change. If interpretation is going to be barely a topic on previous exams then it should remain so on the final, not increase in both coverage and depth. instead of select the correct option some of those questions became select all right answers. At east a couple of final exam questions were very arguable on interpretation (I am writing this before seeing how they were graded). One question had no right answer, and two that were equally not horrible.\n\nHomework was very fair in content and depth, peer grading is a quick way to let a class with 200+ students be run by a handful of TAs and one professor. It also means very different grading standards.  Using the median mark for a grade is a good solution. I don't know of one better.\n\nBeing allowed to use the previous homework on the coding portion of the exams means you were graded on ability to problem solve than memorize the R library. I think they have found a good balance of open note but not open internet. Although reading CRAN descriptions on library functions leaves much to be desired.\n\nSolutions are provided, but if you don't understand them work on seeing how that code does what your own code does.\n\nAdvice: From the start of the course create a list of which topic was covered in which homework. This will save you a lot of time on exams.\n\nThe class has a bad reputation for both quality of instruction and difficulty. I relation to the other four classes I've taken so far I understand why. The instruction and question phrasing combined make the class more difficult than it needs to be.\n\n",
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        }
                    },
                    {
                        "body": "Overall I think this is an interesting class. It provides a deeper knowledge of 6501. You would get more out of this class if you study, do the homework, attend office hours and try to understand the material. \n\nVideo lectures/materials - I would skip the lectures since the audio is bad and it's very hard to understand. She just read it out of the slides and transcripts. \n\nHomework - The TAs are extremely helpful and there is office hour every day. They will help you learn and get the most of homework. HW is 2 parts (MC and Peer Reviews). Peer Reviews can be hit or miss. Some people grade more lenient than others. The point is to learn, not to punish your classmates. You can ask for re-grade from TA if you find it's unfair. \n\nExams - I doesn't like how 85% of your grade is allocated into 3 exams (2 midterms & final). It has 2 parts (closed book MC and opened book coding). The MC is designed to trick you so make sure to read every question carefully. The coding part can be long, so make sure you have a reference code. You can't use internet to trouble shooting but you can use help in Rstudio. Most of the coding part is similar to the homework with some nuances. \n\nI would recommend this class if you want to gain more knowledge of regression. I did learnt a lot from this class. ",
                        "_type": "review",
                        "rating": 4,
                        "created": "2020-12-04T18:49:30Z",
                        "_createdAt": "2020-12-04T18:49:30Z",
                        "course": null,
                        "_id": "external-import-bbb0bb71-921e-412f-9856-eb6617e99693",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-bbb0bb71-921e-412f-9856-eb6617e99693",
                        "workload": 11,
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "created": "2020-11-08T22:44:44Z",
                        "_type": "review",
                        "workload": 8,
                        "_id": "external-import-c5ba46ea-10a1-446c-9583-db6afe6514cc",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "id": "external-import-c5ba46ea-10a1-446c-9583-db6afe6514cc",
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "body": "Cleared due to OMSCentral Owner being greedy.",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "_createdAt": "2020-11-08T22:44:44Z"
                    },
                    {
                        "_id": "external-import-49b097f7-8e3f-4ee3-b7cc-4c551ff94028",
                        "rating": 4,
                        "course": null,
                        "body": "I mostly agree with the other Summer 2020 reviews. Here is my personal addition:\n\nI do not do well with standardized testing. I would much rather be graded on projects and essays than true/false or multiple choice questions. I end up second guessing my knowledge and over analyzing my way into the wrong choice. Half of this course is project based and half is standardized. My project grades were always above average with the class and my tests were always below average.\n\nHere is what I appreciated about the course: The TAs and Dr. Serban take time to respond to you on Piazza. After tests I would go through and analyze my answers. The ones I got wrong I would PM the instructors with my reasoning for each one, and every time they responded with detail. In some cases, they understood my logic and reevaluated the grade. They genuinely care about learning and if you take the time to interact with the instructors they will show you that they want to help you succeed.",
                        "_createdAt": "2020-08-04T06:38:21Z",
                        "created": "2020-08-04T06:38:21Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "difficulty": 3,
                        "workload": 10,
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-49b097f7-8e3f-4ee3-b7cc-4c551ff94028",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-b38f3055-6ecb-409c-907e-6f40263512f8",
                        "created": "2020-08-04T06:21:25Z",
                        "_type": "review",
                        "workload": 10,
                        "_id": "external-import-b38f3055-6ecb-409c-907e-6f40263512f8",
                        "body": "For summer, this course pace is managable. I only used powerpoint slides and those pdfs to study. While the workload and pace is pretty okay, the midterm and final exam takes out a huge percentage of the course. The midterms were manageble, but the finals were pretty tough. \n\nThere is not much or close to no curve for this course as compared to other statistics/ math courses in ISYE. I was a bit disappointed because I thought I understood the material as I did well for homeworks, but the finals part 1 was tricky and I didn't have enough time for part 2. (and the finals took up 45 %!) \n\nIf doing for summer, I would recommend just doing this course only. I had a B up until midterm, but ended up with a C because of the finals. \n",
                        "_createdAt": "2020-08-04T06:21:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z"
                        },
                        "difficulty": 3,
                        "rating": 3,
                        "course": null
                    },
                    {
                        "_createdAt": "2020-08-02T20:49:31Z",
                        "id": "external-import-df67ad47-f383-43c3-93b3-30bd140becf0",
                        "created": "2020-08-02T20:49:31Z",
                        "workload": 12,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_id": "external-import-df67ad47-f383-43c3-93b3-30bd140becf0",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "Reading the previous class reviews made me nervous to take this class. According to the Professor and TAs Summer 2020 used new lectures, videos and homework assignments. I feel some of the previous comments are still very relevant and there are still ways to improve the class. \n\nI cannot comment on previous semesters but the lecture videos this summer were a challenge. Audio was extremely quiet for a lot of the videos. I ended up using the transcripts and powerpoints without watching most of the videos. If you take this class I strongly recommend combining the unit powerpoints. I will come in handy for Part 2 of the exams and studying in general. \n\nHomework & Exams all the two parts. Part 1 is T/F and Multiple Choice. Part 2 is R based code questions. \n\nThere were 4 homework assignments (each two parts) and 2 exams (each two parts). \n\nPart 1 (T/F & MC) was a challenge. For exams and homework you'll want to take you time here and be sure to really read the questions. There were a lot of little words to make this portion very tricky. \n\nPart 2 (Coding in R) I didn't feel was overly challenging. Most of what was being tested was covered in lectures, however there were a few homework problems that were not explicitly in lectures. \n\nExams were similar, both parts were proctored. Part two was timed and proctored. This made doing the coding a bit of a challenge. While it was open notes there was not internet. I was very close on time for part 2 for both the midterm and final. \n\nAlthough the class was a challenge I do feel I learned a lot. If you aren't familiar with Regression I would recommend this class. Just be sure to devote time to the Part 1 as the wording can be challenging. ",
                        "difficulty": 3
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "Well, after hearing mostly negative reviews of this course for 3 years I've finally taken it. Although we cover regression in other courses (6501, 6203, etc.) this course goes a bit further into things like poisson regression, logistic regression etc. All in R, which I quite enjoyed. \n\nBottom line is it's a solid intro to regression pitched to the graduate student. Taking it will not make you a regression expert, but it will serve as a jumping off point if you want to learn more. I, for example, would like to learn a little more about the econometrics side of things, and think this course will be good to have taken perhaps before diving into that subject. \n\nThe text is more or less unnecessary. I actually bought it and wish I hadn't as all the examples are in SAS(!?!). Just skip it. The course transcripts and google will do the rest. The text doesn't even cover the lasso, ridge, elastic net portion of the course. \n\nSupposedly, the videos have been \"improved\" but if that's the case, I'd hate to see the old ones. I think I could do a better job with my iPhone and a decent mic and, maybe, some white boarding software. I mean, where's the creativity? Where's the character? I'd be thinking of ways to maybe make the lectures fun and entertaining. Like the Isbel ML lectures on Udacity. Is that so hard? But then I'm not a stem prof with a 147 IQ. You've heard about the bias-variance trade off? I propose there's a personality trade off involving mathematical ability and ? It's telling that aside from Goldsman, the other most engaging professor (Lee Campe) was from the College of Business. Heck, even the financial modeling (also college of business) prof showed a little personality. \n\nI am nearly done with this degree so can now say that, truly, Ga Tech ISYE and CSE professors aren't hired based on being engaging lecturers (except for Goldsman!) No, they are hired for their research, or publications, or whatever, but not because they're good teachers. \n\nThe lecture style was basically the prof clearly reading a script. I mean, just watch one Khan academy video and you'll see a much more engaging teaching style than anything in virtually any class here. Sigh...Bottom line, lectures are boring, but \"those who've came before\" us have created transcripts of the all the videos so you can just read them (and use them for reference on test/homework day).\n\nOkay, so what's good here? I did note that I \"liked\" the class, after all. The topic selection is solid, the homeworks were very educational and took a bit of work. And the tests were mostly reasonable (past years people had complained that they were \"tricky\"). I didn't feel that way myself.\n\nI should also note, that, unlike other courses I've taken here (**cough**bayes**cough**) there ware more than adequate TA coverage and the TA's were responsive and helpful. The class was well run. Although I didn't avail myself of those resources, I could clearly see as much on piazza, etc.\n\nHow hard is the class, in summer? Frankly, I put relatively little time into the front half, got an \"A\" on the mid term, then for whatever reason, did poorly on the final. Ended up with a B. The fact that two tests make up 85% of the grade is a bit weird (and my case shows why) but in spite of my apparent poor final prep skills, I don't think the class is overly hard. Nothing is particularly hard to understand. The homeworks can take several hours. Usually I'd just block out every other Sunday or whatever for \"homework day\" and the rest of the time, things were, frankly, pretty relaxed. I may have averaged 10 hours a week and that probably an overestimate. \n\nYou have to take two stats classes. If you're AT track, you're almost certainly taking this. If you're comp track, you might want to take HDDA, CDA, etc. If you're biz track, I think you should definitely take this. It's an important foundational subject in analysis that still drives a lot business models out in the real world. \n\nTL;DR, good subject, topic selection, boring lectures, high stakes timed, proctored exams that can be a little stressy. \n\nGood luck!",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-48179465-8cc1-45ee-9b6e-25d067b141f5",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "id": "external-import-48179465-8cc1-45ee-9b6e-25d067b141f5",
                        "created": "2020-08-01T17:25:01Z",
                        "difficulty": 3,
                        "_createdAt": "2020-08-01T17:25:01Z",
                        "_type": "review",
                        "workload": 10
                    },
                    {
                        "id": "external-import-7f6e485c-5a23-4f34-85ac-4eff3c0091f3",
                        "workload": 12,
                        "difficulty": 4,
                        "_createdAt": "2020-07-27T23:31:53Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "This class was apparently redone for this semester - I'm not sure if the redo is finished or what actually changed, though. So I have no idea how similar the class I took is to the one that got mostly negative reviews, or the one you might be considering taking if the class is still under construction.\n\nOverall I liked it quite a bit. Learned a lot of very useful knowledge - regression is such an important part of analytics, I now know so much more about variable selection, proper use of glm vs. lm, etc. than I did before. There are still a couple of grades pending and I'm unsure if there'll be a curve, but odds are I'll wind up with a B.\n\nMy biggest gripes are the quality of lectures and exams. With lectures, Dr. Serban oftentimes gets too into the weeds. And, she'll reuse the same example over and over - which is fine, but therefore assumes you remember something very specific from five lectures ago. For instance, let's say in a given model the R**2 value is 0.7. She'll then refer to 0.7 in a later slide without context, leaving you to scratch your head, like where did that number come from? \n\nThe exams have two parts - a proctored coding section where you essentially have a couple of hours to do a homework and can't go to the bathroom, and a proctored multiple-choice section. My complaint is the multiple-choice: many of the questions seem designed to trick you. Heavy use of words like \"never\" and \"always\" where I made myself crazy trying to think of a single exception. Occasional questions phrased very confusingly with double/triple negatives. And she asks a few obscure questions that were briefly mentioned once and never again - though we're allowed cheat sheets there's just too much information to write down/memorize for every tiny detail. So the reason I graded the course as hard isn't because it's extremely time-consuming, but there are a lot of pitfalls to earn as high of a grade as you might like.",
                        "created": "2020-07-27T23:31:53Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_id": "external-import-7f6e485c-5a23-4f34-85ac-4eff3c0091f3",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4
                    },
                    {
                        "difficulty": 3,
                        "course": null,
                        "_createdAt": "2020-07-27T21:28:41Z",
                        "workload": 12,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "_id": "external-import-af9b918e-b0cd-4286-8358-d3c061ee652b",
                        "id": "external-import-af9b918e-b0cd-4286-8358-d3c061ee652b",
                        "created": "2020-07-27T21:28:41Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "Overall, I found the course to be valuable.  It was very organized and well run by the professor and TAs.  If I had one criticism of the course, it's of the video lecture quality.  Not only is the audio bad, but the professor is not a great presenter and essentially reads from a teleprompter which makes it difficult to stay engaged.  However, they have a well organized transcript and lecture slides to go along with the videos which is what I used primarily.  The HWs and exams were decent and organized.  There are a number of data sets used in the HW and exams that force you to apply the concepts (using R).  I'd say I came away from this course knowing a lot more about regression than I did coming in.  ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "_id": "external-import-2f10c800-1d4f-42c7-bc11-4ace67e06f81",
                        "body": "Positives:\n\n* The topics covered are exactly the right ones for a regression class and I feel that I learned relevant material\n* The TAs and student community was great and I felt I could easily reach out on the slack channel or piazza for help\n* The assignments and exams were well designed, and the lecture knowledge checks and coding examples were ample and really help you get a feel for how the concepts link up to practice\n* The topic is taught in a standard way, so other resources like Penn State's STAT 501 class, regression textbooks and wikipedia line up pretty much exactly\n* Transcripts/notes/powerpoints are provided for all the lectures and are well-organized\n\nNegatives:\n\n* Lecture videos are reading off a script, often with lots of formulas rather than emphasis on visuals and concepts\n\nGenerally, I really liked the class - the assignments were great learning exercises for me and the best part of the class. I think the lecture videos are not good and for that reason some reviews will criticize Dr. Serban, but I think the other aspects of the class more than make up for it - most professors, even those with good lectures, will not provide as many resources, examples and helpful assignments as this one did.",
                        "_type": "review",
                        "id": "external-import-2f10c800-1d4f-42c7-bc11-4ace67e06f81",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "difficulty": 2,
                        "course": null,
                        "workload": 6,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-07-25T15:46:34Z",
                        "created": "2020-07-25T15:46:34Z",
                        "rating": 5
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "difficulty": 3,
                        "rating": 2,
                        "course": null,
                        "id": "external-import-378b034c-4a32-489c-829d-0b2f9d28fd3b",
                        "created": "2020-07-24T15:42:28Z",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-07-24T15:42:28Z",
                        "_type": "review",
                        "_id": "external-import-378b034c-4a32-489c-829d-0b2f9d28fd3b",
                        "body": "What saved me from giving this class a \"Strongly Disliked\" rating were the TAs.  The TAs in this class definitely made it doable and help you feel like you're learning something.  They were super responsive, and explained topics much better than the professor.\n\nDr. Serban's teaching style is definitely not for everyone.  You're honestly probably better off not watching the videos and just downloading the slides/transcripts and walking through it yourself.  It really just felt like she was just reading from a script and didn't provide any additional insight to various topics taught in this course.  Not to mention, the quality/sound in some of the videos made it sound like she recorded the videos in a dungeon.  The thing is, you take these classes hoping you learn something in addition to your own studies.  Without the TA's, I'd have felt more lost after taking this course.  The professor provided absolutely no value to me.\n\nHomework was pretty straightforward.  Exams were fair.  I never thought I was asked anything that I wasn't exposed to in class.  You don't need to have R experience to take this class, but it definitely helps.\n\nDid I walk away from this class feeling like I learned something?  Yes.  Was it because of the professor?  Hell to the no."
                    },
                    {
                        "rating": 4,
                        "created": "2020-07-21T21:33:06Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 2,
                        "_createdAt": "2020-07-21T21:33:06Z",
                        "_id": "external-import-89d9eb58-f382-4044-8bc5-67647992df60",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-89d9eb58-f382-4044-8bc5-67647992df60",
                        "_type": "review",
                        "body": "Overall this was a good course and I learned a decent amount. This was my 9th course in OMSA.\n\nThe class had 5 real units\n- Simple linear regression\n- Anova\n- Multiple Linear Regression\n- Logistic/Poisson Regression\n- Variable selection (forward/backward, ridge, lasso)\n\nPros:\n- Homework structure (mixture of multiple choice + T/F and applied R coding) was conducive to learning.\n- Workload was not at all demanding, even during the condensed summer schedule (although I was only in one class this summer). There were four homework's and two exams all of which had a multiple choice and coding portion.\n- Most importantly, the TAs were highly engaged and most of them were very good. I thought Michael Tritchler was especially good and really took a lot of time to make great content and explain concepts.\n\nCons:\n- The lecture quality is poor and nobody taking the course will get much out of them.\n\nOverall: The past negative reviews make me see this course as a bit of a gamble. If your TAs aren't good, you'll end up with questions that are senseless, confusion on homeworks, and less learning over all. If they are, you can expect to become better at regression through this course",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 7
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "rating": 4,
                        "id": "external-import-9b0b3d9f-39cc-4569-9837-c55309882987",
                        "created": "2020-05-04T22:23:25Z",
                        "_id": "external-import-9b0b3d9f-39cc-4569-9837-c55309882987",
                        "_createdAt": "2020-05-04T22:23:25Z",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "course": null,
                        "body": "This is definitely a must-take course for all 3 OMSA tracks, and I believe it should replace MGT6203 as a core curriculum class. The class focuses on how to interpret the results and judge on the output and you will be given many detailed examples with various types of data sets. However, you will not dive deep into the computation behind the algorithms, and will mainly perform regression using R as a black box. Still, there are other courses that focus on the computational aspect, and I believe that the information and skills you will get in this class are invaluable. I also had a lot of fun going through the exercises and interpreting the results. \n\nIt seems that most of the criticism this class gets comes from the TF/MC quizzes and exams and that some questions are tricky and misleading. Although it is surely frustrating to lose grades based on semantics while fully understanding the material, I found only 2-3 (out of 20 to 40 questions) of these in each quiz/exam, and I found the rest of the questions logical and test your understanding of the material. On the other hand, the other half of the exams were R coding questions that were definitely doable (and even easy) if you watch the lectures and do the homework, and the grading was lenient. That being said, if you overlook a couple of points you might loose on tricky questions that will probably not affect your overall grade that much, you will find this to be a light and a not-difficult course. \n\nIt should also be mentioned that, although the TA’s were great and responsive, the office hours were mess. I believe that instead of the dozen weekly office hours that were poorly organized and resulted in almost no one attending, a 1 or 2 well structured office hour will be much more helpful!\n"
                    },
                    {
                        "workload": 6,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1"
                        },
                        "_id": "external-import-d4f55ded-c268-4bb6-b3c2-9e5ed94ddc1f",
                        "body": "This courses is an example of how not to teach a course.\n\n1. Poor lecture quality. \n2. Awefully worded english transcript, defintely a different era of english.\n3. Unstructured office hours which were practically unattended.\n4. Horrible multiple choice test which does not care of your understanding of the course but more of trying to trick you. Given point #1 and #2 you are definitely going to fall in the trap.\n\n\nHaving taken the course i wish i knew what i know now.. and wont have taken the course even when gatech paid me for it.\n\nGlad TAs were there to support otherwise would have lost my sleep over it.",
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 1,
                        "id": "external-import-d4f55ded-c268-4bb6-b3c2-9e5ed94ddc1f",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-03T03:47:37Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2020-05-03T03:47:37Z"
                    },
                    {
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 10,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester"
                        },
                        "body": "I'm writing this review in Spring 2020 to offset all the super negative reviews about this course. This course is not THAT bad. There are definitely issues with it, but after taking it I can definitely say I learned new things about Regression (even though this is one of the final classes I'm taking in the program). Within the program, ISYE 6501 and MGT 6203 also covered Regression. This course helped me learn new bits about regression that I found useful to my overall understanding. With Regression as a highly used analytics model, I'm glad that I took this class. \n\nThe good:\n- In depth focus on simple & multiple linear regression, ANOVA, Logistic & Poisson models, and Variable Selection.\n- I think the course does a good job in forcing you to understand how to assess the model fit and understanding what the outputs of the model are. This includes variable interpretation and overall model significance. It sounds basic, but I think people who think they understand don't actually get it at a detailed level.\n- Pacing of the class was fine and the concepts built upon each other\n- The exams were fair and had plenty of time to write your R code and answer the questions\n- The TAs for this semester were very good and helpful\n\nWhat could be improved:\n- As stated in other reviews, there are lots of little errors in the videos and I think the professor said herself that they are redoing them shortly. Some people find her hard to understand, but I didn't have that problem.\n- The lectures can be a bit dense, but I found it most helpful in the \"data examples\" in applying the concepts to a real problem. \n- The reliance T/F questions in HWs and exams is frankly annoying. The questions are written with some grammatical errors and you can tell where they are trying to \"get\" you. It's an annoyance that you'll have to get over. \n\nFor people considering this class, please don't avoid it with all the previous reviews. There are good things to learn here even with various annoyances. ",
                        "_createdAt": "2020-05-02T16:58:06Z",
                        "id": "external-import-6dbef0fd-b203-4111-9ce0-cd293ce33183",
                        "created": "2020-05-02T16:58:06Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-6dbef0fd-b203-4111-9ce0-cd293ce33183"
                    },
                    {
                        "created": "2020-04-24T14:59:20Z",
                        "body": "This course gets some pretty poor reviews.  I think some of the reviews are justified.  In the end, I think this is a course worth taking.  I think this course could be improved, however.  IMO, this is probably the most fundamental aspects too analytics.  Here is my take on the good and the bad:  (For reference, I expect an A in the course.)\n\nThe good:  The TAs for this course did a pretty good job.  They were not the most responsive, but no questions went unanswered for more than say 48 hours.  Even the really silly open-ended ones (typically asked by yours truly.). In the end, I left this course knowing so much more about regression that I did before, and much more detail that is covered in 6501.  In the end, I am glad I have this knowledge.\n\nThe TAs shared a transcription document at the beginning of the course that had pretty much everything the professor said.  That was tremendously valuable.  I was able to search for terms and look things up quickly without puttering around in video files.\n\nIn general, the TAs were tremendous.  If it weren’t for the high quality TAs, this course would have been a disaster.\n\nThe bad:  Heavy sigh.  These comments are meant to help improve the course.  It is a graduate level course, and I don’t think that it needs to spoon-feed students.  If you want to be spoon fed, I don’t think GT is really an appropriate program, IMO.  That said, there are some major areas for improvement…\n\nSyllabus:  The syllabus is just plain wrong in many aspects.  The described final described in the Syllabus was completely wrong.  One of the midterms was scheduled over spring break.  The instructor did respond to a couple questions over the semester, but was largely absent.  \n\nCourse pacing:  The course seemed to be paced oddly.  Some of the weeks had multiple things that were due, and at other times, things seemed pretty spread out.  \n\nErrors in materials:  The slides and the transcription were incorrect, and not just in a few places.  I found at least 10 errors in the slides and the transcription document… and they were not just typos, but the kind of errors that could really put a person on the wrong track.\n\nTextbooks:  The first textbook was valuable, but the second one on generalized linear models was not useful at all.\n\nExtermal Resources:  I probably spent as much time on Penn State’s website and looking at Introduction to Statistical Learning in R than I did with the course materials.  That doesn’t speak well for a class that I spent over $1k to take.  It is really frustrating, and makes me angry that Georgia Tech didn’t do a better job offering the course than Penn State.  Seriously makes me mad.  Come on, GT, we are better than that!\n\nExams:  The midterm exams had questions that were worded pretty poorly, and really split hairs.  I didn’t get the impression that the intent was to trick people, just that the questions needed to be more direct and worded better.  For non-native English speakers, I think that the was significantly more energy required to parse some of the questions than the underlying concepts.\n\nTopics covered.  This course doesn’t cover PCA or CART, which is really unfortunate.  It goes into a lot of statistical details, but doesn’t spend much time on the linear algebra perspective linear regression.  Also, I felt that the explanation of regularized regression techniques (Lasso, Ridge and Elastic Net) were actually covered better in ISYE 6501.\n\nOffice hours:  I would recommend fewer office hours, but with much more structure.  The office hours were mostly good, but they were completely open ended.  Having some structure would have really helped, and made the much more worthwhile.  TAs gave A TON of these sessions, it is too bad that they could not have been a better use of time.  \n\nI do hope this course gets updated in the future.  It is worth taking, but can be frustrating.",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_type": "review",
                        "id": "external-import-4e134b94-de20-4229-95fb-1eef41b1b247",
                        "_createdAt": "2020-04-24T14:59:20Z",
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester"
                        },
                        "_id": "external-import-4e134b94-de20-4229-95fb-1eef41b1b247",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4
                    },
                    {
                        "id": "external-import-cde9df27-15f0-4b7d-88fd-0c11c629f771",
                        "semester": {
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_createdAt": "2019-12-30T09:58:19Z",
                        "course": null,
                        "_type": "review",
                        "body": "I'm very glad to have taken this course, though my relatively weak stats background (I'm more of a probability gal) made it a challenge, especially the first 1/3-1/2.  You might think an entire course about regression analysis would be a bit light, particularly if you're already experienced in machine learning; you're fitting a line, right?  Haha, no.  When you're done with this class (or it's done with you), you WILL understand regression - and in particular how to evaluate regression models, choose among models and figure out how reliable their estimates (or predictions) are.\n\nDownsides: the wording of exam and homework questions is sometimes a little off, and it requires a certain amount of teasing out what they really meant to ask.  (The instructor is reasonable about these, though, and if the wording is outright incorrect she will make sure points aren't deducted.)  It's easier at the end of the course than at the beginning.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2019-12-30T09:58:19Z",
                        "workload": 10,
                        "_id": "external-import-cde9df27-15f0-4b7d-88fd-0c11c629f771",
                        "difficulty": 4,
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "body": "The course by itself is very important from a Data scientist perspective . It took me some time to get acclimated to Prof Nicoleta Serban's accent in the lectures. Course content is good with the right balance between underlying math,stats and application. Lot of examples covered in the lectures, Assignments and exams.  The combination of open and closed book assignments helped rehash the concepts and application of the concepts clear. The time for the open book section in exam is not sufficient  though. Easy to score an A in this course. Mike, the TA was exceptional.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-9b4fdaf6-c144-46f5-8225-286a404c2616",
                        "_createdAt": "2019-12-26T17:20:44Z",
                        "difficulty": 2,
                        "_type": "review",
                        "workload": 8,
                        "_id": "external-import-9b4fdaf6-c144-46f5-8225-286a404c2616",
                        "created": "2019-12-26T17:20:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "created": "2019-12-18T04:43:27Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 5,
                        "body": "Overall, the course is not very enjoyable. The content itself is important and crucial to know as a data scientist, but the content provided by the course does not do a good job of teaching it. There are numerous mistakes in the lectures / slides and they are hard to get anything out of. Expect to refer to ISLR or other reference textbooks to get a grasp on the material. There are unclear questions in the homework and exams, including a decent amount of \"gotcha\" style questions that don't test your true knowledge of the content. \n\nThe workload is manageable, so the course can be pretty easily paired with another course. Hopefully the course is re-done soon, otherwise it may be worth avoiding unless you accept that you will be learning finding your own resources and dealing with some mistakes and wording issues.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 3,
                        "_createdAt": "2019-12-18T04:43:27Z",
                        "id": "external-import-7e99ed3f-53ad-478c-8c0c-2e2a4155d33d",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "_id": "external-import-7e99ed3f-53ad-478c-8c0c-2e2a4155d33d",
                        "difficulty": 3,
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester"
                        },
                        "_id": "external-import-9ebc572c-29e9-430a-8c80-7ed7f4bf9ef9",
                        "id": "external-import-9ebc572c-29e9-430a-8c80-7ed7f4bf9ef9",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "rating": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "created": "2019-12-17T04:13:08Z",
                        "difficulty": 3,
                        "_createdAt": "2019-12-17T04:13:08Z",
                        "workload": 5,
                        "body": "I strongly recommend taking another course. Please read the below reviews. You're welcome."
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "_id": "external-import-fb89eac5-658d-4a22-8338-a20dea85d98b",
                        "id": "external-import-fb89eac5-658d-4a22-8338-a20dea85d98b",
                        "created": "2019-11-20T22:49:49Z",
                        "_createdAt": "2019-11-20T22:49:49Z",
                        "body": "This is the worst class I've ever taken. Bad lectures, bad assessments, bad TA's, bad everything. I have an A and expect to finish with one -- I'm only bitter, because I want to learn, and if that's your goal, this class is the literal worst and a total waste of time**. If all you want is a 4.0 GPA for a useless degree and no hireable skills, then go for it.\n\n** instead I'd recommend going through the first 6 chapters of Intro to Statistical Learning (free book + MOOC) on your own time. It doesn't cover everything, namely ANOVA and Poisson Regression, but it covers all of the useful stuff and it's so much better. At least 10x better.\n\nNote: it's possible the class will be improved in the future as I've heard from Dr. Sokol himself that it's being worked on... until then, STAY AWAY",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 1,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "workload": 5
                    },
                    {
                        "_createdAt": "2019-08-12T19:52:21Z",
                        "_type": "review",
                        "body": "I really disliked this class. Many other posters have touched on my points, but to recap:\n- Low quality production: There are multiple lecture videos where the professor pauses, says \"wait wait we need to re-take this\", and then starts from the top. Apparently nobody did a review of the videos before posting, because the final edit includes all of the outtakes. It feels cheap, considering the lectures are many semesters old.\n- The lectures are dry\n- Half of the homework, and about half of the midterm/final, is in a T/F or multiple choice format. It seems like very little thought was put into writing these sections of the homeworks and tests. This really isn't a program/topic that should be taught through rote memorization (when in the working world is your boss going to do a pop quiz on the number of degrees of freedom for an ANOVA residual??? how is that useful???), but combine that with abundant grammatical issues and various trick (\"gotcha\") questions, and these portions of the course became nightmares. I'm a native English speaker and can only imagine how hard the class was for those who are not.\n- There were lots of TAs and most were super helpful. It was still a mixed bag when asking for input, though. I saw many incorrect responses from TAs that led students down the wrong path, and the lack of organization on Piazza meant that significant guidance/direction on a homework was buried in a thread and not pushed to the full class.\n- This seems like a small thing, but the entire term started off so stressful because the syllabus was so hard to understand. The content of the first few units was easy - basic regression, ANOVA, etc. But there is a language/grammatical barrier in the explanation that creates stress when nobody understands what is expected of them.\n\nIt's really a shame because the topic is so important, but I finished the summer term with more resentment than appreciation for the course. Hopefully the professor can put the required time and attention into improving the quality and teaching methods (no more T/F - they have no place in this program).\n\nQuick note on the 7hr/week estimate during the summer term. Homeworks were due every two to three weeks in the shorter summer term, so there was a good amount of content to cover in each. I typically spent 14 hours per homework, but that included 3.5 hours to watch the videos, 3.5 hours to read the lecture transcript (honestly, I had a hard time understanding good portions of the videos, so I read the transcript slowly and in detail), 1.5 hours to do the T/F portion of the homework, 4.5 hours to do the coding/open response portion of the homework, and 1 hour to peer review.",
                        "workload": 7,
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 2,
                        "_id": "external-import-74cad377-5e6e-4bdf-9038-79737c325856",
                        "id": "external-import-74cad377-5e6e-4bdf-9038-79737c325856",
                        "created": "2019-08-12T19:52:21Z",
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "body": "This class was very straightforward. It basically covered basic concepts over again but in more detail. The homework weren't too difficult but definitely took time. They are also peer graded- which meant little feedback and a wide variety of scores.  Dr. Serban is also very hard to understand, so I didnt watch a single lecture- instead I read all of the transcripts. \n\nHer tests were also included some very detailed information- that one sentence from that one slide kind of question. She was also very hands off and let the TAs handle everything. So when you needed clarification on something you sometimes got great help and othertimes you did not. Really depended on the TA. \n\nOverall this course wasnt great, but wasnt too difficult either. I ended up with an A in the course.",
                        "created": "2019-08-12T17:44:21Z",
                        "course": null,
                        "difficulty": 3,
                        "_createdAt": "2019-08-12T17:44:21Z",
                        "_type": "review",
                        "rating": 3,
                        "workload": 5,
                        "id": "external-import-0a53103e-874c-4cd4-bb9f-27264806a834",
                        "_id": "external-import-0a53103e-874c-4cd4-bb9f-27264806a834"
                    },
                    {
                        "rating": 4,
                        "id": "external-import-1e216291-1e4a-43b3-80d4-8d41e7b9fcee",
                        "workload": 6,
                        "_id": "external-import-1e216291-1e4a-43b3-80d4-8d41e7b9fcee",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-08-12T08:07:02Z",
                        "_createdAt": "2019-08-12T08:07:02Z",
                        "_type": "review",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "course": null
                    },
                    {
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        },
                        "id": "external-import-464d2a6b-48f0-497a-820b-a000a2b1f6dc",
                        "created": "2019-08-08T12:31:10Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_id": "external-import-464d2a6b-48f0-497a-820b-a000a2b1f6dc",
                        "_createdAt": "2019-08-08T12:31:10Z",
                        "rating": 4,
                        "workload": 12,
                        "difficulty": 4,
                        "course": null,
                        "body": "The course content alone should make this one of the more useful classes in the OMSA curriculum. I was really excited about gaining a deeper understanding of regression analytics after having a very good experience with 6501. However I was disappointed by the high number of mistakes in the materials and confusion among TAs on quizes and exams. The power point presentations seemed rushed and very low quality compared to Dr. Sokol's lectures. I think there is quality assurance issue across the OMSA program and this could make the case for more oversight given that the delivery mechanism is conserved in this learning system. \n\nGood: \nStarter code and examples\nTopics were useful and insightful\nTAs were willing to help\n\nBad:\nErrors in materials on exams\nT/F, MC questions (not all but too many) were unnecessarily designed to confuse/trick.\nFinal was too long and many didn't finish in the allotted time.\n\nTime: Compared to the battery of homework in 6501 this was reasonable load (4 HWs due bi-weekly, 2 exams).\n\nAll in all I recommend this class but caution about reading the content carefully and be cognizant of the assessments and intention to trick you into the wrong answers."
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "_type": "review",
                        "body": "This is one of the worst classes I have taken.  Poor lectures and bad exams with T/F questions that were pure memorization.  The TAs were helpful which was the strong point as the instructor was virtually non existant.  Overall the workload is not bad and I did like some of the homework exercises but would not take it again.",
                        "_createdAt": "2019-08-07T01:36:43Z",
                        "rating": 1,
                        "workload": 10,
                        "_id": "external-import-9e057c57-a183-441e-9163-bdb6beedd8f3",
                        "difficulty": 3,
                        "id": "external-import-9e057c57-a183-441e-9163-bdb6beedd8f3",
                        "created": "2019-08-07T01:36:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "id": "external-import-5f231709-08b4-4cb6-9a84-070708fc29b1",
                        "difficulty": 3,
                        "_createdAt": "2019-08-06T14:01:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_id": "external-import-5f231709-08b4-4cb6-9a84-070708fc29b1",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "created": "2019-08-06T14:01:57Z",
                        "course": null,
                        "body": "This course was definitely a mixed bag. The biggest complaint I have is that the grading scheme doesn't measure understanding of the material very well. I feel like I learned a lot from the peer-reviewed portion of the homeworks and had to learn markdown, which seems worthwhile.  For the closed book portions, T/F and MC questions were mostly just worded poorly in an attempt to be tricky. the tests were pointless. \"open book\", but timed. proctortrack is absolute garbage. I feel like i lost a lot of points because i couldn't use my normal computer setup. The TAs actually were pretty good in this class. they seemed to care. Videos were not that great and could really use some editing.  You get a little more detail on regression than you do in 6501 and 6203, but not sure it is worth all the hassle.",
                        "rating": 3,
                        "workload": 8
                    },
                    {
                        "workload": 10,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2019-08-01T17:50:07Z",
                        "course": null,
                        "_id": "external-import-bc6d79c8-11d1-451e-8c8a-4270f5191bd9",
                        "body": "Pros: Regression Analysis is a very important statistical analysis to know and it is very applicable to real life. \n\nCons: Lectures are very long and it was hard for me to digest. I consider the best teachers to be the ones who can take a complex concept and be able to explain it in a way that a smart 12 year old can understand it. Professor Serban was not able to do this. I suggest you rely on external resources if you do not understand a concept.\n\nHW and Exams: Many people complained that the wording for the T/F and MC questions were tricky and they definitely are. But if you go in with the mentality that she is trying to trick you and read every SINGLE word in the question, you should be fine.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-bc6d79c8-11d1-451e-8c8a-4270f5191bd9",
                        "created": "2019-08-01T17:50:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 3,
                        "difficulty": 3,
                        "_type": "review"
                    },
                    {
                        "id": "external-import-a1a125c2-e63c-4896-aa85-1d92932d8ec8",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 20,
                        "body": "I was very excited to take this class, as I really enjoy Regression Analysis. The content is interesting, and I do feel that I have a better understanding of regression analysis after finishing the course. However, the current design of the course is frustrating and led to a very difficult experience. The True / False component of the homework has questions written in a manner that was very difficult to understand, and it could take a very long time to unwind what the question was asking. I did think that they TAs and Dr. Serban were fair in regrading any questions that were too confusing. The R portion of the assignments were not unreasonable, and I appreciated the sample code provided by Dr. Serban. I think my largest difficulty in this class was trying to reconcile the lectures and how the content was being assessed in the homework and the assignments. There seemed to be a large degree of confusion between the TAs at the beginning of the course, and it was difficult to get a good answer. I did enjoy the numerous opportunities for office hours and the TAs were usually very responsive on Piazza. \n\nOverall, I learned quite a bit, but did not fully enjoy the experience, as I felt the assessments of learning were not designed in the best way to measure true understanding of the content.",
                        "_type": "review",
                        "_createdAt": "2019-08-01T17:47:20Z",
                        "created": "2019-08-01T17:47:20Z",
                        "rating": 2,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        },
                        "_id": "external-import-a1a125c2-e63c-4896-aa85-1d92932d8ec8",
                        "difficulty": 4,
                        "course": null
                    },
                    {
                        "rating": 3,
                        "_id": "external-import-59a1f124-a694-446b-988e-85230dcf6a8e",
                        "id": "external-import-59a1f124-a694-446b-988e-85230dcf6a8e",
                        "created": "2019-08-01T14:08:42Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 12,
                        "difficulty": 4,
                        "_type": "review",
                        "body": "Overall, not a bad class. I learned material in addition to mgt 6203 and ISYE 6501. \n\nThere are 4 HWs and 2 exams. Each of the HWs has 2 parts - a quiz of approx. 25 questions worth 50 pts and an R portion with some interpretation also worth 50 pts. Though I think peer reviews for the second HW part were useless in terms of feedback, I'm glad that we were graded that way because most students were fairly lenient and I mostly got 1 person who was harsh. At the end, since the median grade was the final one, one needed 2 decent graders to score well. \n\nLectures: This is my biggest piece of feedback: fix the lectures. The delivery is dry and hard to follow. I stopped listening to them after week 2, instead pausing the videos and fast forwarding through the script. The lectures could be simplified - 1-2 videos on theory, 2-3 videos on practical examples. That being said, I found the examples provided to be really good, real life ones. My experience was to read Penn State's online lectures after the videos so I can extract the highlights. I also made detailed notes after each topic in an attempt to summarize the most important points.Another suggestion is: do not overlay multiple screens in the lecture slides, it makes it hard to print them out and take notes without having to re-work them manually. Overall, small stuff but combined it makes a difference.\n\nExams: largely ok, though there were times when the questions were tricky, with multiple possible answers and overpenalization if you don't select the exact combination + added pressure from the time limit and Proctortrack. I prefer non-proctored exams, even if that means more analytical questions and more comprehensive coverage, given enough time to sit and think through them.\n\nThe class is doable in the summer because the professor makes the material available ahead of time + you have 2 weeks for each HW, so even if you combine it with an easier 2nd class you can go through it. With a little more work in strengthening the lectures, this class could be a strong one since it covers great topics and the examples provided are really good. I don't know how MGT 6203 will be reworked starting Fall 2019 but as of now I think if you take ISYE 6501 first and ISYE 6414 second, you'll be good with basic stat concepts. MGT 6203 is not necessary.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-08-01T14:08:42Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        }
                    },
                    {
                        "rating": 4,
                        "course": null,
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "id": "external-import-d57179ce-2d55-4926-99c8-7d13b5596bee",
                        "_type": "review",
                        "_id": "external-import-d57179ce-2d55-4926-99c8-7d13b5596bee",
                        "body": "I was hesitant to take this course in the context of the reviews I've seen previously.  That said, while I believe that much of the criticism is justified, it was still a worthwhile experience and not a particularly hard graduate course.  Commentary about the errors in the lectures is quite true, and the method for assessing understanding (True/False questions that are sometimes worded problematically worded) is not a good choice.  Some had issues with peer grading of the coding portions of the course (in terms of peer graders being inappropriately harsh or even incorrect).  I think my biggest critique of the course is that the material is not taught as clearly as it really could be - I began rewriting information for my own understanding and I did not find it difficult to make clear.  On the positive side, this has been an immediately valuable class, and I never would have sought out an understanding of the math and statistics around regression without it.  Additionally, the TAs were extremely responsive and very strong on the topic - probably the best I've seen so far.",
                        "difficulty": 2,
                        "_createdAt": "2019-08-01T12:37:54Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-08-01T12:37:54Z",
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "_id": "external-import-7805893a-faff-4e16-a359-fc6271a899ae",
                        "_createdAt": "2019-08-01T11:53:13Z",
                        "rating": 3,
                        "workload": 20,
                        "body": "I was really looking forward to this class as I feel regression analysis is a very important skill to have.\n\nI think the topics covered were relevant the the examples including the R code was very helpful. I do believe I learned in this class and it is really worth taking, but it had some challenges as discussed below. \n\nI was disappointed in the videos which has inaccuracies that were constantly being discussed on Piazza and corrected. If you only watched the videos you would be very misled. It was critical to keep up with the corrections from the TAs. In addition some of the ways the professor explained how to interpret results were very hard to follow. I could see by the Piazza posts and office hours discussion I was not the only one struggling with this. I supplemented this class with other classes I found online in order to get a good intuition on some of the topics.  I used the videos to review for tests but this may have hurt me since they were not accurate. \nThank God for the TAs in this class who gave us an accurate version of the transcript to use.  \n\nSince I essentially had to take 2 classes this one and the one I found online, the amount of effort I put into this class was a lot more than expected. \n\nAs for the tests I found the wording of the True/False questions to be an intention to trick instead of teach. It is difficult enough to have a time limit on the testing which really stresses me out anyway, but when the questions are worded in this way you need to take extra time dissecting each word it is even more frustrating. An example, you would have 2 sentences one which is accurate and one which is a judgement call.  I decided in the second test if I would just default all of these to false. This strategy worked pretty well but how disappointing that my answers came down to this type of judgement. \n\nThe office hours I attended some live in the beginning but decided they were not helpful. Later in the semester I started watching the recordings and realized the office hours did improve as the TAs attempted to supplement our learning by teaching topics along the way. These were very helpful in the second 1/2 of the semester along with the links in Piazza that told us which topics were covered in which office hours. \n\nMy suggestion for future classes are to please update the videos so they can be depended on since this is the only interaction we ever had with the professor.",
                        "id": "external-import-7805893a-faff-4e16-a359-fc6271a899ae",
                        "created": "2019-08-01T11:53:13Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 4
                    },
                    {
                        "difficulty": 3,
                        "semester": {
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z"
                        },
                        "created": "2019-07-31T02:04:04Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 5,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "I overall really liked this course. I enjoyed the schedule (4 sections, 1 homework each, ~3 weeks to watch lectures and complete homework in the summer term) much more than classes like the intros (ISYE 6501, CSE 6040) where there is homework due every single week. It lets you live your life a little instead of constantly churning out assignments. \n\nI thought Dr. Serban's lectures were very helpful. They were clear, logical, and followed a common format that made it easy to understand each unit as the semester went on. The lecture transcripts were super helpful and are definitely something that I will hold onto as a tool for reference in the future. The TAs for this particular semester were really great too - super responsive on Piazza and really helpful explanations. I never attended office hours.\n\nThe homeworks (T/F quiz and a peer reviewed assignment) aren't too hard to do well on. I did good on the first test and bombed the final, but I also didn't really put much time into either. \n\nMost importantly, I've used some of the stuff I learned in real value-added projects at work. That's why I'm in the program.",
                        "_type": "review",
                        "workload": 8,
                        "id": "external-import-fd64ff4c-862d-4b38-8b2c-940c0bf171a3",
                        "_createdAt": "2019-07-31T02:04:04Z",
                        "_id": "external-import-fd64ff4c-862d-4b38-8b2c-940c0bf171a3"
                    },
                    {
                        "rating": 1,
                        "workload": 7,
                        "_id": "external-import-3887a198-d758-4567-a514-2feba9fdb8f0",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "I am just going to echo my frustration wind this class another review which perfectly summarizes this class for me:\n\nThis was the worst course I've ever taken in a collegiate setting.\n\nThe worst thing about this class has been unclear instructions and expectations, combined with a lack of timely responses from the TAs and no responses (ever) from the instructor.\n\nQuestions on homeworks / exams were frequently confusing / poorly-worded\nThe last homework assignment was so poorly designed that it was impossible to know if your result would match the \"solution\" because the instructors didn't understand what effect setting a seed has\nMajor issues and questions raised on Piazza went unanswered for days or over a week in some cases\nQuestions that were answered on Piazza were often answered incorrectly or incompletely by the TAs\nRules and expectations for exams were changed mid-exam window\nThe practice final solutions weren't unlocked until a day or two into the final window\nThe closed book section of the final wouldn't open on day 1 of the finals window\nThis class pretty much requires that you go learn regression on your own somewhere else\nI'm sure there is more I'm forgetting...\nLecture Videos:\n\nLong, boring, and difficult to follow. There are frequent mistakes in both the words the professor is saying as well as the transcript. It's so bad that the students have crowd-sourced a more-accurate transcript so people can have a chance at figuring out what's happening.\nThe professor would throw up a static slide of formulas (e.g. MLE or confidence interval derivations) and talk for several minutes with no real explanations to what was happening on the slide. It was just expected that you would look at it and understand it immediately.\nHomeworks are broken into two parts:\n\nT/F & Multiple Choice section - These usually aren't terrible but the questions are often worded poorly. There were also issues here of how these were submitted in Canvas (in free-form) and then graded by a TA. Towards the end of the semester they realized they should just make all the questions T/F or Multiple Choice in Canvas.\nA coding section that is peer-reviewed - These have been pretty painful. They are often long and extremely tedious. (e.g. Do X, now do that 17 more times). There are 5 of these in total and at least 2 or 3 ended up being more than a 45 page pdf. How the question is phrased and how you are supposed to setup our problems are often ambiguous, which leads to a lot of problems with peer grading. Many peer graders are very strict when it comes to deviating from the \"solutions\"\nMidterm - wasn't terrible. It's in two parts like the homeworks:\n\nClosed book T/F & Multiple Choice questions. The biggest issue here was confusion with the rules. They had posted that people could use a singled-sided formula sheet. However, there was confusion as to what could be on that sheet, which they clarified (and made more strict) halfway through the exam window. So people who took the exam earlier benefited from a more ambiguous rule.\nOpen book (no internet) coding section - This was mostly ok.\nFinal - really bad\n\nClosed book T/F & Multiple Choice questions - very poorly worded questions and the style is very different than the Midterm. There are also a few topics not mentioned at all in the course up until now.\nOpen book (no internet) coding section - this was basically impossible to finish in time.\nWe're still in the exam window and a lot of people are reporting scores < 70%",
                        "_createdAt": "2019-05-07T15:59:50Z",
                        "created": "2019-05-07T15:59:50Z",
                        "_type": "review",
                        "course": null,
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "id": "external-import-3887a198-d758-4567-a514-2feba9fdb8f0"
                    },
                    {
                        "workload": 10,
                        "id": "external-import-84ebafe3-9c5a-4c83-9a10-6d1ea4b95d38",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2019-05-06T12:40:34Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 4,
                        "body": "I liked this class. The student, TA, and professor discussion was useful and much more pertinent than I ever got in college or medical school. I made a ton of progress in my analytical and coding toolboxes. But many of the criticisms were accurate about the course mechanics and especially the final exam. I will probably get B's in both classes because I got nailed on the part II of the final exam for each class.\n\nHow to beat the exams, this applies to 6402 and 6414!\n\n(1) get the course transcripts available the first week. Take notes and make corrections, add slides or equations to them, manipulate formulas to make sure you can apply them.  70% of the MC/TF questions come EXACT from the notes so the EXACT wording actually makes a difference. I used EXACT three times now...I think you get the point. Understanding a concept in general is not enough. The other 30% comes from applying the formulas, graphics, and concepts to solve multiple choice problems (usually worth multiple points and may have multiple correct answers). Many of those questions were \"plug and chug\" IF you have the correct formula.\n\n(2) The midterm was fine.  Final was massive for the amount of time. People that use R in their jobs said they could not finish. \nThe thing I noticed was that all the exam part II (Regression and TSA) questions were combinations of the homeworks or sample codes given in the classes. The questions were fair. The problem was adapting them fast enough to use on the test.\n\nGet together in groups to save time. Go through all the R code examples in the class and homeworks. Turn them into \"GENERIC\" functions....SHARE WITH YOUR CLASS AND CHECK THAT THEY WORK. If you can just transform your data and feed it back and forth into your canned functions (you can copy and paste them from R or Rstudio into your test document) it would allow you to get done with time to spare. you can even go so far as to put in some canned explanations with fill in the blanks (rememeber MADLIBS as a kid) accompanying your code and all you have to write is (IS/IS NOT CORRELATED) (IS/IS NOT MULTICOLLINEAR ....etc)  (HYPOTHESIS TEST  < > p.value indicates ...) \n\nIf you built the functions well you will have to alter less code to adapt it for the exam.\nyou can lose 30-60 minutes if you mismatch your data types or need to debug subscripts to ensure alignment. If you have to do that AND adapt your code you will have a rough day.\n\nNone of these are hard, you will learn to do them, but you need to move fast. This is what I remember off the top of my head. Disclaimer...I do not have perfect recall so forgive me if I make a mistake here.\n\n1 Splitting a dataset into training/test\n\n2 performing data analysis and graphics including boxplot, scatterplots, correlation, correlation matrices\n\n3 Models for linear regression,  multiple linear regression with and without log transformed predictors and responses \n\n4 Models for logistic regression with repetitions for error analysis and without repetitions for classification errror. \n\n5 Poisson model\n\n6 Subset model (forward, backward, both)\n\n7 all subsets models(LEAPS library)\n\n8 hypothesis test (normality, correlation)\n\n9 residual plots and analysis \n\n10 plotting the data and a fitted model on the same plot\n\n11 using your models to generate predictions\n\n12 calculate your prediction errors (MAE,MPSE, MAPE...) and RMSE\n\n13 perform elastic net, ridgem and LASSO regression along with accompanying plots and prediction errors\n\n\nTime series\n\n1 Take a series of dates from factor or string to a DATE\n\n2a Fit a time series data set with a linear, polynomial, quadratic, harmonic, and splines regression, and be able to predict a few points ahead.\n\n2 plotting ACF, PACF, for original data, differenced data, residual data, and squared residual data\n\n3 arrange time series forward or backward in time \n\n3a plot multiple time series plots aligned on the same graphic\n\n4 be able to use forecast to predict values and plot them on top of a time series (using base package or ggplot2)\n\n5ARIMA - including submodels AR and MA and ARMA and EACF\n\n6GARCH \n\n7 ARMA-GARCH iteratively \n\n8 plotting squared residual plots to check for autocorrelation\n\n9 Calculating and interpreting hypothesis testing for significance, normality, correlation\n\n10 apply a vector autoregression model\n\nI recommend both classes",
                        "created": "2019-05-06T12:40:34Z",
                        "_id": "external-import-84ebafe3-9c5a-4c83-9a10-6d1ea4b95d38",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "course": null,
                        "workload": 10,
                        "id": "external-import-11c237db-2888-409a-9a4a-4c2e41204d28",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "_id": "external-import-11c237db-2888-409a-9a4a-4c2e41204d28",
                        "body": "Material is presented clearly and in a logical order. Sometimes the lectures can be a bit lacking in coherence for the highly theoretical material, but the data/coding examples are extremely well done and relevant to assignments and real world application. Peer grading is always a little bit of a crapshoot, but for the most part people seemed fair and even erring on the side of generosity. The final included a sizeable amount of material that was not at all covered in the material, though I suspect there must have been a generous curve or very lax grading because grades seemed reasonable. \nA large portion of the exam is coding. Material isn't hard and it is open notes so you can copy from homework and example code pretty effectively, but it is proctored with that crummy ProctorTrack software that doesn't allow for any breaks whatsoever, and the test itself is 3 hours long. I contacted the professor and TAs after the the exam because this requirement is unreasonable and hopefully it is somehow altered, but in the meantime you will definitely need to plan accordingly... I kept an empty gallon jug under my desk...",
                        "difficulty": 3,
                        "_createdAt": "2019-05-06T09:40:04Z",
                        "created": "2019-05-06T09:40:04Z"
                    },
                    {
                        "_id": "external-import-1b8611f4-151c-4ee9-a957-eeb65baf154f",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "course": null,
                        "workload": 8,
                        "id": "external-import-1b8611f4-151c-4ee9-a957-eeb65baf154f",
                        "created": "2019-05-01T19:37:07Z",
                        "_createdAt": "2019-05-01T19:37:07Z",
                        "rating": 2,
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "I had taken ISYE6501 and MGT6203 before this class, both of which touched on regression. Also in both, classes, instructors and TA's stressed the importance of regression analysis, even going as far as saying that regression is used in 90% of analytics work you will be doing in the real world. So I was very interested in taking this class.\n\nContent:\nThis class goes deep into the Mathematical basis of regression. Not much new will be learned in terms of practical application and R that was not already taught in 6501 and 6203. In fact, even on the theory side, I found myself at times re-reading my notes from 6501/6203 to refresh my memory on concepts being taught in 6414. The way regression was taught in those 2 classes gave me a good intuition of what is happening in regression, something I would not have got from the way this class was taught. Unfortunately in my opinion, this is a case of \"everything you really need to know, you learned in kindergarten (6501/6203)\".\n\nInstructor/TA's:\nTA's did a good job and were fairly responsive. Not much interaction with the instructor on Piazza, but I believe she did hold weekly live discussions on Bluejeans. Unfortunately due to time conflict, I could not attend those.\n\nExams/Homework:\nAll homeworks (4) and midterms were very manageable. Things changed drastically with the final exams, which caught many in the class off-guard. The final had 2 parts - 1st closed book test on theory; 2nd open book practical. The mean grade on part 1 was 62%. No grades yet on part 2, but judging from discussions on Piazza, grades will be worse than part 1. It was unreasonably long - the equivalent of 2 homeworks (I spent an average of 4 hours on each of previous homeworks), expected to be done in 1.5 hours.",
                        "difficulty": 3
                    },
                    {
                        "created": "2019-05-01T06:14:21Z",
                        "difficulty": 3,
                        "_createdAt": "2019-05-01T06:14:21Z",
                        "workload": 10,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "- Easy course to get an A in, although I would rate assignments to be overly repetitive. I did ISYE 6402 in this semester as well, and found both courses run by NS to have long assignments.\n- Had homework quizzes that we too easy.\n- Mid-semester exam was too easy.\n- To compensate for easy quizzes and mid-semester exam, they set a tough final to create cross-sectional spread in marks and differentiate students. Was good for me, because my daily work requires use of R and I'd consider myself proficient in this language. Bad for new users of the statistical language.\n- A key drawback was the lack of explanation in some concepts. To prepare for exams, I went through lecture videos/lecture notes/my notes 2-3 times. However, concepts were tested that were beyond the scope of the materials. \n- Easy course, but required hours on assignments.",
                        "id": "external-import-148bd3c1-14f0-4cda-ba0e-e7f3e4688ceb",
                        "_id": "external-import-148bd3c1-14f0-4cda-ba0e-e7f3e4688ceb",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 4,
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 3,
                        "body": "Overall, I had a decent experience in this course (except for the final exam, which I will discuss shortly). Dr. Serban's lectures were fairly informative, if perhaps, a bit long-winded. The assignments were reasonably challenging from an intellectual standpoint (not overly so, however), but they did a solid job of mirroring/testing what we learned in the lectures and were graded via peer-review (not a good thing due to the subjectivity inherent in the assignment answers and the different attitudes/outlooks of the student graders). Some of the assignments were quite lengthy (one of our assignments had an average submission file length of 35 pages and the solution file was 51 pages!), but we usually had 2+ weeks to complete them. The midterm was reasonable and had both a multiple choice section and a moderate coding section (both were completed while being proctored under timed conditions). \n\nHowever, I do have one severe criticism pertaining to the final exam. Again, it was a 2-part exam with one part for multiple choice and one part for programming in R. I mentioned in the above paragraph that our assignments, while of reasonable difficulty, could be rather long. The coding portion of the final exam had 2 questions, each of which probably required at least 10 pages worth of R-code/plots/analysis exported to a pdf file in order to complete with a decent level of correctness/soundness. All of this was expected to be completed within 2.5 hours while being proctored. This generated a significant outcry from students on Piazza. To my knowledge, few (if any), actually finished the coding portion in its entirety; even the quick/talented/experienced individuals who use R regularly at their jobs were vocal about their displeasure with the amount of work required for that small time window. If we had an extra hour or so to do those questions, things would have been manageable, but as it stands, the instructors essentially tried to cram one of our 2 week 25 page homework projects into a 2.5 hour proctored time slot. That's just not doable for probably 90+ percent of the class. It remains to be seen if there will be a curve for it, but there will hopefully be something to help the students out, since the majority of people probably only finished the first question with the requisite answer depth/quality (myself included).\n\nOverall, I would have been pleased with the course, but the highly unreasonable nature of the coding portion for the final exam really reduced my view of it. I hope that future classes either a) get more time to complete that much proctored coding/analysis or b) not have to try and do as much within a 2.5 hour window. If they can improve that, this course will be pretty solid in my view.",
                        "difficulty": 3,
                        "_createdAt": "2019-04-28T20:24:02Z",
                        "_type": "review",
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-1351dad3-1d0e-4a94-9540-aed753d5c351",
                        "id": "external-import-1351dad3-1d0e-4a94-9540-aed753d5c351",
                        "created": "2019-04-28T20:24:02Z"
                    },
                    {
                        "difficulty": 3,
                        "rating": 2,
                        "_id": "external-import-70dbcae2-e4d0-4c7a-909b-dcdc172edd2e",
                        "_createdAt": "2019-04-28T14:52:51Z",
                        "_type": "review",
                        "id": "external-import-70dbcae2-e4d0-4c7a-909b-dcdc172edd2e",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "This course needs a lot of work, and in it's present incarnation, is a waste of your time. You will have to learn regression yourself, from other sources. In the meantime, you will be under pressure to do repetitive, mind numbing homework, take multiple choice exams that don't test knowledge, but rather how to study the instructors badly worded asking style. I'm not sure i learned anything much in this class.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "created": "2019-04-28T14:52:51Z",
                        "workload": 10
                    },
                    {
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1"
                        },
                        "body": "This class was remarkably underwhelming. It's too bad, because Advanced Regression could be one of the best courses in the program. The class isn't really hard at all, except for the closed book final exam. My workload was around 6-7 hours a week max, and some weeks it was 2-3 hours.\n\nThe lecture quality and poorly worded quiz questions (that often get regraded because the Professors/TAs realize they're wrong) are the mot frustrating parts. There are multiple videos that the professor says \"Wait I need to redo that, can we start over?\". I don't really care that it's in the video, but it just shows the lack of effort that is put into the videos and course structure. I took this class in Spring 2019 and former students said they remember the same thing from 2+ years ago. \n\nA couple of the homeworks were very long, but not challenging at all. You get some copy and paste practice, but not much else.  The last homework assignment is probably the most beneficial, but again, there was a lack of guidance on some of the questions, and TA response time was very slow at times (might not be their fault).\n\nI think a restructuring in the class is needed. This was my third OMSA class, and the other two I thought were outstanding (6040 and 6501). I hope future students get a redesigned class, because Regression is something that can generally be applied right away, even if you're in a lower level Data Analyst role.",
                        "difficulty": 2,
                        "workload": 7,
                        "_id": "external-import-0be00403-ef79-417a-ae3c-2fa816817891",
                        "id": "external-import-0be00403-ef79-417a-ae3c-2fa816817891",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 2,
                        "_createdAt": "2019-04-28T13:59:10Z",
                        "created": "2019-04-28T13:59:10Z",
                        "_type": "review"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "_type": "review",
                        "rating": 1,
                        "workload": 7,
                        "body": "I will break by feedback into three parts: 1. the material , 2. the assessments, 3. the running of the class.\n\n1. The class generally covers some interesting and useful topics, however as we have to take ISYE6501 and MGT6203 we have already come across everything in this class at least once. What we get here is some additional statistical depth, and some extra practise with different datasets. I don't think there is enough here to justify taking the class, even if it was taught well. As for the delivery, the lectures are extremely dry and often confusing. In addition there are a lot of mistakes in lectures and slides which have not all been corrected yet after multiple semesters.\n\n2. The HWs are split into TF/MC questions and submitted coding reports. The TF/MC questions generally feel like they are either ridiculously straight forward or like they are written to deliberately mislead. They are overall not too bad, but when you get a question wrong it's usually because of the way the question should be interpreted rather than the difficulty of the question. The coding reports, which are peer reviewed, are usually excessively long and repetitive - they could assess the same material in a couple of questions but instead choose to repeat the same instructions sometimes 10+ times with small variations. The midterm was very fair, even perhaps too easy. The final however was awful - testing areas of the class which were never really covered, potentially incorrect auto-grading, badly worded questions, coding section was too long to be completed reasonably in the time limit...\n\n3. The class has been really badly run. Aside from the mistakes in the lectures and notes, and the frequent terribly worded questions in HWs and tests, TAs are MIA (or very selective in which questions they answer) for large portions of time, even within the final exam windows. There is often a lack of clarity around things which should be very simple, like test instructions. It just feels in general like minimal care is put into the running of the class, which is really frustrating for students.\n\nIn summary, avoid this class unless you enjoy being frustrated and wasting your time. I really hope for the sake of the program they revisit this class and improve it, as it is quite a foundational topic and will be a first pick for many new students.",
                        "id": "external-import-f0b32a77-158e-463e-a716-08dd707dd42f",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_id": "external-import-f0b32a77-158e-463e-a716-08dd707dd42f",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_createdAt": "2019-04-27T20:45:50Z",
                        "created": "2019-04-27T20:45:50Z"
                    },
                    {
                        "id": "external-import-7b00bc84-8f91-4a82-bb04-0b1a9f8bac2c",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "body": "This was the worst course I've ever taken in a collegiate setting.\n\nThe worst thing about this class has been unclear instructions and expectations, combined with a lack of timely responses from the TAs and no responses (ever) from the instructor.\n* Questions on homeworks / exams were frequently confusing / poorly-worded\n* The last homework assignment was so poorly designed that it was impossible to know if your result would match the \"solution\" because the instructors didn't understand what effect setting a seed has\n* Major issues and questions raised on Piazza went unanswered for days or over a week in some cases\n* Questions that were answered on Piazza were often answered incorrectly or incompletely by the TAs\n* Rules and expectations for exams were changed mid-exam window\n* The practice final solutions weren't unlocked until a day or two into the final window\n* The closed book section of the final wouldn't open on day 1 of the finals window\n* This class pretty much requires that you go learn regression on your own somewhere else\n* I'm sure there is more I'm forgetting...\n\nLecture Videos: \n* Long, boring, and difficult to follow. There are frequent mistakes in both the words the professor is saying as well as the transcript. It's so bad that the students have crowd-sourced a more-accurate transcript so people can have a chance at figuring out what's happening.\n* The professor would throw up a static slide of formulas (e.g. MLE or confidence interval derivations) and talk for several minutes with no real explanations to what was happening on the slide. It was just expected that you would look at it and understand it immediately.\n\nHomeworks are broken into two parts:\n* T/F & Multiple Choice section - These usually aren't terrible but the questions are often worded poorly. There were also issues here of how these were submitted in Canvas (in free-form) and then graded by a TA. Towards the end of the semester they realized they should just make all the questions T/F or Multiple Choice in Canvas.\n* A coding section that is peer-reviewed - These have been pretty painful. They are often long and extremely tedious. (e.g. Do X, now do that 17 more times). There are 5 of these in total and at least 2 or 3 ended up being more than a 45 page pdf. How the question is phrased and how you are supposed to setup our problems are often ambiguous, which leads to a lot of problems with peer grading. Many peer graders are very strict when it comes to deviating from the \"solutions\"\n\nMidterm - wasn't terrible. It's in two parts like the homeworks:\n* Closed book T/F & Multiple Choice questions. The biggest issue here was confusion with the rules. They had posted that people could use a singled-sided formula sheet. However, there was confusion as to what could be on that sheet, which they clarified (and made more strict) halfway through the exam window. So people who took the exam earlier benefited from a more ambiguous rule.\n* Open book (no internet) coding section - This was mostly ok.\n\nFinal - really bad\n* Closed book T/F & Multiple Choice questions - very poorly worded questions and the style is very different than the Midterm. There are also a few topics not mentioned at all in the course up until now.\n* Open book (no internet) coding section - this was basically impossible to finish in time.\n* We're still in the exam window and a lot of people are reporting scores < 70%",
                        "difficulty": 4,
                        "rating": 1,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_id": "external-import-7b00bc84-8f91-4a82-bb04-0b1a9f8bac2c",
                        "created": "2019-04-26T14:59:06Z",
                        "_createdAt": "2019-04-26T14:59:06Z",
                        "_type": "review",
                        "course": null,
                        "workload": 12
                    },
                    {
                        "course": null,
                        "workload": 10,
                        "_createdAt": "2019-03-12T04:37:29Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "id": "external-import-30ff18bb-09b0-4758-921a-81499a78323c",
                        "created": "2019-03-12T04:37:29Z",
                        "body": "Spring of 2019 was the first time the whole course was on edX and then the exams through Canvas.  It's only half way through the course, but I think this is a good course.  Yes, it is tough, especially if you've never really had a statistics course before. (My background is a math degree.) The class uses R and a lot of the code is directly given for both examples to follow along in lectures and in homeworks. Then you write the rest of the analysis.  So if you don't know R well, you'll still be ok.\nThe hardest part of the class are the T/F assessments that are part of the homework quizzes and the exams. There is some tricky wordings and double negatives, etc.  The lectures are challenging to follow but full of information. Dr. Serban offers weekly office hours directly with her, and if you can manage to log in, that is great.  The TAs were available via 4 different office hours also and pretty active on Piazza.   I found the best resource for the material was the Penn State online notes for Regression (Google: Penn State 501 Regression Analysis).   I learned a ton in this class, and I liked that the lectures included several different data sets and that you could follow along with R code and practice.   It was a tough class but manageable, especially if you're already familiar with statistics and regression at an undergrad level.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-30ff18bb-09b0-4758-921a-81499a78323c",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "created": "2019-01-02T00:57:32Z",
                        "body": "Pros:\n1. Real-world, memorable data sets that I think are more interesting than data sets included in R, and will help us remember the material better/longer\n2. Dr. Serban gave weekly office hours - her help in these office hours was tremendous, but also made me feel like she really cared about the course and the students\n3. I appreciated Dr. Serban's respectful and encouraging attitude towards students, even with some complaining on Piazza and Slack (if she ever checked it).\n4. I felt like the TA's did a solid job managing with Dr. Serban.\n5. Lots of great examples of the material.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "difficulty": 5,
                        "course": null,
                        "id": "external-import-d7a2c987-028a-45e7-bc3d-cc0d75966574",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 5,
                        "_createdAt": "2019-01-02T00:57:32Z",
                        "workload": 7,
                        "_id": "external-import-d7a2c987-028a-45e7-bc3d-cc0d75966574"
                    },
                    {
                        "rating": 4,
                        "id": "external-import-c595b227-a1ce-4b95-b70a-1d79f536644a",
                        "created": "2018-12-18T19:56:35Z",
                        "difficulty": 3,
                        "body": "I love Dr. Serban, she highlights important material, and draws students' attention to subtleties in material, contrasts concepts that are easy to confuse. She exhibits concern for students, and seems to be a genuinely good person.\n\nOn the flip side, the amount of typos in both lecture and R code, and occasionally office hours is upsetting: it takes a lot of time (sometimes 2-3 hours) to realize that it's not a disconnect in understanding on the student's side. Hopefully, these will all be corrected for future semesters. Bonus for those of us with jobs - the ability to study ahead, the last half of the units was released mid-semester.\n\nThe midterm was reasonable (not all 4 hours were needed), the final was awfully long and difficult (to make up for the midterm I guess?), I'm talking 4 hours, all proctortracked, going as fast as humanly possible, and still not having enough time to finish everything. Fortunately, the weight was shifted to favor the midterm when computing the final grade.\n\nThe TA's were helpful and nice, but they infrequently provided incorrect answers to academic/coding questions, so pay attention.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3"
                        },
                        "_id": "external-import-c595b227-a1ce-4b95-b70a-1d79f536644a",
                        "_createdAt": "2018-12-18T19:56:35Z",
                        "workload": 15
                    },
                    {
                        "course": null,
                        "body": "I have mixed feelings about this course.  Overall, what good you got out of it was marred by the constant mistakes, errors, poor responses on Piazza, and general feeling of disorganization in this course.  The videos were fine, kind of long, and really dwelt too heavily on theory and not enough on examples and interpretation.  It covered a lot of stuff I knew already (and likely most everyone with an undergrad degree) in too much detail and not enough on the stuff that was net new (basically, anything beyond Multiple Regression).  A ton of the interesting newer techniques were in an optional 6th module that we were never tested on or applied in any way.\n\nThe prof was MIA for most of the course on piazza.  And this will sound very non-PC, but the TAs also were very poor in their english skills.  This made for frustrating exchanges, and VERY POOR QUESTION DESIGNS.  This point cannot be said enough -- with true/false or multiple choice, it felt like 30% of questions had some deficiency that came down to language interpretation.  On essentially every HW or exam, they made changes to question wording because of feedback from students.\n\nThis also speaks a bit to how arbitrary some of this course felt.  Especially when it came to interpreting residual plots -- it felt like the prof or TAs could essentially claim either way (\"this assumption HOLDS\" or \"this assumption does NOT hold\") while I was scratching my head, thinking there has to be a more scientific way to assess the model assumptions.  There probably is, but I won't leave this course knowing them.\n\nThe final exam was also a complete gong show.  Restricted use of the internet was NOT stated in the exam guidelines, which themselves were put an unstickied post.  Then halfway through the exam window, the prof posts that we couldn't use the internet for research during the exam.  I and many others were completely confused and her response boiled down to \"well whatever, it's fine either way\".  The exam itself was INSANELY hard compared to what was seen during the course, and a 4 hour window was not sufficient to finish.  I've never had an exam feel so disconnected from the course material.  To me, it was a further reflection of the lack of care put into this class: they probably didn't even stop to realize how hard that exam was going to be.  They just threw some questions together and thought it was good enough.\n\nSo, after this course, I feel like I could have received what I'll leave this class with in about 2 condensed hours of instruction.  A couple of interesting use cases, but really not much beyond what we already learned in 6501 or in previous undergrad.  A bit of a disappointment -- I was hoping to get so much better armed leaving this class with interesting new techniques and tools.  At the very least, the lecture notes did include code snippets that I'll be able to use in the future.",
                        "difficulty": 3,
                        "rating": 2,
                        "workload": 6,
                        "id": "external-import-2e51f76b-33d3-454b-b474-9b47e8fc9108",
                        "created": "2018-12-11T16:13:11Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_id": "external-import-2e51f76b-33d3-454b-b474-9b47e8fc9108",
                        "_createdAt": "2018-12-11T16:13:11Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        }
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-047cb93d-696b-472d-9d5b-d5309029920b",
                        "difficulty": 3,
                        "_createdAt": "2018-12-10T21:12:23Z",
                        "course": null,
                        "rating": 3,
                        "workload": 7,
                        "_id": "external-import-047cb93d-696b-472d-9d5b-d5309029920b",
                        "created": "2018-12-10T21:12:23Z",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "body": "Course was taken in Fall 2018.\n\nI know not everyone wants to work through derivations and proofs, but this is a course where a little more depth might actually make the material feel easier and feel a little less rote/ad hoc. Overall, I did learn useful things but still feel like I need to pick up a book that can complete my understanding of regression analysis. The professor is nice and very knowledgeable, so I wonder if this is just a course that hasn't adapted as well to an online format.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review"
                    },
                    {
                        "created": "2018-12-10T18:20:12Z",
                        "rating": 3,
                        "_type": "review",
                        "workload": 10,
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-bd6ebef0-0e2c-436f-ba65-c22d1bf0a875",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester"
                        },
                        "_createdAt": "2018-12-10T18:20:12Z",
                        "_id": "external-import-bd6ebef0-0e2c-436f-ba65-c22d1bf0a875",
                        "body": "You will learn regression, but that is mostly as a result of confusing homework and exams that force you to find outside sources for the majority of the content covered in class. Although you will mostly be relying on outside material for the conceptual component, the professor does a good job walking through the regression using R. This class is not very time consuming, but it is very confusing. If this class was cleaned up it would be a really good course, but I can't recommend it in its current state.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_createdAt": "2018-12-07T17:49:22Z",
                        "_type": "review",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "Overall I enjoyed this course -- it provided a lot of the depth I needed to take the Time Series Course, I just wish I had taken this one first (not that this is expressly a prereq for Time Series, but it'll make your life easier).\n\nIn true Prof. Serban form, there are a few questions that could be worded better (or...more accurately to what she's asking?) and the logistics of the course could use some work. But I learned a lot and am applying it in my day-to-day now (looking at you, logistic and poisson regression models!)\n\nAlso, not a bad class in terms of workload. If you take MGT 6203 first, the first module will be fairly easy. The homework's aren't terrible if you follow along with the data example lectures.",
                        "_id": "external-import-2531f4ea-26ba-4378-b8d2-83e438466228",
                        "difficulty": 3,
                        "workload": 7,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 4,
                        "id": "external-import-2531f4ea-26ba-4378-b8d2-83e438466228",
                        "created": "2018-12-07T17:49:22Z",
                        "course": null
                    },
                    {
                        "created": "2018-08-07T02:57:44Z",
                        "_id": "external-import-870ea55a-ae9a-45af-89c0-fb709b56d0fd",
                        "workload": 5,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "body": "If you already took ISYE-6501 with Prof. Sokol, you are ready for this course, as this course use a lot R programming. But in 6501, we only taught to use R commands without knowing in details the underlying theory, math and model assumptions. In this course, Prof. Serban teach us in details the theory, assumption and in practice in R how to tell if the the assumptions holds or not, interpreting the model, and also what things we can do to make the model fit the data better. And of course you will know a lot more than just linear regression, like logistic, poisson regression etc.\n\nIn short, this course will teach you a lot of useful stuff. Be brave about the math details, its there for a good reason. Highly recommended course for anyone poised to be data scientist.\n\nOne thing that needs improvement is the homework, some of them has questions/problems thats confusing, misleading and unclear.",
                        "difficulty": 3,
                        "id": "external-import-870ea55a-ae9a-45af-89c0-fb709b56d0fd",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 4,
                        "course": null,
                        "_createdAt": "2018-08-07T02:57:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "_id": "external-import-77c8a6a3-8519-4299-b8d1-92380852ae28",
                        "body": "Overall good course. Pace was sufficient especially for summer. A decent course to balance with a harder one.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-08-05T11:35:39Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "difficulty": 3,
                        "_createdAt": "2018-08-05T11:35:39Z",
                        "course": null,
                        "id": "external-import-77c8a6a3-8519-4299-b8d1-92380852ae28",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 4,
                        "workload": 4
                    },
                    {
                        "body": "This is a really good course to take over the summer when you have to plan around vacations, moving, and other summer fun. Overall, I would say it is easy to get a B in this class, though you do have to work to get an A. The lecture material is not enough to do the HWs if you don't already have a good base in probability and stats (which I didn't). In summer, we had 4 HWs, 1 midterm, and 1 final.",
                        "id": "external-import-b39a32f3-2ca3-402b-9e1d-ed5a20533295",
                        "created": "2018-08-03T16:56:18Z",
                        "_createdAt": "2018-08-03T16:56:18Z",
                        "_id": "external-import-b39a32f3-2ca3-402b-9e1d-ed5a20533295",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "workload": 12,
                        "semester": {
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "body": "Overall course contents are good. Quality of course material needs attention in terms of errors correction before the course starts.  This includes the Homework assignment questions correction as well.\nBecause of summer (could be) there were only 2 TAs, Piazza questions resolutions were delayed most of the times. Many questions were unresolved even after the course ended. More frustrating was answers provided by one of TA used to be incorrect. Professor used to have a session per week but due to mid-morning timings, it was not possible for many students to attend that session. Personally, I could attend only 1 such session. \nTo succeed in this course you need to spend upto 5 extra hrs on your research and study beyond the material provided.  \nCase studies and programs were provided in the course material which helped a lot for homeworks but again due to material quality and incorrectness, you need to make sure interpretations for those are valid. ( Mainly logistic and Poisson regressions chapters.)\nExams are okay and it is not very hard to get grade A in this course.\nIt would have been great if course provided more opportunities to work on more real life use cases than homework with 100 variables which was of no use. Hopefully material quality gets attention before next semester.",
                        "_createdAt": "2018-08-02T02:00:34Z",
                        "created": "2018-08-02T02:00:34Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "_type": "review",
                        "id": "external-import-5298d3ae-0abf-4529-be27-05a35bf09607",
                        "workload": 15,
                        "_id": "external-import-5298d3ae-0abf-4529-be27-05a35bf09607",
                        "rating": 4,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "id": "external-import-9012be2d-0421-4997-a4d2-ff6c895e56b3",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-05-14T12:53:15Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1"
                        },
                        "difficulty": 3,
                        "created": "2018-05-14T12:53:15Z",
                        "course": null,
                        "_type": "review",
                        "rating": 3,
                        "_id": "external-import-9012be2d-0421-4997-a4d2-ff6c895e56b3",
                        "body": "As others have mentioned, the videos and assignments need some editing. I personally did not find the videos very engaging compared to other courses. They are essentially Prof Serban standing in front of a camera reading slides for an entire semester. Many of the questions on the quizzes/midterms/etc seemed to be open for interpretation and were debated extensively on Piazza. Many of the multiple choice & T/F questions were also very focused on technical theory (i.e \"what is the sampling distribution of the prediction of future responses under the Poisson regression model\") , which is fine for Stats majors, but for OMSA, I will not be retaining this level of detail. The examples were great and the R code provided with the examples gave a great starting point for HWs/Exams. For me, the workload was pretty light. It was essentially 1 week watching videos, 1 week HW, 1 week peer review... repeat 5x & mix in midterms/final. I averaged maybe 4 hours a week and finished with B+. Also- office hours w/ Prof Serban were @ 4 ET- they were recorded, but with only 1-2 students showing up, they were not very useful. I did learn a great deal about regression, but just did not feel engaged by this format.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 4
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv"
                        },
                        "created": "2018-05-05T15:19:14Z",
                        "workload": 7,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-05-05T15:19:14Z",
                        "body": "There are a couple of things going into this class that made it easy for myself personally, namely some stats background and some coding background. Overall, the course was very descriptive when it came to forcing the understanding of the few types of regression models discussed in the class. After taking this class, the takeaways should be the model code and the interpretation of the models both in a statistical way and in layman's terms. The course material itself is quite straightforward, plug-and-play in just about every way and requires more regurgitation skill rather than critical thinking (making the exam open book made the course disgustingly easy).\n\nThere are no surprises in this class - everything on the exam will have been discussed in enough detail in either the lecture videos or homework. If the question was ambiguous or flat-out wrong, the professor would personally review and clarify, even refunding lost points. \n\n5 homework assignments, each having a multiple choice section for a small portion of the grade and then a couple of self/peer reviewed sections having to do with the data analysis. Each one had a few weeks' worth of time to complete, so the timing was quite reasonable unless you procrastinated. 3 exams with the same format as the homework, just spanning additional subjects and 2.5 hours to complete. All reasonable, unless you had a bug in your code.\n\nOnly two drawbacks in this class - the material is incredibly dry and repetitive. There are 15 minute lectures for what could be explained at a high level in 3, but get drawn out and watched regardless (easily half of the week's workload would be taking notes). The key takeaways will be identified in the lecture through boxes (hard copies of the powerpoints screw with physical note-takers like myself, though).\n\nThe second drawback is the lack of statistical discipline by the professor at times. There has been some confusion when the professor uses terms that are not correct in a statistical sense (goodness-of-fit vs. predicting power) early in the course that screwed with lectures later in the course. During this semester, a couple of the videos could have been re-recorded due to some mistakes (I expect this to improve over the course of multiple iterations).\n\nAgain, overall a good course to learn a few powerful, easy-to-understand models and a fairly reasonable class in terms of workload to pair with a perhaps more workload intensive class.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "difficulty": 2,
                        "id": "external-import-a2c5e5f7-c714-4dd5-96e4-5ed9976fd5d3",
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-a2c5e5f7-c714-4dd5-96e4-5ed9976fd5d3"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-05-04T19:32:55Z",
                        "_type": "review",
                        "id": "external-import-9d302cb1-0000-4ce9-a597-394f1e9a5a60",
                        "body": "The course was structured in a good way - videos on theory followed by a practical example.  After taking the course, I'd feel comfortable building a production regression model.  \n\nThe course videos require serious editing/redoing.  It's obvious from some of them that they weren't edited at all.",
                        "difficulty": 2,
                        "workload": 8,
                        "course": null,
                        "semester": {
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z"
                        },
                        "created": "2018-05-04T19:32:55Z",
                        "_id": "external-import-9d302cb1-0000-4ce9-a597-394f1e9a5a60",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4
                    },
                    {
                        "_id": "external-import-3c9c84a4-16d1-491b-b1dc-784854e21307",
                        "body": "I spent 120 hours on this course, or 8 hours on average over the 15 week period. Some weeks were heavier than others. I enjoyed the course! The course material is very interesting if you want a solid grounding in regression (linear, logistic, ANOVA, Poisson) and in Variable Selection; I enjoyed the part on Variable Selection most. The course assignments are in R, but it's not too difficult because R code is always provided and well explained with the lectures; you then adapt this code for the 5 homework assignments, the 2 midterms and the final. \n\nThe problem with this course is that sometimes communication is not clear, multiple choice questions are not well formulated, and there are errors in homework (exercises and solutions). Course staff made an effort to accommodate complaints. But I hope that the course material will be improved for future courses. I took this course in Spring 2018, but think it's doable in the shorter Summer term if you count approximately 12 hours per week .",
                        "id": "external-import-3c9c84a4-16d1-491b-b1dc-784854e21307",
                        "created": "2018-05-04T17:25:32Z",
                        "course": null,
                        "rating": 4,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "workload": 8,
                        "difficulty": 4,
                        "_createdAt": "2018-05-04T17:25:32Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "_id": "external-import-792cf9d6-3b57-4a5f-826f-6b93d116324c",
                        "workload": 8,
                        "created": "2018-05-02T17:00:48Z",
                        "body": "The content of this course is good.  If you come into this course as I did with very little previous education on linear regression, its a great class to start with.  If you don't understand regression and don't know R, I would actually suggest this course as your first course in the program instead of ISYE 6501.  Prof Serban does a nice job taking you through examples in R line by line to help you understand what you are doing.  The biggest weakness of this course is the general organizational stuff.  There were tons of typos in the homeworks and due dates seemed to shift.  The course could also do with a pass through the video transcription to better match the video.  Prof Serban, in the couple of instances I interacted with her, was generally flexible and accommodating of issues and feedback from students.  My only other complaint is that I would have liked to spend more time working with the models talked about in unit six (non linear regression, non parametric regression, etc)  The class focuses on Linear Regresssion, ANOVA, Logistic Regression, Poisson Regression and Variable Selection.",
                        "rating": 4,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3,
                        "_createdAt": "2018-05-02T17:00:48Z",
                        "id": "external-import-792cf9d6-3b57-4a5f-826f-6b93d116324c",
                        "course": null
                    },
                    {
                        "id": "external-import-8f187a90-6e24-42f1-8b9a-1bdba1507cb7",
                        "created": "2018-05-01T13:57:18Z",
                        "difficulty": 3,
                        "rating": 4,
                        "_id": "external-import-8f187a90-6e24-42f1-8b9a-1bdba1507cb7",
                        "_createdAt": "2018-05-01T13:57:18Z",
                        "body": "There are 5 assignments, two midterms (2.5 hours), and a final (4 hours). The second midterm and the final were open notes. I would say workload averaged 7 hours a week, but generally I worked in chunks and would do one 15-20 hour week per homework assignment. The assignments were released early enough that we generally had 2-3 weeks to work on them. Lectures were longer than other OMSA classes, but the assignments weren't extremely time intensive if you paid attention to the data examples in the lectures.\n\nBy far the biggest challenge in this course was miscommunication and a lack of clarity around terms. The course videos frequently had mistakes, and the course staff did a bad job of communicating (both notifying about and correcting the errors and also about other course logistics). The true/false questions on the assignments and midterms were extremely frustrating because the language often was not clear.\n\nAll that said, I really enjoyed the course material and felt the class was a very reasonable workload. The material can be a little repetitive, so some people may find the class a little boring. This is a course that could easily be taken in a summer semester, especially if you've taken a statistics course before.",
                        "workload": 7,
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-010e0dda-50cc-478d-9e21-08f4180de887",
                        "_createdAt": "2017-12-14T16:49:03Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "created": "2017-12-14T16:49:03Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        },
                        "body": "I have some experience in regression and found this class to be hard. Not because of the content but due to the style of the videos and logistical issues. This was the first semester the course was offered online and they were working out a ton of bugs. Deadlines and test styles changed throughout the semester. We were not told we could work together until it came out just a few days before the final. I am very glad I took the course, and the topics are really solid to know. The videos are very flat, with lots of room for multimedia improvement there. The concepts start high level, creating a learning cliff. All that aside, I would recommend this course to anyone in OMSA.  I agree with the other reviews here: Solid topics, evolving materials.",
                        "workload": 10,
                        "difficulty": 4,
                        "rating": 3,
                        "course": null,
                        "id": "external-import-010e0dda-50cc-478d-9e21-08f4180de887"
                    },
                    {
                        "_createdAt": "2017-12-09T15:29:21Z",
                        "id": "external-import-b1db8b9b-2f6b-49a8-856d-42e290b1cc32",
                        "created": "2017-12-09T15:29:21Z",
                        "_id": "external-import-b1db8b9b-2f6b-49a8-856d-42e290b1cc32",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 8,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        }
                    }
                ],
                "description": "Simple and multiple linear regression, inferences and diagnostics, stepwise regression and model selection, advanced regression methods, basic design and analysis of experiments, factorial analysis.",
                "_id": "external-import-ISYE-6414",
                "isFoundational": false,
                "creditHours": 3,
                "slug": "statistical-modeling-and-regression-analysis",
                "_type": "course",
                "_createdAt": "2022-07-05T23:23:15Z",
                "syllabusUrl": null,
                "rating": 3.0727272727272728,
                "difficulty": 2.8636363636363638,
                "workload": 9.10909090909091
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "statistical-modeling-and-regression-analysis"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}