{
    "props": {
        "pageProps": {
            "course": {
                "_updatedAt": "2022-08-24T17:25:41Z",
                "slug": "deterministic-optimization",
                "reviews": [
                    {
                        "id": "GjO1iZvsFPRHJDkdhWLkK9",
                        "created": "2024-05-07T07:51:20Z",
                        "body": "Spring 2024: Despite earning a C in this class, here are several reasons why you might still consider enrolling:\n\nCons:\n1. Grading Structure: The course heavily relies on multiple-choice exams, with 75% of your grade stemming from just 60 questions. This includes a mid-term (30 questions for 35% of your grade) and a final exam (30 questions for 40% of your grade). Performing poorly on these exams can significantly impact your final grade.\n2. Workload: The class requires the completion of 15 weekly homework assignments and peer reviews. Balancing this course with another demanding class might be challenging, depending on your mathematical proficiency.\n3. Course Pace: The course quickly surveys various topics in convex optimization, which may not allow for deep exploration into any single area.\n4. Error in lectures: Be prepared to identify and navigate errors in lecture slides, often corrected through Piazza discussion forums.\n\nPros:\n\nOptimization is a valuable skill across many fields. Completing this course can enhance your confidence in tackling more complex mathematical optimization problems.\n\nRetake Strategy:\nIf I were to retake this class, I would:\n\n1. Prioritize Exam Preparation: Utilize practice problems and module knowledge check questions as a primary study tool since the exams closely mirror these examples. Start building cheat sheets based on these and related lecture slides.\n2. Practice Calculations: Ensure you are adept at solving math problems by hand, as calculators are not permitted during exams.\n3. Focus Areas for Mid-term: Practice key concepts like linear algebra and calculus by hand—topics include matrix rank, partial derivatives, convex sets, convex functions, and the simplex method.\n4. Persistence Pays Off: The final exam tends to be easier than the mid-term, so staying committed throughout the course is likely to pay off.\n5. Leverage Group Study: Engage in a study group or a WhatsApp group to collaboratively work through assignment problems.\n6. IMO, the Head TA's office hours are really good.\n",
                        "course": null,
                        "semester": {
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "workload": 10,
                        "_id": "GjO1iZvsFPRHJDkdhWLkK9",
                        "_updatedAt": "2024-05-07T07:51:20Z",
                        "rating": 4,
                        "_rev": "GjO1iZvsFPRHJDkdhWLkHG",
                        "_type": "review",
                        "authorId": "3DzHl3vk7c/JOaoAnMNXRA==",
                        "difficulty": 4,
                        "_createdAt": "2024-05-07T07:51:20Z"
                    },
                    {
                        "id": "hhyYyLbngOMVMei6Dfk0lD",
                        "difficulty": 4,
                        "_rev": "hhyYyLbngOMVMei6Dfk0i9",
                        "_updatedAt": "2024-03-28T12:11:03Z",
                        "authorId": "zPMpZ4qbv+TFymmd8hVL2g==",
                        "_createdAt": "2024-03-28T12:11:03Z",
                        "_id": "hhyYyLbngOMVMei6Dfk0lD",
                        "created": "2024-03-28T12:11:03Z",
                        "_type": "review",
                        "workload": 10,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr"
                        },
                        "body": "Difficulty: If you are good at math (especially linear algebra), this course will be pretty easy. I spent about 10hr/week, but I can def see why others would spend a lot more. Tests are very tricky. So learn your concepts during HW well. the HW grades are \"curved\" since they are student peer graded. I ended up with an A, but barely. \n\nHow to do well: Like I said, HW are \"curved\" but the tests are not. Really make sure you learn the concepts from the solutions published after the HW given. Also studying the previous tests help, which they publish fir studying materials. \n\nWhat did I learn and how was it: I did learn quite a bit. Given a situation that is deterministic, you basically learn how to model and optimize the system in various settings. The lectures and the HW are little dry, but honestly, as long as I learned in depth, that is all I cared about. \n\nComplaint: As other people say... HW to exam proportion is wayyyyy out of what they are supposed to be. Make sure that the HW's are TA graded, so that they are not \"curved\". Also HW is where the real learning happens, so students should spend a lot of time on HW (which is not the case since they are \"curved\") and increase the HW weights on the final grade. ",
                        "rating": 4,
                        "course": null
                    },
                    {
                        "id": "B4f62jA4uiwbPBWumNBDfX",
                        "created": "2023-03-14T02:06:51Z",
                        "course": null,
                        "body": "Disclaimer: I withdrew from the course after getting a 50% on the first and only midterm but I had 90-100s on the 8 weekly homework going in to the exam. I'm 6 courses into the OMSA degree and I have a 4.0. This is the first time I've withdrawn from an OMSA course but I'm happy I did. \n\nNote: I have a PhD so I'm not GPA motivated. I withdrew because I didn't feel like the time I was investing was going to yield the returns I had hoped for when I enrolled in the course. I was going to have to double down to salvage the semester and since I wasn't really happy, and from the looks of the second half of the course, that wasn't going to improve, I cut my losses. \n\nMy biggest beef with this course is it is organized in a way that is antithetical to how I teach undergraduate and graduate students. 75% of your grade is determined by two multiple choice exams, full stop. Best practice is to give students as many ways as possible to demonstrate their learning and many other courses in OMSA excel at this. The exam window is also bracketed by two homework assignments. In general I always try and give students a few days to study and then relax pre-post exam time.\n\nI had a scientific conference before/during the exam window. If you have anything on your calendar that will interfere with your studying around exam time - wait and take it another term.\n\nI also think the course organizers deserve a knock for being a little lazy. There are many little errors in the slides that don't get fixed and they are still using lectures from a Prof who passed away several years ago. Granted, his lecture material was the highlight of the first half of the course as it really was nice to brush up on the math.\n\nI found the homeworks to be intellectually stimulating and I learned a great deal by doing them. Yet HW only counts for the remaining 25% of your grade. The course and the exams aren't really focused at all on practical applications. As this is a theory/pure math heavy course, if you don't enjoy looking at equations or sets and figuring out whether they are convex, compact, bounded etc. I'm not sure you'll enjoy it.\n\n",
                        "workload": 12,
                        "_rev": "B4f62jA4uiwbPBWumNBDc0",
                        "difficulty": 4,
                        "_id": "B4f62jA4uiwbPBWumNBDfX",
                        "authorId": "1SHifQGl0KBH4r9pKQqjzA==",
                        "_updatedAt": "2023-03-14T02:06:51Z",
                        "_createdAt": "2023-03-14T02:06:51Z",
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "rating": 2
                    },
                    {
                        "course": null,
                        "_updatedAt": "2023-01-08T16:00:18Z",
                        "_rev": "sv9JCrQ2mN7v1oIbvpiVjl",
                        "workload": 15,
                        "body": "TL;DR - A great, if jam-packed, fundamental course with a good TA team but  an imbalanced homework/exam weighting scheme.\n\nMe: OMSA (6th course) with intermediate Python knowledge and undergrad experience with optimization (but that was a long time ago lol).\n\n--Pacing--\nWhen folks here and on reddit say this course is a grind, I found it to be TRUE: \n- two topic areas covered per week that anywhere from 3 - 6 videos per (avg. 10min length), \n- weekly homeworks (not too bad), \n- and two exams (midterm was very difficult, final was not as bad due to the provided practice exam materials)\n\n--Content--\nIt's a lot of material to take in, I'd say on par or more than Regression. The topics start off as more abstract to set the stage (e.g. set theory) and then become more process/algorithm-based (e.g. Simplex, column generation, branch & bound).\n\nThe knowledge checks, and to a lesser degree the homeworks, are similar to what you'll find on the midterm and final. So I found it was a good balance of memorizing versus learning/applying.\n\n--Course Faculty--\nVery responsive TA team and good communication every week. Office Hours were held something like three times a week; I didn't attend them but the Zoom videos get posted later for your reference!\n\n--Grading Balance--\nAs many others have said before, I did not like that the homeworks were weighted so little versus the midterm/final which were the large majority of your grade. However, I found this to be aligned with how much work went into them - you can get a 90-100 on each homework by spending only a couple hours on them, but the midterm/final require a lot more time in prep.\n\n--Tools for Success--\nLecture videos, knowledge checks, and critically reviewing the homework solutions will set you up for success. Don't be discouraged by the difficulty of the midterm, as the final was a bit easier.\n\nThis is a great OMSA course for its content. Optimization underlies almost everything we touch within the OMSA program so I think at least understanding what's going on will benefit our education/career.",
                        "authorId": "y+uCCK2uEQQzRvMwdPTGEQ==",
                        "_type": "review",
                        "semester": {
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z"
                        },
                        "id": "sv9JCrQ2mN7v1oIbvpiVkl",
                        "created": "2023-01-08T16:00:18Z",
                        "_createdAt": "2023-01-08T16:00:18Z",
                        "difficulty": 5,
                        "rating": 4,
                        "_id": "sv9JCrQ2mN7v1oIbvpiVkl"
                    },
                    {
                        "_createdAt": "2022-12-23T17:16:08Z",
                        "authorId": "ZJCOnmbLcv7CD0PVrlb70A==",
                        "_updatedAt": "2022-12-23T17:16:08Z",
                        "id": "ojGpuoLqWcC94EPn3naYQv",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3"
                        },
                        "difficulty": 5,
                        "workload": 25,
                        "created": "2022-12-23T17:16:08Z",
                        "rating": 2,
                        "_type": "review",
                        "course": null,
                        "body": "I did poorly in this class, but I really liked the material. So if you're unsure about taking the class, read on, I'm trying hard to be fair. This is my 9th class. \n\nThe content of this course is very interesting. I bought the book recommended for the class and am still working through it. Of all the courses in the OMSA, this has to be one of the more interesting courses in terms of material. It's a lot of material too. \n\nThis class is designed for students continuing their education directly after their bachelors. Expect a few eclectic problems requiring some obscure math rules taught in Linear Algebra and Calculus. I wasn't strong in linear algebra and it's been a while since calculus, and I suffered for it. It is very possible to get a decent grade while still lacking in the prerequisites, you'll just have to put in extra time. \n\nThere is not enough teaching material for this class. It is very much set up for self learning. Here's a topic, go learn it, you'll not get instructed here. I spent a lot of time studying material from other universities, which was frustrating, because I busted my butt to get into GT. If I wanted University of Arizona material, I would have gone there. \n\nPerhaps most frustrating was the fact that this class is academic rather than practical which is so removed from reality that much of what was covered is wasted. It's great that I can do simplex by hand now, but that has 0 value in the real world. There was very little application of the material. I was expecting more application. This really makes the class less valuable since it is not targeted at professionals applying new skills, but academics learning new theory. This is my biggest criticism. \n\nLastly, I'm just not a fan of courses where 75% of the grade is determined by 2 exams. It adds unnecessary stress. ",
                        "_rev": "ojGpuoLqWcC94EPn3naYNA",
                        "_id": "ojGpuoLqWcC94EPn3naYQv"
                    },
                    {
                        "authorId": "gXIsQ5Mcncwm26FFWnqdWQ==",
                        "_id": "sEt0QEOF763GnkGvUbGKdt",
                        "rating": 5,
                        "difficulty": 4,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "_createdAt": "2022-11-27T14:58:02Z",
                        "course": null,
                        "id": "sEt0QEOF763GnkGvUbGKdt",
                        "created": "2022-11-27T14:58:02Z",
                        "body": "Pretty decent course, builds up the fundamentals of optimisation. I took this course with Simulation which was pretty much manageable. Overleaf was very helpful in the assignments and cheatsheets.",
                        "_updatedAt": "2022-11-27T14:58:02Z",
                        "_type": "review",
                        "workload": 10,
                        "_rev": "sEt0QEOF763GnkGvUbGKaT"
                    },
                    {
                        "id": "external-import-5ba19208-5828-4168-baa9-cfb226600145",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "body": "Background: OMSA c-track, 7th course\n\nI found this to be a good course and the content was pretty interesting. There was some weird mix-up with the syllabus during spring break this term (I hope this gets corrected for future iterations) but overall the course functioned smoothly. I think the course could benefit a bit from upping on the difficulty of some of the HW questions. My background is in CS so I don't have a super strong math background but was able to survive without much of a problem as I had taken math courses during undergrad (though over 5 yrs ago). That being said, before enrolling I would recommend having working knowledge of partial derivatives, simple set notation, and basic linear algebra.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2022-05-05T15:32:27Z",
                        "created": "2022-05-05T15:32:27Z",
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-5ba19208-5828-4168-baa9-cfb226600145",
                        "difficulty": 3,
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "_id": "external-import-71c35a32-5a4c-4fb5-aceb-d2266fa83b60",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "id": "external-import-71c35a32-5a4c-4fb5-aceb-d2266fa83b60",
                        "created": "2022-04-21T16:36:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 8,
                        "body": "This class is just a ton of information almost constantly coming at you week after week. Homeworks every week even during the midterm week, but you get to drop your 2 lowest scores which is helpful. I found the material, especially in the first half, pretty interesting and the lectures were very good. But the 2nd half the material gets overwhelming and less interesting, for me at least, and it was pretty difficult to absorb and understand everything coming week after week. Also felt like the lectures weren't as helpful as they were in the first half in explaining and going over the material for comprehension. \n\nI feel like this class suffers from trying to teach you everything very fast instead of slowing down and making sure topics and material are getting learned and understood. I think if I took this as a solo class I might have had more time each week to dive into some of the material I was struggling with, but found it very challenging taking it along with another class.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "rating": 2,
                        "_type": "review",
                        "_createdAt": "2022-04-21T16:36:25Z"
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1"
                        },
                        "body": "To the person (https://omscentral.com/review/-N-8m7zHV9Q-OUfcgkr2) who called out my review - First of all don't assume my gender. Secondly, if you actually read my review, you would have gleaned that I was specifically referring to quality control when the original content was created as I did mention the content cannot be updated for a variety of reasons, without getting into the specifics. I don't think there is anything overly critical in expecting video and slide content is not littered with mistakes. \n\nNext time, I suggest you actually read a review to understand it rather than just respond!",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-4c71887e-2f54-45dc-ba6c-c72cf62a2444",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-4c71887e-2f54-45dc-ba6c-c72cf62a2444",
                        "created": "2022-04-15T02:21:07Z",
                        "workload": 15,
                        "_createdAt": "2022-04-15T02:21:07Z",
                        "rating": 1,
                        "_type": "review",
                        "course": null,
                        "difficulty": 4
                    },
                    {
                        "workload": 12,
                        "_id": "external-import-28754fe6-c21c-4cdc-831b-51dff5a2587e",
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-28754fe6-c21c-4cdc-831b-51dff5a2587e",
                        "difficulty": 4,
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "body": "The content of the course was interesting and I feel like I learned a decent amount, however there are still a lot of frustrations I have with it.\n\nFirst, if you take this course be prepared for a math heavy course without much coding. And be very comfortable with linear algebra and all the notation that comes with it, because it is definitely assumed that you've got decent foundation with it.\n\nYou have homeworks every week and ungraded knowledge checks which help you keep pace, the exams are relatively fair compared to the material. The lectures themselves are generally useful but I struggled a bit with them since they're very notation heavy and many times the instructors go over concepts without really providing examples. There are also numerous errors in the slides/lectures and I understand this is due to 2 of the instructors being no longer at GT, but it is still frustrating to be confused at a slide which is just wrong until a Piazza post clarifies it.\n\nThe head TA, Kristina, was really good though and very responsive. Feel like a lot of the term I was learning from her writeups as much as the lecture material. ",
                        "created": "2022-04-14T17:55:19Z",
                        "course": null,
                        "_createdAt": "2022-04-14T17:55:19Z"
                    },
                    {
                        "_createdAt": "2022-04-11T14:38:28Z",
                        "_id": "external-import-1a09c7c4-6c1b-4b4b-8062-6f88422c9acb",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2022-04-11T14:38:28Z",
                        "body": "I prepared myself with all the prerequisites and still this course turned out to be so difficult. The course revolves around different optimization techniques and honestly, it has become very difficult to keep track of the all the techniques in the 13th week of the semester. I feel there's more preparatory work needed before jumping into this course which the Professor should mention in the prerequisites. A lot of lectures seemed pretty abstract and out of touch with the preceding lectures. After this course I am saying good bye to my perfect score of 4.0 :) ",
                        "rating": 2,
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "id": "external-import-1a09c7c4-6c1b-4b4b-8062-6f88422c9acb",
                        "course": null,
                        "workload": 18,
                        "difficulty": 5
                    },
                    {
                        "body": "I am amazed how this course has an average rating >4. This was by far the worst course in my three semesters of OMSA and right up there with one of the worst courses I have taken period. There are so many issues with it, so let me highlight those:\n\n1. Course content: Lecture videos and slides are chock-full of errors and typos. I understand that the co-instructors cannot update the content for a variety of reasons. However, I am surprised that there was no quality control in place for when the original content was created and uploaded. Given that this is something that hundreds of students would use over many years, a little effort into QCing the content wouldn't have been a complete waste of time and just shows a general lack of apathy towards students.\n\n2. Course structure: The mismatch between time spent on homeworks vs exams and the grade distribution for each is just daft. You can put in tons of effort for each homework and make a couple of mistakes in the exam and this will completely destroy your grade.\n\n3. Course Structure around spring/fall break: The course literally makes your life hell in the week leading up to break where you have just 3 days to watch videos, do knowledge checks, and complete the homework. Note, you do this while having a mid-term released in the same week. What's even better is the spring break is a misnomer for this course. We had a homework due on the Saturday of spring break week, so in reality you don't have a break with this course. A little effort into restructuring would have done wonders. Also note, you can skip two homeworks during the semester, but skipping a homework will bite you later as you'll probably be weak in that content. Besides, skipping homework is meant to help you when you have an emergency/illness, etc., not because the course has unreasonable deadlines for part-time students.\n\n4. Syllabus layout: The course keeps jumping from one topic to another and the lectures don't spend any time up front talking about how various topics will be introduced and how they will build on one another. Just seems haphazard.\n\n5. Instruction: In the semester I took the course, the instructor was virtually non-existent, be it office hours, piazza or otherwise. There's no point putting the instructor's name on the course if everything is handled by the TAs. The TAs are generally very good and some of the office hours were extremely well put together.  \n\n6. Homework and questions structure: Most of the homework as well as exam questions default to the trick or challenging  variety, before even one can have a firm grasp of the basic concept. The lecture videos often don't have a concrete or detailed enough example and the homework has students working on a corner case problem, so I found myself using other resources to truly develop a basic understanding of various concepts.\n\nSadly, this is one of those courses where the old adage \"You get what you pay for\" truly holds. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-79789de0-6302-4ff7-b6bd-71f878e658ad",
                        "created": "2022-04-08T11:33:14Z",
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "difficulty": 4,
                        "workload": 15,
                        "_id": "external-import-79789de0-6302-4ff7-b6bd-71f878e658ad",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_createdAt": "2022-04-08T11:33:14Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null
                    },
                    {
                        "rating": 2,
                        "workload": 15,
                        "_rev": "LFqZmw4Atoei487YE8yy8v",
                        "difficulty": 4,
                        "_createdAt": "2022-03-10T16:14:55Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "body": "The course is HEAVILY theory based on set theory, convex/concave functions, memorization of theory principles, and no calculator/graphing tools available. If you are comfortable with your understanding of matrices to the highest level and can visualize complex functions then this class is for you.",
                        "id": "external-import-cc1a5ee9-0f28-4730-bd4a-49bc7a065706",
                        "created": "2022-03-10T16:14:55Z",
                        "_id": "external-import-cc1a5ee9-0f28-4730-bd4a-49bc7a065706",
                        "_updatedAt": "2022-08-21T20:45:41Z",
                        "_type": "review"
                    },
                    {
                        "_createdAt": "2021-12-15T22:11:22Z",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-a467d1ff-ab5a-40ea-bef4-89fe80d67227",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "body": "I can't really add much with this review that others haven't already covered, but I'll do my best. You should be comfortable in your prereq's prior to taking this course. Most importantly, be very comfortable with linear algebra, specifically matrix notation and partitioning. And be comfortable with some basic calculus and partial derivatives.\n\nAs has been mentioned, the lectures are excellent. The homework does a great job of reinforcing the material taught in the lectures. And the TA's are very helpful as well. If you're interested in the OMSA CS track or any of the ML oriented classes in OMSA (CDA, HDDA, DL, RL, etc...) you can't go wrong taking this class. I was dumb and took CDA and HDDA before this class... wish I'd taken this first. Optimization is super foundational and profound knowledge to get for AI/ML and I feel that I got a lot out of this class and left with a much better understanding of how optimization works under the hood. That's the most important thing.\n\nOk... so the exams. I did well on the exams (and studied hard for them), but I do agree with the complaints that they are a bit unfair. I'm not someone with a photographic memory, and I don't think knowing things like whether the sin(x) chart is 0 at pi or 1 at pi is \"prerequisite knowledge\"... that's just memorization let's be honest. There's a few questions where it just comes down to having certain concepts or equations memorized. The reason a lot of other classes allow cheat sheets for exams isn't to make them easier, it's so they can test you on the deeper aspects of the material that isn't just having equations memorized. I also think the homework, while pretty solid for helping you understand the material taught in the lectures, does a pretty poor job of preparing you for the questions you'll see in the exams. One of the hardest things about the exams is I feel like I didn't get adequate practice solving the types of problems that were on the exams prior to taking them. The practice exams are very helpful, would definitely recommend doing those and the knowledge checks, but that's pretty much all the practice you're gonna get. Having said that, the exams DO test your understanding of the material at a deeper level, and you WILL learn more about the material and optimization by studying hard for them. I think they could use some tweaks, and could be a smaller portion of your grade, but I'm not necessarily upset that I had to take them.\n\nDon't let the exams/gpa scare you away from this class, it's really really good content that I think most students would find interesting.",
                        "created": "2021-12-15T22:11:22Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 14,
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-a467d1ff-ab5a-40ea-bef4-89fe80d67227",
                        "rating": 5
                    },
                    {
                        "id": "external-import-631a38ba-b273-4fde-9629-eab7dd5dd8c6",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_createdAt": "2021-12-08T22:05:54Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "course": null,
                        "workload": 13,
                        "_id": "external-import-631a38ba-b273-4fde-9629-eab7dd5dd8c6",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-12-08T22:05:54Z",
                        "difficulty": 4,
                        "_type": "review",
                        "body": "I took this class because I love the subject matter, not because it would be easy. It's definitely not. Homework outcome I was pleased with: I got out exactly the effort I put in and the assignments furthered my understanding very nicely. However, I am terrible on strictly theoretical exams with no cheatsheets. But I knew that going in. I am still glad I took this course. "
                    },
                    {
                        "workload": 15,
                        "_id": "external-import-0040c4ee-3449-4357-b23d-85cc12934630",
                        "course": null,
                        "body": "If every week you watch the lectures, take notes, and make an honest effort to complete the homework, this course is manageable. As many have stated, the midterm and final is a big chunk of your grade and they are tough, but the final grade is curved. \n\nMy suspicion is the people who have the hardest time with this course either did not have the necessary prerequisites, or are in the habit of relaxing during off-weeks then cramming right before things are due. I want to stress again - being consistent every week is key for your success in this class.\n\nThe lecture materials are some of the best I've seen in OMSA and the supporting TAs are quick to address problems on Piazza. Overall I'm very happy i took this class: it has given me the necessary framework for thinking about optimizations, which appear in almost all cases where statistical learning is used (among others).",
                        "_createdAt": "2021-12-01T13:49:00Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 4,
                        "difficulty": 3,
                        "id": "external-import-0040c4ee-3449-4357-b23d-85cc12934630",
                        "created": "2021-12-01T13:49:00Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        }
                    },
                    {
                        "_createdAt": "2021-11-25T20:20:41Z",
                        "difficulty": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "workload": 90,
                        "_id": "external-import-f396b289-ec56-47c2-a828-0f028e0b95b2",
                        "id": "external-import-f396b289-ec56-47c2-a828-0f028e0b95b2",
                        "created": "2021-11-25T20:20:41Z",
                        "_type": "review",
                        "course": null,
                        "body": "It's a unique course dedicated to optimization concepts, and a good place to learn some mathematical tricks and tools for it. The lectures are phenomenal. I try to take thorough notes. The anxiety you get from studying for the midterm/final which takes up 75% of the course is unreal. It forces you to have a very clear understanding. Very challenging.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        }
                    },
                    {
                        "id": "external-import-92f355e3-32d3-4c69-baef-a4db79a8880a",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 2,
                        "workload": 12,
                        "_createdAt": "2021-11-14T23:23:05Z",
                        "_id": "external-import-92f355e3-32d3-4c69-baef-a4db79a8880a",
                        "created": "2021-11-14T23:23:05Z",
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "course": null,
                        "body": "The lectures are very good. The piazza help is solid.\n\nBut...I will never understand the grading design of classes like this. You spend hours on homework every week, do well on those, and then have your first test in late October wipe it out. I have a strong math background. I remember my linear algebra pretty well, thank you very much. But having pretty deep connections dropped on you in a 90 minute test with 30% of your grade on the line is...frustrating.\n\nI did pretty well on the practice test and knowledge checks we were given to prepare. Then I did average on the midterm, which would be fine, except the average was a 69. Now I'm trying to pound out my homeworks in this and my other classes just so I can give myself as much time as possible to memorize formulas for the final (rather than concepts, no matter what class staff says), that ultimately I'll end up forgetting by mid January anyways. \n\nThis is just not a conducive set up to learn IMO, but pointing this out gets you a round of cheers of \"This is Georgia Tech, it's supposed to be hard!\"\n\nThings being hard for the sake of it is not valuable. ",
                        "difficulty": 4,
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "created": "2021-10-31T10:30:07Z",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "body": "So I've decided to write this review because I've seen a lot of complaints about this course on piazza and here. I think a lot of the complaints are made by people who do not take the prerequisites seriously. You need to be able to do linear algebra and high school math. You need basic calculus. If you are not strong on the stated prerequisite then that's on you, don't complain afterwards that you don't remember how to find the inverse of a 2x2 matrix by hand or differentiate a simple function by hand or you can't remember what the sine curve or exponential curve looks like... That's why prerequisites are listed. Please ensure that you have the prerequisite knowledge before doing a course.\nThis course is like any typical math course. You must UNDERSTAND the theorems and definitions in order to apply them. You are tested on subtleties of those theorems and definitions, and subtlety is key... You must know the conditions under which these theorems hold... otherwise you may try to apply them incorrectly and get the wrong results in real life...or not understand why you are not getting results. This is the same as every math course I've ever taken.\nThe lecture videos are great and I haven't had to do any outside reading to understand them. The homework is also very helpful in building and reinforcing understanding.\nThis is my favourite class of the program so far and I wish there was a part 2 for more advanced topics.",
                        "id": "external-import-da741cad-b3b4-481a-9db8-0c9a55852ea4",
                        "_createdAt": "2021-10-31T10:30:07Z",
                        "workload": 10,
                        "_id": "external-import-da741cad-b3b4-481a-9db8-0c9a55852ea4"
                    },
                    {
                        "id": "external-import-cced694e-d47f-4322-adfc-ee8ac78d63a1",
                        "created": "2021-10-18T19:26:19Z",
                        "_createdAt": "2021-10-18T19:26:19Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "body": "Top notch! (And I don't say that often ;)\n\nI decided to take optimization in addition to simulation—and I am glad I did. In my opinion, it is the best course in OMSA program. Superb lectures; clear and organized content; informative & very useful knowledge checks;  relevant and thought-provoking homework; super knowledgeable, supportive, and responsible TA team (really great!); helpful practice exams\n\nNote: Midterm 1 class average was a D. This is by no means an easy class. You do not get notes or calculator for exam. \n\nFeedback: (1) Exams are heavily weighted despite spending a significant amount of time and effort on HW's. I would like to see this changed to be more reflective of the effort HW requires (perhaps more weight to HW and/or having the knowledge checks worth points), (2) Allow calculators, (3) Allow more than 1-sheet of blank paper for exam \n\nThis felt like a true graduate course. It was quality and so well executed. \nTake note other OMSA courses! \n",
                        "rating": 5,
                        "course": null,
                        "workload": 10,
                        "_type": "review",
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "_id": "external-import-cced694e-d47f-4322-adfc-ee8ac78d63a1",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "_createdAt": "2021-05-15T11:28:48Z",
                        "course": null,
                        "body": "This is a very well structured and managed course. Lecture videos and content are of high standard.  Only drawback is that the weekly assignments are peer-reviewed. Sometimes, the scores are given without useful comments/feedback.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 10,
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "created": "2021-05-15T11:28:48Z",
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-46c2a021-83b2-45fb-8a37-2324954a7a7a",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-46c2a021-83b2-45fb-8a37-2324954a7a7a"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 3,
                        "course": null,
                        "_id": "external-import-eb88ac36-4774-4497-bd80-9aec66fdf1a6",
                        "id": "external-import-eb88ac36-4774-4497-bd80-9aec66fdf1a6",
                        "_createdAt": "2021-05-13T21:12:17Z",
                        "body": "About me: OMSA Program, 4th semester\n\nStrong python, weak math\n\nGrade: B\n\nI look back on this class mostly through the grading. 75% of the grade comes from the combined scores of the midterm and final. Given that, their content does not directly overlap with the homework which is what you will spend the majority of your time on and is only worth 25% of the grade which makes their scores very trivial. The lectures are very good and break down the material step by step, which will prepare you for the homework. However, this makes up probably a third of what you can expect on the exams. I think this is because the computations are very intensive and perhaps the staff feel they are unfair for exams. As someone who focuses more on application as opposed to theory, this steered me in the wrong direction for exam prep. I scored 19/30 on the midterm and was shooting for a very low score to pass and be done with the class. Mercifully, the final was very closely aligned with the practice final that was provided and I was able to get a B overall after the curve (up from ~76%). \n\nI think the material is important on a high level but it’s hard not to consider this almost a pure math class. If that’s your thing, you’ll excel here. If you dislike pure theory like me, I would say that this class provides more application than Simulation at least for the Operations elective requirement. \n",
                        "workload": 5,
                        "_type": "review",
                        "created": "2021-05-13T21:12:17Z",
                        "difficulty": 3
                    },
                    {
                        "created": "2021-05-10T01:36:26Z",
                        "rating": 5,
                        "course": null,
                        "workload": 10,
                        "_createdAt": "2021-05-10T01:36:26Z",
                        "body": "I took this course in Spring of 2021, combining it with two additional courses, including CSE6242 (Data and Visual Analytics). I certainly found this most difficult, but most enjoyable course I have taken since I started this program. Personally, I would rate this more difficult than the infamous CSE6242.\n\nLike many other courses, there are weekly videos which I think are incredibly well done. Obviously you will need some good knowledge of mathematics, especially linear algebra and real analysis, to understand perfectly well most of what’s going on in the videos. However, even with general mathematics knowledge, you could still understand with little effort. I found the professors incredibly engaging. The videos attempt to explain the concepts in the friendliest terms. They also explain conceptually what many of the maths notations or formulations mean. I thought they really put genuine effort into making these videos accessible.\n\nEach week you get a homework, which often help to illuminate the concepts from the lectures. The homeworks, in my opinion, are just absolutely brilliant. A lot of thought certainly went into making those homeworks. The sad thing is that they are all only worth 25% of the total grade. The midterm is worth 35% and the final 40%. As good as this course is, it is quite a sad reality that better effort has not been put into the grading format. The midterm and final are multiple-choice questions that just seek to trick you. You get questions with words like “may”, “always”, etc., which if you miss could be the deciding factor between getting a point or not. As you may have figured, each point in the midterm or final are indeed quite weighty.\n\nPersonally, I found the course to be of medium difficulty. Naturally, the student’s background will determine mostly how they find this course. But that shouldn’t remove from the course’s wholesomeness. As someone who had zero exposure to deterministic optimization course before taking this one, I struggled a bit in the earlier parts of the course, but settled in comfortably towards the later part. At the moment, I am sitting on an marginal A.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-38f5a98b-a6df-4b20-bc50-df9cbf438ff0",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-38f5a98b-a6df-4b20-bc50-df9cbf438ff0",
                        "difficulty": 3,
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "workload": 15,
                        "_id": "external-import-706b4c0f-7e5b-4d33-a5ab-a83aec3976b1",
                        "_type": "review",
                        "difficulty": 5,
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "body": "As someone with a weak math background it was a very hard and stressful, but ultimately very worthwhile class. If you don’t care about the possible hit to your GPA, definitely take it. \n\nHomework is due every week which account for only 25% of your grade, while as other reviews mentioned 60 M/C exam questions account for 75%, so I felt the grade distribution wasn’t exactly fair for the amount of work we have to put in. \n\nGoing in I had very weak linear algebra knowledge (quickly went through Strang’s MIT class beforehand) and pretty much no multivariate calc knowledge. While a lot of people say you should be a master in linear algebra to take this course (and it’s true if you really want to understand the material on a deeper level), I was still able to get a good grade in the class.\n\nLectures are very well done and explain concepts well. Homeworks do a great job in reinforcing the concepts, but I felt you needed to do a bit of research outside the class to figure some things out. TA’s can be a hit or miss. Most are helpful and do a good job (shoutout to Kristina, she’s everywhere answering questions!) while a couple do their best to give you as little information as possible. There are some errors and differences in lectures vs slides but I can understand it’s difficult to go back and re-record things. Again, I felt the proportion of your grade from exams wasn’t fair, but they provide practice midterms which help a lot. Go through it multiple times along with knowledge checks to really drill the concepts down. \n\nOverall highly recommend. If you don’t have the strongest math background you’ll still survive though you’ll have to suffer a bit more to get through it. \n",
                        "course": null,
                        "id": "external-import-706b4c0f-7e5b-4d33-a5ab-a83aec3976b1",
                        "created": "2021-05-08T01:54:08Z",
                        "_createdAt": "2021-05-08T01:54:08Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_id": "external-import-6e766b83-c8fc-429c-8262-b79c304b0c35",
                        "body": "Great Class. Broad overview of optimization hitting a little bit of everything. Exams are tough being only 60 questions worth 75% of the grade (Only reason I rate this hard, otherwise its medium to easy). HW's are interesting but there's quite a few (15 total). Thankfully 2 are dropped which offers some relief  (however do still do them as it helps with understanding.). I got exactly what I wanted out of this class; better intuition of mathematical optimization. Came with a bonus of better intuition of Linear Algebra as well.",
                        "rating": 5,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "course": null,
                        "workload": 10,
                        "_createdAt": "2021-05-06T19:22:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-6e766b83-c8fc-429c-8262-b79c304b0c35",
                        "created": "2021-05-06T19:22:44Z",
                        "difficulty": 4
                    },
                    {
                        "id": "external-import-5068f53d-601c-4208-8c66-1f3c90268ed6",
                        "body": "Awesome lectures, stay away if you want an A. Midterm has noting to do with Optimization and account for 75% of your grade along with the final. Waiting to see how the final will look like.\n\nIt starts off too easy and gets harder about midway. \n\nFor those who have theoretical math background, take it for an easy A. \n\nI have not seen professor one time, never seen him on Piazza either. TA's were not so interesting, not that you need their support really. Its just the exams that are the problem. Homework is quite doable. (3 hrs. per week).\n\nYou should be taking good notes and focusing on every detail for the exam. Especially things that you thing are non essentials, they will be on the exam while the essentials might not be on the exam.\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 4,
                        "workload": 10,
                        "created": "2021-03-29T02:58:45Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_id": "external-import-5068f53d-601c-4208-8c66-1f3c90268ed6",
                        "difficulty": 3,
                        "_createdAt": "2021-03-29T02:58:45Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null
                    },
                    {
                        "created": "2020-12-15T09:55:04Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "rating": 5,
                        "workload": 20,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-dbf7a656-10a1-4e83-b0a7-18fa23f9f548",
                        "difficulty": 4,
                        "_id": "external-import-dbf7a656-10a1-4e83-b0a7-18fa23f9f548",
                        "body": "## tl;dr 1: take the recommended prerequisites seriously. If they tell you that you need both calculus and linear algebra to do well in this class, you jolly well need it. So please don't cry in Slack and Piazza afterwards if you cannot even inverse a 2-by-2 matrix. lol.\n\n*If you are that person, please take a hard look at yourself on why you hated this course when the pre-req are so expressly stated, **and** are not willing to put in the required amount of effort. Indeed, please consider taking Bussy-track electives.*\n\n## tl;dr 2: the prof grades very fairly, the \"A\" curve is bigger than you can ever imagine. Even bigger than Simulation. So please don't cry in Slack and Piazza or OMSCentral if your exam score is a 80 with the median being 70. Refer to critique.gatech.edu.\n\nI think this course is severely underrated and its contents easily underestimated, and I can understand why low ratings were given in the past. Indeed most, if not all, of the issues that occurred in the previous semesters have been ironed out, giving you more time to really distil the course material. \n\nThat said, because you are in a class full of OMSA greats, this is the course where you get the strictest of the peer graders. On one side, I got graded 75 for making a smallest of mistakes. On the flipside, if your solution happens to be similar to that of the actual one, there would be strong suspicion that you got the solution elsewhere (i.e. broke the Honors Code) and you will be reported to OSI. \n\nMy tip is to just focus on doing the midterms & finals well - the overall effect of 75 / 90 in the HWs over the long term is < 1%, you have 2 drops too. A careless mistake on one midterm question is already worth > 1%.\n\nYes, the HWs are challenging, and there are people who are very tempted to cheat in the HWs. **Stop it!** Not only you are violating the Honors Code, you are cheating your own preparation in the midterms and finals. Moreover, you risk having an **IC** or **NR** grades at the results release day in which you have to speak to the Professor directly to clear it up. \n\n**Choose ISYE 6669 Discrete Ops as your Operations elective** if you \n\n* want to mix with the best of OMSA and possibly sacrificing your illusory perfect 4.00 GPA, even if the curves are relatively generous (read next point). \n\n* have a very strong background in Linear Algebra and Calculus for you to be able to enjoy and appreciate this course taught by Prof Shabbir Ahmed and Prof Andy Sun. It has to be said that it's common knowledge in OMSA Study Slack community that **the achievers take this course as their A-track or Ops Electives**. So, better up the A-game.\n\n* want to take ISYE 8803 HDDA and CS 7643 Deep Learning (deeplearningbook.org) in the future. Topics learnt in Optimization forms a baseline in which you will need to explore these topics.\n\n* don't think a cheatsheet would help you - cheatsheets are banned by Prof Sun in this course since Spring 2020 in lieu of practice exams (which in hindsight is the reason why people are now liking this course).\n\n**Choose ISYE 6644 Simulation as your Operations elective** if you \n\n* want to head out into OMSA Bussiess track. In that case you only need to know how (and not why) an Excel Solver works, and taking a whole course of Optimization won't be for you.\n\n* want an easier to score A course to get your 4.00 GPA. That said, due to the difficulty in ISYE 6669, the A grade cut-off is actually lower than in Simulation.\n\n* want to brush up your level of Statistics. Comparatively speaking, Prof Goldsman provides more reminding/helping. Prof Sun is patient and explains well, but he assumes required knowledge in undergrad Linear Algebra. You are in a real grad class, so revisiting is minimal by default.\n\n* think 3 double-sided A4 cheatsheets would help you. In comparison, Discrete Ops *no longer allows a single piece of cheatsheet*.\n\n**Choose both** if you want to take an Analytics track **and** \n\n* want to avoid anything by Prof. Serban (she's nice, but for any reason you want to avoid your GPA from harm because she curves little, the horrors of Time Series Analysis, etc.).\n\n* want to avoid taking Bayes (the horrors of the new professor's midterm exams, and outdated BUGS).\n\n* want to buff up with a whole suite of ISYE Machine Learning courses on offer (6740-CDA, 7406-DMSL & 8803-HDDA).\n\nThis class requires one to sit down, with intense concentration, and jot down explanations given by the lecturers, which themselves are well-covered. Otherwise, come revision time you will forget them easily. \n\nPeople do say that the practice exams are similar to the actual exam. I'd say it's more of an illusion than a reality. Yes the questions can be structurally similar but the content can be drawn throughout the course, especially on those places where it's not shown in the practice exams. You've been warned here :). That being said, because everyone knows structurally what questions to expect, the curve has gone much closer back to 90. Don't expect the cutoff of an A to be 75, like it was in the past, just saying.\n\nThere are a few TAs in the class (due to lack of enrollment size). Even though it appears to be co-instructed, one of the professors sadly passed away recently so the other professor has to handle all the administration and setting of homeworks and exams, so do understand when you see reviews that the TAs / Instructors are not reactive enough.",
                        "_createdAt": "2020-12-15T09:55:04Z",
                        "course": null
                    },
                    {
                        "_id": "external-import-2578da51-8e16-4ba4-beb1-6c6ab3ae004f",
                        "body": "Strengths: \n1. All 3 TAs in office hours were excellent. I am incredibly impressed with their explanations of concepts\n2. Homework assignments allowed a high level of application to theory\n3. Recordings are the best so far in the program in terms of detailed explanations in easy to understand english\n\nWeakness:\n1. Weakly homework assignments and long lectures can feel brutal sometimes. That shouldn't be changed but it sure is a pain\n2. Two 30 question tests count for 75% of your grade. That means each question counts for over 1% of your grade. Like ISyE 6501, this is not at all in line with the effort put in the class.\n\nPound for pound I thought this was one of the best taught courses in the program. I learned a lot and was able to follow along, yet it still felt like the course maintained fidelity to being 'Masters' level education. The course requires a lot of linear algebra and multivariate calc. They review terms for those who don't remember everything but that review is woefully insufficient for someone who never learned in the first place. \n\nI don't recommend this course to anyone who does not understand what linear combinations or gradients are because it goes into the nitty gritty of mathematical details. It also has lot more application than simulation did. I don't know if this was my favorite course in the program but I would probably put it in my top three.",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 5,
                        "course": null,
                        "workload": 12,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-2578da51-8e16-4ba4-beb1-6c6ab3ae004f",
                        "created": "2020-12-13T17:29:26Z",
                        "_createdAt": "2020-12-13T17:29:26Z",
                        "_type": "review"
                    },
                    {
                        "created": "2020-11-01T17:36:13Z",
                        "difficulty": 3,
                        "_createdAt": "2020-11-01T17:36:13Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 15,
                        "id": "external-import-205b7b89-2ed2-4b61-8fb6-fe03a242e332",
                        "_id": "external-import-205b7b89-2ed2-4b61-8fb6-fe03a242e332",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "I am reviewing in the last quarter of the semester. This is my favorite course so far in OMSA. It is not easy but can be very rewarding if you follow thoroughly with the lecture and utilize what you have learn into homework, which is lined up well with the lecture. The homework can be challenging in terms of mathematic reasoning, and implementation of concept into practice, but completely doable if you concentrate half day in it. \nThe course is math heavy but it will walk you through the basic mathematics as prerequisite to various useful algorithms in optimization in a nice pace. The lectures and materials are well structured with a good balance of concept and examples. Both professors gave engaging lectures. Exam are closed book this semester but the practice exam will definitely give you a good prep. Strongly recommend previewing the lecture slides before listening to the lecture, which will guarantee a much better learning outcome. "
                    },
                    {
                        "difficulty": 4,
                        "rating": 5,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "body": "I am doing the OMSA \"Analytics Tools\" track and consider myself to be more interested in the mathematical side of analytics as opposed to the programming side.  I have a math undergrad degree.\n\nThis is one of my most favorite classes of the OMSA program. It is heavy in math but really thorough and moves as a good pace without being overwhelming.  Right now I have a B, but I'm ok with that because I'm learning a lot and have tons going on with personal life.\n\nHomeworks are weekly and line up nicely with the lectures. They are a mix of mathematical reasoning, numerical examples, and Python programming. Some assignments have no programming, some are only programming.  Midterm and Final exam are MC this semester and challenging but doable (so far!).  Note: this semester they experimented with exams having no cheat sheet and no calculator. I was a bit worried, but they did provide a practice exam and solutions well before hand. The practice exam and studying my notes and homeworks were adequate preparation for the midterm.  Got a B on it mostly b/c I got sick with Covid right around midterms for both my classes. (Healthy now, thankfully!)  At any rate, study homeworks, notes, practice problems, etc. and you'll be prepared. \n\nAs a side note, the syllabus says to use Python 2.7, but you can really use any version of Python. You might just have to adjust a few things, but there's no need to go to 2.7.\n\nThe lectures and the TA office hours are my favorite parts of this class. The lectures are *excellent*. More than just reading the slides and equations, the professors in the slides actually describe the mathematical notation and explain what is going on.  There are some minor errors in lectures/slides but those are usually mentioned and corrected on Piazza.  The TA office hours go over the Knowledge Checks after the videos, which are well-written questions you actually have to think about.\n\nI'm taking this class near the end of my program, after Simulation and the 3 foundational courses, Time Series, and Linear Regression. So if you're looking for a good mathematical understanding of optimization, this is an interesting class.  You'll come away with better understanding of gradient descent algorithms and some really nice applications of optimizations and classes of problems.\n\nWhat can say, I rated \"Hard\" but also \"Strongly Liked.\"  I won't walk away with an A, but that is totally fine.  A really great class where I actually learned a lot. That is valuable.",
                        "id": "external-import-f0d1546f-9a21-4477-aab2-932a0cbec119",
                        "created": "2020-10-27T22:53:23Z",
                        "workload": 15,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "_id": "external-import-f0d1546f-9a21-4477-aab2-932a0cbec119",
                        "_createdAt": "2020-10-27T22:53:23Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "created": "2020-05-04T05:43:53Z",
                        "workload": 15,
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "difficulty": 4,
                        "body": "I do not understand the reviews below me for this course. I thought the course as a whole was excellent. I'm starting to think people give negative reviews if the course is a challenge and isn't necessarily an easy A.\n\nPros:\n\n1) I honestly thought the homework questions were extremely well-thought out, challenging, and practical. Those questions, coupled with practice midterms/finals and Knowledge Checks, are very strong resources to prepare for the exams.\n\n2) The teaching was top-notch. The TAs were all exceptional, especially Will. They held office hours twice a week. This was the first class I've taken so far of which the teacher was very much involved too. It was commonplace to see him post on Piazza at least once a week, and would provide very, very strong explanations to questions from students as well. I also thought the videos were extremely strong too - I can tell they've worked on removing most of the issues from previous semesters. Finally, Dr. Sun also provided extremely well-written notes for the most difficult modules for the semester, namely Danzig-Wolfe, Column Generation, Simplex just to name a few. \n\n3) The curriculum was very interesting to me. Maybe because I really enjoy math, but nonetheless I thoroughly enjoyed learning the material. The concepts were definitely challenging, even for me 3-4 yrs out of undergrad. I still cannot wrap my head around an SOCP. If math isn't fresh for you, you could greatly struggle. It's essentially a math class that uses algebra, basic probability, linear algebra, multi-calc (take partial derivs). \n\nCons:\n\n1) Very occasional error in video, of which teacher corrects right after (maybe 2 or 3 in the whole course). \n\n2) Some of the material could be taught in an undergrad optimization course (binary constraints at the end namely), but it absolutely went into more depth than the classic undergrad intro optimization course. Don't get me wrong, it absolutely felt like a graduate-level course in terms of difficulty. But, keep that in mind.\n\n3) Test questions were inconsistent. Some were extremely easy (freebies), others were very challenging and would require deep thought to get correct. Not the first class I've taken where this is the case, but I prefer more of the middle ground.\n\n4) No reference used to a textbook for reaffirmation. Not that big of a deal because the teaching was great throughout the semester. TAs would typically respond within an hour on weekdays (usually sooner), and get back within a day or two for weekends tops.  \n\n5) Don't see how you can put 5 hours of work a week into this class and actually understand the material. The lectures alone are heavy with math, and are around 2 hours a week. So, if you take notes (I HIGHLY recommend you do so, since it's a math class), that is basically 4-5 hours a week right there. Be prepared to put in 10-15 hours a week, including homework, reviewing understanding, preparing for tests, reading piazza. I said 15 hours to give the max of the bounds (lol), of which is on the higher side for the degree. Absolutely required more work for me than ISYE 6501 for example.\n\nAlso, note to the reader, I wrote this review before seeing my final grade, so I am not being skewed by that result. \n",
                        "id": "external-import-85977c26-3e98-48b7-9211-1f9bf476eea3",
                        "_id": "external-import-85977c26-3e98-48b7-9211-1f9bf476eea3",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "_createdAt": "2020-05-04T05:43:53Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_id": "external-import-c29126eb-4ae1-49ca-a5a4-fc363863cf49",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "The content is good…but the exams are really bad.  The cheat sheet you create will be useless.  I think it would be better if the weights were 1/3 homework, 1/3 midterm and 1/3 final.  It can be very frustrating downloading CVXPY and getting it set up on your PC.  Some of the complaints about the course have been going on for several semester and have not changed (no practice tests, mistakes on the slides, bad exam questions)",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "workload": 15,
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 4,
                        "_createdAt": "2020-02-25T18:57:55Z",
                        "id": "external-import-c29126eb-4ae1-49ca-a5a4-fc363863cf49",
                        "created": "2020-02-25T18:57:55Z"
                    },
                    {
                        "_createdAt": "2019-12-26T02:02:57Z",
                        "semester": {
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "body": "The first half of the course was more focused on linear algebra (LA) knowledge. Homeworks don't really give a good benchmark on the exam questions. It would be better to study from a LA textbook rather than use from the HW for exams. \n\nThe second half (after Midterm1) of the course is much harder, and the pace increases (for me). I spent much more time studying for the second half than the first half. \n\nI personally find the course interesting but there was just too much things to study for and there wasn't enough time for me to study in depth as I paired it with one other course. \n\nThere was a grade curve to a certain extent so just study hard and worry less about the grades.  :)",
                        "created": "2019-12-26T02:02:57Z",
                        "course": null,
                        "_id": "external-import-064a57e6-6d35-45d0-9299-f79226dac643",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4,
                        "_type": "review",
                        "workload": 10,
                        "id": "external-import-064a57e6-6d35-45d0-9299-f79226dac643",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 4
                    },
                    {
                        "id": "external-import-e741c5a6-1436-4371-816c-e6090d976941",
                        "_id": "external-import-e741c5a6-1436-4371-816c-e6090d976941",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "workload": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 5,
                        "rating": 1,
                        "created": "2019-12-13T12:15:36Z",
                        "body": "Math-heavy, very theoretical...not grounded in the applications of using optimization models in real life.   I really wanted to like this course. I love the subject matter, as it is very relevant to my current job....however, the lectures are not well done (long, tough to follow).  The tests are worded in a way where even if you have a good understanding of the material - it's possible to do very poorly on the exams.  \n\nOne of our TA's was really excellent (Will Lassiter) and very helpful on Piazza with great explanations.  \n\nI think the lectures and assignments need a revamp.  Make this class more applicable and grounded in the use-cases for all of the material that's covered.  I spent the whole semester lost in theory and feel like I took away very little of value from this course, which is very different from my experience with other courses so far in this program.  \n\nI will admit I did not put in the hours that others did to perform really well in this course.  However, I would have had a lot more incentive to put in the effort if the material was more engaging and learning it was more rewarding.",
                        "_createdAt": "2019-12-13T12:15:36Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-fd0149dd-9dbb-4ba9-be0f-56d2222005dc",
                        "created": "2019-05-13T16:36:19Z",
                        "rating": 4,
                        "workload": 8,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "_id": "external-import-fd0149dd-9dbb-4ba9-be0f-56d2222005dc",
                        "body": "Pros: Interesting content, workload wasn't overwhelming\n\nCons: No instructor engagement, very little TA engagement, the course felt disorganized; exams don't test your knowledge of the material\n\nI'm very torn about this class because I enjoyed the lectures and course materials, but the exams were terrible and the course was poorly run. There were a few lectures where the math/linear algebra was not well explained, but I found having a good linear programming book on hand could solve that, but otherwise I very much enjoyed the course material. However, the exams were extremely difficult unless you had a very strong linear algebra background and had dug into extra material. It felt like multiple choice was used because it was easy to grade, but then they felt the need to make the problems extremely difficult to force a class curve. Everyone did well on the homework assignments, but exam averages were around 75. \n\nOur semester, the cutoff to get an A was around a 78. It seems silly to me to have exams worth so much of the grade then apply a 10+ point curve, where they could just make homework assignments worth more and achieve the same thing without the added chaos. There was a major blunder in that the final exam was due the day before grades were due to the registrar, and the instructors (who never interacted with the class once during the semester) forgot/neglected to submit grades (we were never given an explanation) which required special forms to be submitted on behalf of the entire class to get the grades updated three days later.\n\nOverall, I recommend the class because it was interesting. It's more difficult than ISYE 6501, but worth it in my opinion. Hopefully they fix some of the course issues in future semesters, because this has the potential to be a really excellent class.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_type": "review",
                        "_createdAt": "2019-05-13T16:36:19Z",
                        "course": null
                    },
                    {
                        "course": null,
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "id": "external-import-7f6d7562-4da9-431f-b812-8901473fafab",
                        "created": "2019-05-07T15:58:37Z",
                        "difficulty": 3,
                        "_createdAt": "2019-05-07T15:58:37Z",
                        "rating": 4,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "_id": "external-import-7f6d7562-4da9-431f-b812-8901473fafab",
                        "body": "Class requires a good amount of linear algebra background which I did not have at all (have never taken a course before), but I managed to get by with a significant amount of time and research outside the lectures. For me, the biggest pros of the course are the really interesting subject matter (I just plain like optimization!) and the regular homeworks that are actually genuinely helpful in understanding the subject matter. \n\nI found the lectures to be rather frustrating. There were plenty of mistakes that made grasping concepts quite difficult as they totally disrupted any sort of intuitive understanding of what was going on I was able to muster. The profs also often glossed over the most complicated version of anything. In one lecture, the prof went through like 4 different example formulations of a relatively simple concept and when we get to a VERY complex formulation of an advanced concept, he says something like 'and you can figure out how this works on your own' while providing us with nowhere near enough information to do so. Was that on any HW or exam? No, but it would have been nice to have gotten a bit more information at least in the slides or something. \n\nThere also is not enough feedback throughout the course. There is no session to review information in the exams (or, for the final, we haven't even gotten the solutions at all). The only information you get about the first exam before you take it is that 'it will be like the knowledge checks and the homework' which is decidedly false. The difficulty level is far beyond anything on the homework, coupled with tricky wording and multiple choice questions make a truly difficult exam. \n\nThe absolute biggest issue I had with the course was the knowledge checks. The TAs make it sound like these should basically be treated as a practice exam, which would be fine if it weren't for the fact that they were riddled with errors, almost always directly referencing something on a slide, and there was no information at all about why they might be correct or incorrect. The error issue is easy enough to deal with, there's usually a piazza discussion if they're wrong. The fact that they are directly referencing something on the slide makes them a bit useless as a practice test because either 1. the information isn't really important or 2. it doesn't really require you to work anything out on your own but instead is checking if you know how to read a slide and pick the answer that matches. Both of these also make it difficult to use it as some sort of practice test because once they loose the context of the slide, they sort of loose their meaning. \n\nThe exams also suck. They make you feel like you're a remarkable dumb person because what they're testing is so complex compared to anything you've learned in the course. Like really unnecessarily complicated equations that you need to be able to graph basically that are never mentioned in the hw or anything so you have no expectation. Like, for example, if you could figure out the values for sin and cos over a specific range, when not once in the hw are slides or anything do we discuss those graphs. Are they inherently complicated? No, but I also can't just pull out the values over a range with no preparation."
                    },
                    {
                        "course": null,
                        "id": "external-import-cc7d7d72-d866-4f99-bb85-003e8aaa4089",
                        "created": "2019-05-06T18:24:30Z",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "body": "This is a challenging course.  Make sure you know your linear algebra before you start!  Like everyone else says,  the testing in this course feels unfair.  Coverage of material is good and overall the experience is good if you are willing to overlook the tests.  Logistics are poor,  I waited a long time before my assignments were graded.  The final assignment does not get any feedback because they can't figure out how to get it into the schedule. The peer grading system is not effective for this class so expect to spend time assessing your own homework.  The schedule is also fairly inflexible with one assignment due each week.",
                        "_createdAt": "2019-05-06T18:24:30Z",
                        "_type": "review",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-cc7d7d72-d866-4f99-bb85-003e8aaa4089",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 4,
                        "workload": 8
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-85ac1e05-f790-4998-8fda-abee8a7b456d",
                        "_createdAt": "2019-05-06T17:34:38Z",
                        "body": "TL;DR: cool stuff, challenging, mathy, good practical applications, not enough exercises/feedback, 2 horrible exams that will make you feel dumb but are graded on a curve.\n\nThis is a challenging, very wide-ranging, and generally interesting course with a mix of deep theory and applications. It is math-heavy (derivative calculus and linear algebra). The primary focus is on linear problems, convex problems, integer - linear problems, and reformulations to those problems.  \n\n - Part I (Weeks 1-4) covers intro concepts, convexity, relaxation, and calc-based methods like gradient descent.\n - Part II (Weeks 5-12) covers linear optimization, with case studies, reformulations of various problems to linear equivalents, deep dive on simplex algorithm, relaxation (again) and duality, and two types of huge problems that are solvable with some tricks: column/constraint generation and Dantzig-Wolfe.\n - Part III (Weeks 12-13) covers nonlinear problems that can be solved efficiently (least-squares, SVD, second-order conics, and positive semidefinite problems). This section felt very rushed and the explanations of SOCP/SDP were rather poor.\n - Part IV (Weeks 14-16) covers discrete/integer problems, how to use binary variables, relaxation (again), and a very shallow intro to branch & bound. \n\nAs you can tell, this class covers a TON of ground and it can feel overwhelming. Lectures are rather dry, but HWs provide a good practical angle with Python (cvxpy) or sometimes optional Matlab.\n\nMajor cons:\n - Two brutal exams that try to trick you and seem designed to make you feel stupid -- but also sometimes make you really think instead of doing plug-and-chug with memorized problem templates. (Class mean on the final was 69%). They are three-hour proctored sessions that make 60 total MC/TF questions the basis of 75% of your grade. \n - Not enough exercises to actually learn the material and get feedback: HWs aren't enough, and the solutions usually didn't provide good enough explanations for each solution, so you're basically on your own. EdX knowledge check questions were OK but provide zero explanations for why certain tricky answers were correct/incorrect, which makes learning from your mistakes difficult. I really, really wish there were more (ungraded, instant-feedback) exercises with thoroughly explained answers to help students retain material and prep for exams.\n - Some frustrating errata in both the lecture videos and EdX knowledge check questions which really ought to have been corrected by now.\n - There really needs to be a course project with students' choice of problem, and it should take some of the grade weight away from exams.\n - Peer grading of HWs is sloppy, as usual, which is usually generous but doesn't help you learn from your mistakes.\n\nFinal Note: if you are looking to learn about optimization methods for the latest fancy neural networks you'll be disappointed (aside from basic gradient descent which is covered in this course, a lot of NN libraries use stochastic, not deterministic, methods/variations).  However there are still plenty of cool applications of deterministic opt in operations research and for some ML/Stats applications (like SVMs, robust regression, and SVD).",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "workload": 12,
                        "id": "external-import-85ac1e05-f790-4998-8fda-abee8a7b456d",
                        "created": "2019-05-06T17:34:38Z",
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "rating": 3,
                        "_id": "external-import-2d7f66a5-39a0-4d25-80f2-9d9a1783e17d",
                        "body": "While I've very much enjoyed the material (and learned a ton about the rationale behind linear optimization), there were two main defects with this class - logistics, and grading.\n\nFirst of all, the delivery of the course was quite poor, considering that this class actually is a very math-heavy class. There were a lot of jumps here and there, so basically unless you have a good previous understanding about convex optimization (or linear algebra applied to this optimization),  you are in for hours and hours of searching and reading over the internet. Also there are some wrong information in the lecture, not corrected promptly (such as reverting max and min in a problem)\n\nSecondly, the TAs are not as engaged - their hw solution release was pretty late most of the time, and if you ask a question, the response takes a long time to come. Some responses are detailed but mostly they are \"check this lecture\" or \"oh that is a typo\" kind of short response. The professors are non-existent as well. We kinda relied on our cohort for those responses (thanks to those of you with better understanding of the concepts)\n\nThirdly, in the knowledge checks there are no detailed explanation of why it is right and why it is wrong. If you get it wrong, in order to learn from it you need to see why you lost it. That required additional search time as well. Same goes for the exams - they just say you got it wrong, without giving the reasons. No recap session and such at all. So it does not boost your learning experience.\n\nLastly, about grading. The grading is heavily (75%) exam-based. The main problem is, the lecture and hw, + knowledge checks do not provide adequate preparation for the exam. Whilst there are no practice exams given or topics listed but simply stated \"like homework and knowledge checks\", the difficulty is way higher than hw and knowledge checks. Quite a bit of word-tricks (\"always\" , \"may have\" etc.) There was no way to prepare adequately for the exam, unless you were just plain good with all the concepts. This seems to be a general sentiment, from what I hear in (unofficial) class slack. They should've given at least some practice questions so that one can gauge how good (or bad) they are. With solution, even better. Or just do a recap office hour or something. \n\nSummary)\n\nPros: Material is interesting. Tons of things to learn.\n\nCons: Bad logistics, horrible exams.\n\nVerdict: I wouldn't take it if I were to take it again. If you are really comfortable with linear algebra, go ahead. If not, no bueno. You'll learn a lot of linear algebra, but you'll be better off (and less stressed) taking famous Strang course on linear algebra if you are looking to bolster linear algebra.\nNeutral since I did learn quite a bit from course.",
                        "_createdAt": "2019-05-06T02:27:39Z",
                        "id": "external-import-2d7f66a5-39a0-4d25-80f2-9d9a1783e17d",
                        "created": "2019-05-06T02:27:39Z",
                        "workload": 15,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "difficulty": 5
                    },
                    {
                        "difficulty": 4,
                        "id": "external-import-1253d4bf-d842-498e-8110-9c1185fd0aae",
                        "body": "Course Review ISYE6669\nThis is a good course and I learned a lot.  \n\nPrerequisites:   It seems to me that half of the class is just linear algebra, not specific to optimization.  The course only uses a little calculus (Taylor’s series, gradient and Hessein matrix) and almost no probability/statistics.  I only had a minimum level knowledge of linear algebra from my undergraduate engineering training.  \n\nComputing: You definitely need to know python for the homework (not tested in the exams).  Matlab also helps.  We were asked to set up a python 2.7 environment specifically for cvxpy.  I had set up a separate environment just for this class.  Getting it right for this class could take some time because package compatibility issues with cvxpy.  Some were able to use python 3.5 or 3.6 for this class. \n \nOverall, your grade and learning experience would correlate directly to your linear algebra skills and your time spent on studying materials outside the lectures.  I did well simply because I dedicated far more time (probably 15-20 hours/week) than the average students. \n\nCourse materials:  There are two modules of videos (3-5 per module) each week.  The total time is consistently about 2 hours per week. But I spent at least twice as much time viewing the videos, taking notes, and reading other materials to understand the lectures.  A few videos had typos that confused many students, wasting much valuable time.  A few knowledge-check questions also had typo or other mistakes.  Besides the few mistakes, the lecture videos and slides were very good, clear and well organized.  The math review in the lecture is far from sufficient.  They just assume that you know linear algebra well (and intuitively).  If you don’t, you can follow the lecture, the steps and procedures, but will likely be lost in the details.    \n\nNo book is required.  Some recommended references can be downloaded free from authors’ websites.  But I think they have too much math and didn’t find them helpful.  I had a couple of (nearly 40 years) old Linear Programming books that I found very helpful.  They cover the required math and explain many of the concepts and methods better than the lectures. More than half of the course is linear programming. \n\nThere is a homework assignment every week.  Most of them are not difficult but some can take more than 5-6 hours depending on your experience with python and the software package (e.g. CVX).  I found the homework helpful in learning the material.  All assignments are peer graded.  Most students get 90-100% for the homework (which is 25% of the grade).  The last one (15th) is called “bonus” and is due in the finals week.  But it is not counted toward the final grade.  So I did not submit it. The two lowest grades of the other (14) assignments are dropped before the average is calculated.\n\nThe midterm (35%) and final (40%) exams were harder than the homework.  The issue is that many of the questions are linear algebra, not optimization.  You are required to do math by hand, not with a computer (as you can for homework).  So if you just viewed the lectures and completed your homework, you are not prepared for the exams (unless you are already skilled at linear algebra).  They should have given the questions at the beginning of the course to help students assess their knowledge gaps.  In addition, many questions require true understanding of the concepts and approach, not merely the procedures.  If you don’t understand “why” a method was developed or used but only follow “how” to solve a given problem in the lecture, some exam questions will look unfamiliar. There are so many methods to choose from.  You won’t know where to start.  \n\nI wish more homework (especially the later ones) could include questions not specific to a lecture or method so the students had to think how to approach them.  But I understand that the class is trying to cover as many basic methods as it can fit in the 15 weeks.  The course load is already significant.\nThe TA’s were very responsive and very helpful on Piazza, which made the class a great learning experience.  There were four office hours per week.  But I did not attend any and preferred asking on Piazza. \n\nIf you take the class, I recommend 1) study linear algebra as much as you can, 2) get a Linear Programming book as a reference, 3) set up the python environment ASAP, and 4) ask questions on Piazza.",
                        "_createdAt": "2019-05-05T20:29:43Z",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "created": "2019-05-05T20:29:43Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "workload": 12,
                        "_id": "external-import-1253d4bf-d842-498e-8110-9c1185fd0aae"
                    },
                    {
                        "created": "2019-05-04T00:23:24Z",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "difficulty": 3,
                        "_createdAt": "2019-05-04T00:23:24Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_id": "external-import-a1567d37-9f21-471e-8248-91cfac1a5ee1",
                        "id": "external-import-a1567d37-9f21-471e-8248-91cfac1a5ee1",
                        "course": null,
                        "body": "This course was solid but not great. It will give you an intro to a broad range of deterministic optimization topics and particularly linear programming. \n\nThe course is a nice complement to the random optimization components from CS7641. It will also get you a little more understanding of what is going on under the hood of convex optimization solvers. There is also a heavy component of formulating problems into the form required by commercial solvers, which is probably the most valuable skill for a practitioner. \n\nThe homework is well done and generally light (often 2-4 hours per week). Occasionally it was harder and caught me by surprise, so it's helpful to start early if you can.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 8
                    },
                    {
                        "id": "external-import-d0bb4ffd-d9b4-4ca9-8ff3-b9d8f13e5fba",
                        "created": "2019-04-22T20:47:50Z",
                        "body": "Course gives a good introduction about optimization. \nHowever, Professors are not at all involved in this course and TA's are not very responsive.. \nSo, I will not recommend this class if objective is to learn via discussions/ two way communication..",
                        "difficulty": 3,
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 6,
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-04-22T20:47:50Z",
                        "_id": "external-import-d0bb4ffd-d9b4-4ca9-8ff3-b9d8f13e5fba",
                        "rating": 3
                    },
                    {
                        "course": null,
                        "difficulty": 3,
                        "_createdAt": "2018-12-31T04:40:24Z",
                        "body": "This course is an overview of deterministic optimization algorithms with a few of their real-world applications. They would typically be presented in a general form, but then simplified into smaller dimensions for ease of understanding and ability to solve by hand when given real numbers. Course material and lecturers could be a bit dry, but definitely nothing should be skipped (typically about 1-2 hours of lecture time). Overall, this allowed the student to effectively grasp the concepts with the homeworks, which were directly useful when it came to understanding the concepts presented.\n\nOn the subject of homeworks, there are 14 peer-graded homeworks (6501-style, 100/90/75/50/0) , mostly straightforward and relevant to the material presented in class for effective understanding reinforcement. Homeworks were mostly doable on paper, with a few homeworks to be done in Python but not requiring any more understanding than what was learned in CSE 6040. Homeworks took an average of 2-3 hours each, with some taking more but some taking less.\n\nExams could be a bit tricky, as there were questions that required deeper understanding than what was presented in class, and would not be explained until after the exam period. However, since most of the class missed the same questions for reasons of lack of coverage, it seemed to have been factored into the final course grade. The final grade was curved, where the cutoff for the Fall 2018 semester seems to have hovered around slightly above the class average. \n\nDefinitely recommended for reasons of usefulness and practical application...just be prepared for dry lectures and absentee professors (questions answered by 1-2 TAs).",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "id": "external-import-38c0d539-a39b-4af3-b7d9-541be2aa4d2c",
                        "created": "2018-12-31T04:40:24Z",
                        "workload": 6,
                        "_type": "review",
                        "_id": "external-import-38c0d539-a39b-4af3-b7d9-541be2aa4d2c",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester"
                        }
                    },
                    {
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-12-11T02:03:59Z",
                        "id": "external-import-3290c1e4-6c36-4fd7-a142-a82849262e2d",
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-3290c1e4-6c36-4fd7-a142-a82849262e2d",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "created": "2018-12-11T02:03:59Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "body": "Took this class Fall 2018 and not Summer 2018. \n\nWow. This class covered way more material than I expected. The 14 homework assignments (1 every week) were pretty intense, but the good thing is you get to drop two. The 15th homework assignment is just a bonus and is not included in your grade.\n\nGrading Breakdown:\n1. Homework 25%\n2. Midterm 35% (90 minutes, 30 MC questions)\n3. Final 40% (180 minutes, 30 MC questions)\n\nYou're allowed one 2-sided notes for each test. Fall 2018 class average for the exams were (23.1/30) for midterm and (19.8/30) for final.\n\nThings I liked about this class:\n\n1. Uses Python (helps develop your Jupyter notebooks skills and also formulating equations in LaTex)\n2. Optimization is what ML algorithms are doing, so it's very relevant to everything we're learning.\n3. There was a decent amount of material that crossed over with concepts from other classes from a more \"optimization\" viewpoint\n\nBad things:\n\n1. Absolutely no professor interaction. The two TAs were great at responding to answers, but this is the first class I had where there wasn't a single professor Piazza interaction.\n2. No practice midterm/final\n3. Some of the test questions are just really difficult to get right without more practice from a practice midterm or final. Studying alone isn't sufficient enough to get the right answer. Tests were kind of demoralizing when I thought I did well, but after submitting I did way worse than expected. I think you have to have a truly good understanding of the concepts to apply them to the questions you see on the exam.\n4. Soo much material... it was hard to remember everything for the exams\n5. Errors on the midterm. There were several questions that had multiple checkboxes instead of radio buttons and credit wasn't given for questions if the wrong question was also selected. It didn't seem like the test was reviewed after it was published on Canvas. This probably shouldn't be a recurrent problem though.\n\nHave yet to see how generous the curve is.",
                        "_type": "review"
                    },
                    {
                        "rating": 3,
                        "course": null,
                        "body": "This class was certainly interesting, but I felt at time I got too \"in the weeds.\" We often got much deeper into theory than I would have liked and not so into application, but that just seems to be how this entire program goes. Professors were fine, weekly home works felt a little overkill, but the info is pretty good and I do feel like I learned a good bit. Biggest downside is the tests are unorganized and messy, and don't reflect the home works and lectures very well, imo. I think with some tweaking this could be a very strong course.\n\nMy Background:\n\n23 years old, recently married, graduated undergrad in May 2017.\n\nCoding Experience: Moderate (academic experience with many languages, mostly Python and R)\n\nStatistics Experience: Moderate (4 undergrad level stat courses, Intro to Analytics Modeling, Regression Analysis)\n\nMath Experience: Moderate (peaked at 2nd year Calculus)",
                        "created": "2018-12-07T15:05:22Z",
                        "_createdAt": "2018-12-07T15:05:22Z",
                        "_id": "external-import-13b4ff44-d241-4234-a3e7-857e783a80b2",
                        "difficulty": 4,
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-13b4ff44-d241-4234-a3e7-857e783a80b2",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review"
                    },
                    {
                        "created": "2018-12-04T19:32:11Z",
                        "workload": 10,
                        "course": null,
                        "_type": "review",
                        "difficulty": 5,
                        "id": "external-import-30cfdfca-453a-4767-af98-e84ed3681cd3",
                        "_createdAt": "2018-12-04T19:32:11Z",
                        "rating": 1,
                        "_id": "external-import-30cfdfca-453a-4767-af98-e84ed3681cd3",
                        "body": "Extremely difficult course. Requires a PhD in math or at least a degree in math. Teachers/TAs know a lot more than you and they assume you know as much as they know. There is no application I know of to work as a data scientist from this course. The course is very theoretical and NOT FUN. The course covers an incredible amount of information. You are tested on material not covered in lecture or covered in such poor detail as to be not covered. There is 30 hours of lecture of extremely difficult material. How are you supposed to learn everything that is taught in this course?",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "semester": {
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z"
                        }
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 4,
                        "course": null,
                        "created": "2018-06-05T17:08:53Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4,
                        "body": "My review is biased because I began the class with an excitement to learn about Deterministic Optimization. The material is often highly abstract, and the future rewards seem uncertain, as if the class was an experiment in reinforcement learning. Entering the class with a strong interest was helpful to push through the early math portion, stick with it. The course begins by focusing on core mathematical building blocks like linear algebra, set theory, and convexity. A good understanding of this material pays dividends when the class begins to introduce concepts like search spaces, second order cone programming, and simplex.\n\nThis class focuses on the math and reasoning behind basic optimization techniques. In my opinion, this is the most important thing to understand about optimization before moving on to other optimization topics. Some students in the class had hoped for more applications of optimization techniques to real-world problems. While there are numerous real-world examples explained in the videos, the time spent actually applying optimization to real-world problems in the homeworks and tests is minimal. The class also doesn't really delve into the computational side of optimization. To be fair, that would probably make a good follow up class. Simple fixes like providing vectorized homework solutions could help improve the class in this regard. \n\nOverall I enjoyed this class because I enjoyed the material. I plan on continuing to learn about optimization and this class provides a good foundation for future exploration through the search space.",
                        "workload": 7,
                        "_type": "review",
                        "id": "external-import-08164325-df22-4429-a5ab-f7006adf0677",
                        "_createdAt": "2018-06-05T17:08:53Z",
                        "_id": "external-import-08164325-df22-4429-a5ab-f7006adf0677"
                    },
                    {
                        "difficulty": 4,
                        "body": "I really liked this class, it manages to be both challenging, almost self sustained and very well organized, where you can expect to spend around 10hs per week between watching lectures and doing the homeworks.\n\nThe homeworks are normally fun and consist on solving some problems I would say 50% coding 50% by hand.\n\nI suggest to refresh linear algebra, because even if the course covers much of what it uses, in the end the tests assume a certain level of math. There are two tests which account for 60% of the grade and are quite challenging. \n\nSome students criticised that it focuses much on theory and less on real applications, but I don't agree, I think it has the right dose of both sides of the coin.",
                        "_createdAt": "2018-05-01T17:43:47Z",
                        "created": "2018-05-01T17:43:47Z",
                        "_type": "review",
                        "_id": "external-import-8428d526-fc96-49cc-9eff-0d20f5b108c0",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 5,
                        "workload": 10,
                        "id": "external-import-8428d526-fc96-49cc-9eff-0d20f5b108c0",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    }
                ],
                "_type": "course",
                "creditHours": 3,
                "name": "Deterministic Optimization",
                "isDeprecated": false,
                "created": "2022-07-05T23:23:15Z",
                "_id": "external-import-ISYE-6669",
                "programs": [
                    {
                        "acronym": "CS"
                    },
                    {
                        "acronym": "AN"
                    }
                ],
                "codes": [
                    "ISYE-6669"
                ],
                "_createdAt": "2022-07-05T23:23:15Z",
                "tags": [],
                "description": "An introduction to deterministic optimization methodologies including approaches from linear, discrete, and nonlinear optimization including algorithms and computations. Applications will be introduced as appropriate.",
                "id": "external-import-ISYE-6669",
                "isFoundational": false,
                "_rev": "vLev53Cwnp4JOI2CCHl7Gh",
                "syllabusUrl": null,
                "rating": 3.7291666666666665,
                "difficulty": 3.875,
                "workload": 13.208333333333334
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "deterministic-optimization"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "gsp": true,
    "scriptLoader": []
}