{
    "props": {
        "pageProps": {
            "course": {
                "id": "external-import-ISYE-6420",
                "created": "2022-07-05T23:23:15Z",
                "isDeprecated": false,
                "_rev": "iLpqNfBINCDhaBRaVOICzf",
                "_createdAt": "2022-07-05T23:23:15Z",
                "slug": "introduction-to-theory-and-practice-of-bayesian-statistics",
                "_type": "course",
                "officialURL": "https://omscs.gatech.edu/isye-6420-bayesian-statistics",
                "programs": [
                    {
                        "acronym": "CS"
                    },
                    {
                        "acronym": "AN"
                    }
                ],
                "isFoundational": true,
                "creditHours": 3,
                "textbooks": [
                    {
                        "name": "The BUGS Book: A Practical Introduction to Bayesian Analysis",
                        "_key": "4b68763fa671b5c0c545cc1841938bf2",
                        "url": "https://amzn.to/3CrTr3a"
                    },
                    {
                        "name": "Engineering Biostatistics: An Introduction using MATLAB and WinBUGS",
                        "_key": "71d357a1e65a9943ca03714e6813e287",
                        "url": "https://amzn.to/3AoCYKk"
                    },
                    {
                        "name": "Bayesian Modeling Using WinBUGS",
                        "_key": "2f241ceb10cdfe91ca671f805589238f",
                        "url": "https://amzn.to/3dIUvoT"
                    },
                    {
                        "name": "Bayesian Statistics: An Introduction 4th Edition",
                        "_key": "97e3cfa5b590301997f48e3f798e441c",
                        "url": "https://amzn.to/3dJwe1Y"
                    }
                ],
                "tags": [
                    "BS"
                ],
                "name": "Introduction to Theory and Practice of Bayesian Statistics",
                "_updatedAt": "2022-08-25T21:41:24Z",
                "syllabus": {
                    "file": {
                        "_type": "file",
                        "asset": {
                            "_ref": "file-f8697e3c9ab0757c24e3b06d5f85ac691d3d08ac-pdf",
                            "_type": "reference"
                        }
                    }
                },
                "codes": [
                    "ISYE-6420"
                ],
                "description": "Rigorous introduction to the theory of Beysian Statistical Inference. Bayesian estimation and testing. Conjugate priors. Noninformative priors. Bayesian computation. Bayesian networks and Bayesian signal processing. Various engineering applications.",
                "reviews": [
                    {
                        "id": "JVuu4BxIgmKvCk10vqyK00",
                        "workload": 15,
                        "_createdAt": "2024-11-02T20:44:20Z",
                        "difficulty": 5,
                        "authorId": "gJGGTEnDTNRN7HlO2aFWcA==",
                        "semester": {
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "rating": 1,
                        "body": "This is one of the most horrible courses, causing me to lose 4.0 GPA. It is very disorganized, hard to stay on track with a full time job. I spend whole weekend behind this class yet I can't figure out. Lot of problems with requirements like PyMC which constantly requires troubleshooting. If I had chance I would avoid this class.",
                        "_updatedAt": "2024-11-02T20:44:20Z",
                        "created": "2024-11-02T20:44:20Z",
                        "_id": "JVuu4BxIgmKvCk10vqyK00",
                        "course": null,
                        "_rev": "JVuu4BxIgmKvCk10vqyJy1",
                        "_type": "review"
                    },
                    {
                        "body": "Coming from a chemical engineering background, I didn't have much experience with programming. However, I found the TAs for this course to be extremely helpful. Aaron's GitHub repository and Ed discussion were great resources and the TAs are very helpful. I found the course lectures to be very unhelpful and vague. I would usually fast forward through them, read the notes, then follow Aaron's GitHub to solve the example problems.\n\nThe first half of the course was heavily focused on hand written math problems and it slowly transitioned to applying the theory to a programming language. The first four assignments took quite some time (about 10-16 hours each) to finish. The second half was mainly PYMC or BUGs based model regression and the assignments were fairly straightforward, taking less time to finish.\n\nOverall, I think this course provides a lot of valuable information and tools, consequently requiring some time (15-20 hours per week for me) to be able to understand the concepts effectively. ",
                        "course": null,
                        "workload": 18,
                        "rating": 4,
                        "_createdAt": "2024-05-06T17:12:08Z",
                        "_rev": "GjO1iZvsFPRHJDkdhU3WNx",
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "id": "GjO1iZvsFPRHJDkdhU3WQq",
                        "_updatedAt": "2024-05-06T17:12:08Z",
                        "difficulty": 3,
                        "_type": "review",
                        "_id": "GjO1iZvsFPRHJDkdhU3WQq",
                        "created": "2024-05-06T17:12:08Z",
                        "authorId": "EzW2Sy6F1TGsKjo50cLBqw=="
                    },
                    {
                        "_id": "hjUbyqMaYdjWc1lRG74P5N",
                        "_rev": "hjUbyqMaYdjWc1lRG74P2r",
                        "_type": "review",
                        "course": null,
                        "id": "hjUbyqMaYdjWc1lRG74P5N",
                        "rating": 5,
                        "workload": 10,
                        "authorId": "4kluWNzA+TUcEksL17C2JA==",
                        "difficulty": 4,
                        "created": "2024-04-26T16:15:33Z",
                        "body": "This is one of the best classes I've taken while in OMSCS having taken DL, HDDA, RL, ML, QC & NetSci so far. The other reviews are correct that the video lectures aren't great. They are ok up until about unit 4/5. Luckily Aaron, the best TA I've had in any undergraduate or graduate course I've taken, has made a website where he has re-done many of the lectures using PyMC which is a great resource. There is also no longer any need to use WinBUGS (also thanks to Aaron) you can now finish the course using only Python will little issue. To supplement the lectures I recommend getting a copy of Ben Lambert's book \"A Student Guide to Bayesian Statistics\" which is one of the best textbook I've ever read and watching the lectures Ben made to accompany the book on YouTube. Between Ben and Aaron's work you should be able to get ALOT out of this class. Make sure you know basic calculus and probability before taking the course as well. The later is covered in the lectures fairly well though at the start. Also be sure to go to Greg and Aaron's office hours if you're stuck on the homework!",
                        "_createdAt": "2024-04-26T16:15:33Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr"
                        },
                        "_updatedAt": "2024-04-26T16:15:33Z"
                    },
                    {
                        "_updatedAt": "2023-12-19T07:50:41Z",
                        "_createdAt": "2023-12-19T07:50:41Z",
                        "id": "EMDrCE8zqCAoxcS5bb6sW0",
                        "course": null,
                        "workload": 15,
                        "semester": {
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester"
                        },
                        "rating": 3,
                        "body": "Grade: 95.15%\n\nTheory: the material in the course is extremely interesting. Unfortunately, you'll have to do a large fraction of your learning outside of the provided lectures. The lectures are not presented well: frequently, \"the what\" is presented with little emphasis on \"the why\" behind the material. If you internalize the need for independent, self-study early on, then you should be okay. There are many helpful YouTube channels on Bayesian Statistics.\n\nPractice: I chose to do all code for the course in Python and PyMC. Aaron, the TA is very helpful with PyMC. That said, it would be quite nice to see the course update to exclusively using Python.\n\nAll considered, I recommend this course, not for its instruction, but for knowledge it provides.",
                        "_type": "review",
                        "_id": "EMDrCE8zqCAoxcS5bb6sW0",
                        "authorId": "Kn8gG+am8vXjiWYsxuXP1Q==",
                        "created": "2023-12-19T07:50:41Z",
                        "difficulty": 4,
                        "_rev": "EMDrCE8zqCAoxcS5bb6sUT"
                    },
                    {
                        "created": "2023-12-19T01:34:06Z",
                        "rating": 4,
                        "workload": 15,
                        "_id": "EMDrCE8zqCAoxcS5baLMyI",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr"
                        },
                        "course": null,
                        "id": "EMDrCE8zqCAoxcS5baLMyI",
                        "authorId": "ZHzzbZMgfkSChH1c+K2Fdw==",
                        "_updatedAt": "2023-12-19T01:34:06Z",
                        "_createdAt": "2023-12-19T01:34:06Z",
                        "body": "I'd like to begin by emphasizing that the course material is genuinely captivating. Once you overcome the initial hurdle presented by the first two homework assignments, which essentially serve as a recap of calculus and probability concepts, you'll delve into the heart of the course: constructing distributions using Bayes' Rule. The moment you create your first distribution and compute its mean, witnessing its similarity to the frequentist approach's mean, you'll become captivated by the subject matter.\n\nHowever, it's worth noting that the quality of the video lectures leaves much to be desired. Thankfully, the Teaching Assistant (TA) instruction compensates for this deficiency. I recommend using the video lectures as a reference for the key concepts you need to familiarize yourself with, and then supplement your understanding by researching these concepts online. Attending TA lecture hours is crucial, as they provide practical examples to help you tackle the problems effectively.  The course isn't too difficult but you can run into some issues if you just use the video lectures exclusively to study the concepts.  \n\nIn summary, this course is highly engaging and valuable. The only aspect preventing it from receiving a perfect 5/5 rating is the subpar quality of the video lectures.",
                        "difficulty": 3,
                        "_rev": "EMDrCE8zqCAoxcS5baLMwl"
                    },
                    {
                        "created": "2023-12-03T02:05:24Z",
                        "course": null,
                        "body": "This course really depends on what prior knowledge you bring in. I have a decent foundation in probability and calculus, and the basics of statistics, although I have no education in modeling. The first half of the class is straight forward if you're familiar with probability and calculus. The latter half of the course I found really challenging because I have almost no foundation in modeling. Essentially the entire latter half is just modeling, and I can sure copy the pattern from examples, but I don't feel like I have any idea of how to justify my choice of priors other than the obvious - the feature can only be positive, so it doesn't make sense to use a prior that can be negative, etc. I don't have the background to do create more interesting models than Bayesian regression or diagnose problems accurately. \n\nI did use PyMC where I could've used BUGS, which while ugly, probably would have saved me a lot of headaches from debugging. I didn't find the stack traces to be super helpful, but again, I think this is because of my lack of background with modeling. \n\nThe lectures are not very good, essentially it's a professor sitting in a chair reading slides which are projected on the background. I feel that they didn't offer an intuitive understanding of the material and the lack of a more robust textbook to pair as either a supplemental or follow-along made it very difficult to know where to go for answers when I didn't know how to formulate a question for a TA. I found myself looking online quite a bit for what I feel should be part and parcel of a good course, regardless of the level.\n\nThat last part is my biggest gripe with the course, the lack of a background is on me, but a good lecture should impart an intuition as well as a walk through in detail several examples, explaining each part of the problem, various pitfalls, etc. Self teaching is an important part of the learning process, but it should be to fill in the gaps after the core has been provided, not the opposite. What's the point of a course if I'm going to get most of my understanding from other material?\n\nUnfortunately I don't really feel like I learned much in this course. I feel that I was making good progress before the course on my own, having retaught myself linear algebra, calculus, basic statistical theory (MLE, confidence intervals, efficiency, etc.) and was just about to start a textbook on modeling when the course started :I ) and now I feel like my time this fall was ill spent. It feels as though I was being more productive without the \"help\" of a class.\n\nFor full transparency, I'm on target to get somewhere around 90-92 in the course unless I don't do well on the final and the project, but it's one thing to get a decent enough score and another to learn.\n\nI'm going to try another semester and different courses and if I feel the same after that I'm going to go back to self teaching, which would be a huge disappointment since I am hoping to shift careers into ML, and that's a lot easier with an advanced degree in hand.",
                        "_type": "review",
                        "id": "8lqQ4BiwlpQaXHr6xqYOzu",
                        "workload": 15,
                        "difficulty": 4,
                        "rating": 2,
                        "_id": "8lqQ4BiwlpQaXHr6xqYOzu",
                        "authorId": "zwVyYRJ5ewa2dx+az3YaTQ==",
                        "_updatedAt": "2023-12-03T02:05:24Z",
                        "_rev": "8lqQ4BiwlpQaXHr6xqYOvy",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr"
                        },
                        "_createdAt": "2023-12-03T02:05:24Z"
                    },
                    {
                        "id": "llHPdpE6t2d8pDZnVFT5e6",
                        "created": "2023-11-29T04:22:10Z",
                        "_createdAt": "2023-11-29T04:22:10Z",
                        "_id": "llHPdpE6t2d8pDZnVFT5e6",
                        "body": "Contrary to other students' sentiments, I really enjoyed this course. I have a background in statistics, and one of the reasons I enrolled in this course is because the Bayesian class I took during my undergrad years wasn't satisfactory. I've gained more clarity in how Bayesian analysis works, especially in real-world problems. I agree that the lecture videos weren't as straightforward as one might hope. But thanks to the TAs who fervently replied to everyone's concerns, they made this course extra easier to digest. On top of that, there are numerous online resources that can supplement the materials in this course. So I guess it's just a matter of looking up materials that can help one learn.\n\nThe resource website that TA Aaron Reding created helped a lot, especially in implementing Prof. Brani's WinBUGS codes in PyMC. The midterm was a take-home exam, and while I can access everything, the problems themselves are still challenging. It really tests our understanding of the topic. Now that the class is nearing its end, I have a deeper appreciation of this topic, and I like how it changed my perspective on doing analyses, i.e., changing our prior beliefs in light of new observed data. ",
                        "_type": "review",
                        "authorId": "HMZn1aoN260rPAOsJhmVHA==",
                        "_rev": "llHPdpE6t2d8pDZnVFT5az",
                        "workload": 15,
                        "_updatedAt": "2023-11-29T04:22:10Z",
                        "difficulty": 3,
                        "rating": 5,
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "course": null
                    },
                    {
                        "workload": 1,
                        "id": "UI5KGa02sbnep2oeWKjxuZ",
                        "course": null,
                        "_rev": "UI5KGa02sbnep2oeWKjxqs",
                        "body": "This course is highly valuable for anyone seeking a statistics foundation, especially if you plan to delve into machine learning. It's not a course where you'll be guided every step of the way, so be prepared to engage your critical thinking and invest effort into self-learning to excel. While the lectures might not be exceptional, the staff offers abundant supplementary materials, ensuring you don't need to depend solely on them. The teaching assistants are remarkably helpful, and in my opinion, this course is essential for anyone interested in machine learning.",
                        "rating": 5,
                        "semester": {
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a"
                        },
                        "_updatedAt": "2023-10-27T22:47:08Z",
                        "difficulty": 3,
                        "_type": "review",
                        "_createdAt": "2023-10-27T22:47:08Z",
                        "_id": "UI5KGa02sbnep2oeWKjxuZ",
                        "authorId": "osW8KLhd0q03OcmyoR6mhg==",
                        "created": "2023-10-27T22:47:08Z"
                    },
                    {
                        "id": "QKWodifXFARnu6nLml6REw",
                        "difficulty": 5,
                        "authorId": "LHtl+OMWN3m/ZoRX5vv7wA==",
                        "body": "The lectures provide a very limited understanding to why certain things are done in a particular way. No explanation of the process and missing intermediate step to get to the answer. Particularly difficult to follow when assumption are made regularly to find a proportional or equivalent functions or distributions without knowing why that decision can be made.\nThe first half of the semester is very involved on the theory and advance mathematics behind Bayesian statistics.  Extremely hard to follow, as many symbols and variables are recycled and are used very differently.  This makes it a challenge to learn the concepts, starting out, when things are not consistent.  \nNeed to be familiar with all the mathematical notations and symbols and be able to translate them to something human readable. \nThe homework takes a lot of time to complete leaving a gap in trying out the other course material.  The biggest issue I had was not being able to get answers to questions in a timely manner, and the answers were usually cryptic because they don't want to give away too much (this just made me more confused because I would be working with incorrect equations that lead nowhere) There are a lack of good examples or exercises with nice solutions to walk you through a problem start to finish. \nI'd say the biggest help to starting to learn the material was the numerous web links to external videos and documents posted in the Ed Discussion.  I stopped watching the class lecture videos because other youtubers had better explanations and visuals to actually see what the formulas and algorithms were doing.\nThis class is definitely a victim of quantity of material over quality. I wasted so much time wading through the class provided material looking for answers.",
                        "created": "2023-10-12T18:29:10Z",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "_id": "QKWodifXFARnu6nLml6REw",
                        "_createdAt": "2023-10-12T18:29:10Z",
                        "_rev": "QKWodifXFARnu6nLml6R9m",
                        "workload": 35,
                        "_updatedAt": "2023-10-12T18:29:10Z"
                    },
                    {
                        "created": "2023-08-16T17:49:22Z",
                        "authorId": "xHkep89yXIVJNmJWb2goyw==",
                        "_createdAt": "2023-08-16T17:49:22Z",
                        "body": "By far, the worst course I've ever experienced all the way back to kindergarten.\n\nNo TA involvement at all.  The materials are so bad.",
                        "_id": "HDbsrzRZRpzQ4DQ92Y9gTT",
                        "_rev": "HDbsrzRZRpzQ4DQ92Y9gM5",
                        "rating": 1,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3"
                        },
                        "workload": 5,
                        "id": "HDbsrzRZRpzQ4DQ92Y9gTT",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2023-08-16T17:49:22Z",
                        "difficulty": 1
                    },
                    {
                        "id": "w8rRZHqNmtqqBUFia4Uics",
                        "workload": 3,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb"
                        },
                        "_updatedAt": "2023-06-17T08:52:07Z",
                        "course": null,
                        "_type": "review",
                        "created": "2023-06-17T08:52:07Z",
                        "difficulty": 1,
                        "_id": "w8rRZHqNmtqqBUFia4Uics",
                        "body": "Shout out to the TA Aaron Reding for being a great resource. I have a math background and did quite a lot of statistics in my ugrad. This course was a breeze. \n\nFor those who studied math or statistics, this class is going to be a breeze. For those who did not study a math or statistics heavy field which is most likely the case for those who said this class was extremely challenging, I can see how this class can be hard, but Aaron is really helpful. ",
                        "rating": 3,
                        "_createdAt": "2023-06-17T08:52:07Z",
                        "_rev": "w8rRZHqNmtqqBUFia4UiYP",
                        "authorId": "nKmiv0L2GMPkh0rS8CKWhg=="
                    },
                    {
                        "created": "2022-12-23T00:10:21Z",
                        "rating": 4,
                        "course": null,
                        "workload": 12,
                        "id": "ojGpuoLqWcC94EPn3lmXiC",
                        "semester": {
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z"
                        },
                        "body": "What I liked:\n- TA's are amazing. Greg and Aaron are super helpful on Ed discussion.\n- TA Office Hours are recorded\n- Every example problem has been translated to Python + PyMC (no need to ever use BUGS)\n- It's fairly easy to find alternative explanations on Youtube\n- The actual course material is really cool \n- The freedom to do whatever we want for the final project\n- Take home exams\n- Ability to refresh Calculus and Probability concepts that I'm sure I will need in later ML courses\n\nWhat I disliked:\n- Lectures are hand-wavy and do not go deep into the concepts\n- Typing up all the math for the first three HW reports is painful\n- The official textbook only covered 1/2 of the class\n\nHow I got an A:\n- Cruise through lectures and pick out the main concepts. Search Youtube/other online sources to find in-depth explanations.\n- Read all the threads under Ed Discussion for assignments; they often help clarify a lot\n- Watch every recorded office hour\n- If you're stuck, review Supplementary Exercises + solutions and consult the textbook + solutions",
                        "_type": "review",
                        "difficulty": 3,
                        "_createdAt": "2022-12-23T00:10:21Z",
                        "_updatedAt": "2022-12-23T00:10:21Z",
                        "_rev": "ojGpuoLqWcC94EPn3lmXeR",
                        "_id": "ojGpuoLqWcC94EPn3lmXiC",
                        "authorId": "dDxnnO7RtaE1iRm3WFUENQ=="
                    },
                    {
                        "id": "f7lUmzomareeh1prmr4Qp1",
                        "created": "2022-12-22T18:09:09Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester"
                        },
                        "body": "I learned a lot. The mid-term is basically the variation from the homework. The office hour running by TAs is very helpful to understand homework and how to solve it. And please use OpenBUGS(WinBUGS), rather than python or R, and you will get A in this course. ",
                        "workload": 10,
                        "_type": "review",
                        "_id": "f7lUmzomareeh1prmr4Qp1",
                        "authorId": "3sjPbN3eNm041zMgFUlWUQ==",
                        "difficulty": 3,
                        "_rev": "f7lUmzomareeh1prmr4QkV",
                        "_createdAt": "2022-12-22T18:09:09Z",
                        "rating": 4,
                        "course": null,
                        "_updatedAt": "2022-12-22T18:09:09Z"
                    },
                    {
                        "rating": 3,
                        "_createdAt": "2022-12-21T19:55:15Z",
                        "body": "Where to start. I can tell that Dr. Vidakovic loves Bayesian stats and longs for his students to love it as well. This is evidenced by how often he has the student solve using Bayesian methods and then compare the results to frequentist methods. His hope is that you will become a sold out \"Bayesian\" and abandon the insufficient frequentist paradigm. However, he does not love it enough to give thorough examples of worked problems and applied Calculus. \n\nThe TAs, I believe, are very nice and well meaning but their office hours never went in depth and never worked a problem step by step. Rather, they put up consolidated calculus steps without talking through what they did and why, which is not particularly helpful. I have had to do advanced calc in Goldsman's Simulation class and did just fine with that (got an A), primarily because the TAs would spend two and half hours working through old tests problem by problem, demonstrating in real time how to work the problems. The head TA in this class pulls up typed out steps that leave out how he got from one step to another (i.e. \"consolidated steps\"). He would utter the line, \"And then with a little bit of algebra...\" and then point to the next line, which is not teaching. That's fine when the professor does that. The point of the TA is to go in depth where the professor does not in their lectures. Unfortunately, pedagogy is not a focus of this class. \n\nMy background: I retook Calc 2 and 3 and Linear Alg within the last five years. Consequently, my knowledge in the two areas is still quite strong. Nevertheless, it is still helpful to provide full, worked examples. Many students would be more successful if they received that. It would be like getting into Engineering Physics and just having the professor say, \"Since you've had calculus already, you should be able to figure this out without me working out any problems. Just apply the calc you already know.\" \n\nI finished the class with a B and was happy for that. The first final, the average grade was a 79%. The head TA said he was surprised so many students struggled with the test because he thought it would be easier. In this class, you will write proofs. The final had an average of 87%. As others have said, the grading is very lenient. My addition: many students will feel like there is no way they will succeed for the first eight to ten weeks. Then you finally get into using WinBUGS/PyMC. I just stuck with WinBUGS for the most part with some R script sprinkled in because the WinBUGS examples were explicit enough to use to complete the homework assignments. The first three or four assignments are incredibly difficult because of the math they require. The Metropolis-Hastings and Gibbs sampler assignment is simply not taught thoroughly enough to know how to do it. Again, if it was explicitly walked through, the programming is not difficult, but understanding what each step does and how to do it is the problem. \n\nYou will need to have a firm grasp of multivariate calculus and then be an expert googler to find people online who have worked through some of the conjugations so that hopefully you can actually learn how to do it. Even with the Gibbs Sampler and Metropolis-Hastings examples you can find online, many are not descriptive enough to know how to apply it to the problems in class. \n\nWhat I got out of the class:\n\nI understand the theory and application of advanced Bayesian stats far more now than when I started. I will not give up on learning it better as I see its value and really want to master it. Unfortunately, this class will not get most students there no matter how much they care or try.",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx"
                        },
                        "_id": "ojGpuoLqWcC94EPn3gtNO9",
                        "_type": "review",
                        "workload": 15,
                        "authorId": "nyvbgLPSSRtY+wRtwj9Lyw==",
                        "created": "2022-12-21T19:55:15Z",
                        "_updatedAt": "2022-12-21T19:55:15Z",
                        "difficulty": 4,
                        "course": null,
                        "id": "ojGpuoLqWcC94EPn3gtNO9",
                        "_rev": "ojGpuoLqWcC94EPn3gtNKO"
                    },
                    {
                        "rating": 1,
                        "body": "I loved every other course in the degree, and found this one downright awful.  The lectures provide minimal information on the theory, and many, many hours of self-directed learning are required.  You can argue \"it's a masters program, thats how it should be\", but every other course at least gives you a starting point from which to work.  The assignments take a LOT of time, and small mistakes can really impact your marks.  The exams are a MASSIVE difficulty increase compared to the homwork.  The biggest thing that needs to change is  the use of BUGS.  The software is so old that finding useful documentation is almost impossible, which makes debugging a nightmare.  You're given the option to use PYMC but if your Python isn't very strong (I'd say mine is resonable but my R/Java is better) then you're very much on your own to try learn how to translate the examples into your own homework/projects.  You can do some copy and paste with changes to get the job done, but then if you need to make changes based on small changes in the questions it can be difficult because the lectures are all in BUGS.  Respect to the TAs, they're kind, hardworking people who want the students to succeed and they do the absolute most with what they're given, but the Instructor might as well not exist, and the lectures add zero value.  Avoid this course at all cost, and take an external course via a MOOC if you're interested in the subject matter. ",
                        "difficulty": 4,
                        "authorId": "IRy8pC2Thsqp9VbK9LzCTg==",
                        "created": "2022-12-15T06:44:34Z",
                        "workload": 15,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "_updatedAt": "2022-12-15T06:44:34Z",
                        "_type": "review",
                        "_rev": "82sXZw4302uray8vcA6f3F",
                        "id": "82sXZw4302uray8vcA6f3v",
                        "_id": "82sXZw4302uray8vcA6f3v",
                        "_createdAt": "2022-12-15T06:44:34Z",
                        "course": null
                    },
                    {
                        "id": "t07eRmke6kNqW4pauMUQgH",
                        "_updatedAt": "2022-10-24T02:38:44Z",
                        "rating": 1,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "t07eRmke6kNqW4pauMUQgH",
                        "course": null,
                        "_type": "review",
                        "authorId": "BKkl+nBfUKGVk1Jk30V2BA==",
                        "created": "2022-10-24T02:38:44Z",
                        "difficulty": 5,
                        "_createdAt": "2022-10-24T02:38:44Z",
                        "_rev": "t07eRmke6kNqW4pauMUQbP",
                        "body": "I've attempted to take this course twice: Spring 22, Fall 22. First time I was also taking AI while working full time so I thought I just didn't have enough time to study...I was mistaken. This class is terrible and by far the worst class I have taken. The lectures are not detailed enough to gain a full understanding of the concepts. There are no examples that correlate to the homework. Some examples are provided, but the homework is more difficult and feels like it's a different level. I used Coursera and YouTube to supplement but couldn't find examples like the homework so I always got stuck.\n\nThe TA's are helpful, but they don't answer the questions you have fully because they are trying not to give the answers for the homework...so you end up with very limited help. Good luck finding a tutor...I had one with a masters in statistics and after two sessions he said the material was beyond his knowledge.\n\nThis course needs to be redone. New lectures, new homework, more examples. Until that happens, do not take this course unless you are really proficient in statistics...even then it may not be enough.",
                        "workload": 20
                    },
                    {
                        "rating": 3,
                        "course": null,
                        "authorId": "CqQQZZD6jZbBKqE0NBc/Mg==",
                        "difficulty": 4,
                        "_updatedAt": "2022-10-22T01:29:17Z",
                        "_createdAt": "2022-10-22T01:29:17Z",
                        "body": "I came in to this course interested in learning Bayes, and it has delivered. However, this is the only redeeming quality about this course. Only take this class if you are actually interested in the underlying theory & application of Bayesian statistics. If you are not particularly interested in the material, you will have a bad time.\n\nThere is a lot about the organization of this course that is frustrating (poor lectures and scattered knowledge resources primarily). You will always feel unprepared for the HWs & exams which can lead to some stress. Most of the difficulties in the deliverables simply boils down to manipulating functions to yield an assumed known PDF. Ultimately, the material is not that \"hard\", it will just take a while for you to figure out where to find the material you need & how to decipher the convoluted lecture slides. \n\nThere is a lot of talk about Greg the TA making this course a lot better, and while I do agree, his impact on the course quality is limited. If the TAs continue to deliver supplementary lecture contents and examples I can see this course becoming rather decent, but for now it's still a bit of a mess.",
                        "_type": "review",
                        "_rev": "t07eRmke6kNqW4pauEJ8N3",
                        "_id": "t07eRmke6kNqW4pauEJ8Rv",
                        "created": "2022-10-22T01:29:17Z",
                        "workload": 12,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3"
                        },
                        "id": "t07eRmke6kNqW4pauEJ8Rv"
                    },
                    {
                        "created": "2022-10-20T18:56:00Z",
                        "_createdAt": "2022-10-20T18:56:00Z",
                        "_type": "review",
                        "body": "Background: Undergrad in CS, Minor in Mathematics. Extremely comfortable with calculus & linear algebra (A's in undergrad; no issues with integration in this course), however I did not take a statistics course previously. I am taking this course alongside another.\n\nTAs: First I'd like to say that TA Greg & Aaron are wonderful and do their best to help the students, 10/10 great TAs.\n\nLectures: A lot of people complain about the lectures. I found that they were OK, some parts lacked detail, but that was easily remedied by reading the textbook.\n\nIssue: My MAJOR issue with this course is the lack of examples. Yes they provide supplemental exercises, yes they provide some (weak) examples during the lecture, but I felt they were not useful. Some of the HW problems are very similar to the supplementary exercises, but most of them are \"new\". I love math theory, but I cannot do well in a course where most of the problems (which your grade depends on) feel like I am \"seeing them for the first time\". The HW problems should help reinforce what you have learned not introduce you to some new approach (Especially if they are graded). The midterm feels this way as well, like I am seeing an problem that I have no preparation on how to engage it.\n\nI read reviews that said to avoid this course, I should have listened. However, if you are confident in your skills as I was and do not need \"good\" examples to learn proficiency then go for it!\n\nOverall, this course would have been great for me if the examples mapped together how I felt they should have, but they don't so I'm giving the class a 2.5ish?",
                        "rating": 2,
                        "_updatedAt": "2022-10-20T18:56:00Z",
                        "id": "5SvPj0Oe4QEjBs6G7Q18Od",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "_id": "5SvPj0Oe4QEjBs6G7Q18Od",
                        "workload": 25,
                        "_rev": "5SvPj0Oe4QEjBs6G7Q18Nk",
                        "difficulty": 5,
                        "authorId": "kMYgqqacF6Lt7DFp2C/soQ==",
                        "course": null
                    },
                    {
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "_createdAt": "2022-10-20T12:05:09Z",
                        "rating": 1,
                        "workload": 25,
                        "created": "2022-10-20T12:05:09Z",
                        "course": null,
                        "_id": "aiCubRh65qcuoCPG96JA5L",
                        "authorId": "VUwWMMGOCRn+nhDrdGaRU7C/wUVdHxk7u20NtQVb+BI=",
                        "difficulty": 5,
                        "_updatedAt": "2022-10-20T12:05:09Z",
                        "_rev": "aiCubRh65qcuoCPG96JA3w",
                        "id": "aiCubRh65qcuoCPG96JA5L",
                        "body": "Course: This review is for the course ISYE 6240 Bayesian Statistics. \n\nOutcome: I withdrew from this course before the withdrawal deadline.\n\nCourse review (TL;DR): Pass on this course if possible. Seriously. Hard and dense material. Need lots of knowledge of calculus. Frustrating homework (no typewritten notes). Great TAs but not enough to overcome course deficiencies. \n\nCourse review:  This was a very challenging course. Immensely challenging, in fact. There are a few reasons, but the main two relate to how the material is taught and more importantly the submission of the assignments. \n\nThe videos are delivered in a video format by a Professor that I don't believe I've ever seen in any of the course discussions, and he's not even the main professor... lol. The main one has been completely MIA and from what I can tell it's the TAs who are teaching this course. Either way, the videos do a poor job explaining the concepts. Expect to view them many times to understand what's happening. \n\nPlus, WinBugs is used, which seems very very outdated tbh. Python / R / MatLab can be used, but teaching the material with WinBugs seems like a bad move imo.\n\nThe TAs are great and responsive, but when most of the class are asking questions about the material - the basics too mind you, not the advance stuff that no one seemingly knew - then you know the class as a whole is faulty.\n\nThe submission of the assignments was another matter. By this I mean submitting the homework was an absolute nightmare. You have to type up any and all math formulas. You cannot submit handwritten notes. So, when You're deriving and solving prior and posterior probabilities and integrating all sorts of products and sums and thetas and what have you... you have to type it all up. Total chaos.\n\nFinally, it was supremely difficult to find a tutor for this course. I tried to self learn as much as possible, but there came a point where I decided it was better to suck it up and withdraw then keep fighting a losing battle.\n\nTo sum, don't take this course if possible. "
                    },
                    {
                        "id": "pCDVxAhBcwX2HEe0nK5Ti5",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester"
                        },
                        "_rev": "pCDVxAhBcwX2HEe0nK5Tek",
                        "course": null,
                        "workload": 12,
                        "_updatedAt": "2022-09-25T19:57:02Z",
                        "_createdAt": "2022-09-25T19:57:02Z",
                        "rating": 1,
                        "body": "I registered for this class because I enjoyed my undergraduate math and stats courses, and I wanted a better foundation in stats for the ML specialization.\n\nI ended up withdrawing from this course.  Someone said on another comment that you only get 10 classes, and that you shouldn't waste one on this course.  Unfortunately, I feel that this still holds still true.\n\nLectures were not really that helpful, no worked examples or context, just theory.  I don't really want my hand held but I also feel like if I am paying for instruction, the instruction should help me at least understand the gist of the material.  My entire understanding should not have to come from supplemental material. That's not what I am paying for.  I could just read a book on stats and watch some Youtube videos if that is what I wanted.\n\nAlso, its been about 2 weeks since we submitted homework 1, and its still ungraded.\n",
                        "created": "2022-09-25T19:57:02Z",
                        "difficulty": 4,
                        "authorId": "yGi9KeK0MJukR5PZKwMN0A==",
                        "_type": "review",
                        "_id": "pCDVxAhBcwX2HEe0nK5Ti5"
                    },
                    {
                        "id": "external-import-84858ac5-4ed9-4d20-9e06-1e0f19ba39ab",
                        "rating": 4,
                        "workload": 10,
                        "_id": "external-import-84858ac5-4ed9-4d20-9e06-1e0f19ba39ab",
                        "body": "Bottom Line: Good course for those interested in the mathematical concepts behind Bayesian Statistics.\n\nPros:\n-VERY good TAs\n-Interesting projects\n-Learn (some of) the math behind Markov Chain Monte Carlo\n-Instruction videos were well-edited and explained most of the concepts well\n\nCons:\n-Some of the concepts weren't fully explained. You'll be given the formula for some things as-is without context or explanation. I suppose this is warranted given that this is an introductory course.\n-Exams are huge part of the grade: 25% for the midterm and 35% for the final. This is great if you do well on the exams. Not so great otherwise\n-I feel like the Gibbs Sampling algorithm wasn't fully explained. This is the algorithm WinBUGS / OpenBUGS use and I had hoped to spend more time on it.\n\nAdvice: \n-if you have a decent mathematical background with at least some experience in multivariable calculus and linear algebra, you'll do very well in this course.\n-Use OpenBUGS and not PyMC3 when doing this course. The instructor teaches using OpenBUGS so if you go the PyMC3 route, you'll have to learn that library on top of the course material. I found the documentation and learning resources behind PyMC3 very much lacking.\n\nOverall: I liked this course quite a lot and I think everyone doing AI/ML should consider taking it.\n\nBest of luck!",
                        "course": null,
                        "created": "2022-05-08T16:40:22Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 3,
                        "_createdAt": "2022-05-08T16:40:22Z",
                        "_type": "review",
                        "semester": {
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z"
                        }
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "difficulty": 3,
                        "_id": "external-import-aa8ba49f-ab0c-436d-a628-03c5870e6db5",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "workload": 12,
                        "body": "1. Most students need to watch lecture videos at least twice in order to understand all the concepts.\n2. Assignments are all very educational. They were printed out with hints before you even go to office hours. \n3. TAs are extremely helpful and knowledgeable.\n4. Exams are scary. Final exam is 35% of total grade. Midterm is 25%. You can imagine if you make some big mistakes on exams, there is no way for you to get an A. You need to be very very careful when taking midterm and final.\n5. You can build a good knowledge foundation for the ML track by this course.",
                        "id": "external-import-aa8ba49f-ab0c-436d-a628-03c5870e6db5",
                        "created": "2022-05-08T16:23:22Z",
                        "_createdAt": "2022-05-08T16:23:22Z"
                    },
                    {
                        "_createdAt": "2022-05-02T16:13:48Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-7c8d7a10-5912-412b-8ba0-3e3c4d545fe2",
                        "created": "2022-05-02T16:13:48Z",
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "course": null,
                        "workload": 10,
                        "body": "Overall good course with interesting content. The first half more about mathematical foundation of bayesian formula and also quick intro to different sampling algorithm. Second half doing actual bayesian statistics. This semester the TAs kindly provide several python notebooks illustrating how to implement those regressions with PyMC and those materials were extremely helpful. The drawbacks is that PyMC (unfortunately this is out of our control) doesn't seem to be a very matured/well-written package and it reports error messages very hard to understand/debug sometimes. ",
                        "_type": "review",
                        "rating": 4,
                        "_id": "external-import-7c8d7a10-5912-412b-8ba0-3e3c4d545fe2",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-12-21T18:55:35Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_type": "review",
                        "_id": "external-import-94d8bb3b-27cb-498e-b2ec-6e4698e055af",
                        "body": "The first half of the course is very math-heavy (as expected). For someone like me who had a BA and the last math class I took was in high school, I found it challenging but doable if you are good at self-learning. It will be time-consuming because the video lecture doesn't necessarily provide all the details and thought processes. So go on Piazza or Slack, TA and classmates are very useful and they are the main reason I succeed in this class with an A. \n\nThe second half of the course used a lot of Winbugs. Though in the lecture, the most demonstration is on Winbugs or Matlab, for assignments we have the flexibility to use Python or R. The inconvenient part is in order to understand I would need to translate the Winbugs code into python/R and mistakes can be made during that process. \n\nOverall, the content itself is useful. My work uses Bayesian so it gave a comprehensive background on the math behind and the application. The structure of this class is frustrating so it really requires you to be an active learner. ",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-94d8bb3b-27cb-498e-b2ec-6e4698e055af",
                        "_createdAt": "2021-12-21T18:55:35Z",
                        "rating": 4,
                        "course": null,
                        "workload": 15
                    },
                    {
                        "id": "external-import-6f193d67-9370-4df1-b125-391736080388",
                        "created": "2021-12-19T20:22:02Z",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_createdAt": "2021-12-19T20:22:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 1,
                        "_id": "external-import-6f193d67-9370-4df1-b125-391736080388",
                        "body": "By far the worst course I've experienced ever in my life.\n\nIt seems like people who \"like\" this course usually point to the grading being \"fair\" or \"lenient\". Just because you get graded easily doesn't mean the course is good or you should give it a free pass for being completely horrible.\n\nJust because you got an A in a course doesn't make you an instant expert on the subject matter or how it is taught.",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_type": "review",
                        "course": null
                    },
                    {
                        "course": null,
                        "_id": "external-import-7fca8860-c1ca-4756-9eb9-5070156079a9",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "workload": 10,
                        "body": "I don't really understand why this course has a subpar reputation. The course videos can be slightly dense at times, but overall they give you a good overview of the material and reasonably prepare you for the tests. \n\nThe pacing of the class was just right, the TAs were very helpful, tests were fair, and grading was fairly lenient. I also liked that the tests were take home, which gives you time to thoughtfully formulate responses and test code without being under such intense time pressure.\n\nWinBUGS isn't the most leading edge software platform, but it's straightforward to learn and not even required for the class (you can use R, Python, or Matlab instead).\n\nOverall, I thought this was a high quality course and would recommend, especially for anyone who has a strong theoretical and/or applied statistics background.",
                        "_createdAt": "2021-12-19T06:17:48Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "id": "external-import-7fca8860-c1ca-4756-9eb9-5070156079a9",
                        "created": "2021-12-19T06:17:48Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3
                    },
                    {
                        "_type": "review",
                        "rating": 2,
                        "workload": 20,
                        "body": "If you have a stats background, I could see this class being marked easy or medium. The lectures are terrible and I really did not learn much. I think you are better off watching a couple stats youtube videos on the subject. The TA Greg was the sole redeeming part of this class and even he knew the class content was terrible. ",
                        "_createdAt": "2021-12-18T13:22:28Z",
                        "course": null,
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "id": "external-import-9261dcea-3388-4e2e-a5ff-b37219f3bcfb",
                        "created": "2021-12-18T13:22:28Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-9261dcea-3388-4e2e-a5ff-b37219f3bcfb",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "body": "The worst course I've taken in my entire life.\n\nDo yourself a favor and buy a textbook or watch videos on YouTube. You can thank me later.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-12-14T01:12:58Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "difficulty": 2,
                        "_createdAt": "2021-12-14T01:12:58Z",
                        "_id": "external-import-caa9d3f8-a8b8-4a76-bc2a-3ec42a693944",
                        "id": "external-import-caa9d3f8-a8b8-4a76-bc2a-3ec42a693944"
                    },
                    {
                        "course": null,
                        "workload": 40,
                        "rating": 5,
                        "id": "external-import-3eeebe5a-7dcd-4837-b3f5-726f8118bc0d",
                        "created": "2021-11-25T20:23:30Z",
                        "_id": "external-import-3eeebe5a-7dcd-4837-b3f5-726f8118bc0d",
                        "body": "Highly recommend if you want to learn about theory in bayesian statistics. This doesn't get extended well to the machine learning concepts as well as other courses, but good to have an introductory understanding of prior and posterior distributions.",
                        "_createdAt": "2021-11-25T20:23:30Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 5
                    },
                    {
                        "workload": 18,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "_id": "external-import-2eddc85e-fddc-4cfc-bacc-391956be14b2",
                        "difficulty": 4,
                        "rating": 4,
                        "body": "### Cons\n- Lectures don't explain the materials very well. It's not just algebra, concepts will be used that were not previously introduced. Brani's Biostatistics book is more helpful. TAs and other students will also link to alternative/supplemental material which you'll definitely want to check out.\n- Course is based around antiquated WinBUGS. Old software can be fine, but it's very difficult to automate and tedious to test small tweaks as there are many manual steps involved. You don't *have* to use WinBUGS/OpenBUGS, but you will spend lots of extra time learning Stan, Pymc3, or some other Bayesian package that doesn't well support features WinBUGS has out of the box (especially censoring and missing values).\n- Assumes comfort with matrix calculus, so might want to brush up on this.\n\n### Pros\n- Every assignment/exam is take-home.\n- Helpful TAs.\n- Large quantity of helpful supplemental materials. I highly recommend going through these especially in the early part of the course.\n- You learn a lot about Bayesian statistics and probability distributions in general.",
                        "created": "2021-11-15T04:56:50Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "_createdAt": "2021-11-15T04:56:50Z",
                        "id": "external-import-2eddc85e-fddc-4cfc-bacc-391956be14b2",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "difficulty": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-11-01T04:09:39Z",
                        "_createdAt": "2021-11-01T04:09:39Z",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-e26efda3-7919-42ac-84df-629b35137dd6",
                        "rating": 2,
                        "id": "external-import-e26efda3-7919-42ac-84df-629b35137dd6",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 10,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "body": "The course overall is poor. The lectures are riddled with errors, and office hours are mandatory for homework success. The slides are a vomit of equations and notations that the professor casually talks through. Instruction is a wave of the hand. \n\nMy biggest grievance, however, is the grading. The homeworks are composed of multi-step problems, and if you get a probability/distribution calculation wrong in part a, well there go a large portion of points for parts b-f, which use that probability/distribution. The head TA seemed to address this problem after the first homework with more specific rubrics, but alas the midterm grading followed the same approach, and the average was a C...a bit low for a class without a curve. The rubrics are answer-driven and do not care if you actually demonstrate understanding of the algorithms/equations. Another incident that happened this semester was a lot of students got a 0 on homework 1 (but later 75% credit I think) because a change to the syllabus policy occurred in a long course-introductory Piazza post that said homeworks must be \"typed\". One would think such a draconian policy would at least be bolded in the wall of text.\n\nThis class is important to learn for a ML specialization, which is my main suggestion for taking it, but it desperately needs a massive redesign in grading and lectures. If the rubrics are results-driven, give the students the expected results, and grade them on their methods in deriving that answer. If you're looking for one ISYE course in the OMSCS program, would highly recommend HDDA over this one. Concepts there are a bit more advanced but the actual learning and experience is better.\n\nInteresting enough, students were posting alternative materials in the Piazza forum, which the head TA even endorsed. The concepts in the class aren't difficult, but do require a background in mathematical probability and statistics (calculus-based). Apparently the course becomes dramatically easier after the midterm. This is true concept wise, but the time commitment is about equivalent.\n\nBecause of the exorbitant effort you will make self-learning the material, I highly suggest not pairing this course just because it has a lower difficulty score. I made that error, pairing it with ML, and sold my soul for the semester."
                    },
                    {
                        "_id": "external-import-4cb0d526-f2ef-4451-b034-9c8944340e27",
                        "id": "external-import-4cb0d526-f2ef-4451-b034-9c8944340e27",
                        "created": "2021-10-31T10:16:45Z",
                        "course": null,
                        "body": "The theory behind the content of the course is not difficult.\nThe difficulty is because you spend most of your time trying to figure out if something in the slides or videos that you don't understand is actually a typo or something you actually don't understand, instead of spending time learning the actual material and practicing questions. There are numerous errors in the lecture materials and slides, even places where the lecture changes notation in the middle of the video without warning. It is fine and normal for a lecture video and slides to have errors. What is not fine is that they wait for students to ask if there is an error before giving a correction, and they don't give the exact timestamp or page on the slides. In every other course I've done in the program, errors are pointed out in advance so that students can focus on understanding the material. These lecture videos and slides are not new so it's not like this is the first time that they've been pointed out... read previous reviews on here. My best advice if you do take the course is to try to be a little bit behind on watching videos and reading slides so that you can go on piazza and read errors before you start so that you won't constantly be questioning if that point is something you just don't understand or if it's an actual error...in my experience it's more likely to be an error...but then again who are the unfortunate students that have to read the lecture materials and watch videos first?\nWith respect to the office hours, I've never attended the ones hosted by the professor as I work full time during the time they happen and there are no recordings posted of those.\nThe TA office hours are helpful for homework and the head TA usually posts a summary page of what was discussed, along with the main points so that is very helpful.\nThe TAs are very helpful and the grading is very fair, they seem to be trying to compensate for the quality of the lecture materials. I don't think they should have to do this, but I am really glad they do.\nIn terms of the book for the course, the lecture videos do follow the book, and the book is provided for free. Just don't look to the book for lots of extra examples or a deep theoretical understanding. There are other books out there that give you that though. The material itself is not difficult. \nI hope the lecture materials are redone soon, or at least errata is published at the start of the semester.",
                        "rating": 1,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 5,
                        "_createdAt": "2021-10-31T10:16:45Z",
                        "workload": 15
                    },
                    {
                        "rating": 1,
                        "created": "2021-10-30T21:29:29Z",
                        "workload": 8,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "_id": "external-import-0524537a-51ba-4a07-b30b-d21fcab6bb9b",
                        "body": "Do. Not. Take. This. Class.\n\nThe semester isn't over yet, but I'm posting this now in the hopes that it helps people considering this class for the spring. There is a reason it is consistently one of the worst reviewed courses in the program. I thought, eh, it can't be that bad, right? Wrong. Don't take it thinking it'll be a good course because they got a better head TA.\n\nThis is my 9th course in OMSA and, imo, easily the worst I've taken. The instruction is terrible, and it's not just me saying that. The head TA tells students the lectures are essentially worthless and that you should just read the course book or seek out alternative instruction.\n\nThe head TA tries hard, and deserves credit for that, but his OHs mostly focus on getting people across the finish line on HWs. They aren't really about learning/teaching the material.\n\nThe professor holds a weekly office hour, but does so during normal working hours and does not post a recording (this is an online program... wtf?). As someone working full-time who can't attend his office hours, he might as well not be involved in the course. He has no presence on Piazza and the (awful) lecture videos are recordings done by a prior professor. Apparently he also has limited experience with the programming tool used in the class and any questions about it are to be handled by the TAs. Why is he even teaching the class?\n\nAchieving a good grade in this course (or at least the first half) is driven not by understanding Bayesian theory, but by algebraically manipulating PDF's, doing some hand waving, and recognizing a known probability distribution. Understanding theory either gets you started or comes in at the end, but it is not the focus of the questions or grading. If you read other reviews, the Piazza, or the Slack channel, you'll see I'm not alone in this assessment.\n\nThis isn't sour grapes over grades - I currently have an A. It's just very annoying to experience such a disconnect between the material and the evaluation through HWs/Midterm.\n\nIf you're looking to learn Bayesian statistics, just read one of the books out there on the subject or watch some lectures on YouTube. Taking this class is a waste of your tuition money and your time. If I were GaTech, I'd be embarrassed to be offering this course.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-0524537a-51ba-4a07-b30b-d21fcab6bb9b",
                        "_createdAt": "2021-10-30T21:29:29Z",
                        "_type": "review",
                        "course": null,
                        "difficulty": 3
                    },
                    {
                        "difficulty": 4,
                        "rating": 1,
                        "workload": 15,
                        "_id": "external-import-5c88b27f-24c2-4bd6-87ed-d3655b21bc48",
                        "id": "external-import-5c88b27f-24c2-4bd6-87ed-d3655b21bc48",
                        "created": "2021-06-18T21:22:25Z",
                        "body": "This class was awful. OpenBUGS is an awful, antiquated software application that they have you use (you can use another programming language, but all the examples are in OpenBUGS).\n\nOverall, I'm really sad that this class was my last class in OMSA. It was truly miserable and the entire time I was just hoping that it would be over already.\n\nOn the plus side, the TA was awesome. He was the only redeeming this about the class.\n",
                        "_createdAt": "2021-06-18T21:22:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-05-16T15:59:06Z",
                        "difficulty": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "rating": 1,
                        "body": "The saving grace for this class was the TAs who spent a generous amount of time and effort trying to compensate for the poor learning material. Of course no one wants to be spoon fed, but the lectures are very pointless because it's hard to follow and very little explanation of concepts. Most of my learning was done during office hours. Midterm was difficult in the sense that topics not previously covered was introduced. You truly had to have an understanding of the topic to get an A on the midterm but since the lecture material wasn't reliable, there was no confidence that the material was fully understood.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "id": "external-import-b04b779c-e746-4e3f-b449-018f9cb83863",
                        "_createdAt": "2021-05-16T15:59:06Z",
                        "_type": "review",
                        "workload": 16,
                        "_id": "external-import-b04b779c-e746-4e3f-b449-018f9cb83863"
                    },
                    {
                        "body": "So... a lot of people say that the material can not be understood, but I still managed to get an A and only used those videos. I did have a background that helped with understanding the videos and I agree that they can be improved and material should be added, but I did not find it as bad as many people state.\n\nDifficulty is medium (from my point of view), since the first half of the course is rather hard, but the second half is quite easy.\n\nThe T.As are really great (Specially Greg) and it seems like the course will have some new material from next semester on (R examples as it was written on slack)\n\n\nDo be carefull if you believe that this is an easy A. The first half of this course is quite hard, especially the midterm exam.\n\n\nI did not like the course since bayesian stats are really not for me, but you will be able to undestand this topic and perform your own bayesian analysis, which is nice :)",
                        "difficulty": 3,
                        "id": "external-import-ca7b15b8-955c-463d-b58a-44cac5f6a54b",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 2,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "_id": "external-import-ca7b15b8-955c-463d-b58a-44cac5f6a54b",
                        "created": "2021-05-12T01:33:04Z",
                        "course": null,
                        "workload": 16,
                        "_createdAt": "2021-05-12T01:33:04Z"
                    },
                    {
                        "rating": 2,
                        "_id": "external-import-5d10cbe4-20b3-4ea1-bbc2-8a7ba1f9f681",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_createdAt": "2021-05-11T16:40:45Z",
                        "body": "This is my 9th course of OMSA I have taken and the first review I have made on OMSCentral. My thoughts may echo others but felt the need to express how frustrating this course was, outside of the CIOS survey. \n\nThe lectures were difficult to follow and the examples provided were minimal support to completing several of the problems early on. It's amazing how much of a difference the course ranges in difficulty from the beginning to end. Material leading up to the midterm had few examples to practice from, which made the \"theory\" portion of the course difficult to grasp, unless you went outside of the provided course material to get a better understanding on your own. Then the second portion of the course using programs such as Win/OpenBUGS, the examples are almost as simple as using copy/paste and adjusting some of the measurements to complete the homework assignments. But again, the lecture videos make a lot of assumptions about users knowing how to properly execute their simulations.\n\nShoutout to the TA's, Yuwei and Greg were huge helps during the office hours to give further examples and clarification on assignments. The TA's were the light of hope in getting through this semester and making enhancements to future semesters. \n\nIn all, I missed one problem on the midterm, tried to explain my logic that I had run out of time to try and further troubleshoot and received 0 credit for it, with no further explanation than 0/25. I made A's on all the homework assignments, the subjective \"open ended\" project and 100 on the final, resulting with a course letter grade of a \"B\". That's the frustration. Make A's on every assignment but if you screw up one problem on your midterm, you will quite possibly earn a B letter grade for the course.\n",
                        "id": "external-import-5d10cbe4-20b3-4ea1-bbc2-8a7ba1f9f681",
                        "created": "2021-05-11T16:40:45Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "workload": 16
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-eb750ebb-fc3d-453b-b846-5ad2aadded9c",
                        "_createdAt": "2021-05-11T15:22:38Z",
                        "difficulty": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-eb750ebb-fc3d-453b-b846-5ad2aadded9c",
                        "course": null,
                        "body": "This semester has been exceptionally better than the other semesters in Bayesian Statistics because of the visiting TAs in Greg Schreiter and Yuwei Zhou. It made this bad and hard course look much easy and doable. \n\n## My wish was to ask Prof Roshan not bow into public pressure after the midterms and make the finals a tad bit more challenging. \n\nI know he's got the pressure with the management from giving too much A's so he made the midterms overly hard. But the finals was, by many accounts, too easy that the mean was 95%. Prof Roshan could always use the curve should the finals are hard (say above median is an A, for instance).",
                        "created": "2021-05-11T15:22:38Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 3,
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "id": "external-import-774685eb-4887-47c8-b62b-38a263d69000",
                        "created": "2021-05-10T20:38:32Z",
                        "difficulty": 4,
                        "_createdAt": "2021-05-10T20:38:32Z",
                        "workload": 12,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "body": "After 9 classes at OMSCS, this is my first review and I wanted to specifically thank Greg for an outstanding job as a TA. The course became harder than previous semesters without any meaningful change to the material. Nonetheless, Greg went out of his way to provide help, create homework guides, and office hour examples to help students with the material. He was incredibly responsive on slack and piazza even on the weekends and genuinely cared to help students with the material. Thanks Greg!\n\nIn terms of this course, the first half of the course is rough and very theoretical heavy. As an OMSCS student, I had a hard time with the math and theory behind the material. Brani's lecture videos did not help me at all and I had to learn everything through google. The first 4 homeworks are theory based and the last 2 are computation based (use OpenBugs, it's just easier for this class).The midterm was very challenging and there is an expectation to know statistical concepts outside of what is directly taught in class. After the midterm, it gets much easier. The grading is lenient is overall lenient as well. I legitimately thought I failed the midterm and I got a 90/100.\n\nRecommend taking this course if you want a less time intensive class for the Machine Learning specialization. I personally learned a lot but was definitely frustrated with the material provided by the course.\n\nOnce again, huge shout out to Greg!",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-774685eb-4887-47c8-b62b-38a263d69000",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        }
                    },
                    {
                        "course": null,
                        "_createdAt": "2021-05-07T19:31:47Z",
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 25,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "_id": "external-import-d305e545-a498-4087-adeb-ade02da0a8cc",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "id": "external-import-d305e545-a498-4087-adeb-ade02da0a8cc",
                        "created": "2021-05-07T19:31:47Z",
                        "body": "The first half is very hard, especially the midterm. It lightened up from there. I liked the concepts and their usefulness, but this is the hardest math class I've ever had. You will only survive by finding examples (especially in code).",
                        "rating": 3
                    },
                    {
                        "course": null,
                        "workload": 20,
                        "body": "The class was not that easy as many people indicated here from previous semesters. I would have trouble working out the homework problems on my own without Greg's help.  The midterm was pretty hard, maybe just for this semester. I spent over 20 hours working on the 1st part of Q3, one of the most memorable tests I have ever experienced.\n\nThe hardest part of this course was with the lecture slides. It took lots of effort to have a real understanding or to build the intuitions. For this class, I actually wished Brani could spend more time deliberating on some subjects. Overall, it feels like something was missing. The materials were there, practical and useful, but I was stuck at the stage of primitive imitation. More busy work than meaningful thinking.\n\nTAs were nice. The grading was generous. A final grade of A should be expected.\n\n",
                        "_id": "external-import-bc6902cf-6f75-4121-b6b7-4327373ea9ec",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-bc6902cf-6f75-4121-b6b7-4327373ea9ec",
                        "_type": "review",
                        "rating": 3,
                        "difficulty": 4,
                        "_createdAt": "2021-04-06T02:49:07Z",
                        "created": "2021-04-06T02:49:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        }
                    },
                    {
                        "workload": 15,
                        "rating": 3,
                        "course": null,
                        "body": "Starting Spring 2021, instructors have mentioned that the class will be a bit harder than previous semesters. If you're looking for an easy A, this may no longer be the class.\n\nA lot of the complaints about this class are overblown. I'm an OMSCS student, and to get into the program I recently took Linear Algebra and Calc-based Probability Theory. If you remember calc along with having experience in these two topics, the course will teach you a lot of things to help with modeling data in a Bayesian way. If it's been a while since you touched these topics, you'll want to review (or take the excellent Simulation class).\n\nIn Bayes, the lectures are really like most math classes. The videos cover a lot of math notation and then jump into arbitrary examples aimed at building intuition. Like a lot of math though, how many of these examples are constructed is opaque. This means that the lectures won't seem very helpful as prep for the homework. However, I found that if I do the homework and follow the lectures closely together, some of the homework problems really challenge you to think about the Bayesian approach and the examples in the lectures start to make a lot of sense. \n\nFor example, we had a homework problem early on asking us about the invariance principle with Bayesian estimators. Later homework will indirectly touch on this topic when you have to choose priors and understand how that impacts your model. When you go back to the lectures where Brani talks about this principle, you realize that the lecture is hinting at something important as well. By slowing down to engage with the questions in the earlier homework and revisiting lectures, you'll have a much better time on later assignments and the midterms.\n\nThe last half of the class is much lighter than the first. Most of it is computational, and if you have some prior exposure to regression, you should do well by copying the BUGS code. In terms of time budgeting, I'd say that 70% of the work is in the first half of the semester.\n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-6490af87-c2a1-48b7-bfbd-ca6598e2daa1",
                        "difficulty": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_id": "external-import-6490af87-c2a1-48b7-bfbd-ca6598e2daa1",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "created": "2021-04-05T19:08:42Z",
                        "_createdAt": "2021-04-05T19:08:42Z"
                    },
                    {
                        "rating": 2,
                        "_id": "external-import-ccd673ec-3068-41f2-b165-6e641f85c173",
                        "body": "This course is harder than what you would normally expect due to the fact that the classes are not quite good (probably not even average)...\n\nI decided to write this just to state that the course has changed and it has gotten quite difficult, but the material (our videos) stay the same, so you won't actually learn in here how to solve the problems from the exams. (luckily they're open book)\n\nUnfortunately, the class also \"tries to teach\" an ancient software called WinBUGs and therefore you probably will require to budget some extra time to actually learn how to apply the concepts using Python or R.\n\nEdit: I also wanted to thank Greg Schreiter for his amazing job as a TA",
                        "difficulty": 5,
                        "workload": 16,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "_createdAt": "2021-03-30T02:09:57Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "id": "external-import-ccd673ec-3068-41f2-b165-6e641f85c173",
                        "created": "2021-03-30T02:09:57Z"
                    },
                    {
                        "id": "external-import-f7b025d7-fd41-42ef-a75c-9faa130c7a8f",
                        "created": "2021-03-28T21:09:01Z",
                        "_id": "external-import-f7b025d7-fd41-42ef-a75c-9faa130c7a8f",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 8,
                        "body": "I'm taking the course now, and thought it would be worth putting up a review before registration for people considering it for the Fall semester. This is definitely the most frustrating course I've taken in the OMSA program (9 classes in after this semester) - it isn't the hardest in terms of content, but the course structure/videos/requirements have made for a frustrating semester so far. **Disclaimer: none of these criticisms reflect on the herculean efforts of Greg Schreiter, who should be inducted into the OMSA TA hall of fame.** My main points of frustration:\n1. After the first week or two, the lectures became increasingly hard to get anything out of, and didn't really contribute to the understanding required to do the assignments. I would be prepared to go searching elsewhere to learn the material for pretty much the whole class.\n2. Software requirements: it's well documented that they use an outdated/seldom used software in WinBugs, so that wasn't a surprise. But many of the workarounds that used to allow the software on Macs don't seem to work anymore, so if you use a Mac (and want to use the documentation/examples the class provides), you have to slog through some pretty clunky workarounds to run the code. This heavily contributed to the feeling that I spent more time debugging code in an irrelevant software than actually learning Bayesian Statistics.\n3. Exams - can't speak at all to the final but I felt that, despite my frustrations, I still had a solid grasp on the core concepts of the course going into the midterm (thanks to TA Greg). The midterm left me feeling more clueless than any other exam/assignment I've taken in the program. They did grade it quite generously which was great, but the exam was confusingly hard given the difficulty level of assignments to that point. \n\nI think if you want to learn about Bayesian Statistics - do it on your own time through other resources online. You'll have to do that to a large degree in this course anyway, but with way more time wasted trying to tie it back to the assignments and weird WinBugs applications. I think I learned more useful Bayesian applications through one unit in CS 6601 than I will in this entire class, and in my opinion the course wasn't worth the frustration as I'm not sure I'll really take away anything useful from it.",
                        "difficulty": 4,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_createdAt": "2021-03-28T21:09:01Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1
                    },
                    {
                        "created": "2021-03-15T05:16:18Z",
                        "_id": "external-import-7d6f8032-fe88-47d7-922f-dcb5e0334b3d",
                        "difficulty": 5,
                        "_createdAt": "2021-03-15T05:16:18Z",
                        "_type": "review",
                        "id": "external-import-7d6f8032-fe88-47d7-922f-dcb5e0334b3d",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 1,
                        "body": "Lectures are mostly going thru the slides and very difficult to follow the steps. Legacy software like winbugs does no good to the course. I am not sure how much is useful these are for real data analytics. \nThis has been my toughest class to understand in the 6 classes that I have taken so far. ",
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "workload": 15
                    },
                    {
                        "id": "external-import-879a0332-01c1-4dbb-8449-69a7b26e2b6b",
                        "rating": 4,
                        "body": "I was skeptical at the beginning due to the past reviews I had seen on this website. However, it was better than I expected.\n\nThis course underwent some changes in Fall 2020 semester which makes some past reviews obsolete:\n- WinBugs was made optional and quite a few students did assignments in PyMC3, R, RJAGS etc. (however, students need to do some self study here since lectures are still in WinBugs).\n- Grading time of the assignments was drastically improved (~1 week for all assignments/exams)\n- There were 2 office hours per week and TA responsiveness on Piazza was good.\n\nNow, let me comment on some of the key points in past reviews:\n\n- Use of obsolete software (winbugs) - IMO this is just a tool used for the subject which makes the life easier by providing some ready-made functions. This isn't the main point of the class, this class is a math class and winbugs is just another tool used for it. I don't see a big advantage of using something like PyMC3 - in fact this would make things tedious by requiring you to implement everything from scratch (we did implement MCMC methods etc from scratch at the beginning, but later directly used Winbugs to solve problems). So focus on the math/theory, not the tool used to implement it.\n\n- Missing/skipped steps in lectures - most of these skipped steps in lectures are just algebraic manipulations (or some high-school level calculus). This is a graduate level math class and one needs to be comfortable with at least high school math to take this class. Having said that, I do agree that lectures can be improved to provide more clarity.\n\nMy advise to anyone interested in this subject is, don't worry too much about the scathing reviews in this site - just go ahead and do it you'll likely find it interesting. Overall, I found the subject matter interesting and it was worth my time.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2020-12-30T00:50:26Z",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2020-12-30T00:50:26Z",
                        "workload": 11,
                        "_id": "external-import-879a0332-01c1-4dbb-8449-69a7b26e2b6b",
                        "difficulty": 4
                    },
                    {
                        "created": "2020-12-15T00:14:07Z",
                        "rating": 1,
                        "_type": "review",
                        "workload": 12,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "_id": "external-import-b78f1b34-6ab9-41de-b677-df7748421312",
                        "id": "external-import-b78f1b34-6ab9-41de-b677-df7748421312",
                        "_createdAt": "2020-12-15T00:14:07Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "Don't expect to learn Bayesian Statistics in this class. This class does a terrible job at explaining concepts or really doing any teaching at all. The majority of my learning to get through this class was referencing Piazza posts and CTRL F on the pdf of the lectures for key terms.\n\nThis class consists of 6 HWs (lowest one is dropped) and 2 take home exams for the midterm and final, which are really just slightly longer versions of the homework, and an open ended project. If you do the HWs, you will have no issue doing the exams.\n\nThe 1st half of the HW is very challenging, especially if you do not have a solid statistics, probability, and calculus background. The first 4 HWs will involve some variation of manually (by hand) doing derivatives, integrals, light \"proofs\" (e.g. Show that XYZ also results in ZXY). It was a struggle for me and I really had to rely on the Piazza posts and TA's for guidance. Fortunately the TA's (Yuwei) is pretty responsive and does directionally point you the right way. The 2nd half of the class is significantly easier as everything is done in WINBUGS/OPENBUGS and you can basically just copy and paste the sample code with some modifications. Some people overcomplicated things and made their lives unnecessarily more difficult by electing to replicate the code in Python or R or something else. That's your choice if you want to do that, I suppose, but the WINBUGS/OPENBUGS portion is the easiest assignments in this class. The midterm will be very mathy whereas the final is very heavy on BUGS coding (and it's all open book/notes and you have a week to do it).\n\nI stopped watching lecture by the 5th lesson because there's just no point. I have no idea WTF the Brani videos are saying and I just go straight to the HW. If I need to look up a term, I'll just CTRL F the pdf to look for the terminology and if I don't know much about it, I'll google or youtube it. The reason the lectures are so bad in this class is because Brani just reads formulas off the slide. There's no actual explanation of anything. It's like \"This is the formula. It is E divided by C and you get M.\"\n\n...Okay? How do you get E? How does that relate to C or M? What's it for exactly and how is it used? BAYES THINGS.\n\nOh and another interesting thing about this class is there is no schedule of what you're suppose to watch or do. Thankfully someone posted a schedule in Slack and that's a good rubric to follow along with, but I thought it was a bit odd to not have some sort of calendar of what we're suppose to be covering each week.\n\nOddly enough, there are quite a few \"loyalists\" in this class that will defend it to death. They will argue that you are the idiot and that graduate school is all about doing things yourself and you should just quit complaining. I mean, I get that's true to an extent and OMSA as a whole, but this class certainly takes it another level because usually I walk out of a class having learning something. I learned nothing in Bayes and couldn't give you a EL15 explanation of WTF Bayesian Stats is, and I got an A?!\n\nThe bright side, however, is that the grading is extremely lenient in this class. Just put something down on your HWs and you'll likely get some credit. Even if you get the wrong answer, as long as you were kinda, somewhat directionally there, you'll get at least a B. That being said, if you are academically interested in learning and not just wanting the grade, pick another elective."
                    },
                    {
                        "_type": "review",
                        "difficulty": 3,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "id": "external-import-516ddde2-e621-486c-a8d8-022cfa5c3bf1",
                        "created": "2020-12-14T04:17:24Z",
                        "_createdAt": "2020-12-14T04:17:24Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_id": "external-import-516ddde2-e621-486c-a8d8-022cfa5c3bf1",
                        "body": "If you actually want to learn about Bayesian statistics, don't waste your time and do this course - there are tons of better resources online. Lectures are terrible, concepts are poorly explained, professor is basically reading out the slides and never explains the background. If I didn't take the Simulation course before this one, I wouldn't be able to follow at all. The course revolves around WinBUGS software which is very outdated. I just received my final grade and it close to 100% - despite that, I think I learned close to nothing in this course.",
                        "rating": 2,
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_type": "review",
                        "workload": 12,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 1,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "id": "external-import-a0d95f14-cd89-4aee-b60b-472a5e91abe3",
                        "created": "2020-12-12T22:13:24Z",
                        "_id": "external-import-a0d95f14-cd89-4aee-b60b-472a5e91abe3",
                        "difficulty": 3,
                        "_createdAt": "2020-12-12T22:13:24Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "This is the worst course I've taken in this program so far. \n\nAnd in case you're wondering whether I'm venting, I'm on track for a very easy A"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-12-11T07:17:26Z",
                        "workload": 5,
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "body": "This is my 8th course in OMSA and surely the worst! I have an M.Sc. in probabilistic engineering and have published many papers in simulation and applied statistics, and also have taken the regression and simulation OMSA courses, so I was definitely not underprepared for this course. Still, I couldn't understand any concept from the lectures. Even when I use external resources to understand a specific concept and then come back to the lecture that discusses the same concept, I still cannot understand anything from what the professor discusses! I believe that even if the reverend sir Bayes himself watches the lectures he will not understand anything! \nThe TAs (and not the instructor since he never participated) seem to know this, so they spoon feed everything so that the poor understanding of the students will not be reflected in the grades. \nI will probably get an A in this course, but this class was a disappointment and will not be proud to have it shown in my transcript! ",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "_id": "external-import-9c6ed558-5a9a-4074-9def-bae65edac359",
                        "id": "external-import-9c6ed558-5a9a-4074-9def-bae65edac359",
                        "created": "2020-12-11T07:17:26Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "created": "2020-12-09T04:24:53Z",
                        "_id": "external-import-285f89d1-a589-483a-a078-a649e084e106",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "id": "external-import-285f89d1-a589-483a-a078-a649e084e106",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_createdAt": "2020-12-09T04:24:53Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "workload": 10,
                        "rating": 1,
                        "course": null,
                        "body": "Do not take this course until it is completely reconstructed from the ground up. The free courses on bayesian stats on coursera from UCSC are much better. The videos will frustrate you to no end.\n\nToo much effort goes into getting through the terrible lectures. You learn very little for the effort you put in. Use a better learning resource like a textbook or the aforementioned coursera courses."
                    },
                    {
                        "id": "external-import-1f8fb852-7a7b-4612-acae-53c7e7b9b02c",
                        "course": null,
                        "workload": 10,
                        "body": "This course could be way better if it moved away from using BUGS as many have already mentioned. Take the time to learn the material using a modern Python/R package of your choice (e.g. PyMC3) as that will pay more dividends in the longterm. I did this and it took much more time to complete later homeworks and exams as a result. Early homeworks are very math-heavy while later ones involve mostly programming. Also, the lectures aren't great and the ones that detail a BUGS program are basically unwatchable. I'm expecting to get an A but I definitely put more time in to consciously avoid BUGS",
                        "difficulty": 3,
                        "_type": "review",
                        "created": "2020-12-08T20:14:52Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "_id": "external-import-1f8fb852-7a7b-4612-acae-53c7e7b9b02c",
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-12-08T20:14:52Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "_id": "external-import-de3f8150-f915-4ac3-ad88-330605228185",
                        "_createdAt": "2020-12-06T03:50:50Z",
                        "body": "Brani Vidakovic started this course years ago before moving on and bequeathing the material to Roshan Joseph.  Brani's videos were not meant to be a stand-alone course, but the material is now frozen in time and in need of an update.  Particularly, all the examples are written in BUGS, which is a clunky, outdated, non-scalable program. You are not required to use it, but you won't be able to follow along unless you do.  You'll have to work on your own and be unable to verify that you're doing things right.  The instructors should really take the time to convert the examples and exercises into PyMC3.  Your best option is to learn BUGS, knowing that it's not a portable skill.  Students commonly used Python, Matlab, Octave, and R.  The TAs did a good job at answering questions and holding office hours.  Dr. Joseph was not completely uninvolved, but was mostly quiet.  It might have been because this is one of the early courses in the curriculum, but many students asked repetitive & uninformed questions.\n\nIn reading other reviews you might come off with the impression that this is an easy class.  Nothing further from the truth.  You'll be doing a lot of math, including integrations, which many complained about having forgotten.  On the other hand, if you see the trick to each problem, you might be able to avoid the heavy math (you have to know enough math to avoid doing the math).  The easy part about the class is that the amount of material is not crazy, and many homeworks are slight revisions of past problems.  Overall, this is a great topic and useful skill, but the course materials are subpar.  You might take another course along with this one, so long as it's not too time consuming.",
                        "id": "external-import-de3f8150-f915-4ac3-ad88-330605228185",
                        "created": "2020-12-06T03:50:50Z",
                        "_type": "review",
                        "workload": 15,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "workload": 10,
                        "rating": 1,
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "_id": "external-import-cc7962e6-5c4f-4a45-8637-bee7784f4480",
                        "body": "This course could have been a good first course to take for the Machine Learning specialization. The subject is important and interesting.\n\nThe workload is manageable and that is not the issue here. To get a good grade, you basically just need to do well on homework assignments (each has 1-2 weeks to complete), two take home exams (1-2 weeks to complete), and 1 project. Everything (except for the exams) is open since the beginning of the semester so you can work ahead.\n\nHaving said that, if you want to learn anything here you need to essentially teach yourself. The Brani videos are completely worthless and they would have ruined my interest in the subject if I kept watching them. I stopped after about the 4th video and just opened the slides for concepts I needed to know for homework and exams. Then google for other places that cover those same concepts in the proper way. The instructor on record Roshan was completely absent and did not answer a single content-related question on piazza or provided any material or office hours whatsoever. Head TA Yuwei was very helpful with homework and held office hour weekly, but you cannot expect the TAs to teach you the material, that's not their responsibility. On the dated website of the course, you can always find examples or codes that are very similar to the homework or exam problems and that'd help with getting good grades on assignments. So, you could get a very good grade without understanding much.\n\nOverall, it is such a pity that a beautiful and useful subject is \"taught\" by people who could not give a **** about presenting it in an understandable and coherent way or about helping students to learn it. If not for some good TAs who genuinely care, I would've felt like GA Tech has stolen my money paying for this course.\n",
                        "_createdAt": "2020-12-06T03:02:27Z",
                        "id": "external-import-cc7962e6-5c4f-4a45-8637-bee7784f4480",
                        "created": "2020-12-06T03:02:27Z"
                    },
                    {
                        "id": "external-import-6d9e13d6-4a03-4727-84d3-eaaac603d101",
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_createdAt": "2020-11-29T06:18:50Z",
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "The course is good. \nI gain good understanding of the math behind Bayesian statistic and MCMC. OpenBUG is easy to learn and i actually able to translate what i learned in OpenBUG to Stan and subsequently Pymc3. so, i think wasn't as bad to use openbug/winbug to gain the intuition in writing the Bayesian model.  \n\nProfessor Roshan allow students to use any tool to solve the HW (R, Python, Bug , Matlab..etc). TAs are active and has been helpful in solving the HW and gain understanding on some of the topic.  \n\nImprovement area: would be good if Prof Roshan could have more interaction with the student and we could have more in-depth discussion in office hour.\n\n",
                        "created": "2020-11-29T06:18:50Z",
                        "workload": 10,
                        "_id": "external-import-6d9e13d6-4a03-4727-84d3-eaaac603d101",
                        "difficulty": 3,
                        "rating": 4,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "workload": 15,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "id": "external-import-b3a575c8-1cca-44b6-8988-fda0316b55b4",
                        "created": "2020-10-12T16:50:02Z",
                        "course": null,
                        "body": "A very useful statistic course. The professor gives a very detailed and solid explanation of mathematical concepts in the field.\nThere are 6 homework in total and the one with the lowest score can be dropped. Midterm and final are both take-home open everything. The problems are all very well-designed and can help students learn how to use the statistic tools in this course. There is a final project, requiring students to find their own dataset and do analysis.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 5,
                        "_id": "external-import-b3a575c8-1cca-44b6-8988-fda0316b55b4",
                        "_type": "review",
                        "_createdAt": "2020-10-12T16:50:02Z"
                    },
                    {
                        "rating": 3,
                        "course": null,
                        "_createdAt": "2020-06-30T16:28:40Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "body": "First a bit of background. My undergraduate degree was in Electrical Engineering. I’ve been out of school for eight years with almost no prior statistics experience. This was my first semester back in school and I was concurrently enrolled in AI4R. Not currently working. \n\nI was very excited to take this course. I was jumping up and down when I got in on free for all day. \n\nThe lectures were very hard to understand and only made sense once you had enough knowledge from other sources to piece together what the instructor is talking about. In the end I skipped about a third of the lectures and solely used other resources. In fact, I had to hunt down so many others resources which made me question why I was even taking this class. \n\nThere was a total of six homework assignments. The first was easy. The second thru forth were very hard and math heavy. Five and six were easier and based on using WinBugs/OpenBugs. The homework assignments are available on the course website and I would encourage you to take a look at them before registering. All of assignments are wordy and take multiple readings to understand what is being asked. \nI had to rely heavily on piazza and the instructor’s book. This is because most of the exam and homework problems are a variation of an example in instructor’s book. Which is free and also on the course website.\n\nThe exams were not too hard if you completed the homework. They were completely open and not proctored. They give you two weekends and the week between to complete them which was more than enough time.\n\nThe final project was interesting. I took an exam question and applied the model to a dataset that I gathered. \n\nAll deliverables were to be done in LaTeX or some other typesetting language. I used Overleaf for this. I had never used LaTeX before, it was an added frustration in the beginning. There were many complaints about using it on Piazza. After the first submission it became quite easy and made for some professional looking write ups. Just be aware, you will probably spend more time creating this document than solving your first homework. \nAs a whole, the grading was too lenient. I do not think the course is scalable currently given the deliverables. It took a long time to receive grades and even then - the feedback was minimal. Normally you can drop your lowest homework grade. Due to Covid-19 we were given two drops. The final project was made optional for extra credit.\nI felt bad for the TA's as they had a lot or grading to keep up with. The head TA Yuwei Zhou was great but I think overwhelmed. We had a student, Michael Kuehn that literally carried the class and posted over 1600 messages on Piazza, he usually responded to posts within minutes. Many students mistakenly thought he was a TA. \n\nAfter having taken the class I am more interested in the subject. There are definitely better resources out there than this course but it was great to apply this credit towards the program.\nI ended up with a 100 final grade. This was a product of hard work, looking for many resources and the easier grading due to Covid-19. There are many good books on the subject and they use software packages that are better documented. If you are still interested in taking this course check out the course website.\n\nhttps://www2.isye.gatech.edu/~brani/isye6420/\n",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "difficulty": 4,
                        "workload": 20,
                        "_id": "external-import-cf75355a-bdaa-4f22-9adf-8534186009fa",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-cf75355a-bdaa-4f22-9adf-8534186009fa",
                        "created": "2020-06-30T16:28:40Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "course": null,
                        "created": "2020-06-21T02:22:12Z",
                        "difficulty": 1,
                        "_createdAt": "2020-06-21T02:22:12Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "Bayesian statistics is a useful course to take and know but the way it is taught is awful. The Professor has one of the worst teaching styles and it is honestly impossible to follow what he is trying to say. Do the Coursera course instead and you will learn much more.\n\nCourse itself is very easy. There is some math involved but it is not overbearing. After the midterm the course is practically no work and everyone gets a easy A (insert meme).",
                        "rating": 2,
                        "_id": "external-import-b4a0e751-897b-4a0e-8c8e-95f5d45b174e",
                        "id": "external-import-b4a0e751-897b-4a0e-8c8e-95f5d45b174e"
                    },
                    {
                        "rating": 2,
                        "id": "external-import-25c16d2b-c446-48ef-9896-b9f9414ca597",
                        "created": "2020-05-05T22:09:17Z",
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-25c16d2b-c446-48ef-9896-b9f9414ca597",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 10,
                        "body": "While the course material could have been interesting, several execution errors made this course a very poor learning experience (those who succeeded did so by doing a good deal of self teaching, leaving us questioning why we spent money on this course). TA coverage was quite poor (not due to their efforts, but due to poor staffing) and the instructor was not involved in the class at all beyond being in the pre-recorded videos. The video lectures were quite dry and did little beyond listing formulas. The second half of the course focused on the usage of winbugs, despite the software's irrelevance outside of the academic world (and even there many have shifted to more modern packages, e.g., does David Blei write his papers with winbugs code in them? No!). You also won't learn anything about how bayesian simulation is actually done (e.g. MCMC and its modern varients), but instead spend significant amounts of time trying to get winbugs to set up relatively simple models (most of which you will create by copying and tweaking code from very similar examples). This could could be significantly improved by a more involved instructor presence, improved TA staffing, and an overhaul of instructional materials to have more interactive/media-rich contents (e.g. teaching concepts visually is especially helpful, many other lecture series online use simulation and graphing to augment formulas)",
                        "_createdAt": "2020-05-05T22:09:17Z",
                        "_type": "review"
                    },
                    {
                        "_createdAt": "2020-05-04T16:36:26Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_id": "external-import-efcc3c5f-0f33-45b6-b355-2ec707664aad",
                        "body": "Overview: \nOverall this class was useful. The videos are a bit tough to follow and the beginning of the course is very math heavy. The homework was not overly difficult and there were a lot of resources to help check and understand if you were on the right track. The midterm and final were very straightforward, both were \"take home\" and open notes. \n\nHomework: 6 assignments (released at the start of the semester)\nProject: Yes, not a group project 10% of overall grade\nMidTerm - Take home, open notes\nFinal - Take home, open notes\n\nYou will likely need to use outside resources for some assignments. This semester it was tough to get a response from the TAs or the professor. That made some assignments and learning a little harder. Overall it did not impact my grade. \n\nThe project was to implement your own Bayesian module using what you learned in the class. The project was individual and very little guidance was provided. This semester the project was option due to Covid-19. It sounds like many still attempted the project, myself included. I did not find it difficult. \n\nI would recommend this class as it does give a picture beyond the typical statistical analysis. \n",
                        "id": "external-import-efcc3c5f-0f33-45b6-b355-2ec707664aad",
                        "created": "2020-05-04T16:36:26Z",
                        "difficulty": 3,
                        "workload": 7
                    },
                    {
                        "workload": 10,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 2,
                        "course": null,
                        "difficulty": 3,
                        "_type": "review",
                        "_id": "external-import-8914a47f-f0d3-4b3e-98f7-886da3b75c45",
                        "body": "This is essentially two courses rolled into one, before and after the midterm. The first portion, which is longer (4 of the 6 homeworks and the midterm) revolves around calculus-based probability and a lot of algebraic manipulation to get formulas to look like a PDF or CDF of a known distribution. For most it's significantly harder and takes up more time. The second portion (remaining 2 homeworks, a very open-ended project, and a non-cumulative final) revolves around programming in OpenBUGS/WinBUGS. They provide enough sample problems that you should be able to find something pretty similar and slightly tweak. I still consider myself pretty mediocre with BUGS but got close to a 100% on all the assignments in the second portion using that method.\n\nThe grading was quite lenient, maybe even unreasonably so this semester. Normally they let you drop one homework. This semester with the COVID-19 fears we dropped two homeworks, *and* the project became extra credit, adding up to 10% to our grade. A lot of people dropped the course with the struggles of the first mathy-part but of those who stayed, the average overall grade was in the 90s. All assignments are take-home, open-note/open-book.\n\nThe reason I graded this course so negatively is due to the instruction, or lack thereof. The online lectures are really hard to follow and do a poor job explaining. In the first, more mathy part he doesn't explain how he got from Part A to Part B. He just assumed you'd know that he used the chain rule and substitution by parts (or whatever) and doesn't show his work in doing so or say he did that. In the BUGS-centered part he literally just reads code out loud and doesn't explain what this function or that function does. BUGS is pretty easy to use and at least for our assignments can be reverse engineered pretty easily for what we need, but I barely feel I learned a thing about programming in it, nor would I be able to use it to do a robust analysis from scratch without examples to start from.\n\nThe TAs are the worst I've had in the program, or for that matter in undergrad. Ignore most posts on Piazza. Are woefully unprepared for office hours, not ready to answer questions with examples taken directly from slides or given practice problems. And hell, sometimes don't even show up to their own office hours! Luckily this semester we had a very active community of students helping each other - special shout-out to Michael Kuehn who's not a TA - but had they not who knows what would've happened.\n\n**TL;DR** Very mathy at first, gets much easier after the midterm, with lenient grading you should get at least a B if not an A, videos aren't too helpful, nor are the TAs",
                        "id": "external-import-8914a47f-f0d3-4b3e-98f7-886da3b75c45",
                        "created": "2020-05-02T18:23:06Z",
                        "_createdAt": "2020-05-02T18:23:06Z"
                    },
                    {
                        "id": "external-import-824c8d36-d24e-43b8-9db7-51e46622b643",
                        "difficulty": 4,
                        "rating": 3,
                        "_type": "review",
                        "workload": 10,
                        "_createdAt": "2020-04-28T16:33:07Z",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "created": "2020-04-28T16:33:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "It's hard to rate this course as I have mixed feelings about it. Understanding some of the material can be tough, yet the grading is very generous. So does that mean it's hard or easy? We had a guy, who, supposedly, had a math degree drop the class as it was too much for him. \n\nSimilarly, I think some of the concepts can be useful and interesting, but at the same time, I don't expect I'll be using winbugs ever again. I would definitely need to literally start from scratch with a book like \"Doing Bayesian Analysis\" before actually going out and really trying to apply this stuff. So does that mean I liked the class or not? \n\nIf you read many of the reviews, you'd think this class is easy as falling off a log. But keep in mind these reviews are definitely non-random. People that drop aren't as likely to come here and write one.\n\nIf you are really bright, or have solid grasp of calculus based probability, this class will probably not be too hard. If not, it might be. \n\nComing from a not very advanced math background myself (did the calc sequence long ago) the first part of this course was a bit intimidating with the notation and some of the derivations involved. I realized pretty quickly that the professor's style (speaking in math) would not connect with me. So I went out and tried to find other resources. \n\nThe danger of finding other resources is that you start flailing around after a while, jumping from YouTube videos to coursera courses to books you've bought. Before you know it, you're not really sure what you're doing. And it's here, in a state of flailing that I found myself after about 8 weeks or so. I had a conceptual understanding of things, but some of the mathy bits could be hard to follow in the lectures. \n\nAt one point, I decided I was going to just drop the class. I went so far as to pull up the page on Buzzport and had my finger over the mouse button then thought, \"well, I might as well just take the midterm and decide after that.\" I'm glad I did as the grading was very fair (ridiculously fair) and I decided to just gut it out. After all, this is my 8th class, I have a good GPA, and I figured if I got a bad grade, at least I'd check the box and move on. No one's really going to care.\n\nIn addition to all that, I had a death in the family (not coronavirus related)  and then the whole coronavirus thing happened, so for about the third month or so, I did nothing with the class. This didn't help my understanding, but I didn't give AF.\n\nSo, gentle reader, where does this leave us? Should you take this class? Or, what? You have to take two stats classes, at least, and you don't have many appealing choices. Regression, time series, bayes, CDA, HDDA. If you're doing CDA and HDDA, you're probably best off, but I didn't want the workload at this point in my life. Time series is a very useful subject, but it's literally the lowest rated course in the program. \n\nI'm a Business analytics track student, so, if I had it to do over again, I'd probably still take this course, but I'd start with the Coursera class (it's a two part course) OR the lectures Brendon Brewer on youtube (that uses the above mentioned \"Doing Bayesian Analysis\" as the text) OR just stick with the prof's book on the course website. Do NOT try to do all of them, you will only confuse yourself. \n\nRemember, the grading is super lenient and the assignments get easier towards the end when the focus is more on application. The \"programming\" is mostly copy/paste from the examples, so no need to worry about that. \n\nIf you're more computational track-minded, I'd say skip this and go with HDDA or CDA as stats electives. If you're analytical tools, you're probably taking this. \n\nA note about the way the course is run: questions could go unanswered for quite some time on piazza, don't expect much there. The head TA (Yuwei) did hold office hours. We had a student (MK, you know who you are) who literally answered more questions on piazza that the instructors, TA's, and pretty much everyone else combined. The guy should get retroactively hired and paid. \n\nAssignments felt like they took forever to grade. It could take nearly a month to get a homework grade. I don't blame the TA, per se, but think they may have been a bit overwhelmed. \n",
                        "_id": "external-import-824c8d36-d24e-43b8-9db7-51e46622b643",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "created": "2020-01-01T19:05:18Z",
                        "_id": "external-import-a645f4df-90c1-45d9-a85d-ab69c0788d6d",
                        "workload": 6,
                        "body": "## Pros\n- Covers basics of Bayesian methods with a good mix of theory and practice\n- Very light course load with assignments that are released at the beginning; ideal for pairing with hard courses\n- Lectures and examples pretty clear; there's plenty of handholding for assignments and exams\n- Exams are basically additional assignments so no stress\n## Cons\n- Material is not very in-depth nor advanced; very introductory\n- Must use WinBUGS/OpenBUGS for the assignments so you won't be familiar with modern MCMC tools after taking the course \n- First half the course is quite theoretical so if you don't have a strong stats/math background you might struggle\n\nSpent maybe 5-7 hours per week on average on the course and ended up with 99.8% final grade",
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-a645f4df-90c1-45d9-a85d-ab69c0788d6d",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-01-01T19:05:18Z",
                        "_type": "review"
                    },
                    {
                        "course": null,
                        "id": "external-import-5224fb83-fe6c-483a-9d44-6498d1d5f430",
                        "created": "2019-12-21T21:35:24Z",
                        "_createdAt": "2019-12-21T21:35:24Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "workload": 15,
                        "_id": "external-import-5224fb83-fe6c-483a-9d44-6498d1d5f430",
                        "rating": 1,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester"
                        },
                        "body": "This is by far the worst of the 5 classes I've taken in the program to date. The lectures are terrible. Simply put, the professor seems to have made each video in a max of 2 takes and did not take the time to asses his delivery of the content. I learned next to nothing and ended up going through the assignments by just identifying--or listening to others who've identified--the closest example given in the videos or supplementary material and then copying its structure without ever fully understanding why or how things worked. You will have a better time learning Bayesian statistics from the UC Santa Cruz Coursera course (https://www.coursera.org/learn/bayesian-statistics) and other online resources (e.g. Statistical Rethinking [http://xcelab.net/rm/statistical-rethinking/] is highly touted, though I can't speak to its quality yet as I've only gone through 1 lecture).\n\n(BTW this is coming from someone who finished the class with an A, so this review isn't the result of some bitterness about a grade or anything like that.)"
                    },
                    {
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-cd245140-c536-4f69-9f9b-d83daf45d40a",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "body": "MY BACKGROUND: OMSCS, this was my 1st course, currently working in quant finance, had about 5-6 classical stats classes in undergrad and grad in the past (but little on Bayes and markov chains), my programming skills are very limited.\n\nCOURSE DEMAND: Moderate. I spent about 15+ hrs/wk through the mid-term, but that dropped to about 5+ after that. The 1st half is very mathy and theoretical. You need to know basic stats and calculus, be really clever with algebra, and understand math notation. You’re deriving equations, estimating likelihoods and probabilities, and other fun tasks. 2nd half is more practical where you're recycling / updating prior code for different assignment questions and data sets.\n\nCODING: Knowing how a loop works is all that’s necessary. After the mid-term it’s much more applied, where you use WinBUGS (or similar) to do virtually all the remaining assignments. Coding in WinBUGS was easy as you are given several video tutorials and code templates to use. However, I doubt if I will ever use WinBUGs again. This is my key issue with the course. They should re-tool the assignments to use Python or R for everything. These are more applicable / useful stats languages in my opinion. (Note: you can use JAGS with R for some of the assignments as well)\n\nDELIVERY: TA’s were active on Piazza. Fellow classmates usually provided good insights as well. The office hours contents were too random for me to find value in them. The Instructor was a little too accommodating and lenient, in my opinion, by extending some HW assignment due dates for rather straight forward assignments. But generally very timely with grading (no multiple choice tests here, no code auto graders). The existing videos could use some updating and more content. I found UC Santa Cruz Bayes Stats videos on Coursera to be better, and a great supplement to this course. All assignments / exams were open-book. No proctored exams. No group project. HW's could be front loaded, but not exams.\n\nRECOMMENDATION: I recommend this course for those pursuing the OMSCS machine learning specialization, or anyone with general interest in the basic math fundamentals underlying much of AI/ML. I learned a bit, even with my above average stats background. The notion of updating statistical distributions, parameters, and projected outcomes/decisions, as more information is gleaned is what Bayes Stats is all about (prior + likelihood = posterior). This has helped me already at work and I suspect will be useful with other ML/AI courses I plan to take in the program. A good test to see if this course is for you would be to look at the old homework assignments posted on the (very outdated) course webpage. If you are not completely lost of what’s being asked in them, or find the concepts interesting, then go for it. Good first course, or course to pair with a more demanding course.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2019-12-20T20:37:20Z",
                        "_createdAt": "2019-12-20T20:37:20Z",
                        "difficulty": 3,
                        "_id": "external-import-cd245140-c536-4f69-9f9b-d83daf45d40a"
                    },
                    {
                        "id": "external-import-be80385a-d585-4be8-ac15-e8810418e53c",
                        "_id": "external-import-be80385a-d585-4be8-ac15-e8810418e53c",
                        "course": null,
                        "difficulty": 2,
                        "_createdAt": "2019-12-15T16:54:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "After this course, you'd feel you know everything but actually you don't. You just skim the surface.\n\nIt is an easy A. Grading is lenient. TAs and Professors are very cooperative.\n\nIt is a mathy course - you can work ahead for (almost) everything. The exams are take home.\n\nI recommend this course!",
                        "created": "2019-12-15T16:54:43Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "workload": 18,
                        "semester": {
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "id": "external-import-479553d9-81bc-45b1-ab5e-754a96f7fe61",
                        "created": "2019-12-15T16:45:08Z",
                        "rating": 4,
                        "body": "It is definitely possible to get an A in this course with minimal effort. This is because the grading is extremely generous (class average on final exam was 96) and the provided sample code is so close to the correct answers on the assignments, projects and exams. Because of this, it is possible to ace the exams without a rigorous understanding of the underlying math. For example, in my opinion the HW4 Metropolis Algorithm / Gibbs Sampler questions were the most complicated pieces of code we were expected to produce. The provided code examples were really good. So good, in fact, that you really only had to change a few lines of code to get full credit (in other problems, you could get full credit without changing any of the code at all, just swap in new data). For the earlier half of the course which involves little coding, it's still basically the same deal: between the example problems, book examples, and past homework solutions, you can find an answer to the homework/exam math questions which are similar enough that you can reverse engineer the correct answer with a little basic deduction.\n\nThe lectures also kind of suck. Dr. Vidakovic has a thick accent and it is difficult to understand what he is saying sometimes, even with text translation. He does gloss over some intermediate/advanced math sometimes which isn't good for someone like me who has below average math knowledge. I found myself using other sources to learn; mostly youtube. \n\nThe book \"Understanding Biostatistics\" (available a free PDF) is useful but not simple to understand. It provides good code examples and explains things well, but sometimes the math was a bit too difficult for me. Even so, I learned from it (just perhaps not as much as I could have). \n\nThe overall workload for this course is lower than most OMSCS courses. I thought I might have to drop the course when I was having some trouble understanding around HW3/HW4, but as I said the midterm was quite doable and there is a considerable time break after the midterm. If you know what to expect, then this course is totally pairable with another course. I think this course would be most educational for someone who already knows frequentist statistics and has the drive to do a bunch of the practice problems, read a lot of the book, and put together a challenging project (I did a relatively simple project and got an A). \n\nOverall I actually liked this course. Part of it is simply because I like the subject matter and feel that it is important. I didn't exit feeling that I am some sort of bayesian god, but I definitely have implemented a few cool things in code, how to do some basic/intermediate bayesian data analysis, and I do believe I leveled up enough in math fluency to spec for a new class change.\n\nTLDR: Take this course 1): if you want to either copy example code for a (relatively) easy A course that you can pair with another; OR 2): if you are driven enough to do example problems and read and watch outside lectures and do an awesome project so that you max out your learning",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_id": "external-import-479553d9-81bc-45b1-ab5e-754a96f7fe61",
                        "_createdAt": "2019-12-15T16:45:08Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "workload": 11
                    },
                    {
                        "body": "This is the best course that I have ever taken for OMSCS. (the third one) TAs are so nice and supportive. Lectures have lots of insight and fun. Homework are easy to handle and you can always find a similar one either on videos or excises in previous semester. Exams are all take-home ones so you have plenty of time to deal with them.You can really learn a lot about Bayesian from this course and it is really a good knowledge if you would like to dig into AutoML area.",
                        "created": "2019-12-11T17:36:18Z",
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 5,
                        "_id": "external-import-862becf7-0ad2-4c42-9a89-8cc95d7a4484",
                        "id": "external-import-862becf7-0ad2-4c42-9a89-8cc95d7a4484",
                        "difficulty": 2,
                        "_createdAt": "2019-12-11T17:36:18Z",
                        "_type": "review",
                        "workload": 5,
                        "course": null
                    },
                    {
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2019-12-09T21:30:43Z",
                        "_id": "external-import-7b21431e-c290-4ba7-8726-c2a8cc78d558",
                        "id": "external-import-7b21431e-c290-4ba7-8726-c2a8cc78d558",
                        "created": "2019-12-09T21:30:43Z",
                        "workload": 4,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "body": "This was the first OMSA elective that I was disappointed in.  I don't feel like I left the class with a clear idea of how to apply the material despite getting decent grades.  The class is front loaded with calculus(which can be pretty messy) and back loaded with easy implementation problems.  Most of the homework either consists of calculus or copying a winbugs solution from an example.  The calculus was fairly challenging for me, but the last calc class I had was 20 years ago.  I would have preferred this class explain the math more broadly then focus on what people need in order to implement bayesian models effectively.",
                        "_type": "review",
                        "difficulty": 2
                    },
                    {
                        "created": "2019-12-08T16:30:36Z",
                        "_type": "review",
                        "body": "The course was of medium difficulty up until the midterm. Knowledge on probability and statistics may be helpful, although the concepts can be learned on the go. After the midterm, the workload significantly reduced. There were 6 problem sets, a midterm, a final exam and a project. Not much of the concepts can be learned by watching the lectures alone and it requires extensive self-learning. The class had a very good TA (Yuwei), who was quite responsive and super helpful. We were forced to use WinBUGS for homework, which was frustrating. Project was just like another homework, but with our choice of dataset and analysis. This class is suitable for pairing with a difficult course.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_id": "external-import-3a5f774b-e77e-47c8-b406-102a8e6325de",
                        "id": "external-import-3a5f774b-e77e-47c8-b406-102a8e6325de",
                        "difficulty": 2,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2019-12-08T16:30:36Z",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall"
                        }
                    },
                    {
                        "rating": 1,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 5,
                        "_createdAt": "2019-11-06T16:09:37Z",
                        "_id": "external-import-70cff09c-5848-491c-a5d8-bcd2fba2727a",
                        "id": "external-import-70cff09c-5848-491c-a5d8-bcd2fba2727a",
                        "created": "2019-11-06T16:09:37Z",
                        "body": "1. Heavy on statistics- If you don't have Stats background, this would be very difficult \n2. Need to spent time learning new software like openBUGS which one may not need in outside world \n3. Initial couple of chapters are all about Probability \n4. I highly doubt if we would use Bayesian in real life. Majority of areas still use frequentist approach. \n5. ISyE and Analytics peers who had this as their last class were also struggling. \n\nRecommendation- Do not take this as your 1st class. I have seen many people dropping out/ withdrawing from this class (including myself).",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "workload": 30,
                        "_type": "review"
                    },
                    {
                        "_id": "external-import-7554b774-bfe3-42ff-a280-4ad6a25041d9",
                        "_createdAt": "2019-05-20T19:15:34Z",
                        "id": "external-import-7554b774-bfe3-42ff-a280-4ad6a25041d9",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "_type": "review",
                        "course": null,
                        "difficulty": 4,
                        "created": "2019-05-20T19:15:34Z",
                        "workload": 8,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "body": "This course is difficult to evaluate - The hurdle is not so much the prerequisite level of stats (it all starts with a regression built on five observations) but the knowledge of mathematical notation required. \n\nThe theoretical foundations of Bayesian inference are not very well explained - I signed up for a Bayesian stats course on  Coursera next to this one which helped me understand the theory better. I found the videos explaining the theory very hard to follow. The handouts still contain the errors the professor fixes during the video session.  Things only cleared up once the lectured turned towards examples. \n\nThere is a project at the end that is not very well defined - find a dataset and run Bayesian analysis. I followed a different review here that recommended focusing on the final. \n\nOn the other hand, there is the concept of Bayesian inference, which is very powerful.  The course provides a lot of examples. In the end, I did not do very well in the course, but I am very glad I took it. At the same time, I think it would take only a small effort to improve it."
                    },
                    {
                        "_createdAt": "2019-05-06T09:54:31Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "workload": 5,
                        "_id": "external-import-6f388596-284a-4873-b09d-79aca2ad082d",
                        "id": "external-import-6f388596-284a-4873-b09d-79aca2ad082d",
                        "created": "2019-05-06T09:54:31Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "rating": 5,
                        "body": "First 2/3 of material is pretty mathy/theoretical stats building the groundwork of Bayesian Inference, and the last 1/3 is all programming. There are lots of good examples of problems and code made available so it is quite simple to figure out how to ace any assignments given, but lectures can be a little lacking in clarity with the professor sometimes skipping over explaining some crucial steps. Exams are take home and you are given about a week to complete them, so as long as you have time it shouldn't be an issue. The project lacks guidance, but really you just need to find a dataset somewhere and perform some bayesian analysis on it to the level of complexity comparable to the homeworks and you should be fine. Grades were very highly stacked, I ended up with over 100% with the little bit of extra credit offered.\nOne frustrating thing was on the final the TA uploaded a wrong version (which included a homework problem nearly verbatim). He did not discover it for a few days and I had finished it by then, only for him to upload the real version which shared none of the problems, and only extend the deadline by a single day. Considering the material wasn't tough, it wasn't that big of a deal, but in theory it's unfair to the students. If you have questions about the veracity of any assignments or exams be sure you sound off in the piazza before investing the time."
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "difficulty": 3,
                        "_createdAt": "2019-01-02T22:51:26Z",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu"
                        },
                        "rating": 4,
                        "workload": 8,
                        "body": "I found the material to be pretty interesting. The lectures tend to skip over a lot of the details for how you get from step to step, which can be challenging if you don't have a pure math background. The lectures combined with the starter code give you enough to get through the course. the software wasn't super user-friendly, but they provide many examples, so you can figure it out easy enough. \nThe most frustrating thing about the course was the very slow feedback on assignments. I had no idea how i was doing because the grading was always a few assignments behind and there weren't really closed, verifiable answers. The professor jumped in on piazza a few times and was actually super helpful. TAs were ok. some of their comments were helpful, some not. I could never make office hours and the recordings were not really helpful. I think more user friendly software would make this class even better. I wanted to dig into some of the topics more, but i found myself lost unless I had starter code. I liked it overall. If you have a math background, you will probably like the first part of the course and if you don't, you might dislike it. I think grading was lenient overall, especially for the project. I thought the tests were pretty fair and if you do the assignments, you will be decently prepared.  (taken in Fall 2018)",
                        "id": "external-import-83b589f9-fa17-42d3-800f-ee6c533bce0d",
                        "created": "2019-01-02T22:51:26Z",
                        "_id": "external-import-83b589f9-fa17-42d3-800f-ee6c533bce0d",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-0a31d2aa-31ea-4ae2-a4fb-fe64334c2dc0",
                        "created": "2018-12-27T21:35:04Z",
                        "difficulty": 3,
                        "_createdAt": "2018-12-27T21:35:04Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_id": "external-import-0a31d2aa-31ea-4ae2-a4fb-fe64334c2dc0",
                        "body": "I was originally excited about this course because I was interested in potentially applying some of the concepts to problems at my current job. My excitement for the course quickly evaporated as I was met with dry lecture videos that did not try to build any intuition but rather focused on deriving formulas while glossing over most of the math. \n\nPersonally, the beginning of the semester was a bit rough until I watched the Coursera videos and reviewed other content. After doing so, things started to click. The first few homework are definitely more \"mathy\" while the second half is more applied. The grading is lenient and the take-home exams were easy as well. I ended up with a 99 in the course but definitely feel like I didn't get as much out of it as I had wished.",
                        "rating": 2,
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        }
                    },
                    {
                        "id": "external-import-396488be-59fa-4be7-bed7-2a49ead93126",
                        "created": "2018-12-11T01:12:01Z",
                        "rating": 3,
                        "workload": 10,
                        "body": "Took it Fall 2018. Selection doesn't allow Fall 2018, so I chose Summer 2018. It was offered for the first time Fall 2018 for OMSA.\n\nFirst half of the class is mostly theoretical and the last half of the class is programming in WinBUGS/OpenBUGS.\n\nGrading Breakdown:\n1. 7 homework assignments and allow for 1 dropped HW (5% each for 30%)\n2. Class project (10%)\n3. Midterm (25%)\n4. Final Exam (35%)\n\nThe Midterm and Final Exam are both take home with 3 questions each. You have a week to complete each one, which is plenty of time. \n\nIt's not hard to get an A in this class, but I was a bit disappointed about some of the lecture videos. In the first half of the class, the lecture slides make  a lot of jumps for mathematical derivations and it can be confusing to follow. Relied on my peers on Slack, math stack exchange, and other online Bayesian readings to understand the material better. For the first part of the class I spent a good amount of time, maybe 14 hrs a week, trying to understand the math, but it dropped a lot more when it went into programming.\n\nThe homework assignments aren't due on a consistent basis. E.g. for some reason HW 5-7 were all due within 2 weeks in a 15 week semester. \n\nOpenBUGS (the program that we used) can be a little difficult to debug sometimes because there's not as much troubleshooting questions online and the documentation isn't that great compared to the Python & R we're used to. \n\nThe professor does provide a lot of OpenBUGS .ODC file examples which basically provide the exact template (after switching/adding a few variables) for later homework assignments and with the class project. \n\nThe class project is a solo project of your choosing. It's basically a homework assignment, but you have to find your own dataset and perform further analysis. It's not very long or difficult (5 page max) and I enjoyed doing it. Choosing a smaller dataset may be beneficial because OpenBUGS can run pretty slow based on your iterations, data, and variables. Class project is due same time as your final. Would suggest completing final first before starting your class project since it's worth more.\n\nIf you're on Mac, a student in my class (Thanks a lot Jared!!), posted instructions for using OpenBUGS in Virtual Box . His instructions are as follows:\n\n1.\tInstall VirtualBox\n2.\tGo to http://gatech.e-academy.com/ (will log you in with your GT credentials)\n3.\tGet your free student license key for Windows 10\n4.\tDownload Windows 10 ISO image from here: https://www.microsoft.com/en-us/software-download/vlacademicwindows10iso\n5.\tOpen VirtualBox and create a Windows 10 VM (make sure 32/64-bit matches what you downloaded)\n6.\tThe first time the VM runs, point it to the windows ISO file\n7.\tWait for Windows to install (I set up on offline user account, using my GT Office365 account didn't work)\n8.\tEnable Copy/Paste by installing Guest Additions (https://www.virtualbox.org/manual/ch04.html#additions-windows) and then using the VirtualBox menus Devices > Shared Clipboard > Bidirectional. Might need a reboot. Note that you need to use the Ctrl key while in Windows to copy/paste.\n9.\tInside the Windows VM, download and install WinBugs or OpenBugs\n\nYou could also install OpenBUGS via Wine on Mac, but for some reason I couldn't get it to work so I used this for the entire semester.\n\nOverall, felt a little unsatisfied that the video lectures could have been better, but this is an interesting topic.",
                        "difficulty": 2,
                        "_type": "review",
                        "_id": "external-import-396488be-59fa-4be7-bed7-2a49ead93126",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "_createdAt": "2018-12-11T01:12:01Z"
                    },
                    {
                        "created": "2018-12-07T15:01:27Z",
                        "_id": "external-import-c68d9a9d-49cf-4208-8c14-7e871a9c7e38",
                        "difficulty": 3,
                        "rating": 3,
                        "course": null,
                        "body": "Overall, a fairly interesting, if not lackluster, course. I did learn a decent amount, but the course uses outdated tools and a lot of the class is just getting over the learning curve with the required applications. Overall, if you like Stats, you will probably like this course OK, and if you don't this class will probably be a little frustrating. \n\nMy Background:\n\n23 years old, recently married, graduated undergrad in May 2017.\n\nCoding Experience: Moderate (academic experience with many languages, mostly Python and R)\n\nStatistics Experience: Moderate (4 undergrad level stat courses, Intro to Analytics Modeling, Regression Analysis)\n\nMath Experience: Moderate (peaked at 2nd year Calculus)",
                        "id": "external-import-c68d9a9d-49cf-4208-8c14-7e871a9c7e38",
                        "_createdAt": "2018-12-07T15:01:27Z",
                        "_type": "review",
                        "workload": 8,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        }
                    }
                ],
                "_id": "external-import-ISYE-6420",
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/f8697e3c9ab0757c24e3b06d5f85ac691d3d08ac.pdf",
                "rating": 2.779220779220779,
                "difficulty": 3.324675324675325,
                "workload": 12.96103896103896
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "introduction-to-theory-and-practice-of-bayesian-statistics"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}