{
    "props": {
        "pageProps": {
            "course": {
                "created": "2022-07-05T23:23:15Z",
                "textbooks": [
                    {
                        "name": "Simulation Modeling and Analysis, 5th Edition",
                        "_key": "4c38c62434e112ed32558095ff7e0d40",
                        "url": "https://amzn.to/3RdAzct"
                    },
                    {
                        "url": "https://amzn.to/3Cr0MQx",
                        "name": "Simulation with Arena, 6th Edition",
                        "_key": "179b3bacd0ecf174d9799fadf34a66cb"
                    }
                ],
                "syllabus": {
                    "file": {
                        "asset": {
                            "_type": "reference",
                            "_ref": "file-e374c22c490c84c6f9a99ac6abac65c769ce3003-pdf"
                        },
                        "_type": "file"
                    }
                },
                "syllabusUrl": "https://cdn.sanity.io/files/3yw11hu2/production/e374c22c490c84c6f9a99ac6abac65c769ce3003.pdf",
                "_updatedAt": "2022-08-25T21:42:47Z",
                "isFoundational": false,
                "programs": [
                    {
                        "acronym": "CS"
                    },
                    {
                        "acronym": "AN"
                    }
                ],
                "id": "external-import-ISYE-6644",
                "name": "Simulation",
                "isDeprecated": false,
                "notesURL": "https://www.omscs-notes.com/simulation/welcome",
                "_createdAt": "2022-07-05T23:23:15Z",
                "_type": "course",
                "slug": "simulation",
                "officialURL": "https://omscs.gatech.edu/isye-6644-simulation-and-modeling-engineering-and-science",
                "_id": "external-import-ISYE-6644",
                "description": "Covers modeling of discrete-event dynamic systems and introduces methods for using these models to solve engineering design and analysis problems.",
                "_rev": "iLpqNfBINCDhaBRaVOINhv",
                "creditHours": 3,
                "tags": [
                    "SIM"
                ],
                "codes": [
                    "ISYE-6644"
                ],
                "reviews": [
                    {
                        "_type": "review",
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19"
                        },
                        "authorId": "Slt0liqjgkPgkMV3ytHVZA==",
                        "_id": "B6OhGUAdnS92qOAAYdIGSF",
                        "_updatedAt": "2024-09-08T17:17:42Z",
                        "id": "B6OhGUAdnS92qOAAYdIGSF",
                        "created": "2024-09-08T17:17:42Z",
                        "course": null,
                        "body": "I took this class this summer and if I were to go back and take it again, I'd say make sure you do the practice exams with you cheat sheet and under time constraints. If you struggle with a practice exam question, make a note of it, and mark it down on your cheat sheet. Every so often I see myself revising the cheat sheet all again and again due to the feedback I got when doing the practice finals. If you think that 2 practice exams isn't enough, I'd go and look up textbooks that cover the same math and stats content as what is being taught in Sim. (Make sure it covers RVs, Prob Dist, etc) and do those questions. Honestly Sim is just a math course with  applications using ARENA. Also, \n\nI'd recommend getting a good scientific calculator and leverage their stat's functions there. I personally bought the FX 991 ES and it helped so much because it had integrals and you can switch modes where you can calculate binomial, normal, and Poisson (just look at the calculator guide and see how to do it). The project is lenient as long as you follow the rubric.  We picked a topic where it felt like a research paper than anything (we did literature review, methods, results, discussion . Any additional requirements we list it in the annexes). But overall I'd say your main focus for this course is the practice exams and whatever question you can get ahold of using other probability/stats textbooks. \n\nGood think about Dave is that he knows how to teach without reading the script so its more engaging then, lets say ISYE 6501 where Dr Sokol reads off the slides a lot  (no hard feelings to Sokol, but I gotta give aura points to Dave for not reading off the slides). I never really had to look for external resources beyond Module 2 and everything is pretty much self contained as he said. \n\nIts a great class overall, it prepares you for more advanced classes like CDA. Definitely a well structured and well run course! ",
                        "_createdAt": "2024-09-08T17:17:42Z",
                        "workload": 20,
                        "_rev": "B6OhGUAdnS92qOAAYdIGPq",
                        "difficulty": 4
                    },
                    {
                        "id": "2IKTrcBTPXc7cMTx6yJf5B",
                        "workload": 18,
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4"
                        },
                        "_updatedAt": "2024-08-05T07:30:25Z",
                        "created": "2024-08-05T07:30:25Z",
                        "body": "I initially didn't want to take this course mainly because I used SimPy in 6501 instead of Arena because of how many complaints other student had with Arena. However, the reviews for PM and DO weren't as great at this course and a friend convinced me that it's really not a lot of Arena. She also repeated over and over how funny Dr Dave Goldsman is. I'm sure that in my long career as a student, I haven't met a funnier professor... he would have excelled as a profession comedian if he would have pursued that path!\nI was surprised at the immense amount of material covered in this class. And, as usual at Georgia Tech, they found an infinite number of ways to generate problems on the material. If you have time, I recommend going over the bootcamp course... It should help you with the first exam, at least. Watching the posted exam review questions were really helpful as well... Although I caught on to those late. I felt comfortable doing the HW problems by myself but, a word of caution, they can bring a set of totally different questions on the exams. Make good cheat sheets and practice as much as you can. It was one of the toughest courses I've taken during the summer but fun nevertheless.",
                        "difficulty": 4,
                        "authorId": "ZpFEvoC7OsbW7Ex20fUBcw==",
                        "_createdAt": "2024-08-05T07:30:25Z",
                        "_id": "2IKTrcBTPXc7cMTx6yJf5B",
                        "_rev": "2IKTrcBTPXc7cMTx6yJezu"
                    },
                    {
                        "_createdAt": "2024-08-02T05:56:09Z",
                        "_rev": "CZnPCJFeW1IiYXKDMejNic",
                        "semester": {
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19"
                        },
                        "id": "CZnPCJFeW1IiYXKDMejNlu",
                        "_id": "CZnPCJFeW1IiYXKDMejNlu",
                        "authorId": "Am80cGXb4fcCQJRyDdiF1g==",
                        "rating": 5,
                        "workload": 20,
                        "_updatedAt": "2024-08-02T05:56:09Z",
                        "created": "2024-08-02T05:56:09Z",
                        "difficulty": 4,
                        "_type": "review",
                        "course": null,
                        "body": "As this is my first summer semester, I find the course to be densely packed with well-thought-out content. While it's certainly worth the effort, I would recommend offering it during the spring or fall semesters instead. The course is well-structured, with comprehensive and self-sufficient content. The recorded tutorials for the sample tests are particularly helpful. Dr. Goldman's enthusiasm and humor in the lecture videos are also noteworthy."
                    },
                    {
                        "_rev": "nAphTJxjOsHb6vxQi0vV8U",
                        "_updatedAt": "2024-07-30T00:35:03Z",
                        "rating": 5,
                        "body": "TLDR: Definitely take this course to refresh your probability and math. It will set you up  for future courses.\n\nDefinitely a well designed course. Dave Goldsman does an amazing job at online instruction.  He is very understandable because he doesn't read off the slides. I highly recommend taking this course early in your OMSA journey as it sets you up for future courses.\n\nI would however, prepare in advance by viewing his ISYE 6739 course a few weeks before the course starts as this is 90%  a Math/Stats course.  \n\nPersonally speaking, I came in with only a year after taking Calc 2 from a community college and 2 years  from basic statistics. For Calc  2, I'd just focus on learning how to integrate. You'd probably want to review how to do double integrals as well because there is a section in the course that covers joint distributions.\n\nAlso, make sure to get a good calculator that does probability distributions. and learn how to use it well.  I used FX 991 ES for the exams and it has done wonders for me.\n\n",
                        "id": "nAphTJxjOsHb6vxQi0vVBm",
                        "workload": 16,
                        "semester": {
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19"
                        },
                        "authorId": "Slt0liqjgkPgkMV3ytHVZA==",
                        "created": "2024-07-30T00:35:03Z",
                        "_createdAt": "2024-07-30T00:35:03Z",
                        "_type": "review",
                        "_id": "nAphTJxjOsHb6vxQi0vVBm",
                        "difficulty": 4,
                        "course": null
                    },
                    {
                        "body": "Overall recommendation: Highly recommend this class as a gentle introduction to probability theory. \n\nPractical use case of this class: ARENA was the software that is recommended for this class but it only made up 10% of the class (remaining 90% is theoretical, see the bottom for detailed description). You can use Python / other programming languages for the project as well.\n\nProject: The project can be done individually or as a group (max of 4 members). The difficulty of the project scales with more members of the team. I had 3 members in the group, and we did not know about the difficulty scaling. As a result, the project was really difficult. However, post the project, I felt I leveled up in my coding skills in Python.\n\nLecture content:\nFirst-third: Firehose of refreshers for calculus and probability theory. I did not have any formal classes in probability back in uni so this course helped in teaching me the basics in probability. This section is very heavy on mathematics (but basic calculus, e.g. single-variable differentiation, integration) but geared more towards understanding the various distributions and probability theory. This section is mostly covered for Midterm 1.\n\nSecond-third: A refresher of the first-third of the course but more in-depth. This section is mainly just how to generate distributions from scratch and less on simulation. For example, how do you generate a uniform distribution from scratch (without packages) and from the uniform distribution, how do you generate exponential, normal distributions, etc. This covers most of Midterm 2. \n\nLast-third: Now this is where the true fun starts for simulation. This section provides information on how do you know what distributions do you use for your simulation and how do you know your distributions matches the real data. This goes into chi-square distribution for goodness-of-fit testing for input analysis. Then post-simulation, how do you know the confidence interval of your results (e.g. whats is the 95% confidence interval for your mean), it also deep dives into running multiple replications of your simulation and getting the confidence interval of your results. Lastly, how do you compare the simulation from different parameters ran for your simulation (e.g. does 4 servers in a restaurant reduce waiting time vs 3 servers in a restaurant). I felt this section was the most relevant for simulation for me. This forms the bulk of Finals.",
                        "id": "nAphTJxjOsHb6vxQhw8joM",
                        "difficulty": 3,
                        "_createdAt": "2024-07-28T10:19:20Z",
                        "_type": "review",
                        "_id": "nAphTJxjOsHb6vxQhw8joM",
                        "authorId": "+f0pupb29VclcTpEosLxyg==",
                        "workload": 10,
                        "_rev": "nAphTJxjOsHb6vxQhw8jl4",
                        "rating": 5,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME"
                        },
                        "_updatedAt": "2024-07-28T10:19:20Z",
                        "course": null,
                        "created": "2024-07-28T10:19:20Z"
                    },
                    {
                        "_type": "review",
                        "workload": 8,
                        "_createdAt": "2024-07-23T14:15:33Z",
                        "_id": "W0COWgSkHirTIh5E8ckTSm",
                        "_updatedAt": "2024-07-23T14:15:33Z",
                        "created": "2024-07-23T14:15:33Z",
                        "body": "I loved this class and loved professor Goldsman. The concepts were somewhat tough to grasp, especially since I haven't fooled around much with statistics and calculus since my undergrad, but the course is almost fully self-contained and dose a decent job of providing bootcamps for any and all concepts that are covered in the class. I really appreciate that the lectures are made as easy as possible to follow given the content and that you can tell that Professor Goldsman truly cares about the material he is teaching. My only gripe is that I would have really enjoyed getting more hands on experience with simulation software like Arena or SimPy in the class, as it is primarily focused on the theory and math that supports simulation. If Professor Goldsman offered a course that follows this one which focuses more on the software and application side of simulation, I would strongly consider taking it. ",
                        "semester": {
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester"
                        },
                        "rating": 5,
                        "course": null,
                        "id": "W0COWgSkHirTIh5E8ckTSm",
                        "_rev": "W0COWgSkHirTIh5E8ckTS3",
                        "difficulty": 4,
                        "authorId": "8lbEmMejN1JrEVsQp6Li/Q=="
                    },
                    {
                        "_type": "review",
                        "workload": 15,
                        "created": "2024-05-03T20:36:53Z",
                        "course": null,
                        "id": "3iJXba0TymhgT1yWLcFssd",
                        "_rev": "3iJXba0TymhgT1yWLcFsos",
                        "_createdAt": "2024-05-03T20:36:53Z",
                        "_id": "3iJXba0TymhgT1yWLcFssd",
                        "_updatedAt": "2024-05-03T20:36:53Z",
                        "rating": 5,
                        "authorId": "Y3OtCPu3/xgt+FIjsr7krw==",
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "body": "I loved this course and its content. All of it is very well delivered and often entertaining. My difficulty rating is based on my challenge with catching back up on the prerequisites of calculus, probability, and statistics. It had been fifteen years since I had calc and slightly less since probability and statistics. So please use this review as a warning to bone up on the topics. I did hope for a little more of the application of simulation - either by hand or in Arena. My final comment is that I already have experience with other simulation software, and Arena falls in dead last place regarding ease of use and intuitiveness. Godspeed. ",
                        "difficulty": 4
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN"
                        },
                        "_createdAt": "2024-05-03T18:06:50Z",
                        "body": "This is an exceptionally well designed course. What I loved about this course was that the content is challenging and complex, but if you watch the lecture videos you develop a pretty good understanding. The content is presented in an entertaining yet rigorous manner. You'd love this course if you enjoy mathematical derivations (they don't test you on those directly, but, I have had to rely on the derivations during the exams because I forgot an equation or something). \n\nI generally struggle with complex topics and usually need to brute force my way to understanding them, but if you are someone who picks things up quickly you could probably get away with <10hrs a week. The exams are not very challenging, but you can't show up and expect to do well. They do include a few gimmes and a few freebies in the exam. I don't know where the final curve will land, but even if I make a B in this course, I am happy with the content I learnt. ",
                        "difficulty": 5,
                        "course": null,
                        "_type": "review",
                        "workload": 14,
                        "_updatedAt": "2024-05-03T18:06:50Z",
                        "id": "USiAdFvBMiQ4gP2XFh1GKN",
                        "_rev": "USiAdFvBMiQ4gP2XFh1GHk",
                        "authorId": "y73u2Pv8nRAIEttDMctHig==",
                        "created": "2024-05-03T18:06:50Z",
                        "rating": 5,
                        "_id": "USiAdFvBMiQ4gP2XFh1GKN"
                    },
                    {
                        "difficulty": 5,
                        "_rev": "mqJGDfC7Skica06Vv1uDOy",
                        "id": "mqJGDfC7Skica06Vv1uDSA",
                        "created": "2023-08-04T02:29:31Z",
                        "authorId": "Pqc0oBP00i24fWaUAIuZDQ==",
                        "body": "Simulation is an exceptionally well-designed course. The lectures are fantastic, the instructors are very accommodating, and there is abundant supplemental material to help you succeed. There is nothing negative to say about the course that I can think of, but there may be some reasons you may not want to take it if you are in the OMSCS program, like I am. (I suggest you take this if you are in OMSA, and it may even be required.)\n\nIn short, this is a math class. There isn't too much hands-on and there is a lot of material and the tests are tricky if you do not have a solid stats background. I read that this was supposed to be an easier class I could take over the summer - at least the reviews on OMS Central indicate that is true. But I found it a lot more challenging and difficult to study over the summer months. In the end, I think I lacked the statistical and match background to breeze thru this course, and I would have preferred something a little more hands-on. I was considering enrolling in OMSA after completing OMSCS, but if the level of required stats is anything indicative of this course, I think I am going to have to pass. More about the course...\n\nThe instructor, Dr. David Goldsman, is very knowledgeable and articulate. His presentations are easy to follow and map very well to the assignments. He is funny and tells lots of subtle jokes. He also looks and sounds much like Larry David, and I kept having \"Curb your Enthusiasm\" flashbacks. His lectures, for this reason, are fun to listen to and are as enjoyable as high-level statistic lectures can be.  He pokes fun at Justin Bieber and the University of Georgia a lot, but it is all in good fun.\n\nDr. Goldsman also is quite present on Piazza and involved in the class. More so than most other professors in the OMSA/OMSCS program. He is a hoot and an excellent instructor. \n\n \n\nThe TAs are also fantastic. Especially the lead instructors are exceptionally knowledgeable and do a great job providing timely answers on Piazza, and their PowerPoints supplement lectures and are helpful for the homework assignments. The TAs, especially the lead TAs, go to great lengths to answer anything on Piazza. They are outstanding.\n\n \n\nPro Tip - every week, the TAs review the upcoming homework assignment. They provide a recorded video lecture and PowerPoint. These are fantastic resources and will help you do well on the homework. A few of the early office hours had TAs that were a little dry, so I didn't attend the early semester office hours but realized halfway through the class that this was a huge mistake. \n\n \n\nMost of the course grade comes from 2 exams and a final. Together those three items are 80% of your final grade. The homework assignments are important because they help you study and prepare for the exams. They are due weekly and are not that bad, but some are tougher than others, and they require that you watch the lectures and work through some of the problems. I appreciate that they were due weekly cause it made studying for the exams much easier by forcing me not to fall behind.\n\n \n\nThe homeworks were worth 10%, and the project was worth another 10%. The project is a group project and, like any other group project, is a cluster. A typical 4-person team consists of one person that does absolutely nothing, one that is moderately useful, one that is an endless stream of bad ideas, and one that is a hero. I was the moderately useful one on my team. Since it was only worth 10%, it was hard to get motivated because the course was fast-paced, and it always felt like there was an exam that you had to prepare for. \n\n \n\nThe project and software used to do simulations was Arena. It is good, but it felt like an afterthought since so much of the class tests math and stats. Even after finishing this course, I am not confident I could model a medium-complexity simulation with Arena.\n\n \n\nWhy you may not want to take this course, especially those in OMSCS\n\n \n\nThis is a math course. If you have a solid statistics background, and by solid, I mean you were a stats or math major as an undergraduate or work as an actuary, then this class will be easy peasy. If you are just ok at stats and math (like me), this class can be challenging and will require you to work. Do you want to take a math course, or do you want to do hands-on projects involving simulation? This class is more of the former; you may prefer the latter, and if so, you should carefully consider taking this course as one of your free electives. \n\n \n\nI took this class in the summer, and although I enjoyed the topic, I found it difficult to motivate myself. The schedule was tight because it was summer, and there was little to no downtime. (This will be the last summer course I ever take) Even during weeks when there was an exam or project deadline, you still had homework due. There is even a homework assignment the week of the final. Piazza is really busy, and impossible to keep up with all the posts. \n\n \n\nOne of my major disappointments was that the simulation focused mainly on 'industrial' or 'resource-based' simulations. Simulations where you have physical resources like a help desk, or a factory assembly line, or elevator, or you get the point. The Arena software by Rockwell is really good at these types of simulations. But I was more interested in Monte Carlo simulations related to finance, stock portfolios, options trading, card games, etc. Many of these can be done with Python or Excel, and Arena is probably not the best tool. The instructor does touch on these topics, and you certainly will have the tools to tackle these types of simulations after the course, but I was hoping for more hands-on simulation work in this area. \n\n \n\nIn conclusion, this is a fantastic, well-put-together course in which you will learn a lot of math and statistics that will be helpful in many other classes in graduate school and beyond. The instruction is top-notch for an online course, and you have everything you need to be 100% successful. The instructors are very active on Piazza, and there are many opportunities to interact with instructors via Zoom during office hours. The supplemental materials are excellent. I haven't received a grade yet cause the class is still in progress. However, the instructors have hinted that there will be a generous curve, and there have been plenty of bonus and extra credit opportunities along the way. As an elective, be advised it is less hands-on than other courses in the OMSCS program. There is a slight industrial systems engineering focus rather than a financial modeling focus and approach. Either way, this class is great, and I recommend it to anyone interested in the topic.\n\n \n\n",
                        "_id": "mqJGDfC7Skica06Vv1uDSA",
                        "rating": 4,
                        "course": null,
                        "_createdAt": "2023-08-04T02:29:31Z",
                        "_type": "review",
                        "workload": 15,
                        "semester": {
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2023-08-04T02:29:31Z"
                    },
                    {
                        "_updatedAt": "2023-05-11T17:28:46Z",
                        "difficulty": 4,
                        "created": "2023-05-11T17:28:46Z",
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09"
                        },
                        "_createdAt": "2023-05-11T17:28:46Z",
                        "_type": "review",
                        "_rev": "bKSRXDuTtNOB1Cc926ZfYc",
                        "id": "bKSRXDuTtNOB1Cc926Zfbz",
                        "_id": "bKSRXDuTtNOB1Cc926Zfbz",
                        "body": "Wow, this course is really challenging! In OMSA, you have to choose between Simulation or Optimization theory, and it's a math course. The class covers a lot of advanced statistical concepts, such as conditional probability, discrete uniform distribution, covariance and correlation, and continuous distributions. You'll also learn about things like inverse transform theorem for continuous random variables, hand simulation, Monte Carlo integration, Arena Simulation, random variate generation, input analysis, output analysis, comparing systems, and more. Each week, new topics were introduced, which was both exciting and daunting (mostly daunting). One important lesson I learned is that, For God's sake it's best to use a commercially available random number generator instead of creating your own.\nYou will be doing some (1/3) simulation in class. Professor leads you through various simulations utilizing Arena and provide you with tools/use cases to experiment with or expand your knowledge by digging deeper. Professor is always emphasizing right way to simulate using theory.\nThe best things about this course are Dr. Goldsman and his TAs. Dr. Goldsman is funny, interesting, and respectful towards everyone. He helps students who are struggling with the course material and provides them with the necessary tools to succeed. He gives entertaining talks and has some opinions about Justin Bieber and the University of Georgia. Dr. Goldsman also posts all assignments within the first week of class, which I found helpful. The final grade is based on three tests (80%), thirteen homework assignments (10%), and a project (10%). If you like statistics, you will enjoy this class\n\n\nI pursued computational data track from omsa more reviews here: https://www.linkedin.com/pulse/georgia-tech-omsa-program-review-sid-gudiduri/",
                        "course": null,
                        "authorId": "fSCmQXFvyfSsoe2WxkpPJA==",
                        "rating": 3
                    },
                    {
                        "_updatedAt": "2023-05-11T10:35:10Z",
                        "rating": 5,
                        "_type": "review",
                        "id": "3KqS0NOF6YxT8AZtXEiRuu",
                        "course": null,
                        "body": "I was nervous for this class based on past reviews. My probability and statistics background was limited. Exams are worth 70% of your final grade so it is imperative to do well on exams. I purchased the notes on OMSCS Notes (https://www.omscs-notes.com/simulation/welcome) to help study. The OMSCS notes also provide pdf “cheat sheets” that I used while doing homework and studying for exams. In addition, Professor Goldsman has condensed lecture slides available on Canvas. I recommend using the condensed lecture slides since they are searchable i.e. Ctrl-F. \n\nDr. Goldsman offered two office hours to meet and greet which I really enjoyed. Dr. Goldsman lectures are funny and engaging. He also really hates Justin Bieber! \n\nThe TAs are very helpful. They respond quickly to questions and genuinely want to help you succeed. Shout out to TA Michael! \n\nGroup\t: Weight\nHomework : 10%\nMidterm Exam 1 : 25%\nMidterm Exam 2 : 25%\nFinal Exam\t : 30%\nProject : 10%\nBonus : 2.5%\nTotal : 102.5\n\nCurves: \n\nDr. Goldman curves final grades, however the curve is unknown. My final grade in Canvas was 83.32% and my final grade in OSCAR is an A.\n\nDr. Goldman incentivized students to complete the CIOS class survey. If the class response rate was at least 85%, Dr. Goldman was going to add 1% to ALL student total scores AFTER he determined grade cutoffs! It is unknown if the class response rate was at least 85%.\n\nExam scores:\n\nExam 1: 64 / 100\nMean: 80.11 \nMedian: 82\nHigh: 100 \nUpper Quartile: 88\nLow: 31 \nLower Quartile: 73\n\nExam 2: 85 / 100\nMean: 77.73 \nMedian: 80\nHigh: 100 \nUpper Quartile: 87.5\nLow: 30 \nLower Quartile: 70\n\nFinal Exam: 80.5 / 100\nMean: 76.3 \nMedian: 76\nHigh: 100 \nUpper Quartile: 85\nLow: 43 \nLower Quartile: 67\n\nFinal grade:\n\nMy final grade in Canvas was 83.32% and my final grade in OSCAR was an A.",
                        "_createdAt": "2023-05-11T10:35:10Z",
                        "created": "2023-05-11T10:35:10Z",
                        "difficulty": 4,
                        "_rev": "3KqS0NOF6YxT8AZtXEiRsH",
                        "_id": "3KqS0NOF6YxT8AZtXEiRuu",
                        "workload": 15,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z"
                        },
                        "authorId": "Ipn6pz/33dUtBXzd1DzXSA=="
                    },
                    {
                        "difficulty": 5,
                        "_rev": "AnVLGnCOep77YjL1syQhO2",
                        "authorId": "LbkJ5Fdyb2/vZxctOGXl3g==",
                        "semester": {
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester"
                        },
                        "rating": 5,
                        "course": null,
                        "_id": "AnVLGnCOep77YjL1syQhOt",
                        "_updatedAt": "2023-05-10T15:09:00Z",
                        "workload": 15,
                        "_type": "review",
                        "created": "2023-05-10T15:09:00Z",
                        "body": "I am fresh out this course and very astonishingly ended up with an A at a score of 85%. There is a lot of content in this course so one must approach it strategically as the exams are very strategically designed too. The course content is so beautifully curated that there is a lot of repetition of the content that Prof. Dave really want you to learn by the end of the course. In the garb  of simulation Georgia tech and Prof. Dave really want your probability and statistics fundamentals to become strong. With the practical application to simulation, the fundamental concepts really begin to sink and stick much better than they would with a general probability and stats course. So play close attention to the topics that he keeps bringing up over and over again like Inverse Transform theorem etc. I absolutely loved the course despite pairing it with another difficult course and facing numerous personal challenges along the way. ",
                        "_createdAt": "2023-05-10T15:09:00Z",
                        "id": "AnVLGnCOep77YjL1syQhOt"
                    },
                    {
                        "course": null,
                        "_updatedAt": "2023-05-09T16:06:03Z",
                        "_id": "3KqS0NOF6YxT8AZtWyDpUq",
                        "body": "The course is interesting, i learned a lot. But there is a lot to learn - there is so much to remember for the exams. The exams are not that difficult and somehow still did not score very well. ",
                        "workload": 15,
                        "difficulty": 5,
                        "_createdAt": "2023-05-09T16:06:03Z",
                        "created": "2023-05-09T16:06:03Z",
                        "authorId": "Im6NgszjbUjUpeynaAKcXA==",
                        "id": "3KqS0NOF6YxT8AZtWyDpUq",
                        "_rev": "3KqS0NOF6YxT8AZtWyDpSD",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN"
                        },
                        "rating": 4
                    },
                    {
                        "difficulty": 1,
                        "_type": "review",
                        "id": "YEMddueUW7s3BEKxrWF3vn",
                        "rating": 5,
                        "_rev": "YEMddueUW7s3BEKxrWF3t5",
                        "course": null,
                        "_id": "YEMddueUW7s3BEKxrWF3vn",
                        "authorId": "QaHiGrgd+Pjfq59R17SqTA==",
                        "body": "Too easy for me. ",
                        "_updatedAt": "2023-01-26T14:19:41Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx"
                        },
                        "workload": 12,
                        "_createdAt": "2023-01-26T14:19:41Z",
                        "created": "2023-01-26T14:19:41Z"
                    },
                    {
                        "_updatedAt": "2023-01-02T16:20:13Z",
                        "_createdAt": "2023-01-02T16:20:13Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3"
                        },
                        "_rev": "ojGpuoLqWcC94EPn4GKrm5",
                        "_type": "review",
                        "rating": 5,
                        "difficulty": 4,
                        "created": "2023-01-02T16:20:13Z",
                        "authorId": "PKuhVw7PaTpzOBz3e4Jt/A==",
                        "id": "ojGpuoLqWcC94EPn4GKrpq",
                        "body": "I just finished this class in Fall 2022.  I give thumb up to Prof. and TAs. Prof. David is very hilarious with sense of humor. He cares for his students and loves to know more on students.  Prof. David sent me an individual email to remind me that I should revisit his preliminary course (Stat and Calculus). I could not remember the names of the courses. I felt like he concerned over my struggle in first few weeks. \nFor TA, Michael and James are the best. They responded promptly after I posted questions. sometimes, I am yelled a bit if I do not understand and kept asking from dumb to deepen advanced question. Believe me. If you do not understand, keep asking! These TAs love you and  will advise you until you get it.  They are the best!\nFor exams, there are three exams: Midterm 1,2 and Final. The most difficult one for me is Final Exam because there are many stuff appeared on the exam. I strongly recommend you to form study group like 2-3 persons. You can observe them who ask many questions with good logic thinking and persuade them to join  both study group and project group. Exam practices are very important. You should get through it all. At least, you should hit 75% of exam score.  Total of exam is 80% of grade. If you do well in the exams, you will have high chance to ace A.  Project grade is 10%. As recommended, you should form good group for study and project group. \nProf. David is very generous in grading as I heard from broad curve. If he can remember you from questions you asks or participate. It may be good for you to have good bonus score. In my case, I did bad in final exam (85%) but my first two midterms went well. I earned 95% in my total grade and ace A(letter grade).  \nLast but not least, throughout the course I struggle in understanding on many parts of modules but please keep asking. Learning with curiosity and fun will help you get through the course.  Best of Luck!",
                        "workload": 9,
                        "_id": "ojGpuoLqWcC94EPn4GKrpq",
                        "course": null
                    },
                    {
                        "course": null,
                        "_id": "wLTa6yNrbnanFt9Yb8BjLc",
                        "rating": 3,
                        "id": "wLTa6yNrbnanFt9Yb8BjLc",
                        "workload": 10,
                        "authorId": "LbTDp+NSTYKrwb5GAd3F1Q==",
                        "created": "2022-08-09T13:52:53Z",
                        "difficulty": 4,
                        "_rev": "wLTa6yNrbnanFt9Yb8BjHI",
                        "_type": "review",
                        "_updatedAt": "2022-08-09T13:52:53Z",
                        "_createdAt": "2022-08-09T13:52:53Z",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf"
                        },
                        "body": "I was really excited for this class. I enjoyed the simulation module in ISYE 6501.\n\nBut this class wasn't what I expected. I thought we would focus on the different aspect of making a successful simulation... both in setup and in review and analyzing the output. Really that is just Module 9 and Module 10 which were both very in-depth but they felt like they should've been half the class not 20%.\n\nInstead we spent a ton of time on Math and talking about how to generate random numbers and how to turn uniform random numbers into various distributions. And I just don't see myself ever using that in my job. I want to run a warehouse simulation for my company and I can do a very basic one, but I don't think I learned enough about simulation for it to really be that good.\n\nFor normal people I am very good at math, but for the people in this program I am bad at math and not great at Calculus. So this course was difficult for me. I got a 71% which when curved was a B, so I can't complain. This is my first 5th course in OMSA and first I didn't get an A in. I attribute that to my own math skills (or lack of). If you're good at Calculus I don't think you'll have a problem with this course.\n\nProf. Goldsman is hilarious and a lot of fun and I enjoyed his lecture videos. Again I just wish we had changed the distribution of how much we talked about certain subjects."
                    },
                    {
                        "authorId": "OpUSQ3NZVQXfqz63sty3lQ==",
                        "created": "2022-08-07T02:41:17Z",
                        "_createdAt": "2022-08-07T02:41:17Z",
                        "_id": "LZcH8OQfhbE1IkMdNI06DK",
                        "rating": 5,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 4,
                        "id": "LZcH8OQfhbE1IkMdNI06DK",
                        "course": null,
                        "workload": 10,
                        "body": "I love this course so much. The ability of Professor to teach math with fun is beauty of the course. TAs are awesome. Grade distribution is 2.5% bonus, 25% on Midterm 1, 25% on Midterm 2 , 30% on final , 10% on project and 10% on homework’s. If you able to watch weekly videos , homework’s are doable.  ",
                        "_updatedAt": "2022-08-07T02:41:17Z",
                        "_rev": "LZcH8OQfhbE1IkMdNI06CY",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-afe7dcb8-8443-4157-8e3a-83f1b34ad9d7",
                        "created": "2022-05-08T15:40:49Z",
                        "_id": "external-import-afe7dcb8-8443-4157-8e3a-83f1b34ad9d7",
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "semester": {
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z"
                        },
                        "body": "I don't normally leave reviews for OMSA courses, but when I do, its for Simulation and Modeling.\n\nIf you possess good calculus and statistics knowledge and ability, this class will likely be of little difficulty for you.  However, if you are like me, i.e. old and forgetful of the calculus you learned 15-20 years ago, there will be a struggle.\n\nA good deal of the material feels theoretical; apart from a few Arena simulations and the course project, I don't feel I learned much in the way of how to apply most of this course to the \"real world\", which for me is almost the entire reason for going back to school.  I think I would have appreciated assignments that were more \"hands on\" and grading that wasn't so exam-centric, as 80% of the course grade is based on 3 tests.\n\nProfessor Goldsman does a great job to inject levity into subject matter that's otherwise quite dry and unexciting.  The TAs do a good job of running the course as well.\n\nBottom line: make sure you brush off your calculus and statistics skills before you take this class and you should be fine.\n\nStay nerdy, my friends.",
                        "_createdAt": "2022-05-08T15:40:49Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 7,
                        "difficulty": 4,
                        "_type": "review"
                    },
                    {
                        "created": "2022-05-08T10:18:25Z",
                        "course": null,
                        "workload": 5,
                        "rating": 3,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "difficulty": 2,
                        "_createdAt": "2022-05-08T10:18:25Z",
                        "id": "external-import-ba98b700-c6b0-40e1-bdd2-73c40b0a206b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "body": "OMSCS, Stats background. This course is soft and gentle, and a good refresher. The professor makes sure to throw in free (funny) points. There are simulation materials that are good to be aware of, but I'm not sure I'd use them. Even if you are not strong in maths, exams are not that hard (seriously, make good cheat sheets and you don't need to worry much). Grading on the project is also lenient. All in all, this is a breather, fine choice if you want to do a two-course sem and simulate your maths a bit.",
                        "_id": "external-import-ba98b700-c6b0-40e1-bdd2-73c40b0a206b"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "body": "If you are good at learning theoretical concepts, this course is for you. The course is not bad, but not the best either. The professor makes a big curve at the end of the semester, so earning a high D+ represents B",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "workload": 10,
                        "_type": "review",
                        "rating": 3,
                        "id": "external-import-b3658016-892e-4182-8206-1783ec976686",
                        "created": "2022-05-07T19:10:37Z",
                        "_id": "external-import-b3658016-892e-4182-8206-1783ec976686",
                        "difficulty": 3,
                        "_createdAt": "2022-05-07T19:10:37Z"
                    },
                    {
                        "_id": "external-import-5847d984-46a7-4d2d-b945-d9880243d33e",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "id": "external-import-5847d984-46a7-4d2d-b945-d9880243d33e",
                        "workload": 12,
                        "rating": 2,
                        "course": null,
                        "difficulty": 4,
                        "_type": "review",
                        "body": "I don't understand the hype on this course. I felt like I learned more from exam review sessions than the course itself. Too much is crammed into 14 weeks and I don't feel like I learned much, if any, practical implementation of simulations. You almost can't avoid this class, but from other reviews, I thought it would be amazing and it wasn't. ",
                        "created": "2022-05-06T13:14:09Z",
                        "_createdAt": "2022-05-06T13:14:09Z"
                    },
                    {
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "rating": 4,
                        "_id": "external-import-81f9ad5e-daba-4f14-aa08-1806990c8de4",
                        "_createdAt": "2022-04-24T04:22:30Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-81f9ad5e-daba-4f14-aa08-1806990c8de4",
                        "created": "2022-04-24T04:22:30Z",
                        "workload": 4,
                        "body": "Pretty stats heavy for most of the class, then a portion on ARENA. Interesting concepts to learn about stats-wise but don't see simulation/ARENA being super applicable for most professionals. Tests and homework are pretty conceptual so fully understanding every detail of the stats is not completely necessary. Overall a relatively enjoyable class.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_type": "review"
                    },
                    {
                        "difficulty": 5,
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "_id": "external-import-bc30ddd8-22b4-4c57-ba83-6ad4bb282a85",
                        "rating": 4,
                        "workload": 15,
                        "created": "2022-04-23T15:42:56Z",
                        "_createdAt": "2022-04-23T15:42:56Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "course": null,
                        "body": "The material is really dense and the class is hard if you aren't fluent in calculus and stats, but it's one of the better classes I've taken in the program. The actual simulation work/questions are really easy, but the course focuses a lot on the theory behind how the simulations work. For example, you'll learn Monte Carlo Simulations, there will be questions and assignments on it - easy enough. But then there will also be questions on the math powering it and the math powering the math that powers it, etc. \n\nHard class, but a really good one. And yes, the curve is thankfully enormous.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-bc30ddd8-22b4-4c57-ba83-6ad4bb282a85"
                    },
                    {
                        "course": null,
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "workload": 10,
                        "_id": "external-import-7f977472-56dd-495a-b7fc-ee91dcd5d4b4",
                        "body": "I took Calculus over 20 years ago.  I am glad I took this course to help me shake off some of the rust.\n\nI think the course does a nice job of being both theoretical and practical. Aspiring data scientists should not shy away from the mathematical underpinnings of the things discussed in this course. Do you really want to be someone who just runs functions created by others and hope they work and are mathematically sound? Do you really only want to have a surface level understanding of things and not be able to extend or expand?\n\nI'm frankly a little embarrassed and disgusted by some of the attitudes of my fellow classmates here, on Piazza, and in Slack related to being anti-math. You shouldn't be doing an analytics degree if you didn't want to have to do math. Get over it.",
                        "_createdAt": "2022-03-29T13:42:08Z",
                        "id": "external-import-7f977472-56dd-495a-b7fc-ee91dcd5d4b4",
                        "created": "2022-03-29T13:42:08Z",
                        "_type": "review"
                    },
                    {
                        "rating": 1,
                        "workload": 15,
                        "id": "external-import-5d1a0bcf-4766-4a63-b8b4-a692f3f4d32f",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7"
                        },
                        "_id": "external-import-5d1a0bcf-4766-4a63-b8b4-a692f3f4d32f",
                        "body": "This class is dreadful. I am providing a review for the contents of this class and not so much the people - the people were nice and everyone tries to be helpful. Professor is passionate about the subject, is responsive even when I ask him a direct question on piazza, etc. The people have exceeded expectations and I don't think I would change anything. Organization is great as others have mentioned below.\n\nI will solely lament over the materials in this class. I won't repeat everything that has been mentioned before (yes, very math intensive and has tons of mathematical concepts about generating random variables, way too many materials and modules). If you are like me and you have a heavy business background, you may have done well in Calculus back you were in high school like 12-15 years ago, you will struggle in this class. I did both AP Calculus AB and BC in high school and did great in both classes, I even used to consider myself pretty good in calculus. But that was 15 years ago. It has been 15 years since I tried to calculate the integral of anything. So yeah if you're like me, you will not just struggle. You will roll your eyes, maybe plunge into multiple panic modes in the semester after seeing ungodly mathematical proofs or concepts that you're struggling to follow. The concepts are built upon each other, so if you don't understand the beginning then you will continue to struggle till the end. If you majored in math or stats, then this class is probably fine for you, or even interesting. I never got to the point of appreciating the topics because I'm just struggling through mathematical equations and concepts 90% of the time.\n\nThis is my last and least favorite class in the program.\n\nAdded after reading an above comment: Some of y'all need to chill out. No need to be \"disgusted\" because others are struggling with math while you are not :) Not all analytics professionals are math wizards. Analytics professionals are allowed to be scared of math. Some of us are trying to cross the ocean from one profession to another. Everyone is different. Just because some people struggle in this course, does not mean they will be a terrible analytics professional. Learning lasts a lifetime. If you're discouraged because comments like above, please don't be. Struggle through the class and then move on with your life. Maybe you'll do real life simulations at work and things will start to click for you. If we were all wizards we wouldn't need to be in this kind of program.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 5,
                        "created": "2022-03-29T04:08:25Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_createdAt": "2022-03-29T04:08:25Z"
                    },
                    {
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 15,
                        "id": "external-import-5db9693c-9932-4f8c-bf7f-fb46e0785272",
                        "created": "2022-02-06T13:10:00Z",
                        "_createdAt": "2022-02-06T13:10:00Z",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-5db9693c-9932-4f8c-bf7f-fb46e0785272",
                        "body": "This is a great course with a lot of theory and applied knowledge.  The instructor and TAs are extremely responsive.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        }
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 15,
                        "_createdAt": "2022-01-14T12:57:50Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "id": "external-import-49c0611b-e23a-4719-8865-a6eca3417d69",
                        "created": "2022-01-14T12:57:50Z",
                        "_id": "external-import-49c0611b-e23a-4719-8865-a6eca3417d69",
                        "body": "What a great course that strikes a balance behind some of the \"nuts and bolts\" and applied simulation. \n\nIf your complaint about this course is that it is only about generating random variates then 1) you weren't paying attention and 2) you are probably weaker in math.  Not to sound harsh, but it seems like people focus on the mathy parts of the course and miss the forest for the trees.\n\nIf you're doing OMSA or OMSCS to become a \"button pusher\" then I can see how you might complain when forced to think deeper about what's actually going on behind the scenes.",
                        "difficulty": 3,
                        "rating": 5,
                        "course": null
                    },
                    {
                        "_id": "external-import-4620194c-9118-4049-90ff-913b18b60db5",
                        "body": "The course focuses on discrete event simulation; the point is mainly to understand what happens behind the scene and how to evaluate the results. It is not a series of tutorials on how to do simulations. This means that there is a lot of mathematics in the course. The difficulty level of mathematics will be perceived differently by different students according to the student’s background. For students with a STEM background, it should be very easy math. If you want a course where you do simulations, this is not a good fit.\n\nCompared to other courses in the program, I would say this one is one of the most well-organized and planned. The course load is well balanced over the entire semester and does not really cause pressure. The exams cover all the topics, so doing poorly in one part does not mean your grade will be severely affected.\n\nThe professor is undoubtedly one of the most engaging and manages to keep the students focused.\n\nIn earlier reviews, some students suggested some calculator models; however, I found the simple scientific calculator is more than enough; you don’t really need a graphing calculator; if you have one or can borrow one, great, but I don’t think you need to buy an expensive calculator to do the exams.\n",
                        "difficulty": 1,
                        "id": "external-import-4620194c-9118-4049-90ff-913b18b60db5",
                        "created": "2021-12-21T14:34:32Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-12-21T14:34:32Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 5,
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall"
                        }
                    },
                    {
                        "_createdAt": "2021-12-16T19:10:40Z",
                        "rating": 5,
                        "workload": 10,
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-3b524be1-42d2-4b7a-a18a-8472179431b2",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "This course is awesome.\n\nIf you really think this was only a course in how to generate random variates, then you weren't really paying attention (and most likely have a weak mathematical background and got too focused on it and were playing catch up).\n\nAs with many graduate level courses, there is part of the responsibility on the student to research and do things that aren't necessarily forced on them. If you're in a graduate program and only do what is asked of you because it is graded then you need to readjust your attitude.\n\nThere is PLENTY of opportunity to simulate things in this course. If you don't think there was then you weren't paying attention.",
                        "difficulty": 3,
                        "_id": "external-import-3b524be1-42d2-4b7a-a18a-8472179431b2",
                        "_type": "review",
                        "created": "2021-12-16T19:10:40Z"
                    },
                    {
                        "workload": 10,
                        "_id": "external-import-cf1d8df0-34f7-439c-a70b-fb74b14c93d6",
                        "body": "I loved that there were weekly homework assignments. They kept me engaged in the material. Other courses that have bigger assignments spaced out cause students to engage, procrastinate, engage right before the deadline, etc.\n\nI liked learning about Arena. People in this program sure do like to complain about specific tools. If you're a data scientist, you know that one of the key skills is learning random tools whenever you need to. I don't see what the fuss is all about. Just because you don't think Arena is useful doesn't mean it's not used in industry. \n\nI liked the Arena exam questions. They were an opportunity for basically \"free points\" on the exam. I don't understand why anyone would ever complain about that especially since people ask about grades like every 5 minutes in Piazza or Slack it seems like. Take your free points and absorb knowledge about a tool you've probably never seen before. It's a win-win-win.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "course": null,
                        "_type": "review",
                        "id": "external-import-cf1d8df0-34f7-439c-a70b-fb74b14c93d6",
                        "created": "2021-12-16T12:19:44Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_createdAt": "2021-12-16T12:19:44Z"
                    },
                    {
                        "body": "I have a degree in statistics and I am working as a data scientist. \n\nI learned some new things in the course, and Dave is absolutely a great lecturer.  Having said that, there are some problems in this course, in my opinion. \n\nMy suggestions - \n\n1)\nThere are way too many things to submit - 13 homework submissions , 3 exams and 1 project.  \nMy suggestion is to trim the number of submission by half, and perhaps give 1 or 2 exams instead of 3, and increase the number of simulation projects to 2 or 3. \n\n2)\nARENA - an outdated software almost no one uses. Instead, either move to Python or R or just let the students deal with it (and remove the lectures about ARENA or just provide them as optional). While ARENA is not mandatory to use in the project, there are still questions about it in the exams!\n\n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "rating": 2,
                        "semester": {
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "created": "2021-12-16T09:41:29Z",
                        "course": null,
                        "_id": "external-import-77fe4c38-c026-4350-8732-a000bacce1f4",
                        "difficulty": 3,
                        "_createdAt": "2021-12-16T09:41:29Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 7,
                        "id": "external-import-77fe4c38-c026-4350-8732-a000bacce1f4"
                    },
                    {
                        "created": "2021-12-14T01:14:33Z",
                        "workload": 15,
                        "body": "I for one am glad that some of the \"magic\" behind random variate generation is taught.\n\nThe worst data scientist are those that only know how to import libraries or call functions without any inkling of how they work or how to check if they are working as intended.\n\nIf you are doing OMSA to \"push buttons\" then don't criticize courses that force you to understand more of the nuts and bolts behind it. You won't last long in the profession and you make everyone else look bad.",
                        "difficulty": 2,
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "id": "external-import-f283b429-7de0-45d8-9388-139a1b9e04dc",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-12-14T01:14:33Z",
                        "_id": "external-import-f283b429-7de0-45d8-9388-139a1b9e04dc"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-646c6d1f-8972-4a10-9df4-6377b143a57f",
                        "created": "2021-12-13T19:46:47Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "workload": 6,
                        "_createdAt": "2021-12-13T19:46:47Z",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-646c6d1f-8972-4a10-9df4-6377b143a57f",
                        "body": "I am coming from the CS side for this class and have taken college level statistics 4-5 times getting A's across my lifetime. Brining this up because I thought this class was going to be a breeze and more programming focused. Instead, I marathon studied for my C lol.\n\nPlease be aware this is almost entirely a math class. Despite some reviews talking about how trivial the math is, it's not for any person from a normal or even advanced background. If you have ever wanted to learn how the math behind stat programs and packages in R & Python calculate this is a great course. Personally, I enjoyed learning the math as I do have to explain things like this to regulators in my job. However, if you are looking for a class for developing advanced Python simulations, this is not the one. The last few weeks of intro to analytics modeling is a much better option for that.\n\nFew comments on the class - Instructor is fantastic and I found his dry humor very funny. The TA's are also awesome and their exam review videos were what carried me over the finish line. There are also a lot of bonus points in this course and its curved.",
                        "_type": "review"
                    },
                    {
                        "created": "2021-12-13T16:15:29Z",
                        "difficulty": 3,
                        "course": null,
                        "body": "This is really just an advanced stats class. I feel much of what we learn in this class will never be used by anyone. We spent multiple lectures on how to generate a random numbers and variables which for most people is useless and typing rand() will suffice. In addition this class has a lot of theory and less practical material.\n\nIn my opinion the most useful stuff is at the end of the class, such as non homogeneous Poisson processes and output/ steady state analysis.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 2,
                        "id": "external-import-fdbb9a0a-fd8c-4f38-a783-2a43b6992552",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_id": "external-import-fdbb9a0a-fd8c-4f38-a783-2a43b6992552",
                        "_createdAt": "2021-12-13T16:15:29Z",
                        "workload": 10
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_id": "external-import-afb790d0-4ddf-4b6d-a7de-86260808b85b",
                        "created": "2021-12-12T17:34:56Z",
                        "_createdAt": "2021-12-12T17:34:56Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 8,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-afb790d0-4ddf-4b6d-a7de-86260808b85b",
                        "_type": "review",
                        "difficulty": 4,
                        "rating": 5,
                        "body": "This is one of the better classes in the program.  It's very well structured and you end it happy you worked your way through it and better off in broader knowledge than when you entered - something that can't be said for some other courses in the program. The lectures are well designed and presented and the professor is engaging and adept at tying concepts together. The tests are tough, but fair, and the broader grading curve is more than lenient (though more about a lower threshold for a B; rumors of ~86 equating to an A fits a comparison of observed median grades to GT grade distribution reporting, but is likely still subjective... My 88.5 was a B, likely because my final test grade was quite a bit lower than MT1 and MT2).\n\nBut it is very math heavy, more a math course than a simulation course as other reviews have mentioned. The prerequisites are real and if you are, like me, someone who took those prerequisites 20+ years ago the first 6 weeks of this course will be a real struggle - but worth it if you power through it and review your calculus/probability on the side as you go while taking advantage of the many resources and office hour and previous test recordings, which were the best of any of the now nine courses I've taken in OMSA. Ignore the bratty \"how dare you not know this\" reviews and comments that you see here and in Piazza, etc., most likely from 23 year olds who took all this math two years ago, are impatient with everyone else who didn't, and who want everyone to know about it (not the best interviewing and working strategy, btw, for a real world job where you will be working for people who also took this stuff 20+ years ago)...  this is clearly a course designed (in the first portion) to catch the rest of us up, which it does very well. \n\nI do wish, like others, that we actually did more actual simulation - rather than the math behind it. The brief sections on ARENA looked interesting, but we never really dug into it beyond an overview. \n\n"
                    },
                    {
                        "id": "external-import-a8b3bd7c-5014-45fd-8970-5d4299280741",
                        "created": "2021-12-07T02:03:20Z",
                        "course": null,
                        "rating": 4,
                        "workload": 15,
                        "body": "I came into the course with a weak-to-moderate background in math/stats/probability, and now I feel like I can have an intelligent conversation on a wide range of these topics. Less hands-on simulation and problem solving than I'd prefer, but overall, I'd recommend this course because I feel the material is essential to being a good data scientist. Bonus points because we learned about Monte Carlo Simulation for expected stock market portfolio returns.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_id": "external-import-a8b3bd7c-5014-45fd-8970-5d4299280741",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_createdAt": "2021-12-07T02:03:20Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        }
                    },
                    {
                        "workload": 15,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_createdAt": "2021-11-17T17:58:21Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-b21926b8-582b-4d97-b965-ff80b4124450",
                        "created": "2021-11-17T17:58:21Z",
                        "_id": "external-import-b21926b8-582b-4d97-b965-ff80b4124450",
                        "body": "God bless the TAs who have to answer high school (and sometimes even middle school) level questions about probability and statistics.\n\nThese students really detract from the course experience. I can only imagine how much TA time is wasted doing this that could be better spent providing more feedback to students on projects and other deeper posts on Piazza.\n\nIt's a shame. The class is great; the students are not.\n\nIf you have weak math skills, then consider that you will need to do some additional work here and don't expect the TAs to teach you every single concept from the ground up as that is completely unreasonable.",
                        "rating": 5,
                        "course": null
                    },
                    {
                        "workload": 10,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-2ccc045b-d6e2-4410-9e38-f52a193ac639",
                        "created": "2021-11-07T18:25:23Z",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-2ccc045b-d6e2-4410-9e38-f52a193ac639",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "The class itself is fine. Goldsman's videos are entertaining. Some interesting stuff about random variate generation and other topics at the back-end of the class.\n\nThe problem really is other students and the complete waste of time (in my opinion) on high school and undergraduate level probability and statistics that its clear other students have not taken seriously as a prerequisite. Imagine if Goldsman didn't have to lower the bar for these students and we could actually get into some more graduate level simulation topics.\n\nI was only able to see the public questions in Piazza, but I can only imagine some of the crazy questions students ask in private. I'm embarrassed to think these people are my classmates and will most likely make it through the degree without having an understanding of basic probability and statistics.\n\nKudos to the TA team for their response time and for keeping Piazza organized. It still drives me crazy that people refuse to do even five minutes of searching on Piazza before asking a duplicate question.",
                        "_createdAt": "2021-11-07T18:25:23Z"
                    },
                    {
                        "id": "external-import-2f4dde72-cefe-47d6-a9ac-c98c9d926745",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 5,
                        "body": "Prof Goldsman is the best so far in OMSCS. His lectures are excellent and very engaging. Learnt a lot and happy that took this course. The mini-projects were good. There are 3 exams and they are cumulative/closed book. Exams are fair but definitely needs a good prep. Only thing I didn't like is the emphasis given to ARENA software in all the three exams. TAs are very helpful and quick in responding",
                        "_type": "review",
                        "semester": {
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z"
                        },
                        "created": "2021-08-24T17:12:40Z",
                        "difficulty": 3,
                        "course": null,
                        "workload": 12,
                        "_id": "external-import-2f4dde72-cefe-47d6-a9ac-c98c9d926745",
                        "_createdAt": "2021-08-24T17:12:40Z",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_type": "review",
                        "workload": 8,
                        "created": "2021-08-12T18:44:32Z",
                        "rating": 2,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-c00901f0-2bb4-4653-a06a-d655730e6a66",
                        "body": "I'm truly not sure why this class get such high praise, because I for one didn't find that I really learned anything about simulation. I had hoped that I would be able to walk away with much more than I did.\n\nThis is far more of a statistics class than it is a simulation class. (to me at least). I would also say that if you don't have a strong stats (or math in general) background, then I wouldn't recommend it. (Or, if you really want to learn about simulation) \n\nThe good thing is that the overall grade is made up of multiple categories, so if you don't do particularly well on any one item, it won't kill you. \n\nNote: My undergrad is in math from GT, and I took multiple classes on prob & stats. So my review is not like some of the others that were by those who appear to be missing the necessary foundation.",
                        "course": null,
                        "_id": "external-import-c00901f0-2bb4-4653-a06a-d655730e6a66",
                        "_createdAt": "2021-08-12T18:44:32Z"
                    },
                    {
                        "body": "From the comment below.\n\n> With my **limited stats and math background**, parts of this course felt fast-paced and difficult (mostly because of the pace) for me, especially in the beginning, and I found that overall, taking this course in the summer occupied more of my time than expected.\n\nPractically everyone has been warning us in OMSA [Slack](http://omsa-study.slack.com) and [Reddit](http://reddit.com/r/OMSA) that this course is a roller-coaster, especially so in the summer, if you do not have the required pre-reqs. It is your choice to take it against the advices of the community. Consider the fact that you did not have the pre-reqs prior to admission and that without the leniency of the OMSA Admissions Committee, you wouldn't be offered a seat anyway.\n\n**Moreover, It will be a strong disservice to give Prof Goldsman's class a huge dislike because you did not prepare well.**\n\n> I am taking OMSA mostly for practical applications to advance my career.\n\nThen you should be good in Math and Stats. Who in the right frame of mind would hire a Data Analyst that's inept in these 2 subjects?\n\n> but if I had a second chance to choose, I would pass on this course in favor of another.\n\nBruh, you sure you wanna take [Deterministic Optimization](https://omscentral.com/course/ISYE-6669) with your threadbare level of Math?",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-760990ad-e5cf-42cd-a6e3-45d060dd8875",
                        "difficulty": 1,
                        "course": null,
                        "workload": 100,
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-08-06T14:28:15Z",
                        "id": "external-import-760990ad-e5cf-42cd-a6e3-45d060dd8875",
                        "created": "2021-08-06T14:28:15Z",
                        "_type": "review",
                        "rating": 5
                    },
                    {
                        "rating": 4,
                        "id": "external-import-badc9b8a-6d6d-4b77-b968-b64789d2f13b",
                        "workload": 12,
                        "difficulty": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "body": "This course is recommended for someone who wants to improve upon their statistics and probability skills.  There is a lot of math, which can be challenging at times.  It starts off pretty fast, so try to keep up at the beginning and it will pay off.  Professor Goldsman is very reasonable, he wants everyone to learn as much as possible and if you show that you are working hard, you will at least get a B.  A good cheat sheet makes all the difference, be sure to write down all of the different distributions, their PDF, CDF, expected value, etc.  Overall, I liked the course.  This filled a gap in my knowledge and I'm happy that I took it.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-08-06T12:40:31Z",
                        "created": "2021-08-06T12:40:31Z",
                        "_type": "review",
                        "_id": "external-import-badc9b8a-6d6d-4b77-b968-b64789d2f13b",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null
                    },
                    {
                        "_id": "external-import-8404e8aa-b49e-4d24-abdf-d6af4d407483",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 2,
                        "id": "external-import-8404e8aa-b49e-4d24-abdf-d6af4d407483",
                        "difficulty": 4,
                        "_createdAt": "2021-08-04T23:08:26Z",
                        "_type": "review",
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "body": "### Context\n\nI have a strong programming background, but I am weakest in stats and math. I am taking OMSA mostly for practical applications to advance my career, and because I enjoy data science and analytics.\n\n### Review\n\nI was personally disappointed in this course and felt I wasted the slot on what could have been a more useful class. While the instructor and TA's were great and Goldsman definitely tried to add in some humor, I felt that much of the material simply won't be that useful for me in my career and that the videos were far too long.\n\nWith my limited stats and math background, parts of this course felt fast-paced and difficult (mostly because of the pace) for me, especially in the beginning, and I found that overall, taking this course in the summer occupied more of my time than expected. \n\nThe course shifts from periods of high intensity to periods of extremely low intensity where we review a simulation tool I'm unlikely to ever use (Arena), sort of like a rollercoaster. I found it much more helpful to look up videos online of the topics presented for math concepts than watching the videos presented in the course. I also found the tests to be largely about how good of a cheat sheet you'd created and either memorizing or looking up information and formulas to apply to problems. I'm personally not a fan of this style of work; I'd rather learn how to do and understand something deeply than how to build and read a cheat sheet with tons of obscure formulas and information on it. \n\nPerhaps, if I'd taken the course in a regular semester with more time to really digest the information I would have enjoyed it more, but if I had a second chance to choose, I would pass on this course in favor of another.",
                        "created": "2021-08-04T23:08:26Z",
                        "workload": 12,
                        "course": null
                    },
                    {
                        "id": "external-import-d22d5222-1e08-4e7a-8c46-ffff9a03f58c",
                        "_type": "review",
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 20,
                        "created": "2021-08-04T02:05:31Z",
                        "difficulty": 5,
                        "_id": "external-import-d22d5222-1e08-4e7a-8c46-ffff9a03f58c",
                        "body": "I found this course particularly difficult. I did learn a lot. The flow of this course is quite different from the other courses I've taken in the program. The exam questions are extremely mathematical and it felt like I was under a time crunch to get it all done in the time allotted for the exams. I honestly wish Arena was used more heavily, it was really only touched on in the middle for a few weeks. This course is also very heavily weighted on exams at 80% - another unusual aspect of this course relative to others in the program. Definitely expect to work hard and learn fast in this course, particularly if you don't have a lot of background in calculus, statistics, and probability. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-08-04T02:05:31Z",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        }
                    },
                    {
                        "_createdAt": "2021-08-02T14:17:36Z",
                        "id": "external-import-f2f03acc-7506-4606-b93e-4abdee006ec6",
                        "created": "2021-08-02T14:17:36Z",
                        "rating": 5,
                        "workload": 15,
                        "_id": "external-import-f2f03acc-7506-4606-b93e-4abdee006ec6",
                        "body": "Great professor. Engaging lectures. Great TAs. Challenging and engaging material. Ample extra credit opportunity (a surprising amount). \n\nYou absolutely need a very high level of comfort with the calculus and calculus based stats required by the program. The course is \"self-contained\" but it moves relatively fast. If you're not comfortable with calculus based stats this will not be a pleasant course to take.\n\nThe homework is good preparation for the exams and so are the knowledge checks. There are really interesting mini-projects to choose from. You can do your own but they have a list to choose from and their fun to think about. \n\nDr. Goldsman's reputation precedes him. He's great.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester"
                        },
                        "difficulty": 3,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null
                    },
                    {
                        "_id": "external-import-f91adde9-9dbd-45a5-99dc-8704c0c15291",
                        "difficulty": 4,
                        "course": null,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "This course might be quite difficult if you don't have a background in stats and probability and especially if you take it in the summer semester. And I mean at least one semester in Probability and Statistics!\n\nHow to be successful on this course:\n1) Buy a good graphing calculator. I highly recommend HP Prime if you never had graphing calculator before. If you already have something like TI-Inspire, then you should be fine.\n2) Create a cheat sheet in Google Docs and fill it with formulas and other important information as you go through the course. I highly recommend adding PDF, CDF, Variances, and Means of all distributions that will be covered. Although the course syllabus states that you allowed only handwritten notes, course staff allow you to have printed one.\n3) It is ok if you don't understand math proof of some stuff. Personally, I recommend first try to do knowledge checks and homework reviews. Each question will have a reference to a specific lecture that covers the material. Even though, this method is more involving and counterintuitive it is effective.\n4) Homeworks are released at the beginning of the course. Thus, I recommend doing them bit by bit from day one. I managed to get 80-90% because of that.\n5) There are 2 projects and each is worth 5% of your grade. Make sure that you don't pick a too overwhelming topic and do the project from the day they were released at least 1 hour a day.\n6) Final is a fair game. I would strongly suggest completing Practice tests and also Knowledge Checks and Homeworks by the following technique. Do a practice test, and mark all the questions that you cannot solve. Then do the second iteration of this test, but this time only do those questions that you cannot solve on the previous run. And so on. Until you have nothing to solve. (I.e. Cal Newport method). \n7) On the finals, I strongly recommend focusing first on less involving questions (like questions about Arena).\n\nPlease note that this is mainly a math course i.e. during the entire semester I didn't do any programming at all. But I solved a lot of math problems.\n\nAlthough at some weeks I studied more than 40 hours per week, and never less than 15-20 hours, it was a really good course. I can see how my math skills improved!\nProf. Goldsman knows his subject and teaches it well. TAs are very very responsive. Grading is quite generous as well.\n\nOverall, really good course, and I highly recommend it!\nPSS. Before taking it make sure that you have sufficient background in stats and probability! Take EdX Stats and Prob course that prof. Goldsman teaches!",
                        "rating": 5,
                        "_type": "review",
                        "workload": 25,
                        "id": "external-import-f91adde9-9dbd-45a5-99dc-8704c0c15291",
                        "created": "2021-07-31T04:53:44Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-07-31T04:53:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-07-30T23:24:32Z",
                        "rating": 5,
                        "course": null,
                        "_type": "review",
                        "workload": 8,
                        "id": "external-import-87887c6d-573d-4b0e-bb5d-06901793bf91",
                        "created": "2021-07-30T23:24:32Z",
                        "_id": "external-import-87887c6d-573d-4b0e-bb5d-06901793bf91",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "The boot camps at the outset of the class were helpful but it’s been going on 20 years since I took Calculus and Statistics classes, so I found it difficult to answer some of the questions asked around things like the Central Limits Theorem and such, even though I could follow along and understand the examples. So know that you will need to brush up on these topics. \n\nOtherwise, I thoroughly enjoyed this class. It is my 8th in the OMSA program and I think the best one with ISYE-6501 coming in second. ",
                        "difficulty": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        }
                    },
                    {
                        "course": null,
                        "_createdAt": "2021-07-29T17:56:31Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-42ab47e4-dc57-409b-bce2-b97e322bf0c5",
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "body": "I have an undergrad degree in statistics, so this review may not be useful to everyone. Even though there is a huge bootcamp of Probability and Calculus at the beginning, you should probably not count on just that if you want to get the most out of this class. I will say that this is for sure the **best course I've taken in OMSA so far**, compared to ISYE 6501, CSE 6040, MGT 6203, and ISYE 6414. The TAs and instructors are helpful and accessible (but not too helpful!) for every assignment. Goldsmith is a wonderful instructor and his lecture videos flow well. The lecture slides are provided too and mostly capture everything he says (though you may not get to experience all of his humor).\n\nI think what sets this course apart from the others I've taken so far is that, while the content was familiar for me, the assignments and exams still **test you thoroughly** and encompass the breadth of the content. They make you think about concepts and really *get* them. To me, CSE 6040 and ISYE 6501 were just shy of doing this but felt too much like a whirlwind tour of concepts, and ISYE 6414 and MGT 6203 introduced plenty of content but didn't seem to test you at a deep enough level. Again, maybe this is because I knew a lot of the Probability and Simulation content before taking this class, but I'm still inclined to think this class has one of the best balances.\n\nSome people felt pressured with the two \"mini-projects\" we had to do, but I chose the topics that only required a 1-person group and I had so much fun with them. I was able to write up the projects in Python pretty quickly. Goldsmith even describes these topics as relatively straightforward, so he then expects you to explore as much as you can when doing your analysis.\n\nOtherwise, this is a well-paced course and I think it pairs well with another easy course, even in the summer (I took this with Regression).\n\n### Assignment Breakdown *(remember this is for a summer term)*:\n* *Quizzes* (1% each): 10 weekly assignments, mostly quick (1-3 hours), all MC/TF, more than half with bonus questions.\n* *Mini-Projects* (5% each): 2 projects as described above, with 2-3 weeks each to work on and spread out over the semester. Usually an implementation of or research on a particular concept, and a write-up on findings. Expected 15 hours of work and 5 pages per person per group.\n* *Midterms* (25% each): 2 midterms that very fairly assess your knowledge of the material. All MC/TF. Cumulative. Practice exams and solutions are given before each exam and plenty of TA office hours. Cheat sheets are allowed.\n* *Final* (30%): Similar to the midterms in format, and similar fairness.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "_id": "external-import-42ab47e4-dc57-409b-bce2-b97e322bf0c5",
                        "difficulty": 2,
                        "created": "2021-07-29T17:56:31Z",
                        "workload": 6
                    },
                    {
                        "course": null,
                        "difficulty": 2,
                        "_createdAt": "2021-07-29T02:46:36Z",
                        "body": "Really enjoyed the class! You can tell the professor and TA's were all knowledgeable and wanted people to learn. ",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 10,
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "id": "external-import-6293a1b9-9da6-4751-8e8e-22fc82542b96",
                        "created": "2021-07-29T02:46:36Z",
                        "_type": "review",
                        "_id": "external-import-6293a1b9-9da6-4751-8e8e-22fc82542b96"
                    },
                    {
                        "_createdAt": "2021-07-29T01:47:27Z",
                        "course": null,
                        "_id": "external-import-52d0244a-38c3-40e3-80b8-43db198a1eb8",
                        "difficulty": 4,
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2021-07-29T01:47:27Z",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        },
                        "body": "Great class. Professor Goldman is great. I enjoyed the projects a lot, though the additional work they added definitely was an additional stressor, especially during the compressed summer schedule. My advice to anyone taking this in the future is to make sure you are solid on your pre-requisites. That's my main regret here I think. If I had a better recollection of calc through multi and statistical distributions going in, I think it would have been a lot easier. ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 15,
                        "id": "external-import-52d0244a-38c3-40e3-80b8-43db198a1eb8"
                    },
                    {
                        "workload": 3,
                        "id": "external-import-bdaa4b48-01cd-4be3-96e2-d3d1f2071685",
                        "body": "This course is an interesting and engaging dive into simulation, and specifically the function of random numbers and statistics that allow for good simulations to be created. \n\nProfessor Goldsman is fun -- he has jokes in his videos, and adds personality in his communication. He really does seem interested in the material, and it's clear he enjoys teaching it. This passion for the material also seems present in the course TAs, who were both helpful and kind/considerate of students.\n\nSince this course does rely mostly on math, be sure to have a good understanding of the pre-requisites. The first few weeks of the course are a primer of the pre-requisites, but it does assume that you have at least some comfort/familiarity with these topics (stats and calculus primarily). Note that there is essentially no programming, unless you choose to write code for the two projects -- so if your strength is CS, get ready to stretch some math muscles instead!\n\nI really enjoyed the material and the format, and found exams and homework to be very fair and useful in learning material. Dr. Goldsman's teaching style works very well in an asynchronous learning environment, and I'm excited to apply the material to my day job.",
                        "difficulty": 4,
                        "semester": {
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z"
                        },
                        "_id": "external-import-bdaa4b48-01cd-4be3-96e2-d3d1f2071685",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "rating": 4,
                        "created": "2021-05-11T02:34:35Z",
                        "_createdAt": "2021-05-11T02:34:35Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null
                    },
                    {
                        "id": "external-import-108617ad-f5c4-41f5-88cc-14a3bab2e5e2",
                        "created": "2021-05-10T12:39:22Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "_createdAt": "2021-05-10T12:39:22Z",
                        "body": "This is easily the best course I've ever taken at any school. I absolutely loved it.\n\nDr. Goldsman wants his students to learn and succeed, and he sets you up to do that. He does not impose arbitrary obstacles in order to wash people out. He's extremely active on Piazza, as are the TAs, and they all exhibit a good deal of empathy and patience. They're very generous with lots of extra point opportunities, too.\n\nThere are office hours to help you get through each homework. After those are graded, there are office hours to go over the solutions to help you understand anything you might have missed. There are multiple office hours to prep you for each exam, and then there are office hours to go over those solutions, too. Questions posted to Piazza are often answered in minutes or even seconds. The entire course staff is incredibly engaged and helpful.\n\nYou should know (and others have pointed out) that this is very much a math class, and the actual simulation content is a bit lacking. The content in later weeks builds on the content from earlier weeks, so you'll want to make sure you get really confident with all of it as you move through the class or you'll struggle later. That's a challenge sometimes because the content can come at you pretty fast. There's a lot of it.\n\nThe exams, particularly the 2nd midterm, can be tough. Personally I'd like to see one or two fewer exams and one or two more projects, because the projects are awesome - they give you a ton of interesting ideas to choose from, and then there's always a \"make up your own\" option, too.\n\nI spent more time on this class than most because I liked it so much I felt motivated to put a ton of effort into it and probably spent more time than was really necessary.\n\nAdvice: Get a good calculator with a strong CAS offering (I used an HP Prime, but higher-end TIs should be just as helpful). They'll tell you that any calculator that can do logs and such will do, and they're not wrong, but that presupposes that at exam time you'll be able to do any arbitrary integral or double integral and a bunch of other manipulations. I wanted an insurance policy so I got a really good calculator that can do all of that stuff itself and I'm glad I did. The calculator rule for us was basically \"If it fits in your hand and isn't a phone you can use it.\"\n\nThis is an outstanding class with a top-shelf staff. It wasn't easy for me, but I thoroughly enjoyed it from start to finish and I'm legitimately a little bit sad that it's over.",
                        "rating": 5,
                        "course": null,
                        "workload": 15,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "_id": "external-import-108617ad-f5c4-41f5-88cc-14a3bab2e5e2",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-9f97362d-8276-4f42-b862-bda5d353dd7f",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 5,
                        "body": "Professor Goldsman is awesome. His lectures are full of jokes, ongoing themes, and it helps a lot. \n\nI really liked this class, but it did deviate from my expectations. This class spends very little time actually simulating anything. There are a few weeks of Arena, but those are more about learning the interface than really modelling. \n\nThis class is very math focused, more so than I expected. The first few weeks are all math primers, which is great if you need refreshers on baby statistics, calculus, and linear algebra.  \n\nThe class was pretty easy up until midterm 2, which can set you up for trouble. After midterm 1 the class starts piling on concepts, subtle definitions, and more complicated ideas. midterm 2 was quite difficult, and there is only a couple weeks until the final. The last few weeks of the course are very intense. \n\nThe pop culture alone is worth taking the class. ",
                        "workload": 10,
                        "created": "2021-05-07T18:29:35Z",
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_id": "external-import-9f97362d-8276-4f42-b862-bda5d353dd7f",
                        "difficulty": 4,
                        "_createdAt": "2021-05-07T18:29:35Z",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "workload": 10,
                        "_id": "external-import-7146a55f-caec-433e-a3e6-964acff21c34",
                        "_type": "review",
                        "course": null,
                        "body": "Structured content with well-made slides in .pdf files. Amazing and dedicated TA staff to answer piazza questions and provide detailed explanations on homework and subject every week. Must take class for the amazing Professor Goldsman for his engagement, funniness, and understanding with the students. Not sure about the past, but there are a bunch of bonus points provided throughout the semester as well. Professor Goldsman is active on piazza!\n\nHowever, by no means this course is easy in any ways. It is a statistics bootcamp with lots of information with Arena thrown in for a few weeks. There are two projects throughout the semester that are fun and have strong applications of what you learn in the class. I picked projects that make me practice my Python coding.\n\nExams are extensive and cover pretty much everything in the course. Go over the slides and make your equation sheets based on them. Do the practice exams and use Piazza as a resource for any questions you may have.\n\nOverall, I really liked the course and highly recommend it for people who need a stats and calculus review before taking on the more challenging courses",
                        "created": "2021-05-07T02:23:26Z",
                        "_createdAt": "2021-05-07T02:23:26Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 5,
                        "id": "external-import-7146a55f-caec-433e-a3e6-964acff21c34"
                    },
                    {
                        "_type": "review",
                        "_createdAt": "2021-05-04T19:36:25Z",
                        "id": "external-import-e4387932-0b75-4eac-989d-4c515e90d708",
                        "created": "2021-05-04T19:36:25Z",
                        "rating": 5,
                        "course": null,
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "body": "Great professor and very responsive and helpful TAs - the lectures were engaging and the slides were clear. The class is basically a ton of stats with a little bit of Arena thrown in. I was very, very rusty in stats prior to taking this course but as long as you keep up with the lectures and spend time prepping your \"cheat sheets\" for the exam, you should be okay if you're willing to put in the work. The professor also offers quite a bit of extra credit. I would also highly recommend getting a graphing calculator such as the TI nspire CXII. If you're rusty on some basic math functions (like solving integrals, etc.), the calculator is an absolute lifesaver.",
                        "workload": 10,
                        "_id": "external-import-e4387932-0b75-4eac-989d-4c515e90d708",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-c356b8f5-4539-4dc4-bba6-faca2131d64b",
                        "created": "2021-05-03T01:18:40Z",
                        "_id": "external-import-c356b8f5-4539-4dc4-bba6-faca2131d64b",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "To begin, this course is a very mathematics-based course. Although it involves some high-level project creation (via either Arena or SimPy or whichever framework you wish to use) it is very much a theory-based analytical course. This is definitely a plus in the fact that you will explore many great theories and how they apply to creating simulations for businesses and testing various parameters in your simulations.\n\nI would rate this course in between a Medium and a Hard. It is not as hard as some courses however if you have not been brushing up on your math notation and Calculus you will be in for some review time.\n\nOverall excellent course, Dave Goldsman is an absolute genius and his teachings are consistent, to the point, and apply a lot of examples to learn from. His math notation is extremely consistent and it is obvious he has been working in the field professionally for a while now.",
                        "_createdAt": "2021-05-03T01:18:40Z",
                        "difficulty": 4,
                        "rating": 5,
                        "course": null,
                        "workload": 15,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_type": "review"
                    },
                    {
                        "created": "2021-04-27T05:13:42Z",
                        "workload": 30,
                        "rating": 3,
                        "id": "external-import-92d272b0-2ff8-467d-b19b-79b36afe540b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-04-27T05:13:42Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14"
                        },
                        "body": "This course is little more than re-heated statistics. Change a few headings, and 90% of this material could be used to teach econometrics, geostatistics, or bioinfomatics.\n\nThose with a strong statistics background will get some value out of connecting the theory with the process of simulation. But those who reached their statistical pinnacle when playing Dungeons and Dragons while listening to Justin Bieber (like me) will find themselves drowning in an ocean of abstract trivia.\n\nEverything said about the engagement of the professor and the dedication of the TA's is true. But the whole teaching staff seem to be suffering from the same, old-fashioned delusion: that the best way to explain a concept to a student is to hit them with a proof. I don't need the proof - I never doubted you. What I need is the intuition.\n\nThe fact that there are no intuition-building stories in this course seems like a huge missed opportunity. Tell me about the time an airplane fell out of the sky because they used single-stage sampling instead of two-stage sampling. Tell me about the bridge that collapsed because they used an exponential distribution instead of a gamma distribution. Tell me how they averted disaster by switching from a Normal distribution to a Weibull. The only justification we get for selecting a 90% confidence interval instead of any other is \"because the boss wants it\". Perhaps they teach what bosses need to know at UGA?\n\nSimulation is used when the phenomenon is too complicated for a formula. It is therefore ironic that a course on simulation is taught as if there is an abstract mathematical solution to every problem. At one point the professor says \"in the real world this would be done with a triangle distribution\" and then goes on to prove how a Cauchy distribution can be derived from a Student's t.\n\nThe world of simulation also covers a lot more than just Arena modeling a queue in a factory. But even modeling factory lines is only superficially covered. Factory managers usually have multiple goals they are trying to optimize (not just one). And factory managers worry about improvements that only shift bottlenecks. I am still in no position to help with either problem.\n\nMost of my classmates lavish praise on the course teaching style. That seems baffling. I personally didn't feel motivated to dance in the streets after getting hit with an exam question on Erlang distributions (when the word 'Erlang' was used once in passing at the bottom of a slide). I knew that statistics was a prerequisite, but I thought that meant they wouldn't test you again on the same material. Unfortunately, the vast majority of exam and homework questions don't even pretend to have anything to do with simulation.\n\nFor me, the statistics was twice as hard as the simulation. Which is why I needed to put in 30 hours a week instead of just the expected 10 hours. Did I want to learn statistics? Absolutely not. Am I better for it? Definitely. While it was thoroughly painful most of the time, I'm glad I took the course.",
                        "difficulty": 4,
                        "_id": "external-import-92d272b0-2ff8-467d-b19b-79b36afe540b",
                        "_type": "review"
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "body": "I was surprised by finding this class very underwhelming. It feels like some of my high school math classes where you spend your time pushing numbers around and memorizing equations rather than really understanding the math. I also think the difficulty is hard to pin down. It's trivial if you have strong statistics and probability background. Difficult if you don't. Getting a B is the default grade, and it will take a bit of work to get an A. [I wrote some practical tips here](\nhttps://jonathanlao.medium.com/omscs-simulation-b18bb2e088b9)\n",
                        "_type": "review",
                        "rating": 3,
                        "workload": 6,
                        "id": "external-import-a7e48ea5-86f2-4003-b20a-bfc9d54c32eb",
                        "created": "2021-01-13T15:41:27Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_id": "external-import-a7e48ea5-86f2-4003-b20a-bfc9d54c32eb",
                        "difficulty": 4,
                        "_createdAt": "2021-01-13T15:41:27Z"
                    },
                    {
                        "course": null,
                        "_createdAt": "2020-12-21T15:33:09Z",
                        "rating": 4,
                        "_id": "external-import-a1476921-64d1-4b60-bae9-dfe0eec10897",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "created": "2020-12-21T15:33:09Z",
                        "workload": 8,
                        "body": "Simulation (the full name is simulation and modeling) is a math and stats heavy introduction to the field of modeling physical systems to study their operating characteristics. The course is very heavy on the math, including detailed proofs in the lectures (although not on the homeworks or exams), and light on the applications. This balance was disappointing as I find the applications to be much more interesting than the foundational statistics and math (which can be learned along the way). There are some brief sections on Arena, a simulation language, but it mostly consists of looking at pre-built models or constructing extremely simple models and looking at the output values. \n\nThe lectures videos tend to be longer than in other classes (at least those I've taken) at 10-15 minutes and there were around 6-12 videos to watch each week (1.5x speed really helps). There was a homework assignment every week that matched up well with the lectures, no required reading (all the material is covered in the lecture slides), three exams, and a project. The exams and homeworks matched the lectures well and were fair although as with the lectures, they mainly covered the theory and math behind simulations and not the applications. \n\nThe project could be completed in small groups, or individually and was really what you make it. The grading was extremely lenient, and the amount of effort you put in and how much you learned was entirely dependent on your own motivation. I did a programming project and enjoyed doing the research and writing the code to implement a theoretical topic covered in lectures. It was the most rewarding part of the class to me, and if you really are concerned with learning something, I'd suggest picking a challenging project and forcing yourself to understand and implement the concept. \n\nOverall, this course is relatively easy and low-effort and the Professor (David Goldsman) clearly loves teaching. His enthusiasm for the course makes it easier to get through the sometimes tedious lectures although the course would be improved if it focused more on applications and less on the mathematics and statistics basics. I'd recommend this course to anyone interested in the field of simulation that has little experience with the topic and doesn't mind spending the majority of the class not doing simulation, but building the mathematical foundations. ",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "difficulty": 1,
                        "_type": "review",
                        "id": "external-import-a1476921-64d1-4b60-bae9-dfe0eec10897"
                    },
                    {
                        "created": "2020-12-20T01:45:05Z",
                        "difficulty": 2,
                        "_id": "external-import-a4371ce4-f140-4e18-91bf-6f9b6067aecb",
                        "rating": 5,
                        "course": null,
                        "workload": 5,
                        "id": "external-import-a4371ce4-f140-4e18-91bf-6f9b6067aecb",
                        "_createdAt": "2020-12-20T01:45:05Z",
                        "body": "I don't have a whole lot to add to what's been said in other reviews -- this is an extremely lightweight way to work out your math and stats muscles. As someone whose ability to do basic mathematical thinking steadily atrophies without exercise, it was a great way to stay sharp without burning up too much free time. Once the math/stats bootcamp modules finished up, I probably put in 2-3 hours of work per week, which was enough to finish at the low end of an A grade (~87%, thanks to a very friendly curve). The Arena software is really annoying, especially if you're on on a Windows PC, but I only opened it once all quarter - you might miss a quiz point or two here and there, but you could probably go the entire semester without ever using it. In an ideal world, the course would use a different software platform for running simulations, but I wouldn't get my hopes up if I were a future student.\n\nFall 2020 introduced a new project requirement, which can either be done in (self-selected) groups or alone. Goldsman provides 20 or so possible topics, some suggested for groups and others for individuals (though you ultimately could choose to do any topic that you wanted). I bit off a bit more than I could chew and wound up putting ~20 hours in, which was a little disproportionate to what it was worth (5% total). It was a valuable experience, though, and made it so I didn't need to study for a large portion of the final, as it tied directly into course content.\n\nOverall, I greatly enjoyed the course. As an OMSCS student in the ML track, it's a great way to stay fresh on the math-y side without burning out. Interested students should consider reviewing Goldsman's undergrad probability/stats class, the lectures for which are available somewhere on the GT website (Kaltura maybe?), if you're at all nervous about your math background, but I think most people in the program would be able to keep up even if they never took a calc-based stats class in college.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-ef6c6020-6154-4059-8d50-b93344e2b10d",
                        "created": "2020-12-11T21:53:30Z",
                        "body": "Took this as one of my first courses along with 3 others. It lays a solid foundation math/stat-wise that I'm sure will be useful for all my other future courses.\n\nThe weekly lecture videos were long but very well organized. Materials were self-contained, it's ok even if you didn't have stats background (I didn't) but you need to know a little calculus and basic probability. Prof was funny, caring and very participative on Piazza.\n\nThis semester they implemented a project for the first time (could be individual or group). It was a good (and fun!) way to get a firmer grasp on the materials. They had some challenges in trying to incorporate shared peer reviews on Canvas in the end, but the TAs and the prof were actively replying on Piazza and manually sorting out issues. They made a great team.\n\nOverall, a fun and useful course!",
                        "rating": 5,
                        "_createdAt": "2020-12-11T21:53:30Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "difficulty": 3,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "workload": 7,
                        "_id": "external-import-ef6c6020-6154-4059-8d50-b93344e2b10d"
                    },
                    {
                        "workload": 10,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "_id": "external-import-87f7e543-42ea-4511-9cc3-800417c51540",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-87f7e543-42ea-4511-9cc3-800417c51540",
                        "created": "2020-12-08T21:57:04Z",
                        "rating": 4,
                        "difficulty": 3,
                        "body": "Cleared due to OMSCentral Owner being greedy.",
                        "_createdAt": "2020-12-08T21:57:04Z",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "_createdAt": "2020-12-07T06:04:40Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "rating": 4,
                        "body": "Went in with no prior experience in probability (aside from baby stats classes) and only having taken Calc I.  To succeed they recommend having knowledge through Calc III and a graduate level course in probability, but the course itself is self-contained and it’s possible to learn as you go. It was still a struggle at times for me especially during the heavy math parts, but it’s doable. If you don’t have a probability course under your belt like me, I suggest taking (auditing) the same professor’s edx courses. A lot of the material in that course will show up here. I had to do both at the same time to keep up in the beginning as I felt the bootcamps weren’t enough to get me up to speed.\n\nProfessor Goldsman is great and very active on Piazza answering questions and providing feedback. The TAs are also all great and helpful throughout the term. Out of my 3 courses so far, this is by far the most support friendly course.\n\nExams felt fair, no trickery at all. You’re given an old exam as practice and you also get cheatsheets. I suggest typing them up in latex and printing them out.\n\nA project was newly added this semester and was worth 5% of the grade. The logistics and organization of the project very much felt like they were making it up as the semester progressed. Things were added/removed and dates were changed as we went on. Nonetheless it was a great way to apply some of the things we learned because I’ll echo some of the comments/reviews that this felt much more like a probability/statistics class than a simulation class. I hope they keep the project aspect and iron out some of the kinks for future semesters.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "_id": "external-import-b579e677-106f-4420-ab53-903c286245a3",
                        "difficulty": 4,
                        "workload": 10,
                        "id": "external-import-b579e677-106f-4420-ab53-903c286245a3",
                        "created": "2020-12-07T06:04:40Z"
                    },
                    {
                        "created": "2020-12-06T08:36:38Z",
                        "rating": 4,
                        "course": null,
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-1db3dd15-308c-49d1-b625-d32b36f25073",
                        "_type": "review",
                        "_id": "external-import-1db3dd15-308c-49d1-b625-d32b36f25073",
                        "body": "A nice breather course. Material is fairly basic, but you'll still learn a lot if you haven't ever done prob/stats (or haven't done it in ages), and the presentation/explanations are very good. Course difficulty is comparable to or maybe a bit easier than ML4T. Professor is very sweet and responsive. Don't worry about the prerequisites they mention at the beginning, they will teach you everything you need to succeed. ",
                        "_createdAt": "2020-12-06T08:36:38Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "difficulty": 1
                    },
                    {
                        "_createdAt": "2020-12-05T18:29:38Z",
                        "rating": 5,
                        "body": "Loved this course. Great prof. As others have mentioned, it has a fairly thorough review of probability, statistics, and calc, which I found helpful as it's been a decade since I was an undergrad.\n\nThey added a project - and there are tons of options for topics - so you can get some hands on experience doing some simulations yourself if you want. Otherwise, the course is watching lectures, multiple choice homeworks (that are really more like quizzes), and multiple choice exams.\n\nIf you're at all interested in simulation or just looking for an interesting elective that isn't a mountain of work, this is worth taking.\n\nBest advice I can give is to be very thorough making your cheat sheets for the exams. I just took the final and twice came to a question and thought, dang, I don't remember whatever small esoteric fact I needed to solve the question. But I searched through my cheat sheet and luckily I'd written down what I needed. Most of the questions aren't like that, and the prof doesn't try to trick you at all. I thought the tests were very fair and straightforward. But if you want to have some insurance, make good cheat sheets.\n\nI probably spent 3-4 hours per week most weeks, then 12-15 hours on exam weeks.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "created": "2020-12-05T18:29:38Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "workload": 6,
                        "difficulty": 2,
                        "_id": "external-import-61d8fe7f-10e1-45e4-ab68-277f0eec2669",
                        "id": "external-import-61d8fe7f-10e1-45e4-ab68-277f0eec2669"
                    },
                    {
                        "course": null,
                        "id": "external-import-61569261-daa1-4e0b-8e72-1c49c73f3318",
                        "created": "2020-12-05T17:56:14Z",
                        "_type": "review",
                        "_id": "external-import-61569261-daa1-4e0b-8e72-1c49c73f3318",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "rating": 4,
                        "workload": 6,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "body": "Good course, no complaints",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_createdAt": "2020-12-05T17:56:14Z"
                    },
                    {
                        "body": "Be aware that you will be tested on Arena, so despite being told you can use the programming language of your choice, you should use it for the project.  Tests are the bulk of the grade.",
                        "difficulty": 2,
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-11-18T19:28:00Z",
                        "id": "external-import-7f980694-c9b6-4097-8435-ad2582a2f40e",
                        "created": "2020-11-18T19:28:00Z",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "_type": "review",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 4,
                        "_id": "external-import-7f980694-c9b6-4097-8435-ad2582a2f40e"
                    },
                    {
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "id": "external-import-43d42319-c68d-4cdc-9aa8-efed4d1241ae",
                        "created": "2020-10-12T16:45:42Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_createdAt": "2020-10-12T16:45:42Z",
                        "rating": 4,
                        "_type": "review",
                        "workload": 10,
                        "course": null,
                        "_id": "external-import-43d42319-c68d-4cdc-9aa8-efed4d1241ae",
                        "body": "Interesting and easy course. It covers basic concepts in statistics, simulations with randomness, and introduction to a software Arena. There is weekly easy quiz, which covers similar questions in exams.",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "_id": "external-import-ba221538-4780-417f-8db9-8ad1329c3337",
                        "created": "2020-08-13T21:25:45Z",
                        "body": "**Before we whine that this class that it has an inaccurate name or designation, the full name of this class is ISYE 6644 Simulation *and* Modeling**. So do not assume that this class is only and purely about Simulation - blame the GT admin for that one.\n\n**Much of the workload in this class is done *prior* to the class itself.** Make sure you satisfy the Stats and Probability pre-reqs. A good pre-reading would be Professor Goldsman's open set of Probability and Statistics EdX classes (https://www.edx.org/bio/david-goldsman, or Google ISYE 6739).\n\n**The A's are historically cut-off high** (not that 90 high, but pretty close), and not without surprise -> if you understand his pre-req stuff really well, an A is a shoo-in, even for me without an Undergrad background. Just be proactive and serious about learning - the TAs are the best bunch - shout out to Mariana, Michael Kuehn (of the Bayesian fame) and James Roberts, amongst a list of others.\n\n**Otherwise, a B is the default.** Goldsman's curve is huge. Heck even a 60+ is a B. Just make sure you can demonstrate to the Prof that you know how to compute something legible. That being said, he increasingly does give Cs and Ds - but anecdotal evidences suggest that there are alot of students who come in without the pre-reqs and he has to use this as an only way if you really not deserve a B (like, for example, not knowing how to compute sample variance). \n\n**The test difficulty varies by semester.** In some semesters it feels like Test 3 > 2 > 1. For me in this semester, 2 was the hardest (75 average), then 1, then 3. I suggest to treat such opinions as a pinch of salt, but do follow the advices of the TAs closely - they do give obvious test nuggets in Piazza if you search well for it. At the end of the day, you get the grade you deserve. Tests are a good indicator and no tricky stuff unlike Sokol's - either you know or you don't (sans carelessness). \n\n**It is possible to get 3 perfect test scores (yep, without bonuses).** For this semester, I can now confirm it's the Red Panda (go ask around who s/he is). Go ask around to see who s/he is!\n\n**There is alot of social cohesion in this class**, with the student community easily available on the Slack channels. Even the TA (and even the Prof!) themselves appear there. Prof Goldsman himself embraces the memes and Slack emojis that were made for him - which is now the default fun emoji to use throughout the OMSA Slack at omsa-study.slack.com. \n\n**Take your cheatsheet, seriously.** You're given practice questions. Copy them to your cheatsheet. That could be a fine difference between an A or a B 😂\n\n**The programming aspects ain't heavy**, but hey, we are probably not gonna use them more than the theoretical aspects which could prove useful in CDA (ISYE 6740) and Bayesian (ISYE 6420).\n\n**Professor Goldsman stuff are a trove of gold.** Treasure it.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "course": null,
                        "workload": 10,
                        "rating": 5,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "id": "external-import-ba221538-4780-417f-8db9-8ad1329c3337",
                        "difficulty": 3,
                        "_createdAt": "2020-08-13T21:25:45Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-0e551a9f-5553-4c25-83b5-8046b77de77f",
                        "_type": "review",
                        "course": null,
                        "difficulty": 3,
                        "_createdAt": "2020-08-10T19:03:06Z",
                        "_id": "external-import-0e551a9f-5553-4c25-83b5-8046b77de77f",
                        "body": "This is a great course, I am very glad I took it. There is very little coding; you use Arena for about a week. The rest of the course is on applied statistics and basic simulation algorithms (how do we generate random variables). In other words, the course heavily relies on being comfortable with probability, statistics, and basic calculus. All the math will be reviewed within the course early on. If you can get comfortable with the math, this will be an enjoyable and worthwhile course.\n\nEverything is framed in terms of data coming from a simulation program, but really, a lot of the material it applicable to data analysis from experiments as well and it is because of this that I think this course is beneficial. For example, you will cover how to calculate confidence intervals or how to perform goodness-of-fit tests, both of which are critical (but not very complicated!).\n\nTip: For each midterm you get a cheat sheet (2 pages for first, 4 for second, 6 for final). Work on your cheat sheet with every assignment! There is a lot of material that is fair game for each midterm and the grades I got in each midterm were strongly related to how much time I spent on my cheat sheet leading up to the exam! Additionally, I strongly recommend using LaTeX for you cheat sheet; as the course progresses you will want to be able to quickly and easily make changes to what you already have (sometimes the lectures revisit old material and add more info). In short, the midterms are 90% of your grade and with a mediocre cheat sheet, they are TOUGH, but with a thorough cheat sheet they will be plug-and-chug.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2020-08-10T19:03:06Z",
                        "rating": 5,
                        "workload": 8,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        }
                    },
                    {
                        "_id": "external-import-f6985247-11be-493e-a216-4fd21145cd5d",
                        "_type": "review",
                        "rating": 3,
                        "difficulty": 3,
                        "body": "Really well run class but the actual material is so-so. The TAs and Professor Goldsman himself are quite active. They are really generous with their time and effort explaining the material.\n\nThat said, this class was not focused. It felt a little like an intro to stats class, a little like a practical simulation class, and the last module felt like a whirlwind tour through statistical hypothesis testing.\n\nBy the end of this, I am not really sure how to apply this material in my daily life. But it is enjoyable enough and light class to take during the summer.",
                        "_createdAt": "2020-08-01T02:50:33Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "workload": 5,
                        "id": "external-import-f6985247-11be-493e-a216-4fd21145cd5d",
                        "created": "2020-08-01T02:50:33Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_createdAt": "2020-08-01T00:27:56Z",
                        "difficulty": 3,
                        "id": "external-import-df30c6ea-c54a-45db-8da4-479c2ec875cd",
                        "body": "So, I really wanted to love this course and I came away mostly liking it.\nThe instruction is very enthusiastic and the team running the course is the best and most responsive team I have ever had in my OMSCS (this was my last course).\n\nOverall just read the other reviews (They are all accurate).\nThe only thing I would add that I didn't really understand going into the course (based on the reviews here)\n\n1) You really need to know statistics and distributions in this course. I have been fuzzy on them and it hurt.\n\n2) The exams (which is 90%) of your grade, feels a bit like trivia to me. Like if you didn't write down on your cheat sheet some bit of information and you don't remember it yourself. You will not be able to answer some questions. While this makes for a good exam that you have to study for. I question whether this is really testing my understanding of simulation and how to run one effectively. It feels like it's testing my understanding of the maths / tools much more than my understanding of what a simulation is.\nIn fact, I would carefully venture out and say that the exams really don't test your understanding of how to setup a good simulation or run one. They really test your understanding of the maths that simulations depend on.\nOverall this would be my biggest feedback for the course, you will learn the math that supports all simulations. You will learn proofs of correctness for ways to choose the best performing simulation. But you will get very little practice in actually setting up simulations.\nI would have liked to have a practical examples, where we had to setup simulations and analyze them. We didn't really do that at all. We went through some demos that were given to us, but we never had to actually do the work ourselves.  Then we spent a lot of time on the math.\n\nSo just know that you are taking a math course (which is fine).  \nThe professor and team are are as good as written about.\n\nThat being said, you should have taken at least 1 statistics course before you start this. Or be ready to learn about distributions, CDF, PDF, PMF etc. The bootcamp wasn't enough for me.\n",
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "created": "2020-08-01T00:27:56Z",
                        "course": null,
                        "_id": "external-import-df30c6ea-c54a-45db-8da4-479c2ec875cd"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "_id": "external-import-ffd2e2ed-270a-4886-a6fd-90b0df263037",
                        "difficulty": 3,
                        "body": "This has been mentioned in other reviews, but I want to reiterate: THIS IS A MATH CLASS. You will not write any code, so think that through beforehand. \n\nHaving said that, the professor's videos are great. They're funny and engaging, especially considering the dry material. The TA's are very engaged as well. It definitely feels like an OMSA class, but you will build a solid mathematical/statistical foundation which can apply to ML concepts. ",
                        "created": "2020-07-31T19:25:35Z",
                        "rating": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "_createdAt": "2020-07-31T19:25:35Z",
                        "course": null,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-ffd2e2ed-270a-4886-a6fd-90b0df263037"
                    },
                    {
                        "id": "external-import-10e7078e-3581-490e-b3e9-15cd54f88ce2",
                        "created": "2020-07-30T14:52:02Z",
                        "_createdAt": "2020-07-30T14:52:02Z",
                        "_type": "review",
                        "_id": "external-import-10e7078e-3581-490e-b3e9-15cd54f88ce2",
                        "difficulty": 3,
                        "workload": 10,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "body": "I really liked this course. Big credit goes to amazing Professor and TAs. Professor is able to explain very well complex concepts (always with good humor), lessons are engaging, homework and exams are straightforward without surprises and both Professor and TAs are responsive on Piazza. If you pay attention to all lessons, do your homework and occasionally follow Piazza and/or Slack, I think this course is an easy A. More importantly, you'll get a very good foundation in probability and statistics that'll be applicable in more applied topics. Overall, I'm happy I took this course and I feel I learned a lot in a relaxed and enjoyable manner."
                    },
                    {
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "_id": "external-import-dfa3322e-3c98-4933-bb07-12ff87356d8e",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2020-07-29T17:19:26Z",
                        "_type": "review",
                        "difficulty": 3,
                        "_createdAt": "2020-07-29T17:19:26Z",
                        "body": "Extremely well run class. Goldsman and the TAs are awesome. Videos are top notch. Assignments and exams are straightforward. Dad jokes are awesome. Disappointed with the material though. Calling this class Simulation is a misnomer. It's much more of a Math/Stats/Probability class than it is Simulation.",
                        "id": "external-import-dfa3322e-3c98-4933-bb07-12ff87356d8e",
                        "course": null
                    },
                    {
                        "created": "2020-07-24T16:01:07Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-07-24T16:01:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "_id": "external-import-a47f1dc3-692b-4b1d-b4c9-d4c2bb36d11f",
                        "id": "external-import-a47f1dc3-692b-4b1d-b4c9-d4c2bb36d11f",
                        "difficulty": 3,
                        "rating": 5,
                        "workload": 10,
                        "body": "I really enjoyed this course, but wish there was more work done in Arena.  I'm not sure I'd call this class \"Simulation\" since most of the class felt like a heavy dose of stats / calculus that I was exposed to back in undergrad.  \n\nDr. Goldsman is probably one of the best teachers I have EVER had.  I highly recommend taking this course, because if you can't learn something from him while also enjoying it, then maybe the problem is you.\n\nI heard the curve is pretty generous in this class.  It's impossible to not at least get a B, it's a little more challenging to get an A."
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "difficulty": 5,
                        "course": null,
                        "_id": "external-import-74eff125-ef79-42d6-8aa1-18374e771077",
                        "id": "external-import-74eff125-ef79-42d6-8aa1-18374e771077",
                        "created": "2020-07-22T12:22:33Z",
                        "_createdAt": "2020-07-22T12:22:33Z",
                        "rating": 4,
                        "body": "A better title for this class would be \"Applied Probability and Statistics for Random Variable Generation\".\n\nMost of the course was focused on the theory and math behind generating random variables. There was an insane amount of probability and statistics (more than my 400 level stats course in undergrad) and most of the course is dedicated to the math. So while it was a great learning experience, it was not really on simulation as you might think. If you don't have a good foundation in probability, statistics, and calculus - study up before you take this course! I found the course extremely difficult, especially on the truncated summer semester.\n\nThe TAs and professor were generally awesome and well above average for this degree. They were helpful, very active, and genuinely seemed to care about helping students learn and grow. \n\nThe homeworks were pretty straightforward and had lots of bonus questions. However, they are only worth 10% and 3 tests make up the remaining 90% so if you do poorly on one exam you're in trouble. The main drawback was I would really have liked some sort of small project to better tie together all the concepts and even out the grading. ",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 20,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        }
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "_id": "external-import-8a7debfb-8a99-4de1-bb5a-25ba84b4a113",
                        "difficulty": 5,
                        "_createdAt": "2020-07-14T04:04:53Z",
                        "_type": "review",
                        "workload": 17,
                        "id": "external-import-8a7debfb-8a99-4de1-bb5a-25ba84b4a113",
                        "created": "2020-07-14T04:04:53Z",
                        "course": null,
                        "body": "I felt bit tough to manage the schedule along with other commitments but Prof.  & teaching assistants are really helpful and very much caring. It is very difficult to get a A but with consistent effort we can get a B. ",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "_createdAt": "2020-06-20T01:24:20Z",
                        "workload": 9,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "Amazing professor. He put more effort into making the lecture videos fun and entertaining. This was a stark contrast to lecture videos in the rest of the courses. This course is much easier if you are comfortable with more advanced stats/probability concepts. If you struggle with more advanced math/stats, I would bump up the difficulty level some. It is a cool topic that is applicable to so many types of jobs. You can find a comprehensive summary of the lectures at the following website: https://thedatageneralist.com/simulation/.",
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-03df3e24-771b-4613-8cbe-aa7b3350dd5a",
                        "id": "external-import-03df3e24-771b-4613-8cbe-aa7b3350dd5a",
                        "created": "2020-06-20T01:24:20Z",
                        "difficulty": 3
                    },
                    {
                        "course": null,
                        "_id": "external-import-70b85740-34a3-4bd5-bc40-f6d392f448cc",
                        "_type": "review",
                        "body": "Many of the recent reviews say this is a difficult course. There is some difficult math and you have to take the exams seriously for the A but overall it is definitely less difficult than the \"hard\" OMSCS courses. For starters the workload is not high. There are just weekly homeworks and three tests. I liked the homeworks but they aren't too difficult. There are plenty of \"gimme\" questions on the HW and tests (and a curve) so it's very difficult to completely bomb.\nMy math level was below the class average and I slacked off on studying and I still averaged an 80 on the exams.\nThe professor is great, very active in Piazza and the lectures are good. Some of the math is tough but he gives clear examples. This is in contrast to the Bayesian Stats course where you are on your own to figure things out. There were half a dozen times when I had to think hard to understand what is going on, got frustrated, but every time I was able to figure it out and complete at least one example problem correctly (remembering it all for the exams is impossible but just take good notes and spend time making a detailed cheatsheet full of complete step by step answers to the practice exams). If I can do it then you probably can too because my level of basic stats and calc coming into this course was full of holes. Or to put it another way, if you can't learn stats from this professor, you probably won't from anyone else!\nI would recommend taking this course before (or at least concurrently with) the Bayesian course unless you are already a stats whiz. It's a suitable candidate for doubling up due to the low workload. Worst case scenario you can study at the last moment and phone in the homeworks and still cruise home for a B.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-70b85740-34a3-4bd5-bc40-f6d392f448cc",
                        "created": "2020-05-13T20:16:47Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 5,
                        "workload": 8,
                        "_createdAt": "2020-05-13T20:16:47Z",
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        }
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-acb1391a-d556-4c16-9f8a-76af7467e314",
                        "_createdAt": "2020-05-07T06:25:49Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "A fundamental math and statistics course. IMHO should be taken by everyone early in their OMS path\n\nCourse is tough, but the faculty (Prof & TAs) are very helpful and cooperative. Dr. Goldsman has been by far the most involved professor I've seen in OMS so far.\n\nThe exams are hard. Got a B in the end. According to Dr. Goldsman, cut off for A was 86, cut off for B was 62. \n\nEasy to get a B, tough to get an A. \n\nFinally I am glad that I took this course. I learnt many things though I am not sure if I am going to remember it, even if I get any opportunity to apply it.",
                        "workload": 8,
                        "semester": {
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "created": "2020-05-07T06:25:49Z",
                        "_id": "external-import-acb1391a-d556-4c16-9f8a-76af7467e314",
                        "difficulty": 4,
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "created": "2020-05-04T16:43:34Z",
                        "rating": 4,
                        "workload": 8,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-04T16:43:34Z",
                        "id": "external-import-06162f16-0e29-416a-8d1e-4d810f44b37d",
                        "body": "Great class with a lot of tough content. Often I find videos to be hard to follow or not enjoyable. This class does not have that issue. The videos are fun, there is a lot of great content. \n\nThe course covers the concepts of simulations but does not spend a lot of time in a simulation platform. You will use ARENA but only for 1 or 2 lessons. This class is very math heavy, again be sure to focus the first few weeks when you go over the review sections. \n\nI really enjoyed this course and feel like the math will help in future classes. \n\nWeekly homework assignments\nThree exams - All proctored, note card available and 2 hour time limit\n\n",
                        "difficulty": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "_id": "external-import-06162f16-0e29-416a-8d1e-4d810f44b37d",
                        "_type": "review"
                    },
                    {
                        "difficulty": 5,
                        "rating": 5,
                        "workload": 8,
                        "_createdAt": "2020-05-04T13:21:36Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "body": "This was a very difficult course, but Dr. Goldsman is a great professor! There is a lot of math and stats involved, so the lectures tend to be longer than ISYE 6501. The homework a multiple choice quiz on canvas. I found that writing out the practice tests to a given sheet to be fairly effective at studying for the tests. I wish I had done that for midterm 1!  ",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_id": "external-import-72f17dd8-6e55-4c52-806a-e0fc67bac3ce",
                        "id": "external-import-72f17dd8-6e55-4c52-806a-e0fc67bac3ce",
                        "created": "2020-05-04T13:21:36Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-2878b637-6a82-4cc9-913e-423f1cd88911",
                        "created": "2020-04-18T18:03:06Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_createdAt": "2020-04-18T18:03:06Z",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-2878b637-6a82-4cc9-913e-423f1cd88911",
                        "body": "I want to say up front that this is the most involved and enthusiastic teaching staff and professor I have had a class with so far.  Hats off to them, I think staff like that are what make or break Georgia Tech's reputation.\n\nFor the Material: I took this as an elective for the online CS degree program, and it is NOT a Computer Science course.  It is a MATH course.  I think the material was interesting, and useful for understanding concepts behind RV generation and the basics of Simulation.  However, I was probably not the right audience for it.\n\nGenerous assignments and grading.  You'll have to study for the exams, but everything you need to succeed and more is provided in the lectures, on Piazza, or the extra practice problems.\n\nI would only recommend this course to other OMSCS students if you really like pure math, and are interested in the building blocks behind random number generation and simulations.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "workload": 5
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "body": "I took the course along with Bayesian Statistics. Both the courses are complementary to each other. Simulation teaches you theoretical statistics very well. The course covers probability distributions, random variate generation, Maximum likelihood estimation, Poisson processes, etc. It will be mostly enough for your life time professional career. \n\nThe above theoretical lessons alone make this a great course. In addition, the practical experience of real world simulation using Arena will be very good exposure to have. Exams are proctored but easy. The weekly homework's are plenty but they carry very little weight and thus can provide some relief. Overall, must recommend course for anyone in Analytics / Data Science field.",
                        "_createdAt": "2020-04-07T15:09:43Z",
                        "rating": 5,
                        "id": "external-import-f094b9bb-fc0b-4b6c-a247-bbd32640fc9c",
                        "created": "2020-04-07T15:09:43Z",
                        "workload": 10,
                        "_id": "external-import-f094b9bb-fc0b-4b6c-a247-bbd32640fc9c",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3
                    },
                    {
                        "body": "This is my 7th class in the OMSA program, and I can easily say that I have enjoyed this class the most so far. We're about 90% done with the class as of this writing.\n\nPRO's:\n\nGreat teacher. Knows the topics well and most importantly, knows how to TEACH the topic well. All the OMSA professors I've had so far know the topics they teach very well, no doubt. But the ability to see the subject from the point of view of a student who is learning it for the first time, or has been away from the classroom for a while, is a real gift. What I mean is that Prof Goldsman knows which concepts can be confusing to a newbie, which need to be stressed over and over, and which ones are good to know, but you can get by without burning in your brain. And he points all of those out.\n\nGreat TA's. THE BEST TA's I've had so far in OMSA. Just like the professor, they know the topic well and are able to explain it well. Very responsive on Piazza too.\n\nLively lectures. Prof Goldsman's videos are definitely not boring.\n\nVery good layout of topics. I loved the way the topics were structured. You start out with a Calculus and Statistics bootcamp, which was perfect for me, since it's been 20+ years since I touched this stuff. By the time we got to later Mathy topics, I felt very ready and confident of my understanding of the topics. Some reviewers complained about not spending enough time working in Arena. I do agree with this to an extent, in that it would be nice to have done more full, real-word simulations. But I feel like this class gives you the important tools you need, and specializing in Arena or other simulation tools is something you can do later on your own. \n\nVery considerate grading. This is just the cherry on top. I would love this class even without it.\n\nCON's:\n\nNONE in my opinion",
                        "difficulty": 3,
                        "_createdAt": "2020-04-02T15:49:24Z",
                        "rating": 5,
                        "semester": {
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "id": "external-import-aaa45501-1a5a-460e-9b21-1e02cf5d2f8e",
                        "created": "2020-04-02T15:49:24Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_id": "external-import-aaa45501-1a5a-460e-9b21-1e02cf5d2f8e",
                        "_type": "review",
                        "course": null,
                        "workload": 6,
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "workload": 12,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "_createdAt": "2020-03-02T18:56:51Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "It seems more like a stats class....but overall a great class.  The lectures are great and the TA's are some of the best in the program.  You will be given all the tools you need to do well on the exams.   Not easy to get an A, but you can get an A if you put the time in.",
                        "_id": "external-import-dfb09569-cc92-44cc-9375-8f7b36ef2654",
                        "id": "external-import-dfb09569-cc92-44cc-9375-8f7b36ef2654",
                        "created": "2020-03-02T18:56:51Z",
                        "rating": 5
                    },
                    {
                        "difficulty": 3,
                        "workload": 10,
                        "_id": "external-import-e1cdcf47-4439-4dfa-ac50-795e3395a521",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "created": "2020-01-08T16:08:02Z",
                        "body": "I loved the lectures. Prof Goldsman is very enthusiastic and charismatic. The lectures are well organized, and the slides are very informative. To get the most out of this class, I would very much make sure to study up on probability, \"baby\" statistics, and calculus. The first couple of weeks did cover this, but I wish I hit the ground running. \n\nThe homeworks were fairly challenging, but generally answerable with careful review of lecuture material. The exams were very challenging, even with the cheat sheets we were allowed to create and use. WIth that said, Prof Goldsman offered a generous curve. \n\nAs other reviews have mentioned, the class does not spend much time at all on creating or applying simulations. It is very much focused on the theory behind them. I still enjoyed the class and thought it was valuable. \n\nEdit: I also want to compliment the TAs. They were very good communicators and did a great job answering questions. ",
                        "_createdAt": "2020-01-08T16:08:02Z",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-e1cdcf47-4439-4dfa-ac50-795e3395a521"
                    },
                    {
                        "id": "external-import-4943ccc6-44e6-4147-b4fe-3cb6d9221cd2",
                        "_createdAt": "2019-12-16T13:08:02Z",
                        "workload": 20,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 5,
                        "rating": 5,
                        "_id": "external-import-4943ccc6-44e6-4147-b4fe-3cb6d9221cd2",
                        "created": "2019-12-16T13:08:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "body": "Some things to know going into this course (as others have stated.)  1.  It is VERY math and stats heavy, despite the name.  Some actual simulation is done with Arena, but a vast majority of the course focuses on mathematical and statistical topics.  It is an ANALYSIS of simulation course.  2.  The course starts with \"bootcamps\" in calculus, probability and statistics.  These are not easy bootcamps.  Some prior knowledge is required, and the topics (with the exception of infinite series stuff) is used throughout the course.  3.  The course consists (when I took it) of 10% homework (due weekly) and three exams all weighted at 30%.\n\nHomework:  Pretty easy, actually.    \nExam 1:  Hard   \nExam 2: A Little Less Hard  \nExam 3: Super Hard  \n\nI aced 6040, 6501 and Business Fundamentals (8803)... or if not \"aced\", I did get an \"A\" in all of them.  Grades have not been posted for this class yet, but I suspect I will get a B in Simulation.  I am an older student, and it has been a LONG time since I have done any calculus, stats or probability.  (Before taking this class, I had never heard of an Erlang distribution and thought Brownian Motion was exclusively some kind of physics thing.)  This course was a great refresher for that stuff and much more.  Again, I will state that this is a difficult class.  \n\nDon't let the above scare you too much, though. This was really a fantastic course.  Dr. Goldsman is an outstanding professor and the lead TA was the best that I have had so far.  The videos are engaging and funny...  and relatively free of any errors.  (Something that cannot be said for other classes.)  If you're looking for an easy class and grade, then skip this one (thought I do hear that he curves the grades, and the statistics on https://critique.gatech.edu/course.php?id=ISYE6644 do reflect that).  If you don't mind investing some time, then this class will pay you back in spades.  I know it did for me.  I invested around 15-20 hrs per week on this course, and I have applied some of what I learned in my day job.  Good luck!"
                    },
                    {
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "_id": "external-import-0862829f-4917-4365-a09a-8d581091beec",
                        "body": "Pretty much every review you'll read (including this one) will say that Dr. Goldsman is one of the nicest and most helpful professors, and his TAs are great. He has a corny and wacky sense of humor making his videos easier to follow. It has a wonderful built-in stats and calculus review to get you back up to speed.\n\nI agree with all of that, but I don't agree that this is the greatest course ever. It was okay, but I feel disappointed coming in with such lofty expectations.\n\nFirst: this class isn't actually about simulations. It covers the programming language/software Arena a little bit but not enough that you can go out and make your own simulations. Instead, the class is mostly about the math behind randomness. Which there's nothing wrong with, of course, but it's not the topic I thought we'd cover.\n\nSecond: A lot of the questions on midterms and homeworks are barely covered in the lectures. Some other courses - Bayesian, Regression, etc. - have the reputations that you need to do outside research to learn how to do certain things. I never thought this would be one of them, but lo and behold. For instance, I searched around lecture notes for hours and never found an explanation of what an Erlang distribution was, I had to find it somewhere else. Some of the exam questions - now that I'm done with it - I still don't understand where the answers came from. This isn't a complaint due to my grade - the curve is **extremely** lenient - but I wish I'd have understood more of it, walking out.\n\nI generally enjoyed this course but perhaps I went in too high of expectations which couldn't meet reality.",
                        "id": "external-import-0862829f-4917-4365-a09a-8d581091beec",
                        "created": "2019-12-16T12:11:28Z",
                        "_type": "review",
                        "workload": 14,
                        "_createdAt": "2019-12-16T12:11:28Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "_id": "external-import-804a9eba-a1ae-4c73-962b-8f5e73c4aa58",
                        "difficulty": 3,
                        "id": "external-import-804a9eba-a1ae-4c73-962b-8f5e73c4aa58",
                        "created": "2019-11-25T13:50:35Z",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 6.5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "body": "Sandwich method for review (Good, needs improvement, good):\n\nGood:\n1. Goldsman, is a hilarious teacher who builds some legitimately laugh out loud moments in his lectures\n\n2. There is a lot of solid content on statistics, calculus, and just a tiny bit of linear algebra that offers a review of concepts I have not seen in the 5 previous courses I have taken\n\nImprove:\n1. I wouldn't call this a practical simulation class as much as fusion of statistics and a tour of what simulation is capable of . I think I learned some interesting concepts but I would have a more solid understanding of graduate statistics if Goldsman separated that into its own course.  Then he could have a course in simulation with graduate stats as a prereq that would dive into far more detail in actually writing simulations. Having said that, Goldsman claims making simulations are easy if you understand the underlying math so maybe there really is a method to his madness. \n\n2. Another unpopular opinion here: Make the homeworks harder. I love some of the freebie questions, but I'd content that really tests a student's understanding right from the beginning\n\nMore good:\n\n1. TAs were all stars. Mariana knows her stuff and will stay on for hours explaining concepts to students. All TAs also gave prompt and not condescending feedback.\n\n2. I thought the cadence of having weekly homeworks kept the concepts fairly fresh as we learned them and the fact that they were all made available completely at the beginning of the course mean that people with mid semester time committments could plan effectively.\n\n3. Optional content. I love that there are a bunch of videos that we aren't expected to know since the professor wants to keep this course self-contained. It's a great way to keep the course accessible to anyone who's taken a calc and/or stats course while letting those who want more dive in deeply\n\nOverall, great course. I'd recommend taking it earlier since it has a lot of math that it introduces in an approachable way",
                        "_createdAt": "2019-11-25T13:50:35Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-2b8e0853-fd03-4025-aeda-0245594840f0",
                        "created": "2019-10-08T15:35:19Z",
                        "workload": 16,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "This is a must-take class if you are in the OMSA program, just so that you get to work with Professor Goldsman. His puns are classic \"dad\" jokes, and he is very engaged in the Piazza forums (as are his TAs). The first couple of weeks of class do a great job in refreshing your math /probability and stats which comes in useful in later ISYE classes. I also liked the glimpse into queuing theory, and the the Simulation software. Would heartily recommend (though it was a lot of work since my math is very rusty).",
                        "_createdAt": "2019-10-08T15:35:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_id": "external-import-2b8e0853-fd03-4025-aeda-0245594840f0",
                        "difficulty": 3,
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        }
                    },
                    {
                        "created": "2019-09-15T14:00:48Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "workload": 10,
                        "id": "external-import-e7a8a4c3-33da-4f4e-9832-3b270388b86d",
                        "body": "Dr. Goldsman is a fantastic lecturer and is this course/material's saving grace alongside the outstanding work by the TA's. However, this coursework wasn't what I would take interest in. The majority of the material in this class is condensed versions of Statistical Theory and Calculus put to the test. You really don't do a whole lot of simulation work, but you do get tested on scenarios. Additionally, this might be the only class in the program where you have to whip out your ti-84 (I had to order one from ebay). The first two weeks of the course is essentially a review of Calculus, then the rest of the course is bits and pieces of stat theory, simulation concepts, and random number generation (which feels like the bulk load of the course IMO). There are not any assignments or tests based upon actually performing simulation. The first couple of homework assignments are lengthy and difficult but it gets easier as the course goes on. Dr. Goldsman is really fair about curving the exams, I think it ended up being 65 to 88 was a B, so this class is passable. I enjoyed this class because if you put in some decent effort, you have a fair shot at learning some cool concepts, Dr. Goldsman's videos were on point, and although it's not the easiest or most interesting class, you actually feel content with your hard work at the end of it. I'd recommend it not as a first course, but as a second or third.",
                        "_id": "external-import-e7a8a4c3-33da-4f4e-9832-3b270388b86d",
                        "rating": 4,
                        "_createdAt": "2019-09-15T14:00:48Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "body": "This course was absolutely fantastic. The material is all new, but divided in such a way that you stay engaged. The homeworks also really help with the material and the tests line up with what is being taught and included extra credit as well. \n\nI never had a \"thats not fair to ask\" moment. All the tests were super fair and really tested understanding of the concepts. The head TA and the professor were both also super involved, with the professor answering or \"liking\" a lot of the posts on piazza himself. \n\nThe course did not have as much hands-on Arena as I would have liked, but overall this course was great. (Got an  A)",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "semester": {
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z"
                        },
                        "_createdAt": "2019-08-12T17:48:41Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_id": "external-import-ba02a691-dbd1-4ec5-b93c-1843a38da96a",
                        "workload": 5,
                        "id": "external-import-ba02a691-dbd1-4ec5-b93c-1843a38da96a",
                        "created": "2019-08-12T17:48:41Z",
                        "_type": "review",
                        "rating": 5,
                        "course": null
                    },
                    {
                        "created": "2019-08-11T20:07:36Z",
                        "rating": 5,
                        "workload": 8,
                        "difficulty": 5,
                        "course": null,
                        "id": "external-import-7eee33fe-4849-42dc-affa-3a41c1d91049",
                        "_id": "external-import-7eee33fe-4849-42dc-affa-3a41c1d91049",
                        "body": "The key issue with Simulation class is that it is more a Stats/Probability class than a Simulation class. Now when it's over I feel more comfortable with math theory than with building simulations, other than the most simple ones.\n\nWhen preparing for the tests, I have spent almost zero time revising simulation-related questions, and 100% of my time trying to squeeze probabilities, distributions, random variable generations, and other interesting stuff into my brain and into my cheat sheets.\n\nUnfortunately I can't say anything like \"I know Simulation\" or \"I know how to do complex things in Arena\". In terms of real work, I can probably do an intern's job and learn on the go, which is not what I expected.\n\nAll Arena-related stuff in this course is pretty much intuitive. Some advanced simulations are shown, but we are not building anything even remotely that complex.\n\nSo, thanks to Professor Goldsman for making my Probability/Stats more solid, it's a huge thing and will help me a lot! But I think I'll need to learn Simulation myself to feel comfortable using it at work.",
                        "_createdAt": "2019-08-11T20:07:36Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        }
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_id": "external-import-261ebef5-1b74-4684-92ad-c0f11669ce5c",
                        "difficulty": 4,
                        "_createdAt": "2019-08-08T18:00:01Z",
                        "course": null,
                        "_type": "review",
                        "rating": 4,
                        "workload": 11,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-261ebef5-1b74-4684-92ad-c0f11669ce5c",
                        "created": "2019-08-08T18:00:01Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        },
                        "body": "Great professor. Very math heavy. However, this course will give you a solid foundation of statistics needed for other classes in the program. I would like to a see a simulation project added to this course. It was tough to see the tangible outcomes of the information we were learning."
                    },
                    {
                        "_createdAt": "2019-08-07T01:41:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "body": "This is one of the best classes I have taken.  Well thought out lectures, homeworks tested your understanding, and the exams while difficult tested your knowledge and he curves generously.  The professor truly cares and was very active in answering student questions.  Overall an excellent course that tested the underlying theory and then the actual execution of that theory.  My only feedback would be that I wish they would spend more time with Arena.  We went through it in one week and feel like we only skimmed the surface.",
                        "rating": 5,
                        "_id": "external-import-31b05382-cb51-4dc1-8a3b-51fb069e267f",
                        "difficulty": 3,
                        "id": "external-import-31b05382-cb51-4dc1-8a3b-51fb069e267f",
                        "created": "2019-08-07T01:41:02Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 10
                    },
                    {
                        "course": null,
                        "id": "external-import-b483da65-a788-467a-be5b-cd319daade0f",
                        "_id": "external-import-b483da65-a788-467a-be5b-cd319daade0f",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "created": "2019-08-06T23:45:57Z",
                        "_createdAt": "2019-08-06T23:45:57Z",
                        "body": "Overall, as most people describe, this is an enjoyable course. It's a great review and learning course for probability, statistics, and calculus. There are parts of the class that allow you to develop a basic understanding of Arena and how to run simulations, but a majority of the class focuses on the theory. This is good for a graduate level class, but I found it a bit lacking in practicality, as developing a sound and thorough understanding of how Arena works seems helpful for running simulations in industry.\n\nOverall 8.5/10 for me, the professor and TA's are top notch, best of any course I have taken so far (the only class that comes close in this regard so far is 6501).",
                        "workload": 6,
                        "semester": {
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer"
                        }
                    },
                    {
                        "id": "external-import-25d384eb-c7e9-438b-ac90-645643f3e615",
                        "_createdAt": "2019-08-06T22:19:30Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "body": "Very very fair class with extremely entertaining videos.\nI realized halfway through the class that what I was learning would not be particularly useful for my job. So I kinda phoned it in and only watched the lectures for entertainment value and did enough of the homework a 90 and studied maybe 2 hours for each exam.\n\nI got a B on the midterm 2 after studying for 1 hour, then got super super sick the last 3 weeks of the class and decided to put in even less effort. My choice of not studying backfired hard on me. I ended up getting a D on the final, but thankfully the professor seems to be super generous and curves a D+ to a B. The tests were very very fair, and covered EXACTLY the same material you learned to solve the homework problems.\n\nThe main benefit of this class is teaching me that I am not cut out to learn advanced or even intermediate statistics. Even with a professor as entertaining as Dr. Goldman, I could not stay motivated to even memorize my basic stats distributions.\n\nThankfully you can now be an applied data scientist who only moves data around and pumps it through the latest ML packages without understanding any of the underlying math. So hoping I can continue collecting my nice paycheck while not actually knowing statistics.\n\nI intend to only take more CS heavy, less stats heavy electives going forward and will probably aim for a C on the mandatory stats class I need to take.",
                        "course": null,
                        "_type": "review",
                        "workload": 2,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "created": "2019-08-06T22:19:30Z",
                        "rating": 4,
                        "_id": "external-import-25d384eb-c7e9-438b-ac90-645643f3e615",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3
                    },
                    {
                        "id": "external-import-29e8be61-6306-460b-a1c4-7f4a4e20f580",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "_createdAt": "2019-08-05T19:52:23Z",
                        "course": null,
                        "_id": "external-import-29e8be61-6306-460b-a1c4-7f4a4e20f580",
                        "body": "This course is a good intermediate refresher for your prob/stats. It also tackles some interesting concepts in Simulation that would surely help you in your analytics career. Dr. Dave Goldsman is a brilliant lecturer that imparts knowledge to students like no other.\n\nIf you are someone that has a rusty math background like I am, you would find this course a bit challenging at times (thus why I indicated 8hrs/week).\n\nEnroll at your own risk if you love Justin Bieber and you're offended by Clean, Old-Fashioned Hate (a.k.a. making UGA look bad).",
                        "created": "2019-08-05T19:52:23Z",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 8
                    },
                    {
                        "created": "2019-08-05T17:48:59Z",
                        "body": "Loved this class. Engaging, personable lecture style; consistent level (e.g. depth) and pacing of presentation; very clear communication and effective pedagogy; professor and TAs had obvious mastery of the course material.  The introductory calc/prob/stats review was fantastic; my background in calc/lin alg is very strong, but weak in prob/stats; this course taught me what I needed to know.  This is in marked contrast to my experience in ISYE-6414, which I took last year expecting to learn a lot of stats, but that course, while also being well structured/organized topically, was much less clear in presentation - so much so that I had many a-ha moments in 6644 that I should have already gotten in 6414.  \nThe first third of the HWs (e.g. during the calc/prob/stats review) are more challenging; 2nd third are easier, and the final third are easiest.  I experienced the exams trending the opposite way.  Practice exams are provided, and are helpful; A is curved to high-80s and B is very generously curved (to something in the 60s).  Oh-- and relatively detailed, high-quality, essentially error-free lecture slides are provided -- one wouldn't think that would be noteworthy, but alas it has been in this program (cf. 6414, 8803, and to a lesser extent 6203).  \nNeed to say again that the TAs, and even Prof. Goldsman, are extraordinarily active/responsive on piazza, with adding extra office hours, even offering individual help.  It's truly remarkable.  Such a great experience.\n\nMy only critical feedback would be that I occasionally wanted Prof. Goldsman to be a little more technical/detailed in his presentation (e.g. when he described convolution in Lecture 7.6 as \"basically adding things up\"; like, please say more than that!).  But I get that that is a level-of-coverage choice, and it's consistent across the course.\n\nIn sum: 10/10, would recommend :)",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "rating": 5,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_createdAt": "2019-08-05T17:48:59Z",
                        "id": "external-import-28a0ba5d-c596-453c-8c22-74a73d75d813",
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2"
                        },
                        "_id": "external-import-28a0ba5d-c596-453c-8c22-74a73d75d813"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "difficulty": 4,
                        "_createdAt": "2019-08-05T14:22:34Z",
                        "rating": 5,
                        "created": "2019-08-05T14:22:34Z",
                        "course": null,
                        "_id": "external-import-b0cb6c5e-b17d-487c-9050-de560a120aec",
                        "_type": "review",
                        "body": "Dr. Goldsman makes this course. He teaches concepts well and keeps you entertained. The TA's are excellent, too. I felt the review of statistics was really helpful for me as I don't have a good statistics background.",
                        "id": "external-import-b0cb6c5e-b17d-487c-9050-de560a120aec"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "id": "external-import-bba23d3d-1c60-4017-a737-ceb26853f60f",
                        "_id": "external-import-bba23d3d-1c60-4017-a737-ceb26853f60f",
                        "body": "As others said, this is a great course. The teacher, the lectures, and the TAs are all awesome.\n\nI've decided to do the course after dropping Deterministic Optimization, and I'm pleased with my decision.\n\nEven though the course is said to be self-contained, I disagree a little with this statement. You need to know how to do double (basic) double integrals, and partial derivatives as those subject are not really taught in the course. Only single variate calculus is covered in this course, but you need to understand partial derivatives for the Maximum Likelihood Estimator's lecture, for instance.\n\nOther than that, you need to be comfortable with probabilities and stats. Those topics are covered in the course, but you might feel a need to have a good grasp on them before starting the semester. Thankfully, prof Goldsman provides a free undergraduate course online:\n\n- Videos: https://mediaspace.gatech.edu/esearch/search?keyword=6739\n- Slides + practice exams: https://www2.isye.gatech.edu/~sman/courses/6739/\n\nAbout the course itself, I consider it to be more like a graduate math class that talks about simulation than an applied simulation course. So, if you want to get a job in the simulation field, you might need to do another course. But if you're like me and you needed a great course to refresh your math skills, ISYE 6644 is the way to go.",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 20,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester"
                        },
                        "difficulty": 3,
                        "_createdAt": "2019-08-05T14:19:15Z",
                        "created": "2019-08-05T14:19:15Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "rating": 5
                    },
                    {
                        "workload": 7,
                        "body": "Loved the interaction with Goldsman and the TAs were very responsive.  Super interesting material and great overall course.",
                        "difficulty": 3,
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-c5c3a9fd-6297-44e0-9c01-f87e87a7a9a0",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "rating": 5,
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-c5c3a9fd-6297-44e0-9c01-f87e87a7a9a0",
                        "_createdAt": "2019-08-02T20:20:39Z",
                        "created": "2019-08-02T20:20:39Z"
                    },
                    {
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "workload": 7,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-6130fe26-4f75-476f-8bf7-ec353f44eaec",
                        "rating": 5,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "body": "I really liked this course. I had a strong probability/stats background coming in so I was taking in part because I wanted to work a little with Arena (sim software) and deepen my understanding of some of the theory. It was well structured for an online format. homeworks weren't too difficult, they generally followed the videos. Prof is really dorky (i mean that as a compliment) and the lectures are actually somewhat entertaining and you can skip a lot of the proofs if you aren't interested. I ended up watching all of them anyway. 3 Tests with a cheat sheet allowed. I wish all the classes in the program were this straightforward and the professors showed the same level of enthusiasm for the material.",
                        "_createdAt": "2019-05-08T15:24:12Z",
                        "created": "2019-05-08T15:24:12Z",
                        "_type": "review",
                        "_id": "external-import-6130fe26-4f75-476f-8bf7-ec353f44eaec"
                    },
                    {
                        "_id": "external-import-5c88805f-ea97-49ec-9009-a6ee9f86d77a",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-05-05T21:13:31Z",
                        "_createdAt": "2019-05-05T21:13:31Z",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "id": "external-import-5c88805f-ea97-49ec-9009-a6ee9f86d77a",
                        "body": "Excellent course. Dr. Goldsman is an absolute delight and his lectures are not only fun and entertaining, but also extremely well-organized and understandable. He goes out of his way to present all the foundational information you need before introducing new/advanced concepts, something I wish all lecturers would do. The math is challenging, but Goldsman gives you all you need to succeed. Tests were all very reasonable, all multiple choice or T/F, but with no gotcha's and really test your understanding of the material. I think this is a can't-miss course for OMSA students, make sure you include this in your plans!",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 4,
                        "workload": 6
                    },
                    {
                        "id": "external-import-f2551dfb-6911-4b11-af4c-1c9fff7d6841",
                        "created": "2019-04-30T04:09:17Z",
                        "rating": 5,
                        "body": "An amazing course, a great professor. It gave some solid foundation of probability theory and statistics, such as Maximum Likelihood Estimator and such. \nThe lectures are well constructed, but definitely not easy - it has lots and lots of math involved. And you get to enjoy Prof. Goldman's great jokes.\n\nWhile the exam results weren't the best for me, I learned a ton and definitely have background for the further investigation into statistics, such as bayesian statistics and such. Grading is quite lenient and \"generously curved\".\nAlso, the TAs were top notch, almost ever-present with a ton of motivation. Thanks guys.\n\nIt was an excellent course, with excellent lectures, and responsive TAs / Professor. Absolute recommendation for the first course in statistics, as it covers a fair amount of basic ground.",
                        "_createdAt": "2019-04-30T04:09:17Z",
                        "_type": "review",
                        "workload": 12,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "_id": "external-import-f2551dfb-6911-4b11-af4c-1c9fff7d6841",
                        "course": null
                    },
                    {
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-49ee15ce-65e8-4ed2-99b1-c35e03e898da",
                        "rating": 5,
                        "course": null,
                        "_id": "external-import-49ee15ce-65e8-4ed2-99b1-c35e03e898da",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "body": "This is a great class.   Professor Goldsman is an enthusiastic teacher that does a great job  teaching a fairly challenging subject.  As other reviews have noted, this class is primarily a math class.  You build very few simulations in the class which I know people have found disappointing but there is definitely a method to his madness.  I recently built a simulation and found myself using all kinds of stuff I learned in this class to build it.  \n\nAs for difficulty, it very much depends on your comfort with statistics and calculus.  The class is entirely self contained and almost everything you need to know Professor Goldsman will cover in lectures so its a great place to work on your stats knowledge if you feel its lacking (this is a big reason I took this course).  If you find calculus and statistics to be trivial exercises, this class will be fairly easy.  There is homework every week and the exams are fair but challenging.  Prof Goldsman is known for being a generous grader (they don't call him \"Big Curve\" Goldsman for nothing as he would say.)",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "created": "2019-04-27T14:32:11Z",
                        "_createdAt": "2019-04-27T14:32:11Z",
                        "difficulty": 3,
                        "workload": 12
                    },
                    {
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "body": "Dr. Goldsman is gold.\n\nThe title of the course is misleading. I was expecting \"driver's ed\" but got \"how to design a car.\" \n\nIt's not a bad thing, as I strengthed my foundation in statistics, expecially distributions and random variables, which was sorely lacking, and refreshed my basic calculus.\n\nI highly recommend the course, with the caveat that you won't be doing a lot of simulating, but you'll understand how simulations get made.",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 4,
                        "_createdAt": "2019-04-25T19:10:50Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-4d0c73c5-5dc5-4129-bfd8-5ff647f1b8db",
                        "created": "2019-04-25T19:10:50Z",
                        "rating": 4,
                        "_type": "review",
                        "workload": 8,
                        "_id": "external-import-4d0c73c5-5dc5-4129-bfd8-5ff647f1b8db"
                    },
                    {
                        "created": "2019-04-25T14:49:23Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 20,
                        "body": "This is a phenomenal course. Professor Goldsman does an amazing job of keeping the course self contained (you won't need to remember much from your \"baby stats\" class) and presenting very complex material in a common sense manner. \n\nAssignments were fair, nearly every assignment had bonus problems. All tests were multiple choice (surprisingly difficult still) but he does grade on a curve. \n\nThis is my favorite course in the program so far.",
                        "difficulty": 4,
                        "id": "external-import-8858fdf4-ce4e-4912-b7f7-92e83b402cb2",
                        "_createdAt": "2019-04-25T14:49:23Z",
                        "course": null,
                        "_type": "review",
                        "rating": 5,
                        "_id": "external-import-8858fdf4-ce4e-4912-b7f7-92e83b402cb2",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "rating": 5,
                        "course": null,
                        "id": "external-import-ff5e61c1-b997-42be-b79f-cabe97578cfc",
                        "created": "2019-04-25T13:30:22Z",
                        "workload": 7.5,
                        "_id": "external-import-ff5e61c1-b997-42be-b79f-cabe97578cfc",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_type": "review",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "body": "There is really only one reason to take this course -- Professor Goldsman!  Somehow, his personality oozes from the videos and Piazza and it's hard to not like him. \n\nThe class offers a good theoretical background in simulation concepts including issues around designing simulations, generating random numbers, and analyzing simulation output.\n\nThe only negative thing I would say is that there is not much \"hands-on\" chances to build your own simulations.  He does provide MANY ARENA files as examples and you do need to use them for a few of the homework assignments.\n\nHe is very reasonable and flexible as far as course due dates and he even offers some bonus questions on homeworks.  The TAs in the semester I took it were awesome as well.\n\nOverall, this course is a must-take if you are in OMSA purely for the chance to meet Professor Goldsman.",
                        "_createdAt": "2019-04-25T13:30:22Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_id": "external-import-af464a07-b3f5-4933-9e28-0b8decd21973",
                        "body": "I was excited to take this class and wanted so much to like it. I'll try to highlight the good and bad below:\n\nGood:\n- Professor Goldsman is hilarious. I actually LOL'ed at several points during the videos\n- You go through a calculus and probability bootcamp at the start of the course, so if you were a little light on your pre-reqs coming in, you get a refresher (NOTE: Do yourself a favor and brush up on these topics before you take this course!!)\n- Lecture videos are long, but generally the prof keeps things interesting\n- Workload isn't too bad, but requires some cramming before each test (I suppose like any other course).\n- TA support is good\n\nBad:\n- My big issue with the course is that I feel like I learned a bunch of math without any idea of the applications. We only spent one week going through Arena, and this was basically just a tutorial to get you familiar with the tool. I still have 3 weeks left in the class, but I don't really see us ever using Arena again - hopefully I'm wrong!\n- To expand on the above, most of the lecture videos were going through complex proofs of different mathmatical techniques and formulas. I can understand needing these if I was an undergrad engineering student, but as someone in the workforce, I feel like the content needed to be much more applied. I think a better approach would be to take more of a case study approach to each module - starting with a simple simulation to highlight how to generate basic uniform RVs, and then moving on to more advanced simulations to highlight advanced concepts. I'm planning on including this feedback in my GTech course review as well.\n\nSo, overall, I feel like I'll leave the course more comfortable with how to do double integrals and plug numbers into different probability density functions to get random variables, but if someone asked me \"hey, run a simulation on how this factory works!\", I'd be lost.",
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-af464a07-b3f5-4933-9e28-0b8decd21973",
                        "created": "2019-03-25T21:42:30Z",
                        "rating": 3,
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_type": "review",
                        "course": null,
                        "_createdAt": "2019-03-25T21:42:30Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4,
                        "workload": 5,
                        "id": "external-import-27cb2709-4bee-4d81-b484-af04882447e6",
                        "created": "2018-08-08T14:45:45Z",
                        "course": null,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "body": "Overall, a pretty effective course in the basis of simulation. However, note that the basis provided is for math; a lot of the material goes towards helping the student understand what goes on under the hood so there is quite a bit of probability, statistics, and calculus in the course. Overall, maybe 80% has to do with the math and about 20% is actually using simulation and the simulation language. There will be demonstrations and case studies, but those will be more for self-enrichment as the exams cover the math and simulation concepts.\n\nGrade breakdown came to 3 exams (30% each), one cheat sheet for exam 1, two cheat sheets for exam 2, and three cheat sheets for exam 3. Exams were very reasonable and most of the exams had high B/low A average for a class of 50 or so in SU2018. Last 10% is homework.\n\nProfessor is an interesting and animated guy who keeps his long lectures interesting (compared to management who keeps their long lectures boring). Lecture material goes into a lot more proofs than most people would be comfortable with, and whether it contributes to learning...your mileage may vary. Second pass at development could probably benefit from cutting down on proofs and shifting the bandwidth towards a solo or group project to simulate some real-world process. Otherwise, lots was learned in this class and is worth taking - would like to see a part two of this class for the above.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_type": "review",
                        "_id": "external-import-27cb2709-4bee-4d81-b484-af04882447e6",
                        "_createdAt": "2018-08-08T14:45:45Z"
                    },
                    {
                        "created": "2018-08-07T14:24:29Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 5,
                        "course": null,
                        "_id": "external-import-c2a6efa8-185a-46f9-96e2-4b4f3cc03fa3",
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-c2a6efa8-185a-46f9-96e2-4b4f3cc03fa3",
                        "_createdAt": "2018-08-07T14:24:29Z",
                        "workload": 6,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "This course covers both theoretical and practical aspects of simulations. Theory part is mainly on probability, and its level is on undergraduate senior level if you follow closely. The practical part is on case studies about using Arena for simulation. I can see Arena is very useful in modelling simulations. The only part I am not happy with the course is that it does not have large projects using Arena. The best part of the course is Prof. David Goldsman. Absolutely amazing!",
                        "_type": "review"
                    },
                    {
                        "workload": 10,
                        "_id": "external-import-e25d0baa-13e0-480d-83b1-452ed176dcdb",
                        "_createdAt": "2018-08-07T03:09:22Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "difficulty": 4,
                        "created": "2018-08-07T03:09:22Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "body": "Course materials are top notch, I enjoyed so much watching lectures and trying out Arena software to model simulation like call center etc. Homework are well thought to prepare students for tests.  This course is heavy in math, embrace it you will come out of this course knowing tons of probability, random variables, and other statistics things. \n\nIn short, its an excellent course, it makes me start seeing problems around me that can be simulated and what kind of distribution the data should be drawn from. \n\nFor Mac User, you have to install Windows as Arena is only available in Windows, but its not an issue at all, as free VM like Virtualbox are readily available.",
                        "rating": 5,
                        "id": "external-import-e25d0baa-13e0-480d-83b1-452ed176dcdb"
                    },
                    {
                        "id": "external-import-342e25bb-4484-44a1-bfe5-cb2e7cc6a4b4",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_type": "review",
                        "workload": 10,
                        "_id": "external-import-342e25bb-4484-44a1-bfe5-cb2e7cc6a4b4",
                        "created": "2018-07-30T03:12:29Z",
                        "course": null,
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "body": "First thing to say about this class is that the professor, Dave Goldsman, is probably one of the nicest, fairest and most likable teachers one could ask for. His good-natured UGA jokes kept things light. He was ridiculously accommodating to extra time requests when some of my classmates couldn't take their tests by the deadline. If all this isn't enough, he even referred to himself as Dave \"generous curve\" Goldsman. \n\nHe really wants you to learn the material at the level that is most suitable for YOU. If you are a math nerd and want to get jiggy with it on proofs and derivations, there will be plenty of that. On the other hand, if, like me, you find that stuff a bit much, and prefer to get a high level understanding of things and plug and chug the formulae, you can still at least succeed in the course with the requisite grade. The course works on different levels. \n\nYou will have 3 proctor trak'd tests. They were usually about 30-35 questions in 2 hours. You are allowed one cheat sheet for MT1, 2 cheat sheets for MT2, and 3 for the final. Interestingly, my cheat sheets weren't necessarily that helpful in that one can often figure out the correct answer by simply understanding the principles involved. Or in the cases where I got something wrong, my cheat sheet wouldn't have helped anyway. \n\nWorkload wasn't too bad. I took it in the summer and could watch the videos and do the homework in probably 5 hours per week. It's the preparation for the exams where I spent most of my time. Those weeks I could easily spend 10 or more hours reviewing and creating my cheat sheets. It's funny, but in a way, the creation of the cheat sheets is when you really learn the material best as it's now the 4th time you're going over it (lecture > knowledge check > homework > cheat sheet), but at a different pace. \n\nAs for the subject matter, it mostly follows the book, \"Simulation Modeling and Analysis.\" Like most OMSA courses, you don't need to buy the book, but I picked up an old edition on Amazon for, like, 20 bucks. Figure it's good to have on the shelf. I particularly liked the parts on random variate generation and will find that topic more useful, I think, than any other. My only complaint (and this is similar to optimization, from what I hear) is that the material is very theoretical, rigorous and mathy while providing few if any opportunities for actually building a simulation. Perhaps that is another course, I don't know. One thing is for sure, though, you will come out of this class with a solid understanding of the considerations involved in conducting a simulation study. The experience in actually building one, however, will come with practice later.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-07-30T03:12:29Z"
                    }
                ],
                "rating": 4.310344827586207,
                "difficulty": 3.293103448275862,
                "workload": 11.456896551724139
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "simulation"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}