{
    "props": {
        "pageProps": {
            "course": {
                "created": "2022-07-05T23:23:15Z",
                "codes": [
                    "MGT-6203"
                ],
                "isDeprecated": false,
                "tags": [],
                "slug": "data-analytics-in-business",
                "creditHours": 3,
                "syllabusUrl": null,
                "id": "external-import-MGT-6203",
                "description": "This course teaches the scientific process of transforming data into insights for making better business decisions. The use of examples places business analytics techniques in context and teaches students how to avoid the common pitfalls, emphasizing the importance of building proper models.",
                "_updatedAt": "2022-08-24T17:24:03Z",
                "isFoundational": false,
                "name": "Data Analytics in Business",
                "_id": "external-import-MGT-6203",
                "reviews": [
                    {
                        "_createdAt": "2024-08-11T04:00:01Z",
                        "created": "2024-08-11T04:00:01Z",
                        "workload": 5,
                        "body": "This class was easy, and definitely not much of a burden even with the project, but after I completed the course I asked myself why? I really don't understand why this course is required and should at most be an elective for the business analytics students. \n\nAs for the material, the first 5 weeks covers regression, which is already covered in other courses. If anything, having a full class in regression be mandatory makes more sense than whatever this course was (I understand there's gripes with the regression course as well but I just think a mandatory regression course in general makes more sense for the program than this class). The professor also simply reads off the slides in the videos so they're really boring and unengaging. The next 3 weeks are in finance and although I found the material interesting and well taught, it was very high level and may make more sense to have an elective course on it that goes in greater detail. Then there was marketing which was just some of the lowest quality lectures you may experience. The videos consist of long tangents about topics such as the history of marketing and making a Facebook Ad campaign. Really not meaningful to an analytics degree. Fortunately, as of this semester, there's no closed book testing on this section so you can get by without watching the videos and just flipping through the notes to answer any questions on them. Lastly there was supply chain which again I thought was well taught but is 1. already taught in mgt 8803 so it's not necessary here, and 2. Is pretty high level and I think may be better off as an elective.\n\nAs for the grading in this class, it's really a joke. There are multiple choice self assessments which you can pretty much just flip through your notes to answer the questions without even truly learning. There are 3 homeworks and half of it is pretty much just like the self assessment, and then the other have is coding based which they provide similar examples for. The coding portion is probably the easiest to mess up on in this class but it wasn't difficult as far as a grad degree is concerned. For the midterm, the multiple choice was closed book besides a cheat sheet but it was mainly on regression and some finance so fortunately it didn't involve studying the marketing section, and then the coding was open book multiple choice questions. For the final however, it was completely open book and untimed which was nice for the easy A but I again didn't feel like I was really forcing myself to learn the material. \n\nI didn't find the project to be much of a burden as long as you get a good group at the start of the course, chip away at it throughout the semester, and follow the guidelines. I've heard they don't offer it every semester anymore so this may or may not apply. \n\nI really don't understand why this course is mandatory and what we're supposed to get out of it . Sure it's easier and a lighter course load so you can pair it with something or take it alone if you want a light semester, but is that what a master's degree is about? I've seen others mention that the course being lighter allowed them to really focus on learning R which can be true but again, there are free online courses you can take if you really want to learn that in depth. I really think it would be more worthwhile to eliminate this course and make a different course that's more valuable to this degree mandatory, because I couldn't tell you what I gained from taking this",
                        "id": "FYsk5S1Mp27IS8S7Us7GPo",
                        "_id": "FYsk5S1Mp27IS8S7Us7GPo",
                        "authorId": "cRXz1sFin0M1pGkQUS9Ykg==",
                        "_updatedAt": "2024-08-11T04:00:01Z",
                        "course": null,
                        "difficulty": 2,
                        "_rev": "FYsk5S1Mp27IS8S7Us7GKh",
                        "_type": "review",
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08"
                        }
                    },
                    {
                        "id": "0zwV6JWkoiMq9vnKyY978W",
                        "semester": {
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "course": null,
                        "body": "Man, this is WILD! I’m trying to get my kid to sleep and keep up with this online class, but it’s a total circus. That is until I hit the marketing section by Professor Frederic Bien. I start to play the lecture recording, and boom—my kid’s out cold, no fuss, just lights out.  I can't express my gratitude enough to Professor Bien for granting me the peace I needed to get an A in this course, THANK YOU PROFESSOR BIEN!!",
                        "created": "2024-08-09T04:41:42Z",
                        "_rev": "0zwV6JWkoiMq9vnKyY974T",
                        "workload": 8,
                        "_id": "0zwV6JWkoiMq9vnKyY978W",
                        "authorId": "WHiIEH1su6WtKmpqUU6EZw==",
                        "_type": "review",
                        "rating": 3,
                        "difficulty": 2,
                        "_createdAt": "2024-08-09T04:41:42Z",
                        "_updatedAt": "2024-08-09T04:41:42Z"
                    },
                    {
                        "_type": "review",
                        "_rev": "CZnPCJFeW1IiYXKDMfFEOE",
                        "_createdAt": "2024-08-02T10:34:22Z",
                        "created": "2024-08-02T10:34:22Z",
                        "rating": 1,
                        "workload": 3,
                        "semester": {
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08"
                        },
                        "difficulty": 1,
                        "id": "CZnPCJFeW1IiYXKDMfFERW",
                        "body": "This course reminded me of an afternoon workshop I had in middle school where we learned about 'business'. That content we covered that afternoon was probably the same depth and difficulty as this course. This course is such a colossal waste of credits. It made me regret doing OMSA instead of OMSCS. The course is a high-level overview of some disjointed business topics (including regression?!), which is not why I signed up to do an analytics degree.\n\nAnyway, the finance and operations sections weren't too bad. It just all felt disconnected and too high-level to be worth anything. One of the 'readings' was a 3-page Vanguard brochure. Like, seriously? Is this graduate school?\n\nBy far the worst part was the project though. First of all, I was shocked by how many people actually didn't have a github account. They claim that employers and former students have told them it was the most valuable part of the course, but I've seen nothing like that on OMS Central. All I could think about while doing the product was, 'If you worked for me, I would have fired you a long time ago', but instead, most of the time I had to bite my tongue and say something constructive about the GPT generated code instead while I spent a few Saturdays rewriting the report. Seriously, people were pushing code with comments like # replace with the actual filepath, # Assuming you have computed xyz. What a horrible class. I think without a team I could have done the project in a day, with a team it probably took me a few weekends. Way longer than the combined time I spent on the other parts.\n\nMy advice for prospective students: take it over the summer - They drop the project.\nMy request for Georgia Tech - Please make this course optional. At least for the Computational and Analytics tracks. ",
                        "course": null,
                        "_id": "CZnPCJFeW1IiYXKDMfFERW",
                        "authorId": "XzosBcdhnDW15JHR+dckJw==",
                        "_updatedAt": "2024-08-02T10:34:22Z"
                    },
                    {
                        "_rev": "dqLk8bhtx103SwqVgRxmja",
                        "rating": 2,
                        "_id": "dqLk8bhtx103SwqVgRxmnQ",
                        "workload": 3,
                        "_createdAt": "2024-05-09T18:47:07Z",
                        "body": "I did. not. learn. anything. Final was open notes unproctored so I just opened a bunch of tabs with slides and control-effed everything. Got out with a final grade of B.\n\nBest part was the people I met in the group project. Learned more from them than from the class. At best this was a chance to review/apply a few things I learned in the earlier core classes.",
                        "_updatedAt": "2024-05-09T18:47:07Z",
                        "difficulty": 3,
                        "authorId": "cyXKgHsaBlqraVWSRsGeSw==",
                        "id": "dqLk8bhtx103SwqVgRxmnQ",
                        "_type": "review",
                        "course": null,
                        "created": "2024-05-09T18:47:07Z",
                        "semester": {
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05"
                        }
                    },
                    {
                        "body": "This was one of the easiest class...With that being said, I see this has a lot of low rating, but I am not so sure why. Some parts of the lesson does suck. Now that I read the reviews, I vaguely remember that marketing section exists...But I think the real take away for this class for me was how to use R. \n\nThis class shows you line by line code on how to use R for analysis, and I learned a ton about R that introduction to modelling did not teach...other than that, I do not think there is much to this course. \n\nJust take the exams and do your project and you will end up with an A. ",
                        "_rev": "4nHiAiCDrFrMhA2bPXdaSp",
                        "workload": 5,
                        "_type": "review",
                        "authorId": "zPMpZ4qbv+TFymmd8hVL2g==",
                        "_createdAt": "2024-03-28T12:35:48Z",
                        "course": null,
                        "semester": {
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15"
                        },
                        "_updatedAt": "2024-03-28T12:35:48Z",
                        "created": "2024-03-28T12:35:48Z",
                        "rating": 4,
                        "id": "4nHiAiCDrFrMhA2bPXdaUH",
                        "_id": "4nHiAiCDrFrMhA2bPXdaUH",
                        "difficulty": 2
                    },
                    {
                        "workload": 4,
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "body": "Overview:\nThe curriculum is structured in 4 parts: Regression, Investments, Marketing and Operation Managements. \n\nPros:\n1. The group project was a great application to apply models to real-world problems and consolidate what we know. The group project required us to find a dataset and apply models to achieve a finding.\n2. The workload is light during periods without group project / midterms. On weeks without midterm / assignment (3 assignments)/ group project, expect to only do 1 hour of lecture. On weeks with midterms, expect maybe 4-6 hours to do a revision and you're done.\n3. Regression was more detailed than ISYE6501 (just the linear regression portion, this course didn't go through LASSO & Ridge).  \n\nCons:\n1. The midterms, assignments and finals are riddled with errors that students have to flag to instructors. These are not the typo errors but rather errors on sections that are essential to answer the question. It was advisable to wait for 2 - 3 days from the starting dates of midterms for all errors to be clarified on Piazza. One would expect the TAs to try the papers to get rid of these fundamental errors.\n2. The content of the regression and marketing lectures are read verbatim word-for-word. One can just skim through the slides without going through the lecture. Overall, the content of these 2 sections are not engaging. The remaining 2: Investments and Operational Management is slightly more engaging but touch these 2 areas on a very high level (which is expected given it's an introductory course).\n3. The group project starts about 2/3 through the programme and by then only regression is taught which is definitely insufficient for the project. Therefore, one should expect other modelling techniques (could be from ISYE6501 or other courses) before joining this course which is weird as I would expect one to apply the learnings of the course on a project, not from other courses.\n\nI can see why this is a compulsory course for OMSA to expose the \"business analytics\" side but to me, the only plus side of this course is the group project.",
                        "difficulty": 1,
                        "authorId": "+f0pupb29VclcTpEosLxyg==",
                        "_rev": "06AlKCkzJa2HP46QQGrLG2",
                        "rating": 1,
                        "created": "2023-12-09T15:11:11Z",
                        "_type": "review",
                        "_updatedAt": "2023-12-09T15:11:11Z",
                        "_id": "06AlKCkzJa2HP46QQGrLLK",
                        "id": "06AlKCkzJa2HP46QQGrLLK",
                        "_createdAt": "2023-12-09T15:11:11Z",
                        "course": null
                    },
                    {
                        "difficulty": 2,
                        "_rev": "G2CNO6q5LhmMM5wp3whZRv",
                        "id": "G2CNO6q5LhmMM5wp3whZXE",
                        "authorId": "fpevekfVSYsO3+gyyItRMg==",
                        "body": "A semester or two ago, they added a group project to this class that lasts about 6 weeks. The project was pretty open-ended, and you can use any language. I spent about 12 hrs/week during the project and 6 hrs/week before the project started. There are 4 units in the course, which I'd paraphrase as Regression, Investments, Digital Marketing, and Logistics.\n\nThings I valued: Deeper treatment of linear regression than in ISYE 6501, Investments unit, queueing topic, plenty of practice with R, various analytics techniques I learned from the group project.\n\nThings I didn't like: Digital Marketing unit was outdated, shallow content for some of the topics, course schedule got a little compressed at times.\n\nOverall, it was fine. If the class wasn't required, I would have substituted something else in place of it.",
                        "created": "2023-07-29T03:44:42Z",
                        "workload": 12,
                        "_id": "G2CNO6q5LhmMM5wp3whZXE",
                        "_updatedAt": "2023-07-29T03:44:42Z",
                        "course": null,
                        "semester": {
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249",
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "_createdAt": "2023-07-29T03:44:42Z",
                        "rating": 3
                    },
                    {
                        "id": "meCCLzRK2zIBL5FIK5Mkno",
                        "created": "2023-07-27T08:24:04Z",
                        "authorId": "nukElMDFaLllB6WVzGC31Q==",
                        "difficulty": 3,
                        "course": null,
                        "body": "I rarely wrote reviews for courses, but for this one, I have to. This course is stunningly low quality, especially the marketing part. It's a shame to offer this course in the OMSA, all the instructors for this course except for the financial one should be replaced. They should feel ashamed to giving instructions to us. They don't reach the standard to be a good teacher.  They're destructors, they have destructed my interest in all the content in this course. You don't believe？ Try it and feel how poor it is. ",
                        "_createdAt": "2023-07-27T08:24:04Z",
                        "semester": {
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249"
                        },
                        "_updatedAt": "2023-07-27T08:24:04Z",
                        "_type": "review",
                        "_id": "meCCLzRK2zIBL5FIK5Mkno",
                        "_rev": "meCCLzRK2zIBL5FIK5MkkR",
                        "rating": 1,
                        "workload": 6
                    },
                    {
                        "_type": "review",
                        "_id": "2i4ajiwomZ7VzWFjXjABRG",
                        "created": "2023-07-24T02:11:53Z",
                        "_rev": "2i4ajiwomZ7VzWFjXjABOc",
                        "_createdAt": "2023-07-24T02:11:53Z",
                        "difficulty": 1,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "The TA office hours were very helpful for the hw and exams. The Prof office hours did not help directly with the material but could be useful for the project. The project is pretty straight forward but has a lot of deliverables. If you keep pace, these deliverables make the next deliverable easier. The HWs varied in time and a few were a little convoluted and poorly written. Since this was summer, the pacing was crazy at the end of the semester between HWs, project and final all due within 1 week. The coarse started off a little slow but picked up the pace in July. ",
                        "_updatedAt": "2023-07-24T02:11:53Z",
                        "id": "2i4ajiwomZ7VzWFjXjABRG",
                        "workload": 10,
                        "authorId": "zXytX34msAsoiWRNpcQHTw==",
                        "rating": 4,
                        "course": null
                    },
                    {
                        "semester": {
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "created": "2023-04-16T16:33:35Z",
                        "_id": "lJjgBmapbYHbRYJV3Ztf4F",
                        "course": null,
                        "id": "lJjgBmapbYHbRYJV3Ztf4F",
                        "_updatedAt": "2023-04-16T16:33:35Z",
                        "difficulty": 3,
                        "_createdAt": "2023-04-16T16:33:35Z",
                        "_rev": "lJjgBmapbYHbRYJV3Ztf2j",
                        "_type": "review",
                        "workload": 8,
                        "authorId": "SeDj5kmMwN0Y96F232TCgQ==",
                        "rating": 1,
                        "body": "The worst thing this class ever did was introduce the project. I decided to pair this class with a harder subject since it was supposed to be one of the less demanding classes, and the group project made this class so much worse. Not because of the workload, but because of how unorganized everything is. We're expected to start this project and pick our topics (which we should learn in the course) before we even know what this entire course is about. I wasted 5 weekends in a row because of this project and for what? Absolutely nothing. Did not learn a single thing.  It's also counterintuitive as I spent so much time on this project and I barely had time to learn about the other material this course offers. For the sake of all future students who are taking this course, please remove the project, it doesn't make sense to have it. \n\nThe only positive things about this course that I personally liked was the finance section. I found it very interesting to learn."
                    },
                    {
                        "_rev": "xmBjspF1V07yE5m3XNLJzU",
                        "_id": "xmBjspF1V07yE5m3XNLK2s",
                        "difficulty": 1,
                        "created": "2023-03-29T17:59:02Z",
                        "body": "Waste of time and money. This course should definitely be removed.\nAll low-quality materials, late and low-quality responses in PIAZZA, not motivated at all, non-value OH.\nThe organization is also messy. Here are the facts: Late uploading of OH (>96H after holding of it) and no improvement at all through the semester. Poor design of the project schedule creates more busy work than needed. Unexpected changes such as cancellation of OH, and delay in releasing homework actually happening. The wrong solution has been even initially released for one of the HW too. Doubt there is almost no quality control.\nContent wise, digital marketing part is the most poorly designed because you can only see some slides from another Prof, and some outdated data and random screenshots. \nThe most low-quality course I have ever taken including MOOC and undergrad.",
                        "course": null,
                        "authorId": "D5LBelrnSfXsWKiPmrCUTA==",
                        "rating": 1,
                        "semester": {
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "id": "xmBjspF1V07yE5m3XNLK2s",
                        "_createdAt": "2023-03-29T17:59:02Z",
                        "_type": "review",
                        "_updatedAt": "2023-03-29T17:59:02Z",
                        "workload": 5
                    },
                    {
                        "id": "fzIldrAWHJy6U3JqBXxi1Y",
                        "_updatedAt": "2023-02-17T22:46:24Z",
                        "workload": 7,
                        "_createdAt": "2023-02-17T22:46:24Z",
                        "_rev": "fzIldrAWHJy6U3JqBXxhxG",
                        "_type": "review",
                        "course": null,
                        "difficulty": 2,
                        "created": "2023-02-17T22:46:24Z",
                        "body": "low-quality material, inflexible syllabus, unhelpful TAs, invisible instructor, messy group project, waste of ....",
                        "authorId": "ADkEleB5VSTaLtzfiLkcDw==",
                        "rating": 1,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z"
                        },
                        "_id": "fzIldrAWHJy6U3JqBXxi1Y"
                    },
                    {
                        "rating": 1,
                        "_rev": "2Vx1PvkVoQ26NIDGicEiaU",
                        "course": null,
                        "_updatedAt": "2023-01-18T18:28:53Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22"
                        },
                        "difficulty": 3,
                        "_createdAt": "2023-01-18T18:28:53Z",
                        "_id": "2Vx1PvkVoQ26NIDGicEicu",
                        "body": "It’s a shame that this is a required course for OMSA, because it’s badly executed on many levels.\n\nLike other classes from the business school, this is taught cooperatively by several professors, which is a horribly disorganized endeavor. \n\nDeadlines don’t make sense and get moved, while profs and TAs complain about how swamped they are by their own schedule.\n\nFrom a technical perspective, the class is extremely introductory. Likely one or two of the topics will be new to you, but if you did a technical undergrad or have taken other courses in the program first, most of the course will feel like a review.\n\nDespite this, it was still hard to get a good grade in the class because assignments were poorly designed and TA’s grading was laughably inconsistent. A regrade request on one assignment changed my grade by 45 points.\n\nThe instructors give you about 50 pages spread across several sources as guidelines for assembling a 10 page project report. Instructions are rife with inconsistencies and hidden details, so your grade will be at the whim of your TA. You’ll have to work on a team of 4-5 students, 1 or 2 of whom will not contribute and face no repercussions. And you’ll have to do everything in R, even though nobody will bother looking at your code. \n\nThere’s just so much low hanging fruit – easy changes that could make this course far more effective, and I’m sure it gets reiterated in every student’s survey. One has to assume the instructors simply don’t care.\n",
                        "id": "2Vx1PvkVoQ26NIDGicEicu",
                        "created": "2023-01-18T18:28:53Z",
                        "authorId": "YcRCrpL/0MAbjrBk0BQjiA==",
                        "_type": "review",
                        "workload": 6
                    },
                    {
                        "_id": "zYXwCtUNWkpLqUJ50wUgLX",
                        "id": "zYXwCtUNWkpLqUJ50wUgLX",
                        "difficulty": 2,
                        "_type": "review",
                        "workload": 8,
                        "body": "I assumed some of the issues were caused by the new format and the abbreviated Summer term, but based on other reviews, that doesn't appear to be the case. I've only taken a few courses, so far, but this was the worst by a  lot. Most assignments are lazy multiple choice and auto-graded. The peer grading of the coding portion is worthless and unpredictable. Assignments are scheduled and due at random times (often not lining up with the lessons). The project, as most group projects, is frustrating, tedious, and completely disjointed from the curriculum. \n\nI will say I enjoyed the first couple weeks on Regression, but the last half of the course was a complete waste of time and I didn't learn anything I couldn't have easily googled. \n\nThe only positive is that you would have to work to make less than a B in this class, but getting an A was harder than it should have been due to the chaos.",
                        "_rev": "zYXwCtUNWkpLqUJ50wUgGp",
                        "rating": 2,
                        "course": null,
                        "_createdAt": "2022-08-17T15:37:53Z",
                        "created": "2022-08-17T15:37:53Z",
                        "_updatedAt": "2022-08-17T15:37:53Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2"
                        },
                        "authorId": "fS85IozlAU84oL5Ag4pQuA=="
                    },
                    {
                        "_updatedAt": "2022-08-04T18:47:58Z",
                        "difficulty": 2,
                        "_createdAt": "2022-08-04T18:47:58Z",
                        "rating": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16"
                        },
                        "course": null,
                        "id": "6nnaIduCkMaE6dpBOo6E7y",
                        "workload": 8,
                        "_id": "6nnaIduCkMaE6dpBOo6E7y",
                        "authorId": "r8Zi6tEs6eecVpxPBDqD8Q==",
                        "_type": "review",
                        "created": "2022-08-04T18:47:58Z",
                        "_rev": "6nnaIduCkMaE6dpBOo6E4k",
                        "body": "Definitely the worst class I've taken in the program, might even be worst class I've ever taken.  The class is completely unorganized and disjointed.  The 4 subjects covered don't make sense together in one course.  In fact the coverage of each is completely superficial and elementary.  Why is this a graduate course?  The instructor seems clueless in regards to any timeline concerning the class and deliverables, plus he doesn't add any value to the overarching premise of the course, which should be analytics in business.  His section, marketing, has to be the worse designed and taught subject I have ever encountered.  One concept he touches on is the surprising development that companies have moved from print advertising to mobile and search.  Huh? really?  Also, he includes graphs and industry details that were outdated 10 years ago.  I kept asking myself why we are learning this and what the goal is for us to learn from an instructor point of view. His section comes across like he didn't design it, instead he is reading someone else's notes.   I would be surprised if he put any effort into the design of the course.\n\nThere are 4 homeworks that are not very well thought out.  In fact, there is alot of confusion amongst the TAs when you ask questions.  There were a couple good TAs, but the rest were not as helpful as I've experienced in my other courses.    The main problem is that designing good homework questions takes work and effort from the instructor, and he is not interested in providing either.   There should be a couple more homeworks added and they should be designed to teach us something.\n\nThe biggest problem with the course is the project.  You pick a topic for the project before you really go over any of the 4 subjects.  It doesn't really matter because for the project you are required to do a full blown analysis, using techniques that are never covered in the course.  If the goal is to complete an in depth analytical project, why not instruct the course in the same fashion?  Also, the instructions for the project are ambiguous and far from succinct.   The project requirements should be completely redesigned to fit the course and the level of detail of each subject the course touches on.  I think the instructor discussed this with Professor Polo and tried to make it like a DVA project.  Instead of the project, more homeworks would make more sense.  Or a project similar to 6501 where you research implementations of the topics covered.\n\nIn the end, my conclusion is the class is terrible.  I am disappointed it is included in this graduate program, and even more confused and disappointed it is a required class.  This class needs a complete redesign and new instructor that cares more about teaching than reminding us of all his prior business successes."
                    },
                    {
                        "created": "2022-05-07T19:17:50Z",
                        "_createdAt": "2022-05-07T19:17:50Z",
                        "body": "This is just one more business course with a low level of programming. This semester they added doing a project, which made it more interesting, but it doesn't make you feel like you're in a master's level course because of the concepts you're going to learn. Other than that, the instructors are very responsive at Piazza and will help you succeed in the course.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 10,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7"
                        },
                        "_id": "external-import-9c76b1f9-cf05-4d1c-8f6c-d88340388c2f",
                        "id": "external-import-9c76b1f9-cf05-4d1c-8f6c-d88340388c2f",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 2,
                        "_type": "review",
                        "rating": 2,
                        "course": null
                    },
                    {
                        "body": "## This class demonstrates how OMSA Business Track classes are a stitched-up joke.\n\nGet your groups early and in order, otherwise you will live to repent.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "difficulty": 1,
                        "id": "external-import-eab418d2-a5a8-4fd8-a97c-c07c98c78835",
                        "created": "2022-05-05T11:08:03Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2022-05-05T11:08:03Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 100,
                        "_id": "external-import-eab418d2-a5a8-4fd8-a97c-c07c98c78835"
                    },
                    {
                        "_id": "external-import-d4f2dc02-5417-4ad4-a8dd-e9c67e4b7e47",
                        "_createdAt": "2022-05-02T17:09:31Z",
                        "_type": "review",
                        "body": "This was my third class in the OMSA program, and by far the worst class. This semester, among other things, they introduced a group project to try to increase the difficulty of the class. I formed my group early and had a great experience working with them. My main gripes about the project were that the instructions were vague, in draft form until shortly before the deadline for deliverables, so we often weren't sure of the exact requirements, or the requirements would change. And as others said, when over 50% of your grade depends on things due in the last two weeks of the class, if you don't know how you'll be evaluated, that just adds to the stress.\n\nI didn't enjoy this class for two main reasons: 1. the content, and 2. the poor organization of the teaching staff, timing of assignments, made me feel like I was always scrambling to finish something. I'll go into each one in more depth.\n\nContent: The regression section was fine, as was the last section (operations management). They teach you the fundamentals. The finance section was tedious for me (it's my professional background), but I thought it was too singularly focused on asset management, and descriptive analytics, rather than predictive. The content choice could be better. But by far the worst module was the marketing module. I went into the course interested in learning more about marketing, and this course ruined my interest. Content felt disorganized, the lectures were REALLY LONG and didn't give much in the way of using analytics. I'd also say that the case studies (which you have to pay for) added little value.\n\nOrganization: Group project aside, there were many deliverables that were graded. 10 self-assessments, and 4 HWs. Each may not have taken a ton of time to complete, but they don't unlock the assignments in a very coordinated manner. A SA covering a module may not be unlocked a week or two after the module unlocks, so you'd have to wait to do it, when you'd like to do it right after completing the module. Same with the HWs. They often unlock well after modules covered are completed, so you can't start them early. These moving parts, plus the project, plus the exams, make you put in extra effort just to plan ahead. Add onto that the fact that the last HW was so unclearly worded, we spent more time on Piazza deciphering instructions (and contradicting TA responses) than doing the coding. Then the solutions were incorrect. Then the final exam was missing a ton of instructions and datasets for over half the questions, that had to be posted on Piazza. Then the peer grading for the final project presentation didn't work for days. And on and on... On the teaching staff, maybe I had worse than average group of TAs, but I've posted multiple questions that I think are trivial (to clarify instructions), and I wouldn't get a response until 24+ hours afterwards. To their credit, they did seem more responsive to private Piazza posts, but I'd expect a much faster response time on clarifying questions. \n\nTL:DR, the class isn't difficult, but the poor organization and mediocre content didn't make it a great experience. My experience could've been worse if I didn't have a good project group to navigate the class with. Your grade is ~40% exams, 20% project, and the balance is HWs and SAs. ",
                        "id": "external-import-d4f2dc02-5417-4ad4-a8dd-e9c67e4b7e47",
                        "created": "2022-05-02T17:09:31Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "rating": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "workload": 6,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        }
                    },
                    {
                        "body": "My background covered two of the main sections (finance and OM), so those weeks required little work.  Overall the videos each week take approximately an hour, an hour at most for homework, and less than an hour on reading messages, group, and other add on items.\n\nTowards the end of our semester there was some poorly written instructions on HW4, but that does not ruin the rest of the time spent in the class.   It is a good breather between other classes or paired with a more difficult class if tackling two classes in a semester.  ",
                        "id": "external-import-2120eba7-df32-4ffe-a41a-14d132d6ea67",
                        "created": "2022-05-01T20:45:20Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2022-05-01T20:45:20Z",
                        "_type": "review",
                        "rating": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 3,
                        "semester": {
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z"
                        },
                        "_id": "external-import-2120eba7-df32-4ffe-a41a-14d132d6ea67",
                        "difficulty": 1
                    },
                    {
                        "id": "external-import-a22e1b57-808b-4c21-903c-1b58d6270be3",
                        "created": "2022-04-29T04:44:13Z",
                        "body": "As others have written, an absolute garbage class. Worst college class I have taken IN MY LIFE. The worst part of it was the class project; I had multiple team members who would fail to attend the meetings and not give an explanation as to why they missed the meetings; I ended up having to do the vast majority of the work. Also really difficult to coordinate with people in different time zones. \n\nThe marketing module was torture. Hours of videos filled with fluff, and nothing substantial. They make you pay $50 for the Harvard business review modules which only give you 4 short articles required for the home works.\n\nAs others have mentioned, they also crammed 50+% of our grade down to the last 2 weeks. The final project, the final presentation, the final exams, and the final homework.\n\noh, by the way, the final homework was a disaster filled with contradictions, ambiguities, and sloppy, messy data. For example, we needed to know how to parse two different types of dates in the same column for one of the homeworks. Now, others have said \"well, you will work a lot with messy data in real life\"; okay, fine, but at least teach me what I need to know to do that! None of it was in the lectures. It was buried in one of the office hour sections. \n\noh, by the way, speaking of the lectures, some of the material they presented is wrong!! For example, the formula for process capability cpk; the instructor presents the formula with the wrong order of operations. So I started to answer it the way that he detailed it in his slides, and got an extremely large, obviously incorrect number. I looked it up online, and literally every other source I consulted besides the lecture slides presented the correct formula. The lack of quality in this class is very telling when I have to fact-check the freakin' professor!\n\noh by the way, the professors were never there to contribute anything to the class. It was all run by the TAs. \n\nThis class has really made me start to reconsider if I should continue to pursue an OMSA master's degree. I probably still will, but will steer clear of classes like this one that are rated very poorly.",
                        "semester": {
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z"
                        },
                        "_id": "external-import-a22e1b57-808b-4c21-903c-1b58d6270be3",
                        "_createdAt": "2022-04-29T04:44:13Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "course": null,
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "rating": 1,
                        "workload": 10
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "workload": 7,
                        "id": "external-import-bee6a47e-2884-4cd0-8eda-b51dafb0d72f",
                        "created": "2022-04-27T14:11:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "body": "The is by far the worst graduate course that I've ever taken (I already have a graduate degree). In an effort to make the course more difficult, they turned it into a nightmare. Half of your grade is determine by things that are due in the last 2 weeks of the semester. The project was a mess, with multiple different \"guidelines\" that had contradictory instructions and requirements. My group received feedback from the TAs on our project proposal the DAY BEFORE the project was due. The final homework was so poorly written that even the TAs couldn't provide helpful clarifications for most of it and they ended up deciding the day before it was due that they'd \"relax the grading\". Completing it required hours of scrolling piazza posts and trying to decipher what was even being asked. \n\nThe TAs were pretty unhelpful and some of them downright snarky. The lectures were ok, but tended to drawl on and on. Overall this was a terrible experience and a total waste of my time. ",
                        "_id": "external-import-bee6a47e-2884-4cd0-8eda-b51dafb0d72f",
                        "course": null,
                        "_createdAt": "2022-04-27T14:11:57Z",
                        "rating": 1,
                        "semester": {
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring"
                        }
                    },
                    {
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "_createdAt": "2022-04-27T08:27:46Z",
                        "rating": 1,
                        "workload": 5,
                        "_id": "external-import-e442e4e7-fd6f-422c-a995-5ace68912104",
                        "difficulty": 3,
                        "id": "external-import-e442e4e7-fd6f-422c-a995-5ace68912104",
                        "created": "2022-04-27T08:27:46Z",
                        "body": "Hands down the worst course I've taken in the program. Absolute shit show of a class it seems like they tried making the class more difficult without adding any value. The most difficult part of the course is figuring out the logistical nightmare they create rather than the actual material. You will need to dig through Piazza to clarify mountains of corrections and project expectations. TA's don't have the answers for you and overall a lot of people were screwed at the end of the course. The added homework was riddled with errors and the best they could do was tell you it was going to be graded more leniently the day before it is due despite their being a lengthy Piazza post asking for the assignment to be dropped. The added project was also a disaster and was also due on the same day as the fourth homework assignment. Instructors refused to open up the cumulative Final exam until a week before. The course was easy until the final two week period where 50% of your grade was stuffed into this small window with corrections to project deliverable expectations and assignments made days before they're due. ",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "created": "2022-04-06T04:18:56Z",
                        "course": null,
                        "body": "Why am I taking this course? I feel like I've taken it about 10 times already in this program. Really a waste of time.\n\nMarketing lectures are a joke. Literally lifted from the Digital Marketing course. Why am I paying for both? Make some original content for this course. Really boring, useless details that I could have easily skipped. Why did you walk through the steps to set up an ad on Facebook? I wanted to actually learn marketing analytics (my day job). Walk us through sample a/b or MVT testing data on marketing campaigns. Whatever you did in this section is absolutely not it, not useful, and made me want to quit this degree program.\n\nFinance was actually good.\n\nRegression was so boring and the same thing as 10 other courses.\n\nOperations management was alright-  the homework was a complete disaster in terms of instructions, but the content was... fine.\n\nMaybe this course should be \"how to write in R\" rather than \"here's a bunch of crap we've already taught you\"?\n\nProject is incredibly frustrating. Bad instructions, plus why am I doing this? Conflicting information within the instructions, conflicting answers to questions on Piazza, new requirements made up on the fly and never officially published (apparently we're expected to dig through piazza for the instruction change of the day). I've done 30 homeworks in 6501 that are the same thing as this project. Very dumb.\n\nSo many mistakes in the homework instructions instructions. Clarifications needed on over half of the questions. I shouldn't have to dig through a piazza post to necessary info.  Project instruction document is inexcusable - so many inconsistencies. Deliverables stated at the top of the document do not match the deliverables described in the body. Inconsistencies with due dates from piazza to project documentation to syllabus. TAs have no clue what's going on and post nonsensical answers to queries until the head TA (who apparently is running the show) comes and corrects everyone else's mess.\n\n\n\n\nUpdated with a message I sent to OMSA advising on 4/30:\n\nThis course is in serious disrepair and needs to be gutted/recreated with totally new faculty.\n\nMy understanding is that the course is being run by Frederick Bien with guest lectures by three other professors. However, in practice, the course is run by TAs who do not know what is going on, and all four lecturers are totally disengaged from the course. I have not seen one follow up to student questions from the instructors, only TAs. It is unbelievable that the faculty set up the course and are allowing the TAs to fail.\n\nThe course has been nothing short of a complete mess. A new project was added this semester. That is a great idea, but it was thrown together with changing requirements throughout the semester. There was never a point when what was in the syllabus, project description, and TA posts on Piazza matched. In fact, often, TAs were posting conflicting information with each other on Piazza.\n\nTo make matters worse, the part of the course that should be well-built out (homeworks) were a complete disaster, especially the fourth homework. Instructions were so vague that the questions could be correctly answered 100 different ways. I spent more time searching for clarifications on Piazza than actually working on the homeworks. And even on piazza, TAs were suggesting that questions be answered several different ways. This was incredibly unprofessional - the course is a Management course that teaches people how to be successful business analysts. If the people who made the course and are guiding students through the course aren't even profession, organized business analysts who can clearly communicate instructions, how can students ever reach that level?\n\nNow, we are halfway through finals week, and one thing that was supposed to be released Wednesday is still broken. In fact, this was something that was never messaged on the Syllabus or Project Instructions sheets and was just an afterthought last week on a random Piazza post. Most students in this program have full time jobs and plan their work and lives around the schedule given for the course. It is incredible to expect students to check Piazza several times a day for updates on a final assignment that should have been released at the start of finals week. People may be planning vacations or work trips or family things that will require them to step away from the course. It is unbelievable that a FINAL REQUIREMENT was added a few days before finals week and it is STILL NOT ready for students to complete ON THE DAY THE SYLLABUS SAYS IT IS TO BE TURNED IN.\n\nThe final was also released with major errors (datasets referenced were not included in the final). Unacceptable!\n\n\nMy suggestion for this course is for the professors to actually be engaged in the course, for requirements to be thought out and presented well ahead of time (on the syllabus), for requirements to not be added last minute, and for the release of the assignments to be tested so that students are not waiting several days during finals week for a final assignment to be released. I can't believe I paid nearly $1k for this absolute disaster of a course. I understand that tenure is a thing, but Frederick Bien's total disengagement with this course should be grounds for termination. If I handled something this badly in my professional job, I would be fired immediately, no questions asked. What's worse, Bien's content was 100% ripped from the actual Digital Marketing course. Did no work for the course other than recording a few lessons with someone else's content. Inexcusable.",
                        "difficulty": 1,
                        "semester": {
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z"
                        },
                        "_id": "external-import-0dfcfbbe-40f0-4bef-aa59-8152114e561b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-0dfcfbbe-40f0-4bef-aa59-8152114e561b",
                        "workload": 6,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_type": "review",
                        "rating": 1,
                        "_createdAt": "2022-04-06T04:18:56Z"
                    },
                    {
                        "_createdAt": "2021-12-16T00:35:05Z",
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 7,
                        "id": "external-import-9896da02-2010-4616-8a0e-2024fdd77b66",
                        "created": "2021-12-16T00:35:05Z",
                        "body": "I used this course to re-enforce knowledge from ISyE6501 and MGT 8803/6754. Never had enough time before to go deeper and read as much as I want about the learning topics. This course is easy enough to absorb what is given in the course and gives you enough time to go and dive deep into books, studies, or research areas mentioned in this course. I tend to agree with others, there is tons of stuff that any high-schooler knows may know (Fb, Google Ads), yet being structured is knowledge to be appreciated.  \n",
                        "_id": "external-import-9896da02-2010-4616-8a0e-2024fdd77b66",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "created": "2021-12-15T22:23:58Z",
                        "difficulty": 1,
                        "_createdAt": "2021-12-15T22:23:58Z",
                        "_type": "review",
                        "rating": 2,
                        "_id": "external-import-028353b7-a53d-45c1-949a-f23c7132da2a",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-028353b7-a53d-45c1-949a-f23c7132da2a",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "This class felt like a waste of time from start to finish. For those who liked it because they learned R- that is covered in ISYE 6501 which is also a required OMSA course (it's also a much better course). \n\nThe course required very little effort, and felt like there was very little effort taken in putting it together as well. I watched all the lectures at 2x and still felt like I was wasting my time. My favorite modules were Finance and OM, because at least the lecturers seemed passionate about the topics. Marketing was totally useless info, mostly slides from another class that already feel outdated, and Regression is taught (and taught better) in several other courses in OMSA.\n\nThe computational parts of the exams were my least favorite part. They weren't hard at all but took 3-4 hours to complete because they basically made you download a new csv file and work with a different R package (some of them that they hadn't even introduced in homeworks) for every question. They were just designed to make you waste time.\n\nHaving said that, I guess it was nice to have an easy class? I just wish it was more interesting and there was more effort put into it. This was my 7th class and by far my least favorite.",
                        "course": null,
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        }
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 5,
                        "semester": {
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z"
                        },
                        "id": "external-import-e74b4d0f-8a43-42e1-abd6-03c91b33d05d",
                        "created": "2021-12-10T19:15:39Z",
                        "_type": "review",
                        "workload": 8,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "difficulty": 3,
                        "body": "My background: BSME and MBA. Management consulting + Operational roles. Former SAP MM functional consultant. Some knowledge of Python. Zero prior knowledge of R.\n\nThe class perfectly satisfies a fundamental educational requirement: it teaches, then students practice the knowledge instructors gave them, and finally, students are tested on the SAME material. There are no gaps. In that respect, CSE6040 is a complete disaster.\n\nThe class is an excellent fit for people with different backgrounds. After all, there are three tracks in this program. I had zero issues with the business part but had my work cut out for me with the coding. Computer Science majors will have zero problems with coding but may have issues with the business portion of the class. It is a fair game. I was somewhat bored with the Business. My opposites will be bored with coding. It is Ok.\n\nThe class gently introduces you to R. It offers a great online R training resource. I used it and loved it. Very helpful.\n\nThere is one mid-term, final, and three homework. They have almost the same format: theory (multiple choice) and coding (R).\n\nThe theory is a timed, one-time engagement during the exams—plenty of time for 20 questions. Coding is a take-home, and you have 5-7 days to complete it. No auto-grading.\n\nThe coding part of the homework is peer-graded, and it is a fair process since the answers and guidelines are provided.\n\nMid-terms and final exams differ from homework only in coding grading: you develop your code in R-Studio, get the answers and then complete a multiple-choice section of the exam. Very straightforward.\n\nTo be successful in this class, you must pay attention to the lectures and optional R exercises. All testing is based on them.\n\nTAs are helpful and create a sense of togetherness and go the extra mile to explain things (R coding for me). Outstanding job.\n\nThe class can be improved by the following:\n\nAdd more R exercises to the last three weeks. Currently, there are none, and I felt rusty during the final exam.\n\nReplace Inventory Management, Quality/SPC, and Forecasting lectures with something more advanced. No one calculates ROP and forecast manually. There could have been some great forecasting exercises using available libraries. ROP is not even used anymore.\n\nOverall, it was an excellent CORE class to start learning R.",
                        "_id": "external-import-e74b4d0f-8a43-42e1-abd6-03c91b33d05d",
                        "_createdAt": "2021-12-10T19:15:39Z"
                    },
                    {
                        "body": "Overall, I think this course gets a bad wrap. I definitely see how some people think of it as a waste of time (and $$$), but for me parts of it were actually useful and interesting (mainly the regression and finance modules).\n\nThe most useful part of this course IMO is the first module, Regression. Having a limited stats background I thought this was a good introduction to learning about simple regression, multiple regression, logistic regression, etc. It was also a good primer in learning how to use R. \n\nThe next portion of the course was Finance, which I found to be very interesting because it applied regression to various aspects of finance.\n\nNow, marketing/advertising. This was by far my least favorite module in the course. The lectures were extremely long and 90% of the content was almost useless. The only valuable piece of info from this module was the code on determining customer churn.\n\nI thought the last module, operations research was fine. The instructor was very passionate and funny and it seemed like a decent introduction to OR. Lots of equations though.\n\nOverall, this course is pretty straightforward and easy, but you still have to put in the work. Don't expect to put in 0 work and get an A. The self-assessments and homework assignments can be a little tricky, but if you use the lecture slides and code snippets as models you shouldn't have a problem with most of the material.\n\nAlso, this was my first semester in OMSA and I took this alongside CSE6040 so take that how you will.",
                        "_id": "external-import-a432fe06-8fb7-427c-822d-28960b8e0324",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 4,
                        "difficulty": 2,
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_createdAt": "2021-12-10T15:26:00Z",
                        "id": "external-import-a432fe06-8fb7-427c-822d-28960b8e0324",
                        "created": "2021-12-10T15:26:00Z",
                        "course": null,
                        "workload": 4
                    },
                    {
                        "_id": "external-import-26c9b800-e586-44cd-987b-84469e9e5bfa",
                        "created": "2021-11-26T11:25:32Z",
                        "_createdAt": "2021-11-26T11:25:32Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester"
                        },
                        "body": "I won't say the same things as others already have, most of it is generally true. The one thing I have not noticed on here is noting the length of some of the module videos and how little content they actually cover. For example, there was a 20 minute video in the statistical process control module that presented a definition of quality, 8 dimensions of product quality, and 8 dimensions of service quality. The video could have been 5 minutes and communicated the same amount of content. I watched the Marketing and Operations sections of the course on 2x speed the entire time - otherwise it would have wasted an unacceptable amount of time. I have an undergraduate degree in business and I believe those of us who come into this program with that background should be able to opt out of this course in addition to MGT 8803 or focus this class more on applications of the concepts. ",
                        "_type": "review",
                        "course": null,
                        "id": "external-import-26c9b800-e586-44cd-987b-84469e9e5bfa",
                        "difficulty": 2,
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 5
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        },
                        "_createdAt": "2021-08-06T22:59:44Z",
                        "rating": 5,
                        "course": null,
                        "id": "external-import-619c8946-9606-48dd-8b46-3bde4ed57278",
                        "body": "I loved this course so much. I was not from Business background, so all chapters were new to me. So I spend most of the time watching videos and understanding it. I find good rhythm between course content and questions asked in the assessments , exams and home works.\n\nProf. Bien's hours, I enjoyed much. His explanation in math is vey good. I loved and enjoyed the course. If you have understood the content through videos, It would be easy to get grade A. I did almost 100 % in self assessments and home works. Midterm and final exam also not so hard, I did almost 100%. I hardly follow all posts in piazza but took all TA sessions and Professor Bien's class. He is most responsible and loving guy, I found. I never felt bored .\n\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "difficulty": 3,
                        "created": "2021-08-06T22:59:44Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "workload": 10,
                        "_id": "external-import-619c8946-9606-48dd-8b46-3bde4ed57278"
                    },
                    {
                        "rating": 4,
                        "created": "2021-08-02T15:04:49Z",
                        "_type": "review",
                        "course": null,
                        "workload": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-08-02T15:04:49Z",
                        "_id": "external-import-0768b8f2-dc75-49c6-9c2b-8255d2bb4bff",
                        "id": "external-import-0768b8f2-dc75-49c6-9c2b-8255d2bb4bff",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 2,
                        "body": "This is the easiest class I've taken so far, which considering I took the class in the summer term, was very welcome.  I saw other comments saying the content produced by the professors isn't great quality - I don't agree.  I thought quality was fine.  "
                    },
                    {
                        "rating": 2,
                        "_id": "external-import-044683fc-9c7e-4475-8500-211d439c8544",
                        "id": "external-import-044683fc-9c7e-4475-8500-211d439c8544",
                        "workload": 3,
                        "body": "I'm sure this class is helpful to students with no experience in analytics. However, I found this class to be far too basic. Of the 8 courses I've taken, I feel like I've gained the least from MGT 6203 and MGT 8803 either because I was already familiar with the material (regression / finance) or because the material was fairly basic (supply chain and marketing).\n\nI think students should be able to opt out of this course if they earn an A in ISYE 6501 and/or replace it with Regression. Alternatively, allow opt out to students who have completed at least 5 courses and are in good academic standing (or whatever number of courses and overall GPA deemed appropriate).\n\nStudents who would benefit from the introductory material can take it, and students who don't need it can be allowed to move on to something that will provide more value to them.\n\nAlternatively, combine modules from this class with those from MGT 8803 and create standalone classes for accounting/finance, supply chain, and marketing. Then allow students to take the classes that are relevant to them and avoid the material that isn't.\n\nAt the end of the day it is about opportunity cost, I spent time and money on this course - one of just 10 courses that I will get to take as part of this program. I don't think I learned all that much and think I would have gotten more out of the program had I been allowed to replace it with something else.\n\nI found this class to require very little time or effort. Beyond watching the lecture videos, I spent a few hours on each homework assignment (of which there are 3) and a few hours preparing my reference sheets for the exams.\n\nI rated as dislike because I think it was a waste of my time, not because I think it is poorly taught.",
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2"
                        },
                        "created": "2021-07-21T16:36:49Z",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-07-21T16:36:49Z"
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ"
                        },
                        "_createdAt": "2021-07-21T02:43:59Z",
                        "workload": 5,
                        "_id": "external-import-b45c8776-6eb0-454f-8b82-a9c0ce5a1583",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-b45c8776-6eb0-454f-8b82-a9c0ce5a1583",
                        "created": "2021-07-21T02:43:59Z",
                        "rating": 4,
                        "course": null,
                        "body": "The other reviews are correct that this course is easy, definitely easier than any other OMSA course I've taken so far (a great palate cleanser after CSE 6242). That said, I enjoyed it! The lecture material is mostly interesting - I am much more interested in learning about applications of analytics in Finance, Digital Marketing, and Operations Management at the conclusion of the course than I was before I started. One small criticism is that some of the material is the same as material covered in ISYE 6501 (i.e. linear/logistic regressions, exponential smoothing) - it's pretty silly that that's happening in two required courses in the same degree.  \n\nMy biggest criticism of this course is honestly that it's an Advanced Core Requirement instead of an Introductory Core Requirement. It would have made more sense to have taken this course *before* ISYE 6501 - ISYE 6501 throws you right into the deep end with R programming, whereas MGT 6203 holds your hand a bit with sample code. This course is also higher level in teaching about analytics (more about inspiring where analytics can be useful than actually teaching advanced techniques). I'm guessing the OMSA administrators put ISYE 6501 first as a weed-out course, but c'est la vie.\n\nAnyway, I would definitely take an advanced course with any of these professors diving deeper into analytics in Finance, Marketing, or OM. I enjoyed my (low stress) summer.",
                        "_type": "review",
                        "difficulty": 2
                    },
                    {
                        "body": "This class is almost laughably easy; I do not understand how it is a graduate course. It's a reasonable companion to ISYE 6501 and MGT 8803 (the latter I took concurrently), but as a standalone class, it's a very low lift. I did exactly 0 of the readings and, at least through the first 9/10 weeks, have nearly 100%.\n\nProf. Meyers is pretty entertaining, and the rest of the professors, except for the section on linear regression, were also fairly captivating. The TAs this semester, with one notable exception, were really bad, of way lower quality than any other class I've taken.",
                        "semester": {
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z"
                        },
                        "difficulty": 1,
                        "_createdAt": "2021-07-20T00:53:59Z",
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "_id": "external-import-aba2eb67-83d5-4620-b7b7-03bd23b39e10",
                        "id": "external-import-aba2eb67-83d5-4620-b7b7-03bd23b39e10",
                        "created": "2021-07-20T00:53:59Z",
                        "course": null,
                        "workload": 3,
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_id": "external-import-6ed3e726-b538-4b26-9f4c-487f881ceee7",
                        "_createdAt": "2021-06-30T14:49:24Z",
                        "id": "external-import-6ed3e726-b538-4b26-9f4c-487f881ceee7",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "I came into this course with low expectations and pretty much all of the reviews are true. But i think the worst of all are the following:\n1. Errors in lectures/assessments/tests - using words very loosely that really confuse learners, even some of the hw solution is wrong. I don't think the professors really know what they are teaching very well, and really that's the status quo in higher education is that you have some very tenured people creating lazy content for what they think is a monopoly. It's really a shame that Georgia tech doesn't audit the content of these courses. \n2. Lots of random weird things: e.g. homeworks shown as late when submitted ontime for the entire class, alert on some syllabus grading change via email, etc...\n3. Too much random content: You are given a bunch of things to read, and random R code, worksheets, data sets, links, papers, it's like the professors are like \"whatever, this might be interesting\" - reminds me a lot of corporate learning sessions where they just throw random stuff together without any conclusion or thought going into it. \n\nYou'll have to take it, but i encourage you to speak out to GT administrators about these problems so that future classes are improved. It sucks that this course sucks for so long. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "created": "2021-06-30T14:49:24Z",
                        "difficulty": 2,
                        "rating": 1,
                        "workload": 10
                    },
                    {
                        "_createdAt": "2021-05-30T20:05:45Z",
                        "_type": "review",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "created": "2021-05-30T20:05:45Z",
                        "workload": 4,
                        "body": "There are coding this course, mainly using R. This course covered 4 different topics, but those topics are somewhat related. \n\nI like the finance section a lot, did learn new stuff here. \n\nIf you have math/stat background and know some coding, this course is easy.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "id": "external-import-cb8c290b-50e1-4d87-a6ca-2f404f8c0082",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_id": "external-import-cb8c290b-50e1-4d87-a6ca-2f404f8c0082"
                    },
                    {
                        "created": "2021-05-21T19:47:45Z",
                        "body": "This course simply serves as a buffer course to pair with a difficult course in OMSA program. While not terrible, it is no where near great. I came out of the class with some general knowledge in regression, finance, marketing, and operations but can't pinpoint what I can actually apply due to the surface-level material in each section. The self-assessments allowed 2 attempts, and the HWs and exams were fairly easy.",
                        "difficulty": 1,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-5d8350fe-5130-4dfe-84ae-2658d7c15386",
                        "_type": "review",
                        "rating": 2,
                        "course": null,
                        "workload": 5,
                        "_id": "external-import-5d8350fe-5130-4dfe-84ae-2658d7c15386",
                        "_createdAt": "2021-05-21T19:47:45Z",
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "rating": 1,
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "id": "external-import-1ef0d305-03be-4a71-a71d-712376a2655d",
                        "_createdAt": "2021-05-16T11:50:53Z",
                        "_id": "external-import-1ef0d305-03be-4a71-a71d-712376a2655d",
                        "course": null,
                        "body": "My final grade: I ended up with a high B in this course - an 88.7.  So, while I had an A all throughout the semester, it was the final exam that dragged me down to the B.  \n\nPros:  There is a lot of material that's covered, which gives you broad exposure to different industries.  You'll likely come across something you enjoy.\n\nCons:  The homework assignments were very time consuming: 10+ hours.  There is a lot of material that's covered, which means you won't become well-versed in any one particular subject.  The exams had too much material to cover.  The biggest con would be the terribly worded questions that led to ambiguity.\n\nAll in all: I wasn't happy with the course.  The TAs do try to be helpful.  The questions are terribly worded.  \n\nBe prepared to roll up your sleeves and put in time for this class.  Good luck.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "created": "2021-05-16T11:50:53Z",
                        "workload": 12
                    },
                    {
                        "id": "external-import-83f58bcc-41f4-4151-9139-725edc71b61b",
                        "created": "2021-05-09T11:54:46Z",
                        "workload": 3,
                        "difficulty": 1,
                        "_createdAt": "2021-05-09T11:54:46Z",
                        "_type": "review",
                        "_id": "external-import-83f58bcc-41f4-4151-9139-725edc71b61b",
                        "body": "This is probably the lowest quality class I've taken in the OMSA program and probable the easiest class I've taken since middle school.  The regression module should just be removed because the lectures are poor and not effectively tied to business topics and the topic is taught much better in other courses.  The marketing module was far too long and involved a lot of factoids rather than analytical approach.  The modules on finance and operations were the most useful and enjoyable in my opinion which is why I gave this course a neutral rating overall.  I think they need to look at revamping this course again.  My opinion is that they should look at combining it with MGT 8803 because there is a lot of redundancy between the two and because 6203 doesn't have a lot of meat behind it, the workload for the two combined wouldn't change all that much. \n ",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "course": null
                    },
                    {
                        "rating": 4,
                        "course": null,
                        "body": "Decently easy course. Think the main purpose of this course is to give you a flavour of multiple topics. If you go in with that expectation then I think that you will be able to enjoy it. This course is however, not a good representation of the OMSA programme. I also think that more effort is required for the planning and execution of this course. There were multiple instances whereby mid term and final exam questions were phrased vaguely or were missing crucial information required to solve the problem. This was of course, rectified after it was pointed out. With regards to the time commitment of this course, I can assure you that it is minimal. Probably just 2 hours a week for an A. Most of my time was used on making the cheatsheet for the exams.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-5ff756bc-e140-44b8-8812-3287cbe4f33a",
                        "created": "2021-04-30T12:34:26Z",
                        "_type": "review",
                        "_createdAt": "2021-04-30T12:34:26Z",
                        "workload": 2,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_id": "external-import-5ff756bc-e140-44b8-8812-3287cbe4f33a",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "_id": "external-import-05645d7b-6a35-4355-8211-b16c28a048a3",
                        "body": "Go to **open.georgia.gov/openga/sta**, agree with the Department of Audits and Accounts Disclaimer.\n\nClick on *Organization* and search on *Units of the University System and Georgia Military College* and then *Georgia Institute of Technology*.\n\nArrange the Salary in Descending Order.\n\nRealise that 2 of the most well-paid professors in the top 25 in Georgia Tech are lecturing on this class. \n\nAsk yourself why the professor that reads his own slides in Regression is paid a handsome $381,917 and then Profs Joel Sokol and David Goldsman not as much, and you had to endure all the dryness in his lecture over the first few weeks.\n\nIn retrospect, are we better off not taking this course as compulsory, and then we can have a reduction in school fees (to match that of OMSCS, for example)?\n\nIf you very much like this course in this and previous iterations, it probably shows that you are only here for the A's and I would be really ashamed to have been associated with you in OMSA.\n\n*Edit* - I am a manager of an MNC, and when I interview OMSA students, I *better make sure* that I ask for their transcripts to ensure they are not taking the easy MGT elective courses (especially MGT-8813). This would make OMSA a degree mill if not checked well.\n\nThe truth is that we *business people* understand what is *value*. Paying the same price for another course that makes you relish a challenge, that allows you to connect with other students well on social media platforms. This courses provides absolutely nothing, besides a mirage boost in your GPA.",
                        "id": "external-import-05645d7b-6a35-4355-8211-b16c28a048a3",
                        "workload": 2,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-04-25T07:18:46Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 1,
                        "created": "2021-04-25T07:18:46Z",
                        "_type": "review",
                        "difficulty": 1,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        }
                    },
                    {
                        "course": null,
                        "_createdAt": "2021-04-04T18:19:52Z",
                        "rating": 5,
                        "workload": 5,
                        "_id": "external-import-616af451-57e6-4e8e-aebc-50e27621a92b",
                        "created": "2021-04-04T18:19:52Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "body": "I really like when I am being taught and I am glad this corse was structured to teach you something. I really enjoyed 1st module on regression, lectures were not a state of art, but I went on youtube and found a lot of good content to complement the lectures. The code that was given by the TA's was clear and I really feel like this approach is better for me, instead of just being thrown into a deep water and trying surviving on my own (like they do it in 6501). These 4 week of regression were very helpful for me to absorb regression module in the 6501, which I was taking in parallel with 6203. I think these two classes is a good combination to do together.\nTA's sessions were good. I attended several OH's with the professor. It really felt like a class, where you interact with people. \nThe course is structured in a way that you have different activities going on: self assessments, home works, theoretical exam, coding exam. The course is a bit heavy loaded in the beginning, I was able to get 2-3 weeks break after the midterm.\nTips for the exam: understand code from the TA sessions (you will also get a chance to practice during homework assignments) and make yourself a good cheat-sheet.",
                        "id": "external-import-616af451-57e6-4e8e-aebc-50e27621a92b",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_type": "review"
                    },
                    {
                        "id": "external-import-ef4e3dd1-0f1f-4ae6-936e-ffa336bff94e",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2021-03-21T23:34:35Z",
                        "_type": "review",
                        "workload": 2,
                        "course": null,
                        "created": "2021-03-21T23:34:35Z",
                        "difficulty": 1,
                        "rating": 4,
                        "body": "I'm halfway through this course at the moment and have close to perfect score on all exercises, homeworks and assessments, including the midterms, despite putting in no more than 2 hours every week. I think this attests to how incredibly easy the course is, and why many may not like it.\n\nHowever, I think the content is not bad. While, of course, there is greater room for improvement, the value proposition of the course is solid. It simply sets out to let students understand how analytics has revolutionized business and informs them of possible tools with which they can participate. This suggests why they have made the course compulsory for everyone taking the program. Whoever wants to do analytics in the future will have to reckon with applying it for business. Many companies have started demanding this of their analytics personnel, so it only makes sense to offer this course.\n\nI guess the failure here is in not creating a solid course package that could inform on newer advances while being appropriately \"advanced core\". This course is at best introductory, but sufficiently so. Part 1 goes through regression mostly, even though that's just one of the many tools with which analytics is conducted for business. Part 2 discusses investing and the stock markets, while Part 3 talks about marketing. This is where I am for now.\n\nMy recommendation to anyone taking this program, and who is good enough with analytics tools such as R, is to combine it with at least 2 more courses. This course is a stroll in the park. I watch the videos with 1.5x speed, sometimes 2x speed. I attended the TA hours maybe once or twice, and rarely participated on Piazza. Yet, I don't feel that I'm left behind. I often return after two weeks of little to no study and still catch up pretty quickly. This is because I'm taking another two classes with this, and have to spend way more time on those.\n",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-ef4e3dd1-0f1f-4ae6-936e-ffa336bff94e"
                    },
                    {
                        "created": "2020-12-28T18:30:55Z",
                        "body": "My hope on this review is that I will save at least one person from taking this course if they are able to Opt-Out instead. The OMSA program should be ashamed to have this course as part of a Graduate Program, let alone an advanced core requirement.\n\n**Full disclosure, I received an A out of this class with minimal work. There are no sour grapes here. Only trying to perform a public service.**\n\nThere are several great reviews as to the content of this class, so I will bypass this in my review and get straight to the point.\nThis class is HORRIBLE.\nAnd here's why:\n1) It is riddled with errors in lecture material, quizzes, homework, and Exams. \n2) The lecture material is either a 'light' repeat of things from other introduction classes (MGT 8803, or IYSE 6501), or completely irrelevant to anything applicable in regards to Analytics. \n3) The exams are merely memorization. Unlike 6501, you really do not have to think at all.\n4) The exam questions are written so poorly that you spend more time on Piazza trying to get clarification than working on the exam\n5) There are zero projects or anything beyond merely memorizing the material\n6) Never once was there an attempt at any practical application of the material presented. \n7) Absolutely no cohesion to the material presented. It was just a bunch of half baked and unrelated topics.\n8) The lecture material (besides the SC and OPS) was a snoozefeast. If you enjoy someone unenthusiastically reading slides, then this class is for you.\n\nThe bottom line on this course is the following.\nThe actual applicable knowledge presented could have been summed up in a 20 page PPT. You could have gained the same level of knowledge via 4-5 hours of reading some articles on these topics online. \n\nNow, if you're looking for an easy A to pad your GPA, then by all means, this is the class. That was my plan, and I succeeded with the A. However, the price paid was not worth it. I actually feel less smart on analytics after taking this class, and will be kicking myself that I wasted 3 credits of tuition on absolutely nothing. I read several reviews before taking the class and said to myself \"can it really be that bad of a class?\".. Yes, yes it can..  There is a reason it has the worst reviews of any course in the program. (we're talking 80+ reviews!!)\n\nThis class is a money grab by GT plain and simple.\n\nFinal thoughts..\nI understand that some of you may be reading this and saying \"well, maybe this person already has in-depth knowledge on the material presented in this class, so they were bored.\"  This couldn't be further from the truth. I would rate myself as probably right in the middle of analytics students in regards to the topics that are part of the program. \n\nLet me just recap the course.\nAgain, if you spent 4-5 hours total reviewing these topics online you'd have more knowledge than was provided in this entire course. However, if you feel that the below would be valuable to receive in a bunch of poorly delivered lectures without any hint of practical application, then this class is for you :)\n\nPart 1: Here is a basic and multiple regression model. Here's a quick Logit Model. Here are some ways to use some extra variables and create some dummy factors. Oh, and here's what transforming stuff into Log looks like. We won't tell you where this is applicable, or apply it to anything useful. We'll just make you memorize some stuff for the exam.\n\nPart 2: Here's a way to produce stock measurements that are already present on every stock quote site. We'll show you how to take the long way to get to these numbers by making you code it out, even though it can be done in 5 seconds on a calculator or excel sheet. You'll never ever use this, but, hey, we had to put something here. Oh, and here is a way to invest called Factor Investing.. We won't show you how to use it, but we will make you use R to figure out something that is just descriptive in nature. Again, nothing you'd never ever use. Oh, and buy low sell high!\n\nPart 3: Did you know that Marketing has gone digital? Did you know that it is no longer just on TV or Newspapers?! Well, it's true!! Companies advertise on cell phones and computers.. Who would have thought that was even possible?? Ok, and then there were some cut and paste instructions on how to do a marketing campaign on Google and FB. Yawn! We did use R a bit in this part, but only to add up columns and do basic math equations. \n**The only valuable aspect of the entire course was that we were told to use dyplr for the Marketing calculations. But, we were sent to an offline training doc for this. We didn't get anything in the lectures on dyplr. Again, why am I paying for a course that I can get via a 30 min YouTube tutorial?\n\nPart4: I will admit the supply chain and ops section was good, and the professor was enthused.. But, the info was useless in the sense of an analytics program. And, it was a complete recap of the stuff we already got in MGT8803. I get that quality control and reorder point calculations are good things for a company to perform, but if you make a huge stretch to analytics by just making us use R to perform the math (EOQ, etc.), then it's not really giving us any analytics knowledge. It's like if you are telling me all about French Cooking, and then at the end, you show me how R can make a nice shopping list using an R data frame, it's really not analytics, it's a cooking course!",
                        "_createdAt": "2020-12-28T18:30:55Z",
                        "_type": "review",
                        "workload": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "id": "external-import-b4c8a936-fce1-4ff5-89bd-8dc6042b74c9",
                        "_id": "external-import-b4c8a936-fce1-4ff5-89bd-8dc6042b74c9",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "rating": 1
                    },
                    {
                        "difficulty": 1,
                        "_createdAt": "2020-12-15T04:21:20Z",
                        "id": "external-import-ed5d79bc-891c-4c90-8d7c-7194e2252924",
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_type": "review",
                        "rating": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "As of writing, this class is the lowest rated class on OMSCentral. It comes by its reputation honestly. \n\nIt is difficult to stress how poorly designed, badly implemented and incompetently taught this class is. Setting 1000 dollar bills on fire somehow feels like it would yield a greater return on investment. \n\nExam and homework questions are written as if a non-native english speaker thumbed through a tourist phrasebook over a weekend and went to work. This led to multiple corrections and clarifications on almost every homework and exam. This has happened for many consecutive semesters at this point and is completely and utterly unacceptable. \n\nMarketing videos include multiple 20 minute videos on setting up Google Analytics(?!) and numerous lengthy discussions on... well I wasn't quite engaged enough to remember.\n\nCredit due to Prof Myers and Clarke, who's operations and finance sections were taught at a much higher caliber than the rest, though in not enough depth to matter given the limited time allocated to them. \n\nOh yeah, there were also some videos about regression. A man read some slides. \n\nAs a student, I am embarrassed to be associated with an institution that releases content such as this, not to mention considers it an 'advanced core' class. \n\nGiven the considerable lack of effort given in the delivery of this class, I also tempered my efforts accordingly. Even with my no double-checking, skim some slides and take a quiz approach I ended the class with a solid A. I don't feel good about it. \n\nThere's nothing to feel good about with this class. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2020-12-15T04:21:20Z",
                        "workload": 5,
                        "_id": "external-import-ed5d79bc-891c-4c90-8d7c-7194e2252924",
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-49aef7f1-50dd-456d-9f3f-a16c7076b696",
                        "difficulty": 1,
                        "_createdAt": "2020-12-11T22:16:09Z",
                        "rating": 2,
                        "course": null,
                        "workload": 5,
                        "_id": "external-import-49aef7f1-50dd-456d-9f3f-a16c7076b696",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "body": "This class is a combination of 4 topics with 4 different lectures.\n\nLinear and logistic regression (Prof. Sridhar): The prof's teaching style is very dry (he just reads the slides) but I think he's smart. He knows way more than what he is teaching in this course. Homework and midterm were easy but his questions on the final were a bit more tricky, which was a good break from all the rest!\n\nFinance (Prof. Jonathan Clarke): Teaches some good knowledge about the stock market, a few technical tools and metrics here and there.\n\nMarketing (Prof. Frederic Bien): Kind and very relational. Active on weekly office hour and personally emailed those who didn't change their EdX email to connect with Vocareum. His marketing materials were pretty broad but not so much technical depth.\n\nOperation Management (Bob Myers): Very energetic in his lecture videos, I can see his passion in the field, but the math don't seem to be strong in his materials.. Made me wonder what limitations/shortcut assumptions was I missing out while watching his lectures.\n\nOverall, a light and broad course, but I didn't like the organization and the many errors that were made in the assignments and tests. Advisor made me take this prior to MGT8803, which also has a bad review. I wish I could replace these 2 courses with other courses that I'm more interested in but they are compulsary.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "created": "2020-12-11T22:16:09Z"
                    },
                    {
                        "id": "external-import-c146bd25-7be4-4e93-854c-f14ca4140529",
                        "_createdAt": "2020-12-07T18:22:37Z",
                        "created": "2020-12-07T18:22:37Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "workload": 3,
                        "_id": "external-import-c146bd25-7be4-4e93-854c-f14ca4140529",
                        "body": "Great, *another* class where we do simple linear regression for the first couple of weeks. Seriously, you will do simple linear regression for about 8 weeks of total time between some of the entry level classes. And if taking classes online you have less options on what to take so you will take a LOT of simple linear regression.\n\nThe second half of the class is a mixture of new material and material from MGT8803 in the OMSA program.\n\nThe class is not hard, but it is boring. Perhaps they can take the content that is in 8803 and put it back in 8803. Then pull some of the content out of 8803 and put it here so it is less rushed.\n\nPart of me feels there are classes that exist in the OMSA program purely to pad the schedule. \n\nHomework pretty easy. Tests, pretty easy (I still have to take the final). Open notes on coding portion of the final and untimed was a good call.\n\nOffice Hours were a mixed bag. The content is pretty basic so very few people joined in them. Then in the end of class they became useful, but no one was coming to them because of the bar that was set over the first several weeks.\n\nThis is an \"Advanced Core Class\" but has to be one of the easiest ones they offer. It could be a better class with some restructure of it and other classes.",
                        "rating": 2,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall"
                        }
                    },
                    {
                        "body": "I had a different experience. While  not the most applicable class to those non-management analytics students (can't blame the class for that!), I found the class to be the most organized and well run in my OSMA experience so far. I found some sections to pair nicely with 6501, which I was taking simultaneously. \n\nPros:\n\n0. The /section on operations management was awesome. Bob Myers lectures were amazing and he got me pumped! He was great at keeping the lectures relevant to data and analytics and really interesting. More of him please!\n1. Super organized\n2. TA’s have been the most kind and helpful \n3. Office hours with TA’s well organized and thorough \n4. Office hours with professor\n6. A lot of opportunity to do exercises in R; I learned a couple handy tricks\n7. Lots of hands on opportunities to test knowledge along the way\n\nCons:\n\n1. Yes, the regression section is dry, like real dry.\n2. The marketing section was of ZERO interest to me personally and seemed like a hot waste of time. I'm not personally interested in web advertising. Seems a little too specialized for analytics students who are not likely going into or interested in marketing. The lectures in this section were annoyingly long (25-30 each) and of no value, for me. I could have done without this module.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "id": "external-import-696d8de4-5e07-4b61-b854-3168fb498669",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is"
                        },
                        "_id": "external-import-696d8de4-5e07-4b61-b854-3168fb498669",
                        "_type": "review",
                        "course": null,
                        "workload": 5,
                        "created": "2020-11-03T00:35:28Z",
                        "_createdAt": "2020-11-03T00:35:28Z",
                        "difficulty": 2
                    },
                    {
                        "difficulty": 1,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "course": null,
                        "workload": 3,
                        "body": "Oh gosh this is literally the worst class i have ever taken in my life so far! I am half way through and the stats prof on linear regression topic is really just reading the script and his slide is awful. He often just says 'and this is the result' without any explanation at all. I am a straight A student and I will not suggest anyone to take this course if possible. A total disaster, EVER.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3"
                        },
                        "id": "external-import-561d78c1-60c8-4885-845f-4c900c43ee00",
                        "created": "2020-09-28T06:26:35Z",
                        "_createdAt": "2020-09-28T06:26:35Z",
                        "rating": 1,
                        "_id": "external-import-561d78c1-60c8-4885-845f-4c900c43ee00"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "id": "external-import-11b40d81-ad20-47b0-99f3-8b3364c23fa7",
                        "created": "2020-08-26T00:41:14Z",
                        "_id": "external-import-11b40d81-ad20-47b0-99f3-8b3364c23fa7",
                        "body": "First, what I liked.  I liked the subject matter, and I liked most of the practical analytics application for the various subjects. As a relative R newbie (other than my trial by fire in 6501) I thought the use here was helpful and relevent in a real-world context.  The tests were straight-forward and relatively easy.\n\nI do think the design could be improved, however, and many of the lectures ran over-long in a more scripted fashion (vs. other courses) with little additional benefit - particularly in the marketing sections.\n\nOf the various sections: Regression was interesting but the videos were terrible and I felt more could have been done here. Finance was very interesting and well delivered.  Marketing was a bit of a mess - overlong lectures and R application homework that seemed like it could have been interesting if better structured (I'm hoping this is what the fuller Digital Marketing class covers in more detail?).  Operations had great videos but was a bit more basic.\n\nOverall, I liked it, but it feels like this should be the pre-req survey course of various \"business\" angles - but unlike 6501 and 6040 could be better built.",
                        "_createdAt": "2020-08-26T00:41:14Z",
                        "difficulty": 2,
                        "_type": "review",
                        "workload": 3,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "created": "2020-08-03T16:29:37Z",
                        "_id": "external-import-d2e8551c-67c4-41d3-b739-336ee580e2d3",
                        "_createdAt": "2020-08-03T16:29:37Z",
                        "_type": "review",
                        "rating": 2,
                        "workload": 5,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 2,
                        "id": "external-import-d2e8551c-67c4-41d3-b739-336ee580e2d3",
                        "body": "I am rating as disliked because it's a required course where at best I could imagine this as an MGT elective.  I could see this being a MGT elective course to give a micro overview of 4 business related topics.  The MGT courses are newer on OMSA and have a long ways to catch up to the CSE and ISYE course content and delivery.\n\nOverall, it is a fairly easy course.  Homework assignments probably took me the most time (30%).  A large portion of the grade is open book practical exams with no time limit (35%) - you can achieve an A without much effort.  The theory section (35%) of the mid-term and final allowed for 1 & 2 pages of notes respectively.  The self-assessments (10%) allow for unlimited and feedback on what was missed.  You could spend 3 hours studying for each of the 10 or you could just iteration the options and be done in 3 minutes.  Obviously you learn nothing with the latter approach but it is compensated when completing HW and studying for exams.",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "_createdAt": "2020-08-02T20:59:19Z",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "id": "external-import-a9a9db7c-597d-457f-9f44-335ac59f60ed",
                        "body": "As a required and advanced course I was really hoping for more. The course covers a lot of ground but I didn't feel it was anything unique. \n\n1. Regression - this is covered in ISYE6501 and ISYE6414\n2. Finance - This was unique unless you take the MGT Finance Class\n3. Marketing - Slides were from the MGT Digital Marketing Course\n4. Operations - A lot of this material was taught in greater detail in Simulation\n\nWhile everyone won't take all the classes listed above I didn't feel a lot of value was added from this class. \n\nHomework - 3 assignments each split into two parts: Part 1 T/F & Multiple Choice,  Part 2 coding in R. \nSelf-Assessment - 10 total amounting to 10% of your total grade. These were all multiple choice and didn't have a limit on the number of attempts. \nExams - 2 exams each had two parts similar to the homework \n\nOn the exams Part 1 was proctored and timed, 3 hours was allowed for 20ish questions. In total they recommended allowing for 90 minutes to take the exam. \nPart 2 was not proctored and open notes/internet. This was mostly code based question but was still multiple choice. \n\nThe exams and homework tend to have mistakes or unclear wording. I would recommend using Piazza to follow up. Often TAs were responsive and willing to answer questions. This did cause issues on the exams because clarifications would be posted after people had already started and/or finished specific sections. \n\nThe class overall was not difficult but I also didn't get a lot out of it. ",
                        "rating": 2,
                        "workload": 6,
                        "_id": "external-import-a9a9db7c-597d-457f-9f44-335ac59f60ed",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "created": "2020-08-02T20:59:19Z",
                        "difficulty": 2,
                        "course": null
                    },
                    {
                        "body": "I really enjoyed this course and have no idea why so many people dislike it.  If you consider this course as it's comprised of 4 distinct mini courses, this courses makes a lot more sense.\n\nThis is the true introductory course, and I think you should take this course before taking ISYE6501.  The course starts with regression, then covers finance, marketing, and operations management.  Some lectures are more interesting than the others (and I'd highly recommend downloading a chrome extension of video speed controller so you can watch these lectures at 2x - 3x speed).  \n\nThe course is taught like a middle school class, where they guide you through all the equations, how to use each function in R, how to interpret results, etc.  If you have not taken any courses in a while or don't have strong background in math or programming, THIS is the course to take.\nI lacked this prereq, so I really appreciated how they guided you through everything and practically spoon fed you the information.\n\nTAs and Professors in this class are much more accommodating and courteous than most others.  I feel like they really listened to the students and acted on any requests that we made right away.  They held finals review recitation, changed test question styles, how they upload documents, grading for HW, based on student feedback.  So there were a lot of changes that were being made throughout the course and could have caused some confusion but this is really impressive and appreciated.  Even Prof B held weekly office hours!\n\nIf you do not do very well in this course after submitting all the assignments and taking all the tests, I would highly highly reconsider pursuing a degree at tech, because other tech classes are not going to be like this. at. all.  This is probably the course with the lightest load, easy material where they spoon feed you information, and the nicest prof/TA's you'll ever have.  Other course will demand a lot more of your time and lot more learning on your own outside of the class. ",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2020-07-30T20:38:21Z",
                        "course": null,
                        "rating": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_createdAt": "2020-07-30T20:38:21Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "id": "external-import-fb8379a6-d964-439b-a071-70a7ffc231a3",
                        "workload": 2,
                        "_id": "external-import-fb8379a6-d964-439b-a071-70a7ffc231a3",
                        "difficulty": 1
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 1,
                        "body": "Took this class Spring 2020 with the hope of improvement after it had been reworked. Nope. In short, really easy class but SUPER DISORGANIZED.\n\nIt was clear right from the beginning that although the semester had already started, the material for the semester had not been finished. I could understand this if it was a new class or if it was being offered for the first time since the rework, but it was already offered Fall 2019 so it made no sense. I believe the first assignment wasn't due until 4 weeks into the semester.\n\nGrade policies, assignments, and course expectations were constantly changed on the fly. And many of these changes were only mentioned in comments on random Piazza posts, not even in Course Announcements. TAs and the Professor were less than useless in helping navigate through the course. \n\nDespite the huge headache caused by the disorganization, it was still an easy class. If you need an easy class to pair with a difficult one, this should be it.",
                        "difficulty": 1,
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "created": "2020-07-29T17:09:52Z",
                        "workload": 5,
                        "_id": "external-import-0d21d57f-c049-44f0-8118-e48511cbbe50",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-07-29T17:09:52Z",
                        "id": "external-import-0d21d57f-c049-44f0-8118-e48511cbbe50"
                    },
                    {
                        "course": null,
                        "body": "This course provided almost minimal value. The modules are cobbled together in a way that doesn't really make any sense, and they do not build on each other. The second and last modules are the only ones that are really \"analytics in business\". The advertising module is just rote memorization and you don't do any kind of analysis, making the me feel frustrated that we even had to buy the HBR case studies (which we hardly used).\n\nOverall, if this course were not a requirement, there would be zero value in taking this course.",
                        "_createdAt": "2020-07-29T13:34:55Z",
                        "rating": 2,
                        "_type": "review",
                        "workload": 3,
                        "_id": "external-import-59f43463-a6b9-4a06-9e88-c1debd632bbc",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "id": "external-import-59f43463-a6b9-4a06-9e88-c1debd632bbc",
                        "created": "2020-07-29T13:34:55Z",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "difficulty": 3,
                        "_createdAt": "2020-07-28T12:45:44Z",
                        "_id": "external-import-6efa8dd2-934e-4b87-805d-cb263f429176",
                        "body": "I found this course to be frustrating due to it's poor execution and placement in the program. This course is considered \"core\" to the program, and it really should be an intro course that can be waived in favor of an elective. \n\nWhat you can expect:     \nThis course is on par with an undergraduate survey course.    \nRepeated errors on assignments and exams    \nCourse content created solely by TAs with no instructor review      \nA demotivating experience    \nDisappointment in Tech for allowing this class to continue     \n\nStructure:    \nThis is a pretty straightforward survey class covering 4 modules;\nRegression, Finance, Marketing, and Operations Management. \n\nBy module, this was my experience:     \nThe regression module is decent if you've never seen or it's been a while since you worked with regression. However, if you've already taken ISyE-6501, this course will teach you bad habits. It just doesn't maintain the depth of instruction of 6501 due to the short modules.\n\nThe finance module was a trip, I had a lot of fun even knowing I don't wish to work in finance. I thought this module was great for the course, though there were a few things that were not covered completely in lecture. \n\nThe marketing module doesn't add any value to the course and should really be replaced. \n\nOperations management overall was basically a flyby Green Belt. You see control charts and inventory management stuff. I was impressed with how much OM content was stuffed into a short period.\n\nOverall, it's required, so bite the bullet, but be prepared for disappointment and frustration. ",
                        "id": "external-import-6efa8dd2-934e-4b87-805d-cb263f429176",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 1,
                        "course": null,
                        "workload": 10,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2020-07-28T12:45:44Z"
                    },
                    {
                        "_type": "review",
                        "rating": 4,
                        "workload": 5,
                        "_id": "external-import-02ec2e56-45ed-439d-988f-0c1419d395db",
                        "body": "I took this over the summer, so the schedule is a little condensed (11 weeks rather than the regular 15-16 weeks). Despite having minimal background in R, this was a very manageable course and its easy to pick up R on the fly. There were weeks when I didn't listen to a single lecture and I could easily catch up the following week. It is split into 4 different sections approximately equally. \n\n1. Regression - the lecture material was extremely dry with minimal examples. Basic linear regression and logistic regression. Regression is used throughout the course, so it would have been nice to have a better intro. The saving grace here is that the material is simple, so you can easily go elsewhere and learn it. Unfortunately this part of the course cannot be dropped as it's pretty important - but I'd recommend cutting a week off this material and moving it to Finance...\n\n2. Finance - Prof Clarke is enthusiastic and the material is interesting. Unfortunately, its the shortest part of the course. The topics covered (transaction costs, market efficiency, factor investing) are just skimmed through so you're made aware of the concepts but there is no time to get into any sort of depth.\n\n3. Marketing - Prof Bien runs this part and I think despite his best intentions, this material seems disjointed from the rest of the course. There is a lot of discussion on Google Analytics, social media and digital advertising but its taught in a way that is not really applicable to analytics. Sometimes it seems like a history lesson in the evolution of digital marketing. There are also several case studies, which one is recommended to purchase from HBR. These case studies may be an interesting read but again, the material is very peripheral to the course material and does not need to be purchased. I felt there was a missed opportunity here and the material should be revamped.\n\n4. Operations - I thought this was the best part of the course. Prof Myers brings a lot of energy to his lectures and he is clearly passionate about the material. There should be more time dedicated to this material. \n\nCourse structure - 3 assignments (10% each), split into a coding section and multiple choice questions. Much of the coding is covered in the TA office hours. Piazza is also helpful if you're stuck. There are also 10 Self-assessments, which are just a bunch of multiple choice questions. There are unlimited chances to do these questions until you get them right. Its a 10% giveaway. Midterm and final is split into coding (open book, you get a week to do it) and proctored 3hr closed book exam. The midterm had some unnecessarily ambiguous questions and ended up being curved up. There was also a 4% extra credit available in the final, so technically you could end up with 104% in the course.\n\nThere was some frustration due to repeated mistakes in assignment and midterm questions, however the TAs were responsive to queries raised on Piazza.\n\nOverall, I did learn stuff here - particularly in the Finance and Ops sections. With the relaxed pace of the course, I also found time to practice R.  This course is required for OMSA, so you can't skip it. Should be an easy A - as per the data, 86% of students got an A last semester.",
                        "id": "external-import-02ec2e56-45ed-439d-988f-0c1419d395db",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "created": "2020-07-27T23:08:24Z",
                        "difficulty": 2,
                        "_createdAt": "2020-07-27T23:08:24Z"
                    },
                    {
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "difficulty": 1,
                        "id": "external-import-53ed9d37-5183-4bef-817d-cefcc0342341",
                        "course": null,
                        "body": "I can confirm most things others have noted in their reviews. This doesn't seem like a graduate level course. Some of the content could be very useful if properly delivered. \nCourse has 4 modules, regression, finance, marketing and operations management. Finance and operations are best comparatively. \nRegression content is decent (as compared to modeling course, it's a bit more in depth) but the delivery is utter useless. The professor is literally reading slides. \nFinance module is better delivered and enjoyable. \nWhy is marketing module, the way it's structured is in an analytics course is not clear. Long boring lectures about descriptive things in marketing. \nOperations content is decent and could be relevant but it's very very superficial, just list of formulas and learn how to apply them. Professor delivered the content very well though.\nI took it extremely easy and some weeks didn't even study at all. Still managed 97%. I completed the final in 45 mins I think. This course needs a revamp. ",
                        "_createdAt": "2020-07-27T14:56:21Z",
                        "_id": "external-import-53ed9d37-5183-4bef-817d-cefcc0342341",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2020-07-27T14:56:21Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-2f25ba71-35d2-439b-903e-3b318477d180",
                        "_type": "review",
                        "course": null,
                        "body": "This class is a complete and total mess. They redid it once before - I hear yet another redo is in the works because so many have still complained about it since then. The lectures are pretty bad but not awful (they differ from topic:topic each with different instructors, some topics are far better presented than others) - my biggest gripe is how disjointed the assignments are. Oftentimes the instructions on assignments are flat-out wrong. Like they'll tell you to use 7, but actually you were supposed to use 5. Normally they'll correct this on the Piazza forums, but won't actually correct the assignment itself. And if you've already submitted it before the correction or didn't notice that Piazza post, too bad. Or the way many questions are phrased make very little sense. The syllabus also contradicted what was in canvas a few times, and they never bothered to fix, merely clarified on Piazza.\n\nIn terms of difficulty I agree with most of the other reviews that it's pretty easy - I personally didn't take regression prior to this course but would imagine that makes it even easier since there's seemingly a ton of overlap. You should be able to earn a B with practically no effort, and an A with a bit of effort. But just because it's easy doesn't mean it's enjoyable...hopefully when they redo the course yet again it'll be better, I'd advise perhaps holding off until it's ready and maybe it'll be more tolerable by then",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "_id": "external-import-2f25ba71-35d2-439b-903e-3b318477d180",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 1,
                        "created": "2020-07-26T16:58:05Z",
                        "_createdAt": "2020-07-26T16:58:05Z",
                        "rating": 1,
                        "workload": 5
                    },
                    {
                        "id": "external-import-d77ef62a-882c-4f5a-972e-7ab6b8d54a1c",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "_id": "external-import-d77ef62a-882c-4f5a-972e-7ab6b8d54a1c",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "_createdAt": "2020-07-25T17:35:29Z",
                        "rating": 4,
                        "created": "2020-07-25T17:35:29Z",
                        "body": "After reading so many negative reviews, I expected the worst going into the course. Overall, the course is not bad and finance module was highlight of the course. I just wish they can expand on the finance and operations module. Regression module seem to be redundant from ISYE 6501. \n\nI think some students go into the course expecting an easy A and expect the TAs to spoon feed them the answers. However, if you had put in the effort to research and go through the lessons, you can finish the course without even attending office hours. Comparing this course to the other two introductory courses. this course is easier. \n\nIn terms of TAs appearing to be snarky, I think this is biased and I have had worse snarky TA and even fellow student comments from CSE 6040.\n\nThey need to improve on the logistics of this course. So many errors in the syllabus and even the date settings on Canvas. They were quick to respond and update the documents, but it's an extra effort for students to keep up with the logistic changes. ",
                        "workload": 6,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "workload": 10,
                        "id": "external-import-06589fe3-7d9b-462e-b9e2-b2c2ab86ac72",
                        "created": "2020-07-25T01:15:33Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-07-25T01:15:33Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "course": null,
                        "_id": "external-import-06589fe3-7d9b-462e-b9e2-b2c2ab86ac72",
                        "body": "Preliminaries.  I will get an A.  I studied for this course about 8-10 hrs/week.  I viewed all the lectures and watched recordings of the office hours as needed.  I attended only 2 office hours in person.  They were kind of painful.  (If you're a TA, and the smoke detector in your room is beeping because the battery is running out.  Remove the battery, and replace it after the call.)\n\nIt is difficult to review this course as a single unit.  I will make some comments for the whole, and discuss each section separately.  Generally, I believe this was the first time the course was offered in its new form over the summer semester.  The syllabus went through 6 versions, primarily due to schedule changes and adjustments.  It was difficult to keep all of the dates straight.  The course had a reputation for being too easy.  I can assure you that is no longer the case.  Without having taken ISYE-6414, I don't think I would have done nearly as well in this class.  The TAs for the course seemed to not be completely on the same page.  Some were big fans of the R packages dplyr and tidyverse, and others didn't seem to mention them.  The textbook was completely useless.  I tried on several occasions to use it, but it really had absolutely NOTHING that was relevant to the course.  While it may be useful in the future, I didn't use it...  and it was relatively expensive.  Here are some details about the specific sections:\n\nPart 1.  Regression.  Pretty much that sums it up.  It was an overview of linear and logistic regression, with some mention of relevant topics like outliers and multicollinearity.  It does not go as deep as ISYE 6414, and makes some statements that made me raise my eyebrows after taking that course.  For example, saying that a model with a higher R-squared value is better is not completely true, and subject to a LOT of assumptions.  Also, they were almost fixated on talking about 1 unit and 1% changes for predictors in simple linear-linear, linear-log, log-linear, and log-log models.  While this may have a lot of value in business (though I sort of doubt it) the statements are really approximations and make me cringe.\n\nPart 2.  Financial Analytics.  I enjoyed this part of the course the most.  The instructor was energetic, and the topic was very interesting.  We discussed things like CAPM and Fama/French factor models.  The case studies were primarily on Berkshire Hathaway, and I found those very interesting.  There was some discussion about efficient markets, that was only briefly discussed.  I actually went out and got the suggested book on the subject... and I still missed the question on the midterm on this top.  That sort of burst my balloon.  Which brings me to the midterm.\n\nThe midterm for this course was awful.  It covered topics that were not even briefly discussed in class.  The wording was, and I apologize if I offend anyone, written in a way that a native English speaker would have trouble understanding.  When I brought up questions regarding the wording in midterms and in home-works, the response that I got from the TAs was \"Don't overthink it.\"  I wanted to scream... \"Then write it correctly!\"  As a classmate pointed out... \"Let's eat dad.\"  is much different from \"Let's eat, dad.\"\n\nPart 3. Digital marketing.  I really like Professor Bien.  He is energetic, and clearly has a great background (Ph.D. in math from MIT, extensive experience in the industry, more degrees than I have fingers, probably).  Unfortunately, this section seemed to be pretty much the study of the painfully obvious.  I am not that interested in digital marketing.  In my view, social media is to society what smoking is too good health.  Sure, it may be fun... but it results in cancer.  Anyway, this portion of the course went on for too long and basically came down to understanding the CPM means cost per 1000 (M means Mille)... you can imagine the fun that we had discussing the difference between CPM \"means\" and CPM \"stands for\"...\n\nPart 4.  This part of the course was fascinating, but too much packed into too little time.  The instructor was very energetic... but the sides were pretty bad.  (When you pay over 1K to take a course and you see a slide with the title \"Title\", it can hit a nerve.)  I found at least 4 mistakes in the slides in the last part of the course... and not little ones.  The last portion of the course covered... wait for it...  MM1 queues, control charts, exponential smoothing (with trending and seasonality), and inventory control (Economic order quantity.)   And we did it in about 2 weeks.  Again, too much and not enough time.\n\nThis course is required, and it is probably better in a regular semester... but I think it still has some kinks to be worked out.  Also, I have to say, the TAs for this course were generally some of the worst that I have had, with a few very important exceptions.  Again, I really like Professor Bien...  but this course is still... after being re-worked... not great.\n\nTMI?  I have been considering this review for the past several weeks.",
                        "difficulty": 3
                    },
                    {
                        "rating": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-d3fc2318-9874-435a-98df-424eb7a378cf",
                        "created": "2020-05-15T19:34:23Z",
                        "workload": 5,
                        "_id": "external-import-d3fc2318-9874-435a-98df-424eb7a378cf",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "body": "Some of the courses in OMSA have been great but a few are awful or at least mediocre. I think this course was mediocre. I guess the expectations are high (given we are talking about Georgia Tech). Even though I don't consider it to be a complete waste of time, I have to admit that the courses is too basic.\n\nThe problem with this course is that they try to teach about too many different aspects of business analytics in one course and then don't go in depth in anything. If you don't have a business background (this is my case) you will learn a couple of new things, but the level of the course is bad compared with the average in the degree.\n\nI think they should just get rid of the course and replace it by one advanced business analytics course focused on one specific domain, por example: supply chain analytics, marketing analytics, financial engineering or any other area of business where Analytics are used heavily.\n\nI might be wrong, but I have the impression that the main specialty of the professors teaching the business courses is not analytics. I want to learn about analytics applied to business and not about \"where\" analytics can be used in business. This is a subtle difference but this is what I expect given that this is an analytics degree and not a business analytics degree. The focus should always be in the Analytics.\n\nMost of the students who have a background in engineering, math or science will find this course to be weak because it is very weak in analytics content.\n\nI think this course would be OK for an introductory undergrad course, but the fact that we are calling this a core advanced course in a Masters degree in Georgia Tech is a joke. I don't regret enrolling in this degree, but I have to admit that this course degrades the qualify of the degree and have made me rethink the idea of switching to the OMSCS. If they are going to make this course compusory, they MUST make it a great course.",
                        "difficulty": 1,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-15T19:34:23Z"
                    },
                    {
                        "id": "external-import-d674df8e-2a28-4aa9-a530-aa5e127c7e1d",
                        "workload": 2,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_id": "external-import-d674df8e-2a28-4aa9-a530-aa5e127c7e1d",
                        "difficulty": 1,
                        "_type": "review",
                        "course": null,
                        "created": "2020-05-12T14:14:57Z",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_createdAt": "2020-05-12T14:14:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 1,
                        "body": "I won't repeat what other reviewers from the Spring 2020 term have written...I just don't understand why this is an advanced core class, and why it's required. There seems to have been minimal thought put into the course design."
                    },
                    {
                        "workload": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "created": "2020-05-11T14:34:52Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-3b7f79d7-cb66-418a-b626-96cb8ffe9472",
                        "rating": 1,
                        "difficulty": 2,
                        "id": "external-import-3b7f79d7-cb66-418a-b626-96cb8ffe9472",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-05-11T14:34:52Z",
                        "_type": "review",
                        "body": "This course was consistently inconsistent. The regression and marketing sections were a serious struggle to get through because the material was so dry, poorly presented, etc. However, other sections were presented well, had interesting/applicable material, and assignments that helped to solidify understandings. The material at times felt very theoretical and at others very applicable. The assignments were also very inconsistent, both with regards to frequency and material. The good thing was that the self-assessments can be submitted as many times as needed to get them all correct. \n\nAside from the material, the class was total chaos. It really seemed like the professor and TAs didn't care at all. There was conflicting information, particularly regarding the midterm, between the syllabus and multiple Piazza posts. Piazza was not well organized at all, and trying to find the most recent information and guidance was a challenge. \n\nI got an A in the class, despite not putting in that much effort, but it was definitely a frustrating class. I strongly recommend that the OMSA program look at re-structuring this class, and work with the professor/TAs on better communication. "
                    },
                    {
                        "id": "external-import-d84a8649-767f-4a07-949b-07031d636950",
                        "created": "2020-05-02T19:23:14Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "difficulty": 1,
                        "course": null,
                        "body": "The material on this could use some rework, as this is essentially a mashup of ISYE 6501 and MGT 8803.  Many of the first module lectures are tired rehashes of other course material (regression -linear/logistic).  This module felt like a pretty big waste of time considering you learn regression in other courses in the program that make more sense.  That being said, a big chunk of this course content is just various linear regression schemes (finance, marketing, etc.), so it would be hard to get rid of the regression content since there are no pre-reqs for this class.  \n\nOverall this just feels like a weird class stuck in between something with a business tilt and a stats tilt, and not in a good way; it misses the best of both.  The lectures are fine, but most are just profs reading verbatim off of slides.  All that being said, this class was exceedingly easy and required a minimal amount of effort.",
                        "_id": "external-import-d84a8649-767f-4a07-949b-07031d636950",
                        "_createdAt": "2020-05-02T19:23:14Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 2
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-080d2b66-54ed-4441-8fae-b53c10e76540",
                        "workload": 3,
                        "body": "This course was very inconsistent -- while some sections were interesting, well-structured, and engaging, others were very hard to get through, felt poorly-planned, and didn't generally add much value. \n\nThe good news -- the course is generally easy, especially if you have any background in finance or operations and understand regression, and both the professor and TAs seemed helpful enough and willing to make corrections or changes where needed to help students (even if some of those corrections were made necessary by mistakes on their part).\n\nHigh points for me were:\n- Professor Clark's finance section\n- Professor Myers' operations section\n- Exams felt true to the material, and were generally easy if you paid attention to lectures and were able to complete homework\n- TAs and Professor seemed responsive to changing circumstances (thanks, COVID-19!)\n\nLow points:\n- Regression module\n- Marketing module (interesting material, but felt loosely structured and difficult to follow) \n- Difficulties in deploying homeworks",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "created": "2020-04-30T02:16:14Z",
                        "course": null,
                        "rating": 3,
                        "difficulty": 2,
                        "_createdAt": "2020-04-30T02:16:14Z",
                        "id": "external-import-080d2b66-54ed-4441-8fae-b53c10e76540"
                    },
                    {
                        "id": "external-import-26ff1299-df1b-4d66-9a68-e570949e3b0b",
                        "created": "2020-04-27T20:01:51Z",
                        "difficulty": 2,
                        "_id": "external-import-26ff1299-df1b-4d66-9a68-e570949e3b0b",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "rating": 2,
                        "workload": 5,
                        "body": "## Topics\n### 1. Regression\nProfessor Sridhar Narasimhan just reads directly from the slides and doesn’t explain anything any further. At the end of each module, he gives a 1-2 question quiz. He never explains the answers. I suggest skipping watching the lectures for this topic. You’re better off studying the slides and going to the office hours to ask the TAs to explain anything you don’t understand.\n### 2. Finance\nProfessor Jonathan Clarke explained concepts clearly and was easy to follow along. This was my favorite part of the course. You’ll learn a thing or two about things that apply to you in real life!\n### 3. Marketing\nProfessor Frederic Bien has the worst lectures I’ve ever seen so far in the program. They were incredibly long, boring, and not very insightful. Anything useful that was tested on any assignment could be summarized into a few slides. It felt like I wasted so much time watching his lectures. \n### 4. Operations Management\nProfessor Bob Myers explained concepts well and I enjoyed his lectures. Pay attention to the mathematical formulas carefully while watching lectures. \n## Course Organization\nWe were the first semester after this course was “revamped” so we were basically the guinea pigs to test out the new structure. A syllabus should be a contract between student and instructors, right? WRONG. While the syllabus said they would not be, out of nowhere they decided to make some assignments proctored and/or peer reviewed. When students brought this up, we were basically told –> too bad. This set the tone for the rest of the semester and left a terrible impression. \n## TAs\nThese TAs were the worst ones I’ve ever had. Some TA’s would mark piazza posts as resolved when many times they were not. Some TA’s would be snarky, discouraging students to post questions. TAs took forever grading assignments that weren’t automatically graded. \n## Office Hours\nMy first office hour was my last office hour because of how terrible it was organized. TAs were late, didn’t have an agenda, and found myself listening to silence for most of the time. I suggest going only if you have questions to ask. \n## Course Work\n### Graded Homeworks\nThe wording on some of the questions on the graded homeworks were unclear and confusing. Sometimes they would provide you a different data set to work off of several days after the assignment has already been released. You can’t resubmit these so that really sucked. I really hope they do a better job on this going forward.\n### Self Assessments\nI enjoyed the Self Assessments. If you got a question wrong, you could go back and try to solve it again until you got it right, reinforcing the concepts.  \n### Exams\nExams were fair and did a good job testing your ability to interpret outputs from analysis. \n",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-04-27T20:01:51Z",
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        }
                    },
                    {
                        "created": "2020-04-26T23:17:50Z",
                        "_createdAt": "2020-04-26T23:17:50Z",
                        "rating": 1,
                        "body": "**TL;DR:** Even though this course has been revamped, there's still a lot of work to do. The class has potential, but it lacks direction as of right now.\n\n# The Content\n## 1. Regression\nThe professor is beyond boring, but the content is useful. We go deeper than what we saw in 6501. My advice: just read the slides, since the teacher only reads them anyway.\n\n## 2. Finance\nThe teacher is great, and the content useful if you are interested in stock trading.\n\n## 3. Marketing\nThat was the worst part of the course. First, the lectures are extremely long (and boring). Second, the content barely touches analytics! There were so many analytics topics that we could have explored, but that we just ignored. One suggestion I would have is to have a section on how to implement an A/B test and the multi-armed bandit technique from scratch. Right now (Spring 2020), the marketing module mostly consists of random stats that won't be relevant if six months (e.g., in the social media section, the teacher does not even talk about TikTok). In short, if they need to redo a part of the course, it should be this one. \n\n## 4. Operations Management\nThis is best part of the course. The teacher is fantastic, and the content is very useful (if you want to work in the field).\n\n# The Course Organisation\nThe course is a mess. Professor Bien (the course coordinator) didn't seem to have any experience in online education (even though it was his second semester teaching this class). We were given surprise peer-grading assignments twice, the second one being during the COVID-19 crisis. It felt like the syllabus was just a suggestion, and the teaching staff could change it as they wanted. Finally, the course coordinator (and the TAs) did not accept constructive criticism, which eventually led to heated discussions on Plazza.\n\n# The TAs\nMost TAs (but not all) were arrogant and mostly unhelpful. For a reason that I cannot understand to this day, they were always \"closing posts,\" even if the answer they provided was \"we'll get back to you.\" By the end of the course, they stopped doing that after many complaints\n\n# Office Hours\nProf. Bien office hours were 2-hour long, and he spent most of the time talking about stuff not related to the course. He sometimes provided useful information, though. The office hours led by the TAs were better, but to be honest, if you are decent in R (i.e., you did not struggle too much in 6501), you don't have to attend them.\n\n# Exam/Homework\nThey were mostly OK, but with occasional misleading questions. The averages were extremely high, which makes me believe that not many thoughts were put into them. Verify at the beginning of the semester what you are allowed to have during the exam since, as I mentioned earlier, the syllabus is just a suggestion in this course. For what it's worth, the programming parts were take-homes, we had a proctored theory midterm (one two-sided cheat sheet), and an open book/not proctored final exam (because of COVID-19).\n\nOne thing that was not OK was the peer-grading process. Both times we had a peer-graded homework, it was a total disaster (confusing rubric, unclear explanations...). In the end, the TAs had to regrade each homework manually.\n\n# COVID-19\nIt took them at least three weeks before acknowledging that COVID-19 was actually a thing. Many students reach out to Joel Sokol, and I believe that this is the reason why Prof. Bien finally addressed the situation. This is why we got the open book final exam. We also got extra credits, which was welcomed (one of, if not the only, highlight of the semester).\n\n# Conclusion\nIf the course were optional, I would strongly suggest that you take something else. But since we have to take it as OMSA students, I would suggest that you ask many questions about the evaluations at the beginning of the semester (what is proctored, number of cheat sheets...). We had two peer-graded homework this semester, but Prof. Bien said that he wanted to include more in the future. So, it is very likely that the workload in this class will increase.\n\nAlso, note that the 3/4 of the content was still enjoyable, so there's at least that :)",
                        "difficulty": 1,
                        "course": null,
                        "id": "external-import-fdf048d6-8c1a-472a-abd2-239058dd3b03",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 7,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi"
                        },
                        "_id": "external-import-fdf048d6-8c1a-472a-abd2-239058dd3b03",
                        "_type": "review"
                    },
                    {
                        "course": null,
                        "workload": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "_createdAt": "2020-03-21T23:51:42Z",
                        "created": "2020-03-21T23:51:42Z",
                        "_type": "review",
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_id": "external-import-c8a3871c-b6ad-4d2f-8da5-f339efb50b5e",
                        "body": "Easy A class. Content is easy to understand and workload isn't difficult provided you complete them on a weekly basis. (weekly self-assessments, HW assignments, and non-proctored take-home quizzes)\n\nYou'll be mainly using R, but you won't need to learn anything out of the ordinary. If you're already familiar with R, you'll be good to go. ",
                        "difficulty": 1,
                        "id": "external-import-c8a3871c-b6ad-4d2f-8da5-f339efb50b5e",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "id": "external-import-5ba3d7f2-0b5e-41e1-b312-594211bed1ed",
                        "created": "2020-01-08T15:56:19Z",
                        "course": null,
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 5,
                        "body": "This was an easy class since all homeworks, self-assessments, and exams were open book (there were also no group assignments). The self-assessments allowed multiple attempts. The questions on assignments would either come straight from lecture slides or require some R analysis on data sets. Following lecture examples made most of the coding assignments easy as well. \n\nThe class did not go into a lot of depth, but also did not seem to cover much ground relatively speaking. As a comparison, it felt more shallow than ISYE-6501 (I took that in Spring 2019) which is a class that covers a ton of topics. \n\nThe first homework assignment caused some confusion due to the wording of a few questions. However, subsequent homeworks improved even if they were not perfect. Unfortunately there was some distrust after the first homework and I felt that students were more ready to blame the questions (I was guilty of this as well). ",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_createdAt": "2020-01-08T15:56:19Z",
                        "_type": "review",
                        "rating": 3,
                        "_id": "external-import-5ba3d7f2-0b5e-41e1-b312-594211bed1ed"
                    },
                    {
                        "body": "This is a very easy course: \n- lectures are about 1-2 hours per week; \n- unlimited submission for self-assessment questions; \n- not proctored exams;\n- a lot of content is already covered in other courses.\n\nThe course required students to purchase a $30 course pack as supplement material, unfortunately, those case studies in the course pack have little relevance with course content. Only a few homework/self-assessment mentioned the cases, but the questions are not well designed and did not require thinking or a deep understanding of the material at all. \n\nI was excited about the course at first, because I heard it was redesigned, the actual experience was very plain, I don't think I learned a lot from this course. If you have to take this class, pair it with courses that are challenging or time-consuming. ",
                        "difficulty": 1,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-525b0a49-43f4-4961-983e-6940b79cb193",
                        "created": "2020-01-04T01:28:14Z",
                        "workload": 3,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-525b0a49-43f4-4961-983e-6940b79cb193",
                        "_type": "review",
                        "_createdAt": "2020-01-04T01:28:14Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null,
                        "rating": 3
                    },
                    {
                        "id": "external-import-56c23acf-16ec-4f29-93ed-3b264704721f",
                        "created": "2020-01-02T19:38:01Z",
                        "course": null,
                        "workload": 1,
                        "_createdAt": "2020-01-02T19:38:01Z",
                        "rating": 1,
                        "body": "I learned nothing from this class, was frustrated greatly by this class, and got a 99 in this class.\n\nThe subject matter for the homeworks was ridiculously easy. I didn't watch a single lecture, and the homeworks would take me about 1-2 hours coming in blind, because they were usually taken straight from the lectures and required no critical thinking. The only thing that made them difficult was the instructors often did not fully understand what they were asking about, and so the questions would have multiple (or no) correct answers. For example, there were 5 questions (out of 20) graded incorrectly on the first homework on regression. I took Regression Analysis last semester, and this class repeated much of the same material in a more difficult to understand and convoluted way. \n\nExam and final were open-book, and so ended up being just like the homeworks, where you just had to Ctrl-F your way through the lectures and source material. The frustrating thing is this could (should?) be a really good class, given the many ways analytics are used in business. That would require A LOT more effort to put into how the class is formatted and run, however.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "semester": {
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z"
                        },
                        "_id": "external-import-56c23acf-16ec-4f29-93ed-3b264704721f",
                        "difficulty": 1
                    },
                    {
                        "_id": "external-import-21b13f83-a9d0-4dc4-8363-3f698bde4eaa",
                        "_type": "review",
                        "difficulty": 1,
                        "_createdAt": "2020-01-01T08:43:11Z",
                        "workload": 3,
                        "course": null,
                        "body": "I took this course together with ISYE 6501 and really thought it was too easy. I haven't taken ISYE 6414 and while I was thrown into the whirlwind of regression in the earlier weeks before regression was covered in ISYE 6501, the assignments and exams were surprisingly forgiving. \n\nI understand that this course is supposed to be focused on the business application of analytics, but it felt more theory than practical since exam questions were more focused on calculating R^2 values, various metrics in finance, marketing, and operations management. I would have preferred if they were styled more similarly to ISYE 6501, where case studies were given and students were required to apply their code snippets to the problem.\n\nInstead, students had to merely plug and chug formulas that are essentially on the lecture slides. Exams were open book and there was a 4% bonus, allowing you to score a maximum of 104% which meant an easy A. \n\nMy other gripe was the inconsistency of the class schedules. Students were told to ignore the PDF and to adhere to the schedules posted on Piazza but to adhere to the deadlines that were on the edX progress page. The final exam release date was also a lot later than the stipulated date, which induced unnecessary stress for students who were doing other courses or may have taken leave from their day jobs and ended up waiting an entire day but no exam was ever released. \n\nThat being said, I think Professor Bien did do his best to inform us on the reasons why they could not release the exam earlier and the TAs were helpful when we faced technical problems. I understand this is the first run of the new version of the course but I think there are still areas for improvement, especially with the testing methods. Lectures were definitely informative, especially for those who lack a business background.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-21b13f83-a9d0-4dc4-8363-3f698bde4eaa",
                        "created": "2020-01-01T08:43:11Z",
                        "rating": 3
                    },
                    {
                        "_createdAt": "2019-12-17T16:08:00Z",
                        "created": "2019-12-17T16:08:00Z",
                        "_type": "review",
                        "workload": 5,
                        "_id": "external-import-94b46614-4fb9-4949-bba6-040b6d2091bf",
                        "body": "I believe this was the first semester of the newly revamped MGT 6203. I thought this class was very easy, especially having taken it after Regression Analysis. Almost all of the coding content covered in this class was covered in Regression Analysis. The homeworks are split into two types: self-assessment and regular homework. The self assessments are a guaranteed 100% since you have unlimited attempts to take the quiz. The homework you only have one attempt, but all of the answers could be found in the lecture videos, R code provided, and Google. The tests are open book and have no time limit (not proctored). I found this testing format to be very comfortable and it didn't stress me out at all, so I performed very well. The only bad thing about the class is that the due dates and release dates of assignments on the syllabus were not followed.\n\nOverall, this was a very straightforward class. It is good to take if you are anticipating a busy life during a semester. (Note: This is the only class I took this semester.)",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 1,
                        "id": "external-import-94b46614-4fb9-4949-bba6-040b6d2091bf",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        }
                    },
                    {
                        "rating": 4,
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "_createdAt": "2019-12-10T08:42:25Z",
                        "workload": 3,
                        "body": "After what I heard of this course previously, I expected lots of frustration coming in but I believe the faculty over-revised the course and it's now very easy. I like the general analytics knowledge that was added like in marketing, operation management, and finance.  But overall, it is a very light loaded and easy course. Only 3 assignments worth 10% each, 1 midterm, 1 final, and 10 freebie self-assessment that's worth 1% each. Sometimes I felt like I could forget about this course for 2 weeks and could still easily pick it up after. I'd recommend taking this along with other heavy-loaded courses. For now, this is a GPA booster.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-e197b4ce-261f-49a2-b38f-8e01f84f8333",
                        "created": "2019-12-10T08:42:25Z",
                        "course": null,
                        "_id": "external-import-e197b4ce-261f-49a2-b38f-8e01f84f8333"
                    },
                    {
                        "_id": "external-import-0943bcdc-74bf-4eca-be95-ee884488abeb",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 1,
                        "workload": 1,
                        "created": "2019-12-10T04:02:41Z",
                        "course": null,
                        "body": "This class was far too easy. It also jumped all over the place between regression, some random finance topics, some random weeks about marketing and social media, and then finally some random operations management topics. Completely incoherent course, it was a complete waste of time. The average on all assignments and final were close to 100%.",
                        "difficulty": 1,
                        "_createdAt": "2019-12-10T04:02:41Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "id": "external-import-0943bcdc-74bf-4eca-be95-ee884488abeb",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_createdAt": "2019-12-06T22:30:38Z",
                        "body": "This is the first semester that Prof. Bien taught the course.  It is still being designed, so there were a lot of ad hoc changes to the class and syllabus during the semester.  Prof. Bien is really passionate about the class and is very engaged.  The class is broken up into 4 units: Regression, Finance, Marketing, and Operations.  The regression is more technical, then the other units just involve easy calculations.  The homeworks and exams are multiple choice, so there are a lot of challenges to answers. Prof Bien has been very understanding to accept multiple answers.  I recommend this class as an easy companion to a harder class.  It's very easy, so there should be no problem taking this as one of your first classes.",
                        "difficulty": 1,
                        "_type": "review",
                        "rating": 3,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "workload": 3,
                        "id": "external-import-0ec7989e-ab90-4c41-b33c-5ec7881144ea",
                        "created": "2019-12-06T22:30:38Z",
                        "_id": "external-import-0ec7989e-ab90-4c41-b33c-5ec7881144ea",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "created": "2019-12-01T13:45:02Z",
                        "rating": 2,
                        "_id": "external-import-88ebb3c6-88df-44be-94f4-564682ef8ba6",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-12-01T13:45:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 8,
                        "id": "external-import-88ebb3c6-88df-44be-94f4-564682ef8ba6",
                        "body": "It's clear that the value of this course lies in a nominal connection of the program to the \"real world\". The difficulty with the course is that Prof Flury does not engage well with students and material is disconnected from larger concepts. The course is broken down into 5 modules: Accounting, Finance, Supply Chain, Marketing, and Business Strategy.\n\nAccounting - 5/5 - Very clear. Homework was clearly built upon the lectures. Lectures built on each other. Very Clear concepts\n\nFinance - 4/5 - Concepts were clear. The importance of the concepts were clear. The presentation of material was weak at times.\n\nSupply Chain - 4/5 - Concepts were clear. Presentation was clear. Homework did not follow from material presented in lectures.\n\nMarketing - 2/5 - Too many concepts presented without any overall themes. Homework did not follow from material presented in lectures. Relies too much on clever memorization tools without exploring whether the tools are comprehensive.\n\nBusiness Strategy - 0/5 - Big woof here. This is the only section led by Flury and should not be. Lectures are disconnected. Subtitles are transcribed incorrectly due to lack of pronunciation (southern accent). Review Quizzes do not follow from lecture. Flury was also very dismissive of alternative ways of thinking in Piazza and displayed strong survivorship biases in his Piazza replies.\n\nAs you can see, the class nosedives in quality as you go on. GTech needs to seriously review the involvement of Prof Flury in future iterations of this course. The closer he was to the material, the worse the material.",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3"
                        },
                        "difficulty": 2
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 12,
                        "_createdAt": "2019-10-08T15:31:28Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "created": "2019-10-08T15:31:28Z",
                        "rating": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "body": "I took this course before the revamp in Fall 2018. The textbook is great, and I have still have it with me. It certainly helped that I had taken Regression the semester before. It suffered from poorly worded exam problems, and not enough practice problems. The variance between the difficulty level of the HWs and the study guide provided and the actual exam was huge.",
                        "_type": "review",
                        "_id": "external-import-f73cfb68-32f1-4dca-bf27-e13232fd9028",
                        "difficulty": 3,
                        "id": "external-import-f73cfb68-32f1-4dca-bf27-e13232fd9028"
                    },
                    {
                        "id": "external-import-b0607f35-5a0f-4443-952a-c291f9c661cd",
                        "_createdAt": "2019-08-01T16:19:08Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "body": "I took this course in Spring 2019. Unfortunately, that is not a choice in the Semester Drop-down. Initially, they stated exams would be proctored, but a few weeks into the course announced the exams would be open-book exam (non-proctored). This course has been reworked for the Fall 2019 semester, so it is hard to know what will change. I would guess they will still use the same books, as they were pretty good. One of them (ISLR) is available for free PDF download. The other one (Data Mining) I rented from Amazon for about $50. I only needed 2 or 3 chapters from the Data Mining book. There were 4 graded homework assignments, due 2 weeks apart. Initially they released a HW 1 week before due date, but then changed to 2 weeks before due date after some feedback. I think it is important to allow students flexibility as to when they work on assignments, given the online format. My grades were not very good (70s and 80s) initially, but they applied a curve so my final score was 89.",
                        "created": "2019-08-01T16:19:08Z",
                        "difficulty": 3,
                        "_type": "review",
                        "workload": 7,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu"
                        },
                        "rating": 3,
                        "_id": "external-import-b0607f35-5a0f-4443-952a-c291f9c661cd",
                        "_updatedAt": "2022-07-11T19:08:18Z"
                    },
                    {
                        "id": "external-import-2782bc52-026f-4c3a-b5a3-5c86b342575f",
                        "_type": "review",
                        "course": null,
                        "difficulty": 5,
                        "body": "This class was a train wreck.  Avoid at all costs until they revamp it (planned for Fall 2019).  The lectures aren't too bad, if a bit simplistic, but the 'homework' is actually a collection of 4 quizzes that are critically misaligned with the lectures.  They are also clearly designed to 'trip up' the student by focusing on very specific edge cases and deep nuance of each topic or technique.  However, the nuance wasn't taught anywhere except for in the books.  \n\nThat being said, if you're a book learner and you need an excuse to read & internalize both ISLR and Data Mining for Business Analytics, then this might be a good excuse.\n\nThere is no student collaboration allowed for this course for fear of cheating.  We did nothing but accept reading assignments for the first 2 months of the course.  They ended up throwing out 6% of the questions because they were uniformly missed across the student body (trick questions with bizarro wording).",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-05-15T14:55:52Z",
                        "rating": 1,
                        "workload": 4,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "_createdAt": "2019-05-15T14:55:52Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_id": "external-import-2782bc52-026f-4c3a-b5a3-5c86b342575f"
                    },
                    {
                        "created": "2019-05-06T10:10:40Z",
                        "_createdAt": "2019-05-06T10:10:40Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "_type": "review",
                        "_id": "external-import-39f75c7d-becc-4d0f-b4e5-434bc3cef0d6",
                        "id": "external-import-39f75c7d-becc-4d0f-b4e5-434bc3cef0d6",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 1,
                        "workload": 6,
                        "body": "Knowing that they're redoing the class hopefully this review will no longer be applicable to those reading this, but boy what a crummy class. Very little prep material was given to teach you actual application of code. When enrolling you pay for the privilege to teach yourself the material through google and be graded by a computer (all MC). Homework and exams were absolutely riddled with errors and the TA ended up just giving everyone a 6% grade boost at the end rather than address them all. Speaking of TA's, you could practically hear the echoes in the piazza forums because students were constantly asking questions that were never answered. Staff effectively abandoned the class half way through. The material is mostly useful stuff, but you could learn it much more effectively by just skimming a textbook and doing examples. I personally contacted Dr Sokol, and it seems he is very much aware of the issues and working to ensure this same nightmare doesn't occur in the future and I very much hope they succeed.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2
                    },
                    {
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 5,
                        "_id": "external-import-86b60f24-46c8-4276-8f00-5995310c0cef",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z"
                        },
                        "body": "This course was just terrible. \nI know they are revamping it, I wish I waited. \nThe first half of the course on accounting was useful, but the second half of the class was just terrible video lectures about detailed marketing concepts that you will never remember or ever need to know without google. \nThe amount of memorization required to do well in this class is absurd.",
                        "id": "external-import-86b60f24-46c8-4276-8f00-5995310c0cef",
                        "created": "2019-05-06T00:25:01Z",
                        "difficulty": 3,
                        "_createdAt": "2019-05-06T00:25:01Z"
                    },
                    {
                        "workload": 3,
                        "body": "Very easy class that is a watered down version of ISYE 6501 - Intro to Analytics Modeling. Only 4 homework assignments which had simple, google-able questions. 2 tests, each with 2 parts - a \"theory\" part and a \"coding\" part, again answers were easily found on Google. Many errors on the assignments, tests, and answer keys. I had a great experience with ISYE 6501 and was extremely disappointed with this class. It was not engaging AT ALL. Felt like a bunch of topics cobbled together haphazardly. \n\nShould NOT be a required class. It adds absolutely nothing to the curriculum and reduces the legitimacy of the graduate program.",
                        "difficulty": 1,
                        "_type": "review",
                        "rating": 1,
                        "id": "external-import-33604cc6-f50d-4dae-84a8-1fc4c6d0f34d",
                        "created": "2019-05-02T19:56:47Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_id": "external-import-33604cc6-f50d-4dae-84a8-1fc4c6d0f34d",
                        "_createdAt": "2019-05-02T19:56:47Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        }
                    },
                    {
                        "body": "Disappointing class with mediocre effort from the faculty's side. The workload in the first few weeks was light, followed by back-to-back homework, midterm, homework workload. The HWs were significantly harder than the lectures would lead you to believe but I enjoyed the challenge which pushed me to search way beyond the provided content. However, it appeared as if 2 separate people did the lectures and HW questions and exams. I found the HWs and exams to be very poorly written with multiple errors, such as no correct answers present in the choices, poorly worded problems, late releases of solutions, canvas issues in releasing the student's own answers, no timely response to questions and overall lack of knowledge in how to run a class.\nIt seemed that the professor had 0 involvement and the class was run by TAs; only the head TA communicated high-level directions. \nPosts on Piazza read \"points will be given\" for the multiple wrong questions but as of the end of April I am yet to see any points give for HWs 3, 4, mid-term exam and final exam. \nMediocre class. Even if revamped, it needs periodic and timely involvement from a professor. I don't blame the TAs in whatever limited info they provided. The class lacked strong lead and direction which the professor should have provided.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "rating": 2,
                        "difficulty": 3,
                        "id": "external-import-e722c5fc-8441-4e62-b3a8-64ac0756c343",
                        "created": "2019-04-30T23:46:28Z",
                        "_id": "external-import-e722c5fc-8441-4e62-b3a8-64ac0756c343",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "_createdAt": "2019-04-30T23:46:28Z",
                        "workload": 10,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        }
                    },
                    {
                        "_type": "review",
                        "id": "external-import-fd36916c-2f5d-48cb-977a-d97094fd1899",
                        "workload": 3,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-04-28T19:36:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "difficulty": 3,
                        "rating": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "created": "2019-04-28T19:36:17Z",
                        "course": null,
                        "_id": "external-import-fd36916c-2f5d-48cb-977a-d97094fd1899",
                        "body": "This course was poorly structured and executed. The weekly workload was quite light (1 hour of lecture material which is ultimately superficial and unhelpful, textbooks were useful in-and-of themselves, but not particularly so for the course). Homeworks/exams were open-book and were essentially a game of \"where's Waldo\" primarily using Google and hoping that you understood the poorly-worded and structured questions so that you knew which topic(s) to research. Overall, these assignments/exams were not helpful or useful in an educational sense. There were often glaring errors in the answer choices and in the question prompts themselves as well. \n\nOverall, the numerical scores for the course grades are on the lower end of the scale despite the light workload and open-book assignments/exams. My final numerical grade will be a 75; the average will probably be around a 77-78. Last semester, a 77 was considered an \"A\", but I am not sure how big or small the curve will be for this semester. I was really disappointed with this course. I ultimately did not learn much, and I was saddened to see such a lack of quality/effort inherent in most of the instruction and the assignments. If any of us (students) did such poor work at our private-sector jobs, we would likely be fired. This course is not worthy of Georgia-Tech's reputation for excellence, and I sincerely hope that an effort is made to improve/revise this course by the administration."
                    },
                    {
                        "rating": 2,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-04-24T06:13:46Z",
                        "workload": 5,
                        "difficulty": 2,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "_id": "external-import-3996f98b-36c5-4e83-984f-d35c90c2dfbb",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-04-24T06:13:46Z",
                        "id": "external-import-3996f98b-36c5-4e83-984f-d35c90c2dfbb",
                        "body": "This course is almost useless if you have already taken many other classes in OMSA, especially regression. This class spends a lot of time on regression, but I already learned regression course by Dr. Serban before and this course provides no new information. Then the course go through various machine learning method and cross-validation in a very shallow level. If you have taken ISYE 6501 you won't learn anything new.\n\nThis class title is \"Data Analytics for Business\"; however, there is no business content except for the last week's seminar video. The difficulty is undergraduate sophomore or junior level at the most . \n\nThe other drawback is that there are many errors on exam on HW, and TA's response is not helpful. Some theoretical question is useless without practicality.",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-16cffd27-2de0-4893-9af5-50dd199adc96",
                        "created": "2019-04-22T02:36:42Z",
                        "workload": 9,
                        "_id": "external-import-16cffd27-2de0-4893-9af5-50dd199adc96",
                        "rating": 3,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "body": "Pro: \nThe text book is good.\nThe powerpoint slides are excellently organized, and the contents can be applied to solve real world problems.\nThe professor wore a different shirt with varied colors and patterns every week. \nCon:\nToo many errors with the homework and exams.\nMinimum activities on Piaza.\nOffice Hours are useless.\nOverall I do learn a decent amount from this class.",
                        "difficulty": 3,
                        "_createdAt": "2019-04-22T02:36:42Z",
                        "_type": "review",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "id": "external-import-97107d24-29c4-43f8-9a37-ef44fc924922",
                        "body": "Not Georgia Tech's strongest class but it's getting revamped next semester. Workload is low for those needing a class that is not very demanding but be warned that the amount learned is low too. The one good thing I'll say for the class is that much of the required reading is out of the ISLR, which was an instructive textbook. \n\nOverall, probably not as bad as everyone says but still pretty bad",
                        "_type": "review",
                        "rating": 2,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1"
                        },
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "created": "2019-04-16T18:49:37Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-04-16T18:49:37Z",
                        "workload": 3,
                        "_id": "external-import-97107d24-29c4-43f8-9a37-ef44fc924922"
                    },
                    {
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "id": "external-import-2b15fe07-286a-46b1-8214-ae6d94e55009",
                        "workload": 5,
                        "_id": "external-import-2b15fe07-286a-46b1-8214-ae6d94e55009",
                        "rating": 1,
                        "course": null,
                        "body": "Worst class I've ever taken in my life. Midterm, final, and homeworks were full of errors, and TAs refuse to respond to half the questions about them so you can never even learn why the answer is what is (or what the real answer should be if the marked one is an error).",
                        "_type": "review",
                        "created": "2019-04-12T19:43:51Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-04-12T19:43:51Z"
                    },
                    {
                        "_createdAt": "2019-03-15T21:38:54Z",
                        "created": "2019-03-15T21:38:54Z",
                        "body": "HW and Exams have 0 relations with the lectures. I learn by myself using Google.",
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-af939f9c-d892-4c5d-a12e-96f43f8adbac",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-af939f9c-d892-4c5d-a12e-96f43f8adbac",
                        "difficulty": 3,
                        "rating": 2,
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "_type": "review",
                        "course": null,
                        "body": "Although the class teaches some useful topics and I found the lectures mostly were well done, there were too many issues around the exams to recommend it. On the plus side, it is easy to pair up with more challenging classes as you can put in minimal effort and just cram for the exams.",
                        "_createdAt": "2019-01-18T13:29:47Z",
                        "difficulty": 3,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-b4d5930d-d29d-4e75-bbbb-b62e21f3203b",
                        "created": "2019-01-18T13:29:47Z",
                        "workload": 5,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 2,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_id": "external-import-b4d5930d-d29d-4e75-bbbb-b62e21f3203b"
                    },
                    {
                        "id": "external-import-5c1e9871-eaf3-41f8-a373-7b55fa37a428",
                        "created": "2019-01-07T22:23:47Z",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_id": "external-import-5c1e9871-eaf3-41f8-a373-7b55fa37a428",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 2,
                        "_createdAt": "2019-01-07T22:23:47Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "workload": 8,
                        "course": null,
                        "body": "The course covered a good range of useful topics and used R for most of the homework assignments.  The required text books were excellent.   It has a potential for being a great course.  But it was a disappointment. \n\nThe videos were not very effective because many were simply statements in bullet points.  They didn’t help me understand the concepts.  Many were the same content as the book Introduction to Statistical Learning with R but skipped critical details.  It’s better to read the book first.  \n\nHomework assignments (4 graded and one not) were simple but didn’t prepare students for the exams.  The midterm and final exams have two parts, part I closed book (60 minutes) and part II open book (4 hours).  Both were multiple choice questions but part II required R to answer the questions.  Some questions tested concepts never mentioned in the course – you were just expected to know.  The bigger issue is that many questions were poorly written and asked true/false questions.  You get it wrong if you think too much (more rigorously) or too little.  Many students did poorly in the exams (average in the 70s).  But the final grade had a big curve.\n\nThe professor was never there answering questions or interacting with students.   The TAs weren’t as organized as other courses.  Sometimes Piazza questions were not answered for days, leaving many students anxious and frustrated.   They didn’t try to use Piazza to stimulate learning and discussion.\n\nSome of the course contents overlapped with other OMSA courses.  But I did learn some new concepts and had more practice with R.  Given the time spent, the return wasn’t too bad.  It could be so much better if the lecture videos and homework questions were improved.   Since this is a core requirement, not a elective, for the OMSA students, it has a high opportunity cost.",
                        "rating": 3
                    },
                    {
                        "created": "2019-01-02T22:39:13Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-679f31a9-b6fe-481c-824b-81a16e1a2dad",
                        "_type": "review",
                        "course": null,
                        "workload": 3,
                        "_id": "external-import-679f31a9-b6fe-481c-824b-81a16e1a2dad",
                        "_createdAt": "2019-01-02T22:39:13Z",
                        "rating": 4,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3,
                        "body": "I think the biggest disconnect for this course was that the lectures don't correlate well with the assignments and the assignments don't really prepare you for the exam. this is why so many people seem to not spend much time on it, yet say it was hard or dislike it.\nthere is a lot of overlap with 6501. If you don't have lots of R experience, you will get better by necessity to complete the homeworks and the coding part of the exams. the multiple choice/proctored part of the exams really was stupid and pointless. questions were poorly worded multiple choice and I really hate proctortrac. Overall, the material was interesting enough, I would expand the homeworks and coding section and maybe replace the useless multiple choice with an individual project or something that actually relates to how you would use it in practice. For me, I liked it because I improved my R skills and the topics are interesting."
                    },
                    {
                        "_createdAt": "2018-12-26T15:23:00Z",
                        "rating": 1,
                        "difficulty": 2,
                        "created": "2018-12-26T15:23:00Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-81275285-2577-4805-b9f4-cc516b5f4dff",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "body": "Dr. Sridhar Narasimhan was absent from the course apart from the prerecorded lecture videos consisting of him reading every line of a PowerPoint presentation. The TAs apparently wrote all of the homeworks and tests which had serious issues. The 4 homeworks were generally very easy—mostly copying verbatim the code from the PowerPoint and substituting in the dataset of interest. The 2 tests had questions that were so poorly worded that it made the test taking experience a nightmare. The TAs were generally not very helpful on Piazza, preferring to defend the way things were worded/written than trying to help the students understand them. \n\nThe books for this course were actually pretty decent (ISLR and Data Mining for Business Analytics: Concepts, Techniques, and Applications in R) but they were not required. \n\nI’m not sure why this class is a foundational course. \nMost of the topics were covered in 6501. I would recommend waivering out of this course if you have that option available to you. \n\nIn the end our grades were curved significantly (a 77% overall received an ‘A’) but I’m not sure I learned much.",
                        "id": "external-import-81275285-2577-4805-b9f4-cc516b5f4dff",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 5
                    },
                    {
                        "id": "external-import-e91a9ed7-4f4e-4649-8dc1-dd3e014df4d5",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 2,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-12-17T17:36:32Z",
                        "_createdAt": "2018-12-17T17:36:32Z",
                        "workload": 10,
                        "difficulty": 3,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_id": "external-import-e91a9ed7-4f4e-4649-8dc1-dd3e014df4d5",
                        "body": "Completely ran by TAs that clearly have very limited knowledge in the field but believe they know everything.  Lots of inconsistency between lectures and exams/HWs.  HWs and Exam questions were all created by TAs with no cross or master audit from themselves or professor.  Questions missing critical information/assumptions, questions incorrectly worded, duplicates in answers, answers contradict lectures/office hours.  TAs are very defensive and lack of integrity in admitting/resolving issues in the courses.  Some always respond with one simple yes/no without addressing the actual concerns.  Some never responded.  Some gave one sentence response with obvious wrong answers. Some say take my word because he works as a manager at a big company?!  Due to overwhelming evidence of problems in HWs and Exams, they use grade inflation to solve the problem.  When you have 7 TAs, everyone is counting on others to address issues.   No issues were addressed and there were so many.  One TA said prof had 20 years of teaching experience and is very good.  I believe it, does the TA not realize that TAs are the center of the complains?  Professor is still responsible for hiring unqualified TAs and does not audit their sloppy work."
                    },
                    {
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester"
                        },
                        "workload": 7,
                        "_id": "external-import-db596e3a-84b4-4512-94ed-314ce203d29a",
                        "difficulty": 2,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-12-12T13:44:49Z",
                        "_type": "review",
                        "body": "# Strengths\n**(1) On required readings** -- The required readings provided (Galit, ISLR, some links) were great references! I really enjoyed reading through them and writing down notes since it deepened what I learned before the course.\n\n**(2) On HW difficulty** -- Homework was generally OK and allowed us to practice what we've learned from class. I also liked that some questions have gotchas to make sure you're reading the documentation well (e.g., stepAIC needs a scope parameter for forward stepwise selection) since this is a good real-life coding skill to nurture. I would have wished for more difficult coding homeworks, but perhaps the current level of difficulty was appropriate for an advanced core subject.\n\n# Weaknesses\n**(1) Lack of Professor/TA responsiveness on Piazza forums** -- The responsiveness of the TAs/professor dipped especially towards the latter half of the semester. I noticed several questions go unanswered for quite some time, or answered purely by other students (instead of the TAs/professors).\n\n**(2) Lack of organization** -- Majority of the videoconferences were scheduled a few days before the videoconference, so it was hard to find the time and plan around the timeslots provided. Some supplementary code for video lessons and HW solutions were often shared late, which was difficult for some students with time constraints especially for the exam periods.\n \n**(3) Room for improvement in quality checking of exams/HWs** -- Homework and exam quality checking has a lot of room for improvement. There were multiple reported cases from students that some questions were worded poorly or vaguely. There are also several instances of questions testing how well you can \"spot the difference\" (i.e., 4 almost-similar choices were given, which tripped up a lot of students) instead of testing our understanding of the core concepts themselves. For the finals, there was also an entire section of questions whose answers cannot be replicated by majority of the students.\n\n**(4) Minor errors in video lessons** -- There were some minor mistakes in the video lessons themselves. Perhaps the course team can update the videos or add annotations to the text above each video to clarify the mistakes previously flagged by students.",
                        "id": "external-import-db596e3a-84b4-4512-94ed-314ce203d29a",
                        "created": "2018-12-12T13:44:49Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 2
                    },
                    {
                        "id": "external-import-e7803773-a72d-4752-bc2b-674e8afb2d68",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 1,
                        "workload": 3,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "rating": 3,
                        "created": "2018-12-10T21:16:01Z",
                        "body": "The biggest problem with this course is not the course itself, but it's redundancy with another required OMSA course ISYE6501. I think the OMSA program needs to differentiate this course by either going more into the business application direction, or by making it go deeper than ISYE6501 in the subjects. Perhaps a course project would help, something with a business analytics focus. \n\nThis course is very light, and could be paired with the hardest courses in the program for balancing.",
                        "_createdAt": "2018-12-10T21:16:01Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_id": "external-import-e7803773-a72d-4752-bc2b-674e8afb2d68"
                    },
                    {
                        "id": "external-import-a38506b3-6cb6-44c8-a30d-d687b9ae7956",
                        "created": "2018-12-10T14:44:44Z",
                        "_createdAt": "2018-12-10T14:44:44Z",
                        "rating": 3,
                        "difficulty": 1,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "workload": 2,
                        "_id": "external-import-a38506b3-6cb6-44c8-a30d-d687b9ae7956",
                        "body": "My feelings on this class were mixed. The workload was incredibly minimal: ~1 hour of video per week, plus one assignment per unit every 2-4 weeks (4 total), which generally took 1-4 hours. Videos for a given unit were released at the start of the unit, but typically I watched all the videos and completed the unit assignment over 1-2 days. Unfortunately, assignments were released the last Tuesday of the unit and due that Sunday night, which didn't allow you to read the homework over or work on the homework along with the videos if you followed the course schedule (where they're broken out by week). \n\nThere was a midterm and a final, both a 4-hour programming exam (open book/internet, very similar to homeworks) plus a 1-hour (closed-book) multiple choice exam. My main criticism was that the questions on the assignments/exams for the latter half of the course were often poorly worded or missing information. This made the last assignment and the final exam frustrating (there was a section of the programming final that had technical problems, causing a significant portion of the class to miss 15% of the questions (as of the time I'm writing this interview, we're still waiting to hear from the TAs whether they will be giving full credit for the questions). \n\nOverall, the course was almost no time commitment, but could benefit from some more quality control. I paired it with ML, which was a reasonable overall workload. The content is covered in a whole bunch of OMSA courses (such as DVA and Regression), so unfortunately I didn't really learn a whole lot, so I would recommend taking this as early as possible in the program if you want to have a better learning experience."
                    },
                    {
                        "id": "external-import-7297c03f-cf90-46c0-a165-d7711e929162",
                        "rating": 1,
                        "course": null,
                        "body": "Disliked this class very much. Though I did learn quite a few things, the atrocious exams and support from TA's and the professor ruined this for me.\n\nI always thought homework assignments were to be done in effort to prepare you for the exams. Not in this case. Studying anything homework related would be a waste of time. But that one slide from the second week of class that was glossed over just a little bit? Sure let's include that. Actually, lets write four questions concerning that topic.\n\nI really have nothing good to say about this course. They set everyone up to fail with the lack of study guides, online support, and even basic English syntax on the exam questions.\n\nDon't even think about this class until they iron out the incredible kinks or find a professor who knows how to teach an online course.",
                        "_createdAt": "2018-12-09T23:08:42Z",
                        "_type": "review",
                        "workload": 6,
                        "_id": "external-import-7297c03f-cf90-46c0-a165-d7711e929162",
                        "created": "2018-12-09T23:08:42Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3
                    },
                    {
                        "created": "2018-12-09T19:12:31Z",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "body": "This class needs to be redone entirely.  It focused on programming and very little on how to apply the results in real time which would be expected for the title of the course.  The professor is clearly well regarded (and I have heard it is a great on campus class) but the online class honestly seems like a waste of money.  The lectures are not helpful for the exams.  The multiple choice exams are pure memorization and not helpful for application.  The homework require R coding (not something I would want to do in a management class).  It is unclear what we learned in the course.  I would be okay with an \"easier class\" to pair with some of the more difficult classes, but the grade distributions are on the lower end for a Masters level course.  \n\nWhile the workload is decent, not much is learned, the exams are memorization, the grades are tough, and the class needs to be re-evaluated.",
                        "_createdAt": "2018-12-09T19:12:31Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "id": "external-import-d586cb95-56b5-46ef-ac91-b023f1ed38a5",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 5,
                        "_id": "external-import-d586cb95-56b5-46ef-ac91-b023f1ed38a5"
                    },
                    {
                        "created": "2018-12-09T18:21:21Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_id": "external-import-01842010-92df-49a3-8d4f-63828ea2912e",
                        "_createdAt": "2018-12-09T18:21:21Z",
                        "rating": 4,
                        "course": null,
                        "id": "external-import-01842010-92df-49a3-8d4f-63828ea2912e",
                        "difficulty": 3,
                        "_type": "review",
                        "body": "Took course in Fall '18, but selecting that was not an option when creating this review.\n\nThis class gets a bit too much criticism here, I think. It's a good course in basic canonical data analysis techniques with R. It uses the universally loved ISLR as a text, along with another text that's also nice to have on the shelf.\n\nThe weekly workload is very small, but don't let that fool you. This is where the course can be a little deceiving as, while the weekly lecture and readings won't take much time, you will be expected to REALLY know the material come test time.\n\nSpeaking of tests, there were two, a mid-term and a final. The tests are broken into 2 parts. Part 1 was multiple choice, about 50 questions (closed notes, closed books, no cheat sheet), and the class averaged about 78%. So not so easy. Second part of tests were coding in R and completely open everything, here the class average was low 80's. \n\nI did the opposite of the class in that I always did better on the multiple choice than average, but worse than average on the coding sections, which makes no sense until you realize that I have poor coding aptitude, I guess. \n\nDecent class, probably could have focused a bit more on business applications, given its name.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 5,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        }
                    },
                    {
                        "rating": 2,
                        "_id": "external-import-2976376b-a893-4e3f-a155-d0fad2b81341",
                        "difficulty": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "body": "Easy enough, especially after taking ISYE 6501.\n\nHomework's were a breeze -- I spent maybe two hours a week on this course.\n\nThen came the final that was full of misworded questions and \"gotchas.\" I had a 100 going in to the final and somehow ended up with a B it was so bad.",
                        "id": "external-import-2976376b-a893-4e3f-a155-d0fad2b81341",
                        "created": "2018-12-07T17:44:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 2,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-12-07T17:44:17Z",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "rating": 1,
                        "course": null,
                        "created": "2018-12-07T15:11:05Z",
                        "body": "This course is a survey of techniques mentioned in isolation. In keeping with GT MGT, all assessments are poorly worded multiple choice (HW and exams).\n\nHW and exams are released for a few days at a time. For the homeworks, this is unnecessarily constraining. For the exams, this is stressful.\n\nThe topics covered are not consistently applied to a business setting.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "_createdAt": "2018-12-07T15:11:05Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "difficulty": 3,
                        "id": "external-import-76142836-ef43-4fc2-a546-2b6245c70681",
                        "workload": 5,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_id": "external-import-76142836-ef43-4fc2-a546-2b6245c70681"
                    },
                    {
                        "workload": 6,
                        "created": "2018-08-10T13:10:57Z",
                        "body": "This course is badly structured, and not well managed. The content topics, while interesting in themselves, have received very light treatment - not much challenge or learning in the weekly homeworks and lectures. Homeworks were too simple - more like plugging in values in a formula. On the flip side, the final exam, which was 50% of the grade, and broken into 2 parts, all of a sudden raised the level of the kind of problems/scenarios students were expected to solve. There wasn't good support from the instructors towards the end of the course, when it was most needed for a tough final. It was more students helping students. The course had much promise, but badly handled. The most valuable part of the course were the executive interviews at the end of the course.",
                        "_createdAt": "2018-08-10T13:10:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_id": "external-import-845ef2ff-edaf-4f66-856c-fef121e7073b",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-845ef2ff-edaf-4f66-856c-fef121e7073b",
                        "difficulty": 1,
                        "rating": 2,
                        "course": null
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-08T14:51:40Z",
                        "_id": "external-import-1edd0097-2b84-4533-8d54-82b2bcfb5807",
                        "id": "external-import-1edd0097-2b84-4533-8d54-82b2bcfb5807",
                        "created": "2018-08-08T14:51:40Z",
                        "rating": 1,
                        "workload": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "body": "Lectures were pretty good (if not dry) on analytical models used in a business context. One module is there per week, each module taking 30 minutes-1 hour of lecture. Homework occurs once every two weeks, about 15-20 questions on average using both R and homework trivia questions. Some of it was repeated material (if ISYE6414 is taken prior to MGT6203, about half the class is accounted for), and some material is truly new.\n\nHomework is 50% of the grade (5 homeworks for a 10 week semester), and the final exam was the other 50% (50 multiple choice questions and a programming section). Buyer beware, the class does not prepare you for the final exam - questions asked are nitpicky and memorization based with no cheat sheet for the MC. With no curve, it's really easy to slip into B territory. Recommendation is to wait when taking this class - it has the potential to be developed into something great. However, if taking something intense like ML/DVA and need a light workload course for a second class, take it now.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "difficulty": 3,
                        "_type": "review"
                    },
                    {
                        "id": "external-import-c462d665-b2a9-42cd-8213-d65fd8849476",
                        "created": "2018-08-08T06:28:42Z",
                        "rating": 2,
                        "workload": 3,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "body": "I did not enjoy this course. Most of it was a repetition of regression; other more interesting parts were treated very superficially. Homework was very easy. I expected the final exam to be easy, too, but I was wrong.",
                        "difficulty": 2,
                        "course": null,
                        "_createdAt": "2018-08-08T06:28:42Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "_id": "external-import-c462d665-b2a9-42cd-8213-d65fd8849476"
                    },
                    {
                        "workload": 2.5,
                        "_createdAt": "2018-08-07T14:33:42Z",
                        "body": "Course wasn't hard at all, but extremely underwhelming. HW was 50% of the grade and the final (2 parts) the other 50%. Material is VERY surface level. If you practice the HWs and are proficient at R, you can do the 2nd part of the final without issue (it was coding and a 3 hr time limit - this likely will be changed). Part 1 of the final was MC and tested on random details. I did well in the course (94 overall), but I'd wait until at least 2019 for a revamp.",
                        "created": "2018-08-07T14:33:42Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 3,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "_type": "review",
                        "course": null,
                        "id": "external-import-665db1ac-82c2-442f-83a5-476ad2af5f73",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-665db1ac-82c2-442f-83a5-476ad2af5f73"
                    },
                    {
                        "id": "external-import-626f218d-caf8-44e6-9817-1a273d01e787",
                        "created": "2018-08-07T14:28:03Z",
                        "body": "This course is mostly on basic regressions. Text analytics bit has good initiative but was not covered in-depth. Overall this is more like a MOOC course rather than a proper postgraduate course. I think most people would expect more contents to be covered in this course and assignments be more challenging.",
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-07T14:28:03Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "rating": 2,
                        "workload": 3,
                        "_id": "external-import-626f218d-caf8-44e6-9817-1a273d01e787"
                    },
                    {
                        "course": null,
                        "id": "external-import-fcfb0cbb-c954-413e-af96-9921954e862e",
                        "workload": 2,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu"
                        },
                        "_id": "external-import-fcfb0cbb-c954-413e-af96-9921954e862e",
                        "_type": "review",
                        "difficulty": 1,
                        "_createdAt": "2018-08-06T15:35:59Z",
                        "created": "2018-08-06T15:35:59Z",
                        "body": "Out of the three courses I've taken thus far (ISYE6501, CSE6040, and this one) this is the worst course by far.\n\nThe course is titled Data Analytics in Business, but the link explained between what is taught and how they are applied in business is superficial at best. This is not to say that what is taught is not used in business, they are, and to a significant degree. It is just that the course does NOT do a good job of relating course material to business.\n\nThis course is essentially a course on all sorts of regression, basic networks, text analytics, and basic R.\n\nThe homework assignments are a joke and make up a large percentage of your grades. This does not mean it's easy to get a high mark because the final exam is very badly designed.\n\nIn our term (2018 Summer) the final exam was split into 2 parts. The first part was 50 multiple choice questions in 60 minutes, and relies on you to completely memorize all course content as no reference material is allowed what so ever. The second part is more meaningful, requiring live-coding on R, 30 questions to be done in 3 hours--which is actually very cramped. Majority of my class did not finish the second part within time.\n\nThe course could be made a lot better by linking the course material to actual business applications, going beyond basically teaching how to interpret R output, having more meaningful homework, and by having mid-terms instead of cramping everything into the final exam.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 1,
                        "_updatedAt": "2022-07-11T19:08:17Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-08-06T14:58:10Z",
                        "_id": "external-import-850a4303-fc83-4fac-9d9b-ec8d616f6e9b",
                        "body": "Class is separated into 5 assignments (10% each) and your final (50%).  Assignments don't really prepare for you for the final as each assignment gives you 2 weeks to complete it.  The final is 2 parts.  Part 1 was 50 multiple choice in 1 hour.  Part 2 was 30 free response coding intensive questions in 3 hours.  Part 1 was pretty poorly written as most questions were worded oddly.  Part 2 was difficult due to the time constraint.  You don't really learn much in this course that isn't covered in ISYE 6501.  Can't say I would recommend.",
                        "_createdAt": "2018-08-06T14:58:10Z",
                        "rating": 2,
                        "difficulty": 4,
                        "course": null,
                        "id": "external-import-850a4303-fc83-4fac-9d9b-ec8d616f6e9b",
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        }
                    },
                    {
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "workload": 2,
                        "id": "external-import-849af344-a373-48e6-ab7e-de5a185980ba",
                        "created": "2018-08-05T11:37:49Z",
                        "difficulty": 2,
                        "_createdAt": "2018-08-05T11:37:49Z",
                        "body": "Super easy course was great for summer. Only thing is the exam was very difficult compared to homework and it's so heavily weighted. Be sure to take great notes and quiz your self weekly to prepare for the final.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-849af344-a373-48e6-ab7e-de5a185980ba",
                        "course": null,
                        "semester": {
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer"
                        }
                    },
                    {
                        "workload": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "body": "I'm not sure what to say about this course. I might call it a waste of time, but I only spent a couple hours a week on it, and this was in a condensed summer term (for a fall/spring term, it'd be way less). I could have completed this course in single weekend. The content in this course is very conceptually easy, mostly because the treatment of the material was exceptionally light. I don't feel as though I've learned anything about Data Analytics in Business, which is what you think you might learn in a class called Data Analytics in Business. You might think there would be business cases, simulations, team projects, ethics, consulting reports, etc. that would make the class interesting and fun... but I think they tried to avoid that. I was excited for this course, but left feeling disappointed, and I'm really not that difficult to please. There just isn't very much content in this course.\n\nThe exam format was stressful. The one test was the final, which was worth 50% of the overall grade. The questions on the first part of the final were very poorly worded, and I think about 10% of the grade on part one is completely random chance. The second part of the exam was much more straightforward, but took a whole 3 hours to do if you were going fast. \n\nIf you're taking multiple courses at the same time, pair this one with a difficult course. If you're a first-term student, don't base your opinion of other OMSA courses on this one. The ISYE and CSE courses are challenging and interesting.\n\nEDIT: I believe student criticisms have been heard, and they'll (hopefully) make some changes to the course in future terms.",
                        "difficulty": 1,
                        "_createdAt": "2018-08-03T18:21:18Z",
                        "id": "external-import-589f0571-e3fb-4464-9c90-e2a2aedf8d06",
                        "created": "2018-08-03T18:21:18Z",
                        "course": null,
                        "_id": "external-import-589f0571-e3fb-4464-9c90-e2a2aedf8d06",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-2c2927fb-c0c5-4225-9310-f5e6c4fb25c4",
                        "created": "2018-08-03T16:37:38Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 2,
                        "_createdAt": "2018-08-03T16:37:38Z",
                        "workload": 2,
                        "_id": "external-import-2c2927fb-c0c5-4225-9310-f5e6c4fb25c4",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2014-2",
                            "_updatedAt": "2022-07-22T00:49:45Z",
                            "startDate": "2014-05-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Imx7"
                        },
                        "body": "This was a breeze at the beginning with all the HW's. The worst part is the exam which was very poorly planned and not a fair representation of the course material taught. I wish the professor changes things for the future iterations.  I can't recommend this course until the exam structure is fixed.",
                        "difficulty": 4
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_createdAt": "2018-08-03T14:51:33Z",
                        "_type": "review",
                        "course": null,
                        "id": "external-import-28735937-1a56-4336-8591-71ae3f448a74",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 1,
                        "body": "Initially you will feel this is a easy course. The content was very light it was more to tell you what does each and every output is related in the business world. Now with the content light you would think the exams will be a breeze, but it was opposite the multiple choices were tricky. but the real problem is the 2 hour R proctor. it was exhaustive and not worth the time. If you are keeping it open book then why proctor it and second how can you expect people to solve problems and write explanation in 2 hours. Very disappointed that i took this course.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-08-03T14:51:33Z",
                        "_id": "external-import-28735937-1a56-4336-8591-71ae3f448a74",
                        "workload": 2
                    },
                    {
                        "rating": 3,
                        "id": "external-import-23e3891c-eb47-49fa-8756-ced6b82b3a05",
                        "created": "2018-08-03T08:58:07Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-23e3891c-eb47-49fa-8756-ced6b82b3a05",
                        "_createdAt": "2018-08-03T08:58:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "difficulty": 2,
                        "workload": 3,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "course": null,
                        "body": "This course should split the industry interviews into bi- weekly installments and develop subject material/homework that in some part each week aligns with concepts discussed in the interviews.\n\nToo much time was spent on Regression at too shallow a level. It is largely a rehash of 6501. Assume we know it, revisit it quickly and turn towards application of it in business. It felt like a whole week was spent on what was covered in 3 slides in 6501, without necessarily getting into greater depth. Spend more time on all subjects and their application to real world business examples.\n\nIt was a good opportunity to review Regression but spent way too long doing so, with easy homework - would have been better if the homework had been a bit harder like the exam.\n\n Wait to do this course after it is revamped (hopefully). It's a waste of time and money as is."
                    },
                    {
                        "workload": 2,
                        "_id": "external-import-a99a8cc2-ac40-45ea-b03a-18660e105957",
                        "created": "2018-08-03T07:49:33Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 1,
                        "course": null,
                        "_type": "review",
                        "id": "external-import-a99a8cc2-ac40-45ea-b03a-18660e105957",
                        "body": "This was the worst course that I ever taken in my life.The name is too big for the content. Not projects. Not good experience with business analytics. Just generic example for begginers that you could find everywhere. One bullet final exam with the 50% of the total grade with the worse methodoly that you can imagiing to grade a code test and non necessary tricky questions in the theric ones.  I think that business analytic nanodegree or datascience nanodegree of Udacity is a tons  miles better.",
                        "rating": 1,
                        "_createdAt": "2018-08-03T07:49:33Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q"
                    },
                    {
                        "_id": "external-import-6d6ef682-e857-4460-a761-9600249620d5",
                        "created": "2018-08-02T17:10:04Z",
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "rating": 2,
                        "workload": 2,
                        "body": "**Pros:**\n\nWell, it was a very light workload so I had a relaxing summer term (though, this isn't really a good thing because we are here to learn after all).  Explanations of different types of regression were clear and useful review.  Association rule mining was interesting and new to me. The interviews at the end briefly raised some important issues.\n\n**Cons:**\n\nOverall, such a missed opportunity from a content perspective. For a course about analytics in business, it was:\n\n * light on the analytics side: 75-80% was coverage of traditional regression models. The remainder was mostly very shallow coverage of association rules, text mining, and graph analysis.  No coverage of contemporary ML/AI/NLP. No coverage of visualizations/dashboards.\n * light on the business-issues side: nothing (except an interview at the end) on areas in different industries that are being transformed by analytics, value/customer orientation, analysis of internal projects as investments; and \n * light on the interconnections between analytics and business: little/no mention of the history of data analysis in business, data acquisition/silos/cleaning, cost/benefit of analytics projects, privacy and security issues, ethics, data lifecycle management/QA, prototyping and agile/lean project management, and operating analytics/ML products in a real setting.\n\nThe interviews at the end, though interesting, were bolted-on without any connection to the material or effective application.\n\nThis class should have been a historical and current overview of data issues from C-suite, VP, and project team levels, plus weekly hands-on case studies of _real analytics projects and problems in business_, with an industry expert brought in help guide each one. The course needs to be completely redesigned based on input from industry analytics leaders (such as those the prof interviewed).\n\nHomework was easy and boring -- basically rote tasks. Mostly type in a few lines of R (or hand-calculate), get some numbers, select the right multiple-choice option.\n\nThe final exam was bad. I don't know why the business school has such an irrational preference for rigid exams over applied projects.  Part 1 relied on memorization and had several poorly-constructed questions. Part 2 was just a 3-hour proctored slog of R coding and copy-pasting that I managed to finish and review with 2 minutes to spare.  High-stakes exams are an extremely poor way to teach most analytics topics --- projects/case-studies actually reflect the work of data scientists in the real world.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-6d6ef682-e857-4460-a761-9600249620d5",
                        "_createdAt": "2018-08-02T17:10:04Z",
                        "course": null,
                        "_type": "review"
                    },
                    {
                        "_type": "review",
                        "_createdAt": "2018-08-02T13:28:35Z",
                        "rating": 3,
                        "course": null,
                        "id": "external-import-59556dfd-286a-4cd9-8972-e92ea074ec49",
                        "created": "2018-08-02T13:28:35Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-59556dfd-286a-4cd9-8972-e92ea074ec49",
                        "difficulty": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "workload": 2,
                        "body": "The content is not bad, there is just too little depth and the weekly workload is a joke. I suggest to pair this course with some other bigger course otherwise your semester will be wasted."
                    },
                    {
                        "created": "2018-08-02T13:27:30Z",
                        "_createdAt": "2018-08-02T13:27:30Z",
                        "course": null,
                        "workload": 1,
                        "id": "external-import-d67cc524-245d-4743-a45d-e5960a0e2c5a",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z"
                        },
                        "_id": "external-import-d67cc524-245d-4743-a45d-e5960a0e2c5a",
                        "difficulty": 2,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "body": "The course covered good material. However, it didn't go into too much depth on the topics. Modules were released every 2 weeks and took about 30 minutes to watch the lectures and around 1 hour to do the corresponding homework. It would be more useful if the released a module each week or went into more detail. Homework was very easy. However, their was only 1 exam (summer) and it was two parts. Part 1 closed book multiple choice, 50 questions in an hour. Part 2 was 30 questions open everything, open response, programming in 3 hours, which wasn't enough time."
                    },
                    {
                        "rating": 1,
                        "created": "2018-08-01T23:16:25Z",
                        "semester": {
                            "startDate": "2015-05-18",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Ign3",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2015-2",
                            "_updatedAt": "2022-07-22T00:49:19Z"
                        },
                        "_id": "external-import-781f8ef6-050d-43c2-8948-92708a260719",
                        "body": "Awfully underwhelming course. About 30-40 minutes of video content assigned every 20 weeks, with 5 hand-holding homeworks comprising 50% of the grade and 1 final exam comprising the other 50%. Any questions that you get wrong on the final are due to poor wording or an overemphasis on the memorization of unimportant details, which sounds to be the case with a few of the business courses.",
                        "difficulty": 1,
                        "_type": "review",
                        "id": "external-import-781f8ef6-050d-43c2-8948-92708a260719",
                        "_createdAt": "2018-08-01T23:16:25Z",
                        "course": null,
                        "workload": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_updatedAt": "2022-07-11T19:08:17Z"
                    },
                    {
                        "_id": "external-import-c81bccab-0d17-4f44-8f79-42004c7dcf8c",
                        "course": null,
                        "workload": 2,
                        "created": "2018-08-01T18:01:49Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 2,
                        "difficulty": 2,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "body": "On a week to week basis this class has the lightest workload of any class I have taken in OMSA, by a large margin.  The homework is so simplistic it's almost pointless.  To bring this class up to a similar content level of other OMSA courses you'd basically need to double the amount of content.  For example we spent four weeks of a ten week term covering linear regression and it could have easily been managed in two weeks.  This is a topic that has been covered in some form or fashion in three of the four other classes I have taken.  No one in this class should need this slow an introduction to this topic (this is an advanced core class after all).  The topics later in the semester, network analysis, text analytics and association mining were better but they were covered at a pretty superficial level to me.  This class would have been better if we dove into the details on these topics rather than spend so much time on a topic that everyone in this class should be fairly familiar with at this point (linear regression)\n\nThe homework assignments are not hard, but they do nothing to enhance your understanding of the content or prepare you for what is expected on the exam. Most of the homeworks are basically a reperformance of the sample code provided in lecture.  Almost zero thought or analysis is required.  \n\nI would have rated the difficulty as very easy if it hadn't been for the final exam.  The homework and sample exam questions did not prepare me for the level of detail demanded on the first part of the exam (50 multiple choice questions).  Given my performance on part 1 I made a better effort to prepare for part two of the exam.  I felt prepared for part two content wise but not prepared for the awful format. Exam questions in a pdf, answers placed in a word document and 30 questions almost all of them requiring coding resulted in a three hour frenzy of coding, alt-tabbing and copy and pasting.   \n\nThis was another disappointing class from the business school.  Based on my experiences in 6203 and 6754, I will be avoiding all other classes offered by the business school unless I see actual evidence of quality content being created.  This class just feels like another missed opportunity.",
                        "id": "external-import-c81bccab-0d17-4f44-8f79-42004c7dcf8c",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-08-01T18:01:49Z"
                    },
                    {
                        "rating": 4,
                        "course": null,
                        "id": "external-import-e5329fde-00d9-43ec-9883-8b48e228d111",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1"
                        },
                        "body": "Fairly straightforward class, but the lectures were all recorded from in-person sessions and could be difficult to understand.  Actual material should have been more interesting than the cases and examples used in the lectures.  Hear that the class is being reworked for an online format so hopefully the lectures improve.  No real coding experience needed, the entire class was mostly a tutorial in using Radiant, which is a GUI front-end for building models in R",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "_id": "external-import-e5329fde-00d9-43ec-9883-8b48e228d111",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-05-01T20:40:14Z",
                        "workload": 6,
                        "_createdAt": "2018-05-01T20:40:14Z"
                    }
                ],
                "_rev": "iLpqNfBINCDhaBRaVHU6hz",
                "_type": "course",
                "_createdAt": "2022-07-05T23:23:15Z",
                "programs": [
                    {
                        "acronym": "AN"
                    }
                ],
                "rating": 2.262295081967213,
                "difficulty": 1.9344262295081966,
                "workload": 5.758196721311475
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "data-analytics-in-business"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}