{
    "props": {
        "pageProps": {
            "course": {
                "id": "external-import-MGT-8803",
                "creditHours": 3,
                "_rev": "iLpqNfBINCDhaBRaVHZK7r",
                "syllabusUrl": null,
                "isDeprecated": false,
                "description": "An accelerated introduction to the basics of management and the language of business. The course provides a framework that will enhance a person's effectiveness in the business world.",
                "_updatedAt": "2022-08-24T17:43:17Z",
                "slug": "special-topics-business-fundamentals-for-analytics",
                "_id": "external-import-MGT-8803",
                "reviews": [
                    {
                        "semester": {
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z"
                        },
                        "body": "Other than finance, you this course won't take much of your time. Nothing special, but doesn't need to be. It's a quick brushing up on key business concepts. It doesn't expect too much of you.",
                        "_updatedAt": "2024-10-15T14:28:15Z",
                        "_rev": "03T6dzzu6unkAUnqVD2r7f",
                        "id": "03T6dzzu6unkAUnqVD2rCA",
                        "workload": 5,
                        "_type": "review",
                        "rating": 3,
                        "authorId": "in7QWdkivZGueVqo2uBLrw==",
                        "_id": "03T6dzzu6unkAUnqVD2rCA",
                        "created": "2024-10-15T14:28:15Z",
                        "course": null,
                        "difficulty": 1,
                        "_createdAt": "2024-10-15T14:28:15Z"
                    },
                    {
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "f50633a0-0caf-44de-a999-817ca41d76f4",
                            "_updatedAt": "2024-07-23T22:42:48Z",
                            "startDate": "2024-05-19",
                            "_createdAt": "2024-05-09T04:46:16Z",
                            "_rev": "W0COWgSkHirTIh5E8dL4ME"
                        },
                        "id": "0zwV6JWkoiMq9vnKydVgoR",
                        "rating": 4,
                        "_updatedAt": "2024-08-10T18:28:46Z",
                        "difficulty": 3,
                        "_createdAt": "2024-08-10T18:28:46Z",
                        "_id": "0zwV6JWkoiMq9vnKydVgoR",
                        "_type": "review",
                        "_rev": "0zwV6JWkoiMq9vnKydVgkO",
                        "workload": 10,
                        "authorId": "cRXz1sFin0M1pGkQUS9Ykg==",
                        "course": null,
                        "body": "I really didn't think this course was nearly as bad as people say it is (besides the marketing section), although I do question how necessary this class is for the program as a whole. Definitely don't feel like we need two MGT courses.\n\nTLDR: Accounting is great, finance is the hardest, marketing is terrible, and supply chain is well taught and not too hard conceptually but the exam questions can get tricky. Having an exam every few weeks can get exhausting, but doing the supplemental questions is a must to prepare for the kinds of questions you'll see on the tests, and TAs are helpful if there's anything you don't understand. I also felt the bonus points on the exams make getting an A reasonably doable.\n\nThe course starts off great as the new professor for accounting, Ryan Blunck, is fantastic. His lecture videos are great and as long as you study the notes from his recorded and office hour videos, you'll be golden for the test. This was the only module where they revealed the class performance and it was overall pretty high. I'm not sure how this module was before he taught it but I would rate this class a 5 if they were all taught by him!\n\nThen there's finance. I thought this section was reasonably well taught but the material was definitely more difficult. The volume of material started to feel a little high by the end and the complexity level of some of the calculation questions are rough. Going to his office hours and going through every kind of practice question covered both in the videos and in the supplemental questions is a must to do well on the test. Once you understand how to answer these questions, I found the exam doable but these questions can definitely get hard, depending on your math and finance background. Go to the TA office hours if you're struggling as the TA for this section, Michael B, was super helpful. You may have to put in a lot of effort to succeed in this section, but I still found I learned a lot.\n\nNext is marketing and I would easily rate this class a 1 if every section was like this one. Yes, it's the easiest conceptually and there's no calculations, but the lecture videos are long and just complete information dumps, throwing definition after definition and concept after concept at you. I found studying for this exam brutal as there was an insane amount of information to memorize. Doing well on this section depends on how easily you can memorize information, and how much time you want to spend memorizing it, only to then forget most of it once you take the exam. I also found the live office hours useless but you still need to go/watch in order to answer a couple exam questions. This section was such a shame as I otherwise really enjoyed the course. I also found the homework difficult to get full points on despite having 10 attempts at the simulation as there's very little guidance. \n\nLastly, there was supply chain. Bob Myers lecture videos are great and keep you engaged. The concepts covered are pretty straightforward and I didn't find there to be too much information. The calculation problems he covers in his recorded videos aren't bad, but the ones in his live videos get a little more tricky. And then some of the supplemental questions are even more difficult. Go to the TA office hours or ask in ED if any of them are tripping you up. Once you understand every kind of question they may throw your way, the exam isn't bad, but they do get tricky. I also found the homework on this module easier to do well on despite only having 3 attempts. My main gripe with this section is the material is already covered in MGT 6203 so it definitely doesn't need to be covered twice. \n\nSince this was summer I can't speak to business strategy, but overall if it wasn't for marketing I would say this is a good course that is possible to do well in as long as you prepare for the exams by going through and understanding every practice question provided, and capitalize on the bonus points. I also recommend taking this in the summer since they remove a module instead of condensing the material, and you only have 4 exams instead of 5.",
                        "created": "2024-08-10T18:28:46Z"
                    },
                    {
                        "difficulty": 2,
                        "_updatedAt": "2024-05-10T14:25:19Z",
                        "_type": "review",
                        "course": null,
                        "created": "2024-05-10T14:25:19Z",
                        "rating": 1,
                        "_id": "Wjp792UkPhmbw5TW9rqcCk",
                        "authorId": "3TEh5/WwxWnfv5M09FttRg==",
                        "_rev": "Wjp792UkPhmbw5TW9rqc5M",
                        "body": "This course is as bad as everyone says it is - Georgia Tech should really remove this course as a graduation requirement. Even MGT 6203 is better than this course. \n\nThe material is extremely surface-level and usually boils down to memorization. The exams are all multiple choice (with some math) and occasionally cover some obscure fact covered in the weekly LIVE lectures. Also, weekly lectures are supposed to be ~1.5 hrs but almost always go long - usually to 2 - 3 hrs. These live lectures are in addition to the 1 - 3 hrs of recorded lecture videos.\n\nThis course is meant to be an introduction to the Business Side of analytics, but I honestly do not see the point of it, especially if you are a \"C-Track\" student. If you ever encounter any of the topics covered in this course, you can probably learn it on-the-fly within a week in a professional setting. This course seems more fitting for a Bachelor's degree, not a Master's degree.. because Master's degrees are supposed to be focused, not general purpose.\n\nThe best thing about this course is the fact that it is not too difficult. All of the exams have extra credit, which is nice. What is NOT nice, however, is that 90% of your grade is exams. So if you are not a good exam taker, you may struggle a bit (or stress unnecessarily around exam time, which is every 3 wks). The remaining 10% of the course is linked to two simulations that you have to pay 64 USD for via Harvard Business School Publishing. The simulations were just OK, and I found them very hard to score 100% on. It is definitely possible but you are provided close to no help or guidance. ",
                        "workload": 8,
                        "_createdAt": "2024-05-10T14:25:19Z",
                        "id": "Wjp792UkPhmbw5TW9rqcCk",
                        "semester": {
                            "term": "spring",
                            "_id": "cfd8efb3-0d83-463e-bea7-c821e9841d05",
                            "_updatedAt": "2024-05-09T04:45:52Z",
                            "startDate": "2024-01-08",
                            "_createdAt": "2024-05-09T04:45:27Z",
                            "_rev": "NgmyNwM8hvgytbAbDDuWfw",
                            "_type": "semester"
                        }
                    },
                    {
                        "course": null,
                        "semester": {
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "workload": 8,
                        "_updatedAt": "2024-05-02T23:40:11Z",
                        "id": "EUg8zgPZjzAV0BcRkSjt0a",
                        "_type": "review",
                        "rating": 3,
                        "_id": "EUg8zgPZjzAV0BcRkSjt0a",
                        "authorId": "16aJIiY7g0wsPgpi6piheA==",
                        "_createdAt": "2024-05-02T23:40:11Z",
                        "difficulty": 2,
                        "_rev": "EUg8zgPZjzAV0BcRkSjszO",
                        "created": "2024-05-02T23:40:11Z",
                        "body": "I was so excited to take this class and was really let down!\nLectures: Most of the lecture content could be made shorter and more concise (especially the marketing and business strategy sections). The finance section examples were hard to follow. Marketing lectures were outdated and middle school level. Marketing analytics is huge and I would've liked to learn some techniques instead of 3 hours of \"know your customer!\".\nOffice Hours: I think office hours could be eliminated or utilized differently. Office hours were a repeat of lecture videos and they were insanely long (2-3 hours). I found it very frustrating to listen to the same 2 people interrupt and ask irrelevant questions or questions answered in lecture videos/10 seconds prior as it made the OH even longer and was disrespectful of everyone's time. I would've preferred having TAs present answering questions in the chat, a Q&A at the end of office hours, or students utilizing Ed Discussion. I would've liked to see office hours review Supplemental Questions or real world examples.\nHomework: I thought the marketing homework was basically a repeat of the other homework we did and could be eliminated.\nAdditional Resources: The best additional resources we had to purchase were the Tesla and Trader Joe cases. The professor utilized them often and connected them to material. Otherwise, I think requiring students to purchase content on top of paying tuition is unnecessary and can be a barrier for some. I wish I would've been able to purchase the content I wanted (like just buying the homeworks, instead of having to buy everything and not use it.\nTAs/Course coordinator: I was a bit disappointed by the responses I saw on Ed Discussion. I found them short and often not helpful. I feel like there was some laziness and rudeness. Michael B and Ian B seem to be the most present in Ed Discussion and I found their answers helpful. "
                    },
                    {
                        "id": "4nHiAiCDrFrMhA2bPXdPIP",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "7c19a637-676e-46c3-9576-d5113631dabb",
                            "_updatedAt": "2022-07-22T00:41:10Z",
                            "startDate": "2023-01-09",
                            "_createdAt": "2022-07-21T21:55:13Z",
                            "_rev": "3eqo578hxQNJIGFal0EORN"
                        },
                        "_id": "4nHiAiCDrFrMhA2bPXdPIP",
                        "_type": "review",
                        "created": "2024-03-28T12:26:46Z",
                        "workload": 8,
                        "authorId": "zPMpZ4qbv+TFymmd8hVL2g==",
                        "difficulty": 3,
                        "_createdAt": "2024-03-28T12:26:46Z",
                        "rating": 2,
                        "course": null,
                        "body": "I think this class should be an elective for the business track guys. A lot of memorizations to be done with great attention to details. The test questions are confusing. I ended up with a C, but I know for sure if I studied A is definitely possible (I am not saying this just to make myself feel better. I took DL, CDA, DO, etc and this is the only classes I have a C in. All the others I got A's...). Just take this class as one semester of annoyance and you will end up with an A. Have fun. ",
                        "_rev": "4nHiAiCDrFrMhA2bPXdPGx",
                        "_updatedAt": "2024-03-28T12:26:46Z"
                    },
                    {
                        "id": "jqVEww7I7cd4nQ13NJ4LBv",
                        "_type": "review",
                        "rating": 3,
                        "workload": 4,
                        "difficulty": 4,
                        "_createdAt": "2024-01-09T06:09:03Z",
                        "course": null,
                        "_id": "jqVEww7I7cd4nQ13NJ4LBv",
                        "body": "Very basic course. The lectures and video conferences cover all the material. I took it along with CDA and was strapped for time so ended up doing last minute preparations for most of the exams. I think the topics were interesting and very applicable if you're inclined to any kind of bussiness. But the structure of the exams was quite annoying and had to memorize a lot of theoretical knowledge. ",
                        "created": "2024-01-09T06:09:03Z",
                        "_updatedAt": "2024-01-09T06:09:03Z",
                        "_rev": "jqVEww7I7cd4nQ13NJ4LAN",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "authorId": "+jTAa/Y57/V1BqtRCslpQA=="
                    },
                    {
                        "course": null,
                        "_updatedAt": "2023-12-12T02:25:50Z",
                        "rating": 3,
                        "id": "hJHM1Qo6YGhDUyHpH7xEK8",
                        "created": "2023-12-12T02:25:50Z",
                        "workload": 9,
                        "_id": "hJHM1Qo6YGhDUyHpH7xEK8",
                        "body": "This was my third class (after the other 2 mandatory classes: CSE6040 and ISYE6501, where I got an A in both). I had a B in this class: I was 0.8% from getting an A, which was really frustrating because this class' content was imho the easiest of all 3 classes I have taken so far, and ironically also the class where I invested the largest number of hours.\n\nUsually when a new class starts, you just got to figure out the 'modus operandi' once, but here because the class has 5 different modules, each of them taught by different people, for each of the 5 modules you have to adapt all over again: each of the lecturers have different styles and paces. Overall, for each module every week I did the following (doing them all took me on average 10 hours / week):\n\n(A) Watch Pre-recorded videos\n(B) Self-Assignment\n(C) Readings and/or Homework\n(D) Watch Live Session\n(E) Watch TA Office Hours (first 3 modules only)\n(F) Read the questions in Ed Discussion\n\nUnfortunately I found that you have to watch BOTH the pre-recorded videos as well as the Live session or else there would be a couple of questions from the exam that you would not know how to answer.\n\nThe 5 Modules:\n\n1) Finance Accounting: Very dense module with a lot of data, but I really liked it. It was very well structured. The exam was reasonable.\n\n2) Finance: This is where things started to get frustrating for me: the content was dense, but much less organized than in Accounting. What really caught me off-guard was the Exam: it was unexpectedly hard. So far it's been my experience at OMSA that the weekly exercises, assignments and self-assessments are harder than the actual exam. Here in the Finance module it was the opposite: the exam was way harder than the class examples and exercises.\n\n3) Supply Management: My least favorite part. Super chaotic, seemingly easy content.... and one of the most wickedly -and unnecessarily- twisted and complicated exams I have experienced. \n\n4) Business Strategy + 5) Marketing: Structure could have been better, but at least the exams were nowhere as insane as the Supply Management one.\n\nOverall, I am glad this class is out of the way. I liked the Finance Accounting (very technical) and Marketing (very not technical) modules, but I found that this 3-week modules format was too rushed to go through things properly. ",
                        "_rev": "hJHM1Qo6YGhDUyHpH7xEGc",
                        "semester": {
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21",
                            "_createdAt": "2023-08-12T05:26:25Z"
                        },
                        "authorId": "AqdW0TmiDdSgsdG+xFWuYA==",
                        "difficulty": 4,
                        "_type": "review",
                        "_createdAt": "2023-12-12T02:25:50Z"
                    },
                    {
                        "_createdAt": "2023-08-03T22:15:26Z",
                        "_rev": "9ouvNeu7IEFKdlkHfapRzQ",
                        "id": "9ouvNeu7IEFKdlkHfapS4i",
                        "created": "2023-08-03T22:15:26Z",
                        "_id": "9ouvNeu7IEFKdlkHfapS4i",
                        "authorId": "plJ/Z8pFBEUWHzHf/YlAeA==",
                        "course": null,
                        "rating": 4,
                        "workload": 8,
                        "semester": {
                            "_updatedAt": "2023-07-26T19:05:14Z",
                            "startDate": "2023-05-15",
                            "_createdAt": "2023-07-26T19:05:14Z",
                            "_rev": "G2CNO6q5LhmMM5wp3Xva4U",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "c302ae44-e285-436c-943e-18184f6f6249"
                        },
                        "body": "Recently, I completed the MGT 8803 course, and it turned out to be an enlightening ride. It broadened my understanding of key business areas like Accounting, Finance, Supply Chain Management, and Marketing, subjects I had only a slight grasp on before. The wealth of knowledge I've gained is genuinely substantial.\n\nThe course structure is indeed intensive - after every module, there's an exam. While these tests helped cement the module concepts and prepared me for a multitude of scenarios, it did get a bit taxing. Balancing the rigorous workload with my other responsibilities was no small feat.\n\nA shoutout to the instructors who were fantastic throughout. Their ability to break down and explain complex concepts was top-notch, and their readiness to assist made the learning experience more accessible and engaging. However, I found that the content could have been better tied into Data Analytics. A little more focus on how these business fundamentals link to data analytics would have made the course even more relevant to my future work.\n\nThe module-ending quizzes were a godsend! They were so well-structured and did an excellent job of reinforcing the learning from the module. These quizzes were my go-to resource during exam prep - a great way to test my grasp of the material and see the concepts in practice.\n\nThe course could benefit from a bit more downtime between modules. The pace and intensity of the exams kept me on my toes, which, while not entirely a bad thing, made digesting and practicing the concepts a little stressful.\n\nTo sum up, MGT 8803 is a comprehensive, albeit demanding, course that delves deep into vital business subjects. It will require your time and effort, but the skills and knowledge you'll acquire make it worth the investment",
                        "_updatedAt": "2023-08-03T22:15:26Z",
                        "_type": "review",
                        "difficulty": 3
                    },
                    {
                        "course": null,
                        "_id": "H2M0ZebBQpDCtJDgu1cYKs",
                        "_type": "review",
                        "authorId": "fSCmQXFvyfSsoe2WxkpPJA==",
                        "difficulty": 3,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z",
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx"
                        },
                        "body": "Rest in peace, Prof. Alan Flury. He was passionate about teaching this class and treated everyone kindly. During weekly Zoom sessions, he went above and beyond to answer all student questions, even if it meant extending the scheduled hour-long meeting to two hours. He was approachable, humble, and excellent in delivering the course material.\nInitially, I planned to take this course along with ISYE 6501. However, due to my heavy workload, I had to drop it. The next time I took the class, I dedicated at least an hour every day to it. By paying attention to vocabulary and understanding the material, I was able to perform well. The course was divided into modules, and each module had five tests, each worth 20% of the total grade. The Supply Chain and Business Strategy modules had 5% homework and 15% tests. You can use what you learn in this class to invest in a company or develop supply chain models and strategies. However, there is much more to learn before feeling confident in investing. As an engineer, I would recommend that OMSA students consider making this course optional.\nFinancial Accounting: Balancing Financial Statements, Assets, Contra Assets, Short-term/Long-term Assets, Short-term/Long-term Liabilities, Equity, Contra Equity, Ratio Calcs etc.\nFinance: Introduction to Financial Management and Investment Rules, Evaluating Investment Opportunities and Stock valuation. Risk, Return, Cost of Capital and Firm Valuation\nBusiness Strategy: Intro to Strategy, Strategy Formulation, Environment Analysis\nSupply Chain Management: Introduction, Medium Term Decisions, Short Term Decisions,\nMarketing: Marketing Strategy, Opportunity Analysis, Segmentation, Positioning, Buying behavior and product development. Place development, Pricing and Promotion\n\nI pursued computational data track from omsa more reviews here: https://www.linkedin.com/pulse/georgia-tech-omsa-program-review-sid-gudiduri/",
                        "id": "H2M0ZebBQpDCtJDgu1cYKs",
                        "created": "2023-05-11T17:33:02Z",
                        "_createdAt": "2023-05-11T17:33:02Z",
                        "_rev": "H2M0ZebBQpDCtJDgu1cYIc",
                        "rating": 3,
                        "workload": 10,
                        "_updatedAt": "2023-05-11T17:33:02Z"
                    },
                    {
                        "workload": 10,
                        "id": "8TBloK0Mo9ZsPoyG21GMyS",
                        "semester": {
                            "startDate": "2022-08-22",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFOwvx",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2022-3",
                            "_updatedAt": "2022-07-22T00:41:19Z"
                        },
                        "_createdAt": "2022-12-19T01:51:48Z",
                        "body": "I was skeptical about this class due to the low ratings and my not understanding why I had to attend this class. However, this was a practical and refreshing course for a student with an engineering background. \n\nThere are five different subjects in the semester, three weeks each. For finance, you'll learn how to read financial statements and analyze companies using traditional valuation methods. I found these helpful because of my investment interest. Supply chain management was easy to learn because I thought I could use common sense, except for certain parts where you must apply simple formulae. Business strategy class was also interesting in learning guiding principles for many organizational decisions. Marketing was initially my least favorite class, but understanding its psychological part was fascinating. \n\nThere are two assignments to complete; you'll have to pay on your own to submit the results. I found it quite odd, but it was not so pricey. \n\nIt's a practical course if you have zero background in business. But opting out would be a better choice for those who have one. \n\nPs. After completing three subjects, I learned that the rating and evaluation of the subjects on OMSCentral could drastically differ based on your interest. I found this class worth taking despite such low ratings. \n",
                        "_type": "review",
                        "authorId": "TyfsPxW1kgdpM5YwU4dxqg==",
                        "course": null,
                        "_updatedAt": "2022-12-19T01:51:48Z",
                        "created": "2022-12-19T01:51:48Z",
                        "difficulty": 2,
                        "_id": "8TBloK0Mo9ZsPoyG21GMyS",
                        "_rev": "8TBloK0Mo9ZsPoyG21GMuC",
                        "rating": 4
                    },
                    {
                        "id": "fT2DAxGuAIAZVP80ZLgzv0",
                        "body": "The course was taken in Summer, so the Business Strategy section is not covered. If you take this course during Fall/Spring, this section is probably included. The main professor for the course (and the one that covers Business Strategy) passed away the first week of the Summer session (he was the best thing about this class).\n\nThe Head TA \"took over\" in his absence, and seemed over his head. His responses were rude most times, condescending others, and seemingly tired of hearing the same questions over and over. That being said, a lot of the questions students were asking were covered a thousand times, and make one wonder if they were even capable of brushing their own teeth.\n\nYour mileage may vary going forward.\n\ntl;dr\nAttend the live sessions\nWatch the async videos\nAttend the TA office hours for Accounting and Finance\nMemorize \"everything\"\n\nLong version:\nThe class is broken down into several sections, each taught by a different professor:\nFinancial Accounting\nFinance\nSupply Chain\nMarketing\nBusiness Strategy\n\nHalf of your grade in the course will come from the first two tests. These are closed book, closed note, closed internet, closed everything and rely heavily on memorization. Accounting and Finance consist of roughly half \"theory\" questions and half \"problems.\" The problems are mostly straight forward if you do the practice problems and GO TO THE OFFICE HOURS. The TA's that offer the hours for these two sessions are amazing and go through in great detail. \n\nGet used to creating the formulas in Excel. They do provide a formula sheet, so you do not have to memorize these. But seriously, do the problems several times from scratch. You're going to have to create a Balance Sheet and Income Statement. There's a great chance the Balance Sheet will not Balance on the test. They did this intentionally to make you realize it has to balance, and thus, you had to add the missing value in. My advice? Check the answers given for subsequent questions, backtrack from there, and you'll find the missing item (assuming they use the same problems, which...it sounds like they do).\n\nThere are also questions that come up saving \"What % returns such and such?\" Why bother calculating it when they give you the %s in the multiple choice? Throw those into your formula, get the answer that matches, and there you go. It's basic algebra but they don't ever explain that. Instead they want you to struggle/go through the hard way. Don't play their game. Always look at the answers first, as most times, you can just plug them into the easier formula and get the answer. There's also only four answers, so we're talking seconds to do this.\n\nFor the \"theory\" portion you'll have mostly True/False, Fill in the Blank, Statement 1/Statement 2 are True/False/Both/Neither. There isn't much you can do here but memorize. If you ask the TAs what you memorize, they'll tell you everything. I can't help you here, focus on the problems since those are methodical while making flashcards for nearly every topic covered in the videos. Both videos. The async and the live office hours.\n\nOk, that gets you through Accounting and Finance. Hopefully you're sitting rather pretty here, because unlike Professor Fury (RIP), the Head TA will not be doing you any favors. He did not curve any grades (despite Fury always curving). He did not give any feedback (despite Fury being amazing at it). He did accuse the entire class of cheating though, so hey. There is that.\n\nNext comes Supply Chain and your first \"Homework\" assignment. This is part of the ~$60 Harvard Course Pack (yes, you need this, some of the case studies are on the tests, and you need the simulations). You're given three chances to do the simulation. RECORD EVERYTHING YOU DO. Write it in Excel, on a napkin, take pictures, but every step, record it. The reason being, nothing changes in subsequent tries. Meaning, you know exactly what will happen and what happens based off what you do. The \"Board Members\" will also ask you questions about why you did such and such. If you have no clue, pick an answer. Write it down. You'll know if it's right or wrong the next time around and can adjust what you answer.\n\nTake your first attempt and make some educated guesses. See what happens. Write down the answers. Consider where/how to improve. Also consider you know the EXACT demand of the phone based off what you selected. You could possibly PRODUCE the exact number in your next run through...\n\nTake your next two shots here to do well. You're aiming for a high profit and high board votes. You should be able to get at least an 80% on this with simply tweaking what you did.\n\nNext is the Supply Chain test. It's more theory than problems, but does have some problems (far easier than the previous two sections). You should be ok here as Supply Chain is relatively straightforward, but don't take it for granted. Put the time in to memorize and go over the problems. For entertainment, you can create a game of the number of times the professor says \"right\" in the recorded and live videos.\n\nFinally (for Summer) comes Marketing. There's something extremely off-putting about the professor for this, and none of that is helped by his topic being the worst, most irrelevant, and boring covered in this class. You also have another simulation. However, they give you unlimited tries for a week or so period before resetting it, and having you submit your \"real\" run through. You have no excuse not to get an A on this using the same process as Supply Chain, except now it's unlimited tries. Run through it until you make all the perfect decisions for your choice WRITE THEM DOWN, and come the \"real\" turn in, just do that exact run through again.\n\nAs for the test? It's 100% pure memorization of garbage. There are no problems. No ways to apply the \"knowledge\". Nothing. It's 40-some questions of Marketing theory, True/False, Statement1/Statement2, etc etc etc. This is the test the Head TA and professor accused the class of cheating on due to several(?) finishing the test within 10 minutes. Honestly? You either know this crap or you don't, so 10 minutes is probably too long anyway. \n\nIf you're taking this in Fall/Spring, Business Strategy falls in there somewhere. But with Professor Fury gone, I imagine they'll tweak it to have someone else do the live videos or do away with them entirely.\n\nI highly suggest taking this class in the Summer for nothing else to be done with it so much quicker. Note, if you do, your first test OPENS the second week of class and is DUE early the third week. It's a rocket-speed pace through these topics, but once one is done, that's it. There is no cumulative final or midterm. Each module is self-contained. Once done, it's done. Take a shower and move on with your life. \n\nYou'll never use the material taught in this class. Some topics are interesting (mostly finance due to the stocks and how some aspects work), but at least half the class is worthless, with a third of it already being covered (by the same professor no less) in other required courses. The best thing I took away from this class was the knowledge that GT offers all students a free subscription to the Wall Street Journal. \n\nGood luck. May the odds be ever in your favor.\n\n\n\n\n",
                        "rating": 1,
                        "_id": "fT2DAxGuAIAZVP80ZLgzv0",
                        "_rev": "fT2DAxGuAIAZVP80ZLgzs5",
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16"
                        },
                        "authorId": "Y/Q3hmmWWMqbslITphyCOA==",
                        "_type": "review",
                        "created": "2022-09-06T22:28:41Z",
                        "_updatedAt": "2022-09-06T22:28:41Z",
                        "difficulty": 3,
                        "_createdAt": "2022-09-06T22:28:41Z",
                        "course": null
                    },
                    {
                        "created": "2022-08-08T19:20:47Z",
                        "authorId": "IcgXKn5s7yEB+vLmyFfkgw==",
                        "body": "Two hardest sections: One test each, each worth 25% of your grade.  Two easiest sections: One homework (worth 5% or 10%) and one test (worth 20% or 15%). I don't understand why there were different requirements for different sections. \n\nTests include things only covered in office hours, so make sure you watch them. In addition to the 3+ hours of lectures every week. \n\nThey stopped releasing test answers because they said people had posted the tests in their entirety online. Whack that people did that, but also whack to not just write new tests each semester. Who knows if that will continue into future semesters, but I'm not crazy about not being able to learn from mistakes I made.\n\nGot an A or B in every other course in this program, struggled to get a C in this course. Too bad this is a required course because you can't take something else in place of it. If you can waive this course, I HIGHLY recommend that you do so. ",
                        "id": "6nnaIduCkMaE6dpBP4PUCc",
                        "_createdAt": "2022-08-08T19:20:47Z",
                        "_type": "review",
                        "_rev": "6nnaIduCkMaE6dpBP4PU6A",
                        "_updatedAt": "2022-08-08T19:20:47Z",
                        "rating": 1,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFQ0gf",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2022-2",
                            "_updatedAt": "2022-07-22T00:45:42Z",
                            "startDate": "2022-05-16",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "6nnaIduCkMaE6dpBP4PUCc",
                        "workload": 7,
                        "difficulty": 3,
                        "course": null
                    },
                    {
                        "_type": "review",
                        "body": "This was one of the hardest courses I've taken in the program, but not because the content is challenging or the professors are bad. It's actually organized quite well and the content is mildly interesting. However, the sheer volume of information is overwhelming. I have met 3 types of folks in this course:  \n\n1. For folks (like me) who struggle with recall, it's a brutally hard course. \n2. For most folks with decent recall, it'll be relatively easy with a little work and carefully reading exam questions.  \n3. For those with perfect recall / photographic memory, this course will be trivially simple. \n\nThat's why you'll see such a high variance for reviews. Now to be clear, I'm not saying this is a memorization course... but... if you struggle with recalling a very large number of things you just learned and applying them in nuanced ways, you'll struggle with this course.\n\nI actually dropped the course the first time around after getting a \"D\" on the first exam, and I spoke with the professor about my challenges. His response was to really try to immerse myself in the content and really dig in. In video game parlance, he basically said 'git gud.' I took his advice to heart this last semester when I decided to suck it up, git gud, and dig into the class to try to pass it. I ended up passing with a high C, but it was not easy even to get there.\n\nAnyway, here's the course in a nutshell for someone like me:\n\nThe regular course is 15 weeks.  Every 3 weeks is a different topic, ending with an exam.  There are two simulations that are really good and I excelled at (90% and 100%), because they were fun, interesting, helpful, and applied. Then (even on simulation weeks) you have the following every week:\n\n* 70-120 hours of Videos\n* A mandatory VideoConference, that often is the only source for some exam content\n* Multiple readings that are pretty dry\n* An Ungraded Self Assessment (SA) for the Chapter.\n\nI pretty much followed the same pattern of increasing panic every 3 weeks:\n\n**Week 1 - Intro / Overview Week**: \"Okay, this is a great overview and really pretty important to know... I can do this.  I wonder how they're going to test on this stuff, because this is a really broad, common-sense overview.\"\n\n**Week 2 - Broad / Deep Dive Week**: \"Oh wow, they're really digging into the nuance and detail of each part of this and there are a LOT of slides, videos, readings, etc... I am going to have a hard time keeping up with all of this content.\"\n\n**Week 3 - Broader / Deeper Dive Week**: \"Oh bloody hell... there is no way I can fit all of this in my brain... I'll just do the best I can, I guess.\" Then I'd take the SA and study a lot. \"Okay, I finally got all the concepts on the SA and understand the nuance pretty deeply, I might be *okay* on the exam\"\n\n**Exam**: \"WTF?!  This is like a completely different set of topics from what they said was important and there's no way I could have learned all of this in the time allotted... I suppose I'll take an educated guess between two finalists on the next 10 questions.\"\n\nRinse. Repeat.\n\nAnd that happened for literally every section of this course.  I watched all of the videos, attended all of the video conferences (had to watch recordings for 2 of them for which I had conflicts), and did about 75% of the readings.  I participated in Piazza asking clarifying questions, and even made a huge deck of study notecards.  I studied for each exam for probably 9-10 hours cumulatively using SAs, note cards, notes, video transcripts / slides, and piazza.\n\nThen in every case, I got a C or a D on each exam, while the averages were in the mid- to high-80s. Personally, I think if I do all the work assigned to me, pay attention, try to internalize the knowledge, study, commit, work hard, and I STILL get a crappy grade, the problem is not me -- it's a problem with the course design.  I think the course is so obsessed with weeding out cheaters that it really hurts people that don't have a photographic memory or at least very reliable recall. Now before you go saying that I didn't 'pay attention' to the content (like the reviewer below), I'm actually doing quite well in the program and this is one of my last courses before I graduate. It was one of the easiest, content-wise, and one of the hardest, structure-wise. Hopefully this review helps you prepare and get through this slog.  Good luck!",
                        "_createdAt": "2022-05-09T04:00:02Z",
                        "created": "2022-05-09T04:00:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-24ef0d9f-c57e-4102-8b37-5383e9867be5",
                        "difficulty": 5,
                        "rating": 1,
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-24ef0d9f-c57e-4102-8b37-5383e9867be5",
                        "workload": 15
                    },
                    {
                        "body": "I saw some bad reviews for this course and was surprised to see that. That review was mostly due to total negligence of course materials and weekly videos in my opinion. \n\nI came from a physics background and everything was new to me. I had zero background in finance. Every term was A, B, C, and D to me.  I learned a lot at the end.\n\nIt covers 5 modules.\n1) Module 1: Accounting \n\n       Week 1: Introduction to Financial Accounting\n\n       Week 2: Assets, Liabilities, and Owners Equity\n\n       Week 3: Ratio and Financial Statement Analysis\n\n       Just learn basic accounting terms and learn how to make an income statement. \n        Focus on weekly videos. spend 12 hrs per week.\n\n2) Module 2. Finance\n\n       Week 4: Introduction to Financial Management and Investment Rules\n\n       Week 5: Evaluating Investment Opportunities and Stock Valuation\n\n       Week 6: Risk, Return, Cost of Capital, and Firm Valuation\n\n       covers company evaluation. Focus on problems of weekly videos. \n       Spend about 20 hrs per week. covers 75% math and 25% theory.\n\n3) Module 3 Business Strategy\n\n       Week 7: Introduction to Business Strategy\n\n       Week 8 Environmental Analysis\n\n       Week 9: Strategy Formulation\n\n       No math here. spend 10hrs/week. It's not so hard.\n\n4) Module 4: supply chain\n\n       Week 10: Introduction to Supply Chain Management and Long-Term Decisions\n\n       Week 11: Medium Term Decisions\n\n       Week 12: Short Term Decisions\n\n       spend 10hrs/week\n       careful on this session. Looks easy but mathematical problems are a bit tricky. \n\n5) Module 5: Marketing \n\n        Week 13: Marketing Strategy, Opportunity Analysis, and Segmentation\n\n        Week 14: Positioning, Buying Behaviors, and Product Development\n\n        Week 15: Place Development, Pricing, and Promotion\n\n        Focus quizzes and examples are stated in weekly videos. spend 10hrs/week\n\n\nThe course covers a lot and learned a lot. I can now understand how to read an income statement and how to make it. How the cash flow works, how to evaluate companies using NPV, IRR, etc. I became familiar with horizontal integration, vertical integration, etc. can be applied in different situations. I also experienced simulation in supply chain and Marketing.\n\nBeing a math background I performed high performance in  Finance and accounting. The beauty of this course is that I feel it is like an in-person class. this class was different because a new concept was introduced in the weekday session. I want to thank all professors and special thanks to Professor Flurry for making this course so engaging and interesting. Even though in his hard time, he was so caring towards students and feel like a guardian. I regularly spend 2hrs watching videos and the accounting/finance section spends a bit more time in excel.\n\nThe only concern is that in the simulation of supply I didn't get enough chance to practice before the exam. It's just 3 times and only got 75%, in opposition of that in Marketing I got multiple chances to practice and got 100%. In almost all sections I got 100 % and above in finance and accounting. I believe it would be better to give multiple chances of practice before exams as well so that we really learn something. Time was given after submitting work but it couldn't attract me. Loved this course so much.\n\nTips:\nI printed all the slides, and quizzes before each module and went through the videos. The beauty of this course is to focus on every quiz by heart and watch weekly videos twice (strictly). It's not hard to get an A. Most problems are from weekly quizzes or weekly videos. The course is so organized and has a mixed flavor of five professors. Professor flurry makes a few adjustments on the go.\n\nMy grades are accounting(101/106), (finance 107/113), Business strategy (100/104), supply chain (93/106), supply chain simulation(7.5/10), Marketing(98/106), and marketing simulation (10/10). I really enjoyed the course and learned a lot.\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7"
                        },
                        "_id": "external-import-94826e2e-3f6c-4ff7-b993-b59b29ae3891",
                        "id": "external-import-94826e2e-3f6c-4ff7-b993-b59b29ae3891",
                        "_type": "review",
                        "workload": 10,
                        "_createdAt": "2022-05-01T20:33:21Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "created": "2022-05-01T20:33:21Z",
                        "difficulty": 3,
                        "rating": 5
                    },
                    {
                        "_type": "review",
                        "id": "external-import-0b89ddb1-a167-47ad-9da1-715b2692adac",
                        "created": "2022-04-17T22:50:35Z",
                        "workload": 6,
                        "_createdAt": "2022-04-17T22:50:35Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10"
                        },
                        "rating": 1,
                        "difficulty": 3,
                        "_id": "external-import-0b89ddb1-a167-47ad-9da1-715b2692adac",
                        "body": "This has been my least favorite class in the entire program and I am almost done with the program.",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "workload": 5,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2022-04-06T22:20:38Z",
                        "_type": "review",
                        "course": null,
                        "created": "2022-04-06T22:20:38Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 4,
                        "_id": "external-import-a9dda8aa-fbb5-4801-985d-7026a39547e1",
                        "body": "I don't think this class is as bad as many people would lead you to believe. The tests can be brutal trying to cram all the material into your head beforehand and the lectures/conferences are quite long, but I think the material itself is good. The class follows a consistent schedule of three weeks of material followed by an exam. In total there are five exams, none of them cumulative. While I am not a fan of the delivery of the course, I did feel like I learned a lot. If you give yourself plenty of time in advance to study for each exam, this class should be an easy A (also check out Quizlet for some really good flashcards for each exam). In my opinion, no matter your career goals after the program, knowing the concepts taught in this class will only add value to you as an employee and this class provides a nice bridge between the worlds of data science/analytics and business.",
                        "id": "external-import-a9dda8aa-fbb5-4801-985d-7026a39547e1",
                        "difficulty": 2,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "body": "Easily the worst course in OMSA. Some tips to get through:\n\n1) Attend office hours (weekly conference). This is the only course I've taken at OMSA where the asynchronous videos they post don't contain all the necessary information. They introduce new topics that you will be quizzed about in the office hours and will not make that clear unless you watch/attend them.\n\n2) You can ignore the business cases for the most part as they will have little to no bearing on the midterms which is where you will be questioned on your knowledge.\n\n3) The weekly quizzes are all out of order - you will often be quizzed on week 1 about material you won't learn until week 3. This is just the professors being disorganized - don't let it get to you. My advice here is to not do the quizzes until you're prepping for the midterm.\n\n4) For the business strategy module only the office hour slides are important. You can basically skip watching the async videos for the whole module & just study the slides. Watch the conference calls if you can fight off falling asleep. This can apply to other modules too but moreso the business strategy one.\n\nThis course is not hard nor does it require a significant amount of time. Overall I just found taking the course frustrating and generally resented the lack of depth and frantic context-switching. The only real redeeming qualities of this course are that it's non-cumulative (once you're done a module you'll never get quizzed on it again), and it does genuinely feel like the professors are trying. It's just a poorly designed and executed course.\n\nI think GT needs to take a step back and ask why two MGT classes are necessary (both studying supply chain using the exact same slides? Why am I learning this twice from the same professor in two different mandatory courses?). I would hazard a guess to say that MGT classes are not why the majority of us are attending an analytics masters (why not just take an MBA?). It just feels out of place.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 8,
                        "_createdAt": "2022-03-31T02:56:33Z",
                        "id": "external-import-9905dae3-06eb-4486-880d-8c74b504e1da",
                        "created": "2022-03-31T02:56:33Z",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2022-1",
                            "_updatedAt": "2022-07-22T00:45:51Z",
                            "startDate": "2022-01-10",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0GON7"
                        },
                        "rating": 1,
                        "_id": "external-import-9905dae3-06eb-4486-880d-8c74b504e1da"
                    },
                    {
                        "body": "1.) If you can opt out of this class you should.\n2.) If you cannot opt out but have a CFA or CPA or other such non-academic credentials you'll do fine. You'll say how easy it is because, honestly, you already know the material. This review is not for you.\n3.) If you learn easily by hearing material and enjoy interacting with a professor during office hours, again, you'll most likely do fine.\n4.) Ok, so you have to take this class and aren't a financial whiz. You need to make the most of it and continue reading.\n\nScheduling:\n\n i.) Take it as one of your last courses in case there is a remote chance it gets better\nii.) Take it during the summer so you have one less module and 4 fewer required video conferences (1.5 - 2.5 hours each) to review\n\nThis is my 7th class in the program and the one I disliked the most. \n\nIt was a strange blend of professors being active on Piazza and on Video meetings yet exams and homework not lining up with what was presented. Attention to supporting a student learning the material was mixed and sometimes a mixture of passive-aggressive or gaslighting responses. For example, many of the practice problems did not have published results and refused to be answered on Piazza with vague comments such as \"to be reviewed later\" (not always) or check your presentation material ... (ok now what? I still don't get it). I don't understand why the solutions weren't published for all the self assessments.\n\nThe lack of instructor support for ease of learning to prepare for the exam and homework material, combined for an optimal annoyance of a required class. (Gradient Descent Global Annoyance Optimal FOUND)\n\nWe have TWO required OMSA MGT classes. Really? These should be freed up as floating electives, or reserved as required business track courses or CREATE A CLASS THAT is enjoyable!\n\nThe pre-recorded videos are not sufficient to complete the self assessments, homework nor exams. The videos create a foundation but what is tested is way more advanced and only covered in the weekly office hours videos on a case by case example. As a result I found myself memorizing seemingly random rules without additional context to pass the exams. Not exactly the skill set I was hoping to hone getting an advanced analytics degree.\n\nIn addition, as others mentioned, it crams too much material into one semester with different professors and corresponding teaching styles. Once I thought I got the hang of what is going on - bam - a new professor with his (always a he BTW) own rapid teaching style starts a new subject.\n\nYou will need to memorize dozens of equations and even more definitions and be able to accurately type in exam materials to MS Excel as the proctored exams do not allow copy and paste for analysis. Again, not a skill I wanted to go to graduate school to refine.\n\nI don't have a business background and struggled with the first two modules, accounting and finance. Supply Chain was much better for me but was disappointed in the exam which was confusing and seemingly arbitrary with what it covered. I felt prepared for the exam only to be asked disorganized question on tangential material <<sigh>>. I felt more than a little tricked by my comfort with the weekly conference and self assessments. The first two modules, accounting and finance, are hard core business classes. It has very dated economic theory and approaches to business. All in all not very inspiring.\n\nIt's the sheer volume of work that is overwhelming. Nothing technically difficult, just a huge amount to memorize and process. It would have been great to have a reasonable amount of material ahead of time and have the professors review that instead of adding complexity at each weekly live video. Again to support learning and retaining the material for us non-auditory learners, please, please provide a pdf of the important points. Just a simple suggestion. Whatever. I'm over it and thought that I would share my experience. I honestly hope your experience is better.",
                        "difficulty": 3,
                        "_createdAt": "2021-12-20T01:42:42Z",
                        "_type": "review",
                        "workload": 15,
                        "rating": 1,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-2af2f172-51f9-428e-9f26-0d9a5b855c34",
                        "created": "2021-12-20T01:42:42Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_id": "external-import-2af2f172-51f9-428e-9f26-0d9a5b855c34"
                    },
                    {
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "workload": 10,
                        "body": "I came into this course with some background on the material as I took finance and accounting courses in undergrad. I thought these professors did a better job than undergraduate and I got a lot more out of it.\n\nLot of memorization, which is annoying, but I was able to cram for the tests most likely due to background knowledge.\n\nI rate this course so highly because of the in-person interaction with the professors and the effort put to keep hands-on with the students. Professor Flurry really cares about how well we do, and the knowledge checks are sufficient in preparing you for the finals (unlike OTHER classes, looking at you ISYE 6501).\n\nIn addition Prof Flurry frequently extended deadlines and added time for tedious copying to excel during exams - highly appreciated!\n\nIn short, I don't care if I need to work hard if I am provided the material and opportunity to do well, and the professor actually teaches and treats students with respect, which this class and prof flurry absolutely excel at.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "id": "external-import-20322023-b338-440b-9e54-d467338455af",
                        "created": "2021-11-17T17:46:21Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_id": "external-import-20322023-b338-440b-9e54-d467338455af",
                        "_createdAt": "2021-11-17T17:46:21Z",
                        "_updatedAt": "2022-07-11T19:08:20Z"
                    },
                    {
                        "_createdAt": "2021-11-13T19:23:52Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "rating": 1,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review",
                        "course": null,
                        "id": "external-import-9f36911e-59cd-4bdb-87a5-6675ce165269",
                        "created": "2021-11-13T19:23:52Z",
                        "difficulty": 4,
                        "workload": 16,
                        "_id": "external-import-9f36911e-59cd-4bdb-87a5-6675ce165269",
                        "body": "Studying for the Business Strategy exam and just wanted to leave a review to document how much I absolutely hate this class. They really try to cram so much unnecessary information into this course. No actual learning involved. For 3 weeks, I watch the videos, study the slides, even having to read the video transcripts, and then take an exam that is purposefully trying to trick us, regardless of how hard you studied. As someone with 0 business background and 0 intention of doing any business-related work roles, I absolutely cannot stand this course. I'm taking this as well as ISYE 6740, which subjectively speaking should be way harder yet every week, I have to put more time into this course. I also work full-time (40 hrs/week) because I can't afford not to, and just finding the time to cram all of this information in is absolutely ridiculous. Praying to God that GT will remove this as a course requirement. "
                    },
                    {
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23"
                        },
                        "_type": "review",
                        "course": null,
                        "workload": 10,
                        "id": "external-import-ed5831e2-7a5c-415a-a385-5a70483c9268",
                        "difficulty": 3,
                        "_createdAt": "2021-10-23T08:12:36Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-ed5831e2-7a5c-415a-a385-5a70483c9268",
                        "created": "2021-10-23T08:12:36Z",
                        "rating": 1,
                        "body": "tl;dr version: This course has been a complete waste of my time and money.\n\nThere's an assumption built into the design of this program overall that we will all work in industry upon graduation, and between this course and MGT 6203. this assumption consumes a full 20% of our courses, not counting the practicum. If you're not, though, that means 20% of your investment is wasted on information you're not going to use and will probably core dump as soon as you've completed the course. Essentially, program inflexibility markedly reduces the value of the program to non-industry professionals; GT should trust that students in a professional education master's understand their own career paths well enough to know if they need this course and thus make it elective, not required.\n\nIt would be less annoying if this course and MGT 6203 weren't mostly redundant with one another, but they are, unfortunately. Either one alone would serve the purpose of business familiarization, and MGT 6203 has more useful exercises for an analytics student.\n\nOn top of that, I think this course is too ambitious for what it's meant to be. They're trying to cram an MBA into one semester, and I don't think it works in its current format. My wife is a CPA, and when I was working through the financial accounting material, she told me that they were asking us CPA exam questions and she didn't understand why they would put them into a survey course. That's about the feeling you get for a lot of this course, really. You are working hard to retain something complex that you don't really care about just long enough to get through the exam and that's about it.\n\nI would much rather have spent this semester on something useful that I cared about, but I just want to graduate at this point, so"
                    },
                    {
                        "_type": "review",
                        "body": "I personally liked this course. I have no background in business courses. My undergraduate degree was in statistics. I learned a lot, and it gave a good basis of the fundamentals.\n\nI think the bad reviews come from people who expected this course to be either an easy A or low maintenance. This course covers business essentials and foundations. It is definitely A LOT of information and time consuming. If you keep up, you will be fine.\n\nWith that said, not sure it was a smart idea taking it in the summer, but it worked for me since I was interested in the topics.\n\nTips on succeeding:\n1. Make sure you are up to date on weekly video lessons and weekly self assignments (ungraded). The self assignments were helpful in testing your knowledge. Like I mentioned before, this course is a lot of info!!! Cramming does not work.\n\n2. Attend office hours. Every week, the professor for that module will host an office hour call along with Dr. Flury. Ask questions in the chat! Immediate response was nice. \n\nCons:\n1. Weekly video lessons are long. Ranging anywhere from 50- 130 minutes long. I cannot stand slow talking and monotone voice, so I sped the video up to 1.5x speed sometimes even 2x.\n\n\nOverall, I liked it. Depends on your attitude about the materials and your end goal from taking this course. Good luck!",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_createdAt": "2021-08-03T21:29:10Z",
                        "workload": 5,
                        "rating": 4,
                        "course": null,
                        "_id": "external-import-b22df1bb-3efa-4d2c-bf66-19e62c67485d",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester"
                        },
                        "id": "external-import-b22df1bb-3efa-4d2c-bf66-19e62c67485d",
                        "created": "2021-08-03T21:29:10Z"
                    },
                    {
                        "_createdAt": "2021-08-03T16:05:14Z",
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "_id": "external-import-68e3bb35-0ebb-4b9e-9b95-1803ba5c7499",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 4,
                        "_type": "review",
                        "id": "external-import-68e3bb35-0ebb-4b9e-9b95-1803ba5c7499",
                        "created": "2021-08-03T16:05:14Z",
                        "workload": 12,
                        "body": "There are so many things wrong with this course.But first I want to start with an environment explanation of this course and the good things.\n\nStudents background: One group of students have previous finance/accounting education and find this class useless, the other one has absolutely no prior education on these topics, where every word needs to be learned what it means under finance/accounting angle (I belong to the second group, finding this course very hard).  As such, professor (Flury) is already set up on such \"can't please them both\" situation to start with. \n\nGood: \n1. Flury does a great job being responsive (to be appreciated especially when thinking how insultingly underpaid he is). Also coordinating with other professors is done pretty smoothly. TAs are good too.\n2. Having more exams now, having an exam for each subject. \n3. One of the tests may go open books even though the problems may be a bit harder. I find this very positive. The whole purpose of the school is to make students reach the solutions by thinking and being creative rather than having muscle memory habits.\n4. The subject is overall explained well.\n5. Curving is reasonable and each test gives you 6% extra credit opportunity\n\nBad: \n1. Rushed with a positive accelerating towards the end which creates a false workload perception during the first & second week just to be bombarded on the 3rd. This made me forgot the 1st and the 2nd-week exercises and I had to drop this course once for wanting to get an A\n2.  Except the last topic, all the SA exercises are not good enough to get an A, unless one has previous exposure to such subjects\n3. Believe it not 2-3 questions may not even be explained during the course. For students  who have prior exposures may look \"obvious\" but for the other group is \"what the heck is this?\"\n4. A good percentage of questions asked, prof. Flury answers back with riddles. Not helping. Also, even when he sends our Excel sheets formulas are not there. SMH.\n5. No copy paste allowed in Exam. It's ridiculous. Not only I missed 5-10 points in 2 exams due to the typos, but the time I spent resolving them, affected the answers of the rest.\n6. Jayaraman writing examples and explanations is for NSL. It's mind-boggling.\n\nI feel bad for Flury working so hard, yet there are a few easy things he can do to make this course great. All he has to do is to watch how the prof. Sokol or  Vuduk do the videos and approach the problems.\n\nOverall it's OK course, but a must.\n",
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "id": "external-import-af7698ac-a2c4-4ac9-bdf3-b56de3ab6e69",
                        "rating": 1,
                        "course": null,
                        "body": "Is there something stronger then strongly disliked l? Something more like this course is waste of money and time. Look your going to see someone inevitably saying data scientist's need to understand the underlying money that their managers care about. Honestly, that may be true but this course is a waste to learn anything about business.\n\n It's a rushed mishandled abortion of a 4 course MBA taught by a disinterested group of professors who should have retired a decade ago. Slides are wrong, misspelled, outdated, or just plain confusing. The subject matter needs to be updated. The details need to be better outlined in the syllabus and office hours should truly be supplements not necessities.\n\nI'd have more but this course was enough of an energy waste. It's bad avoid if you can.",
                        "_createdAt": "2021-08-03T02:12:23Z",
                        "_id": "external-import-af7698ac-a2c4-4ac9-bdf3-b56de3ab6e69",
                        "_type": "review",
                        "created": "2021-08-03T02:12:23Z",
                        "workload": 12,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXf4",
                        "difficulty": 4
                    },
                    {
                        "id": "external-import-ad0a6087-7d48-4b13-b0ea-2f4dd280a9e6",
                        "_id": "external-import-ad0a6087-7d48-4b13-b0ea-2f4dd280a9e6",
                        "difficulty": 2,
                        "_createdAt": "2021-07-19T22:47:02Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 4,
                        "course": null,
                        "created": "2021-07-19T22:47:02Z",
                        "workload": 9,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "body": "I think this class gets a lot of bad press because lots of people taking it either don't have a business background or don't care about business. I fall into both categories, however, I didn't mind the class. Contrary to popular sentiment, I also think the class is well made. As a quantitative person, I liked the finance module the best, followed by accounting, although I have no desire to ever work professionally in either of these fields.\n\nWork-wise, this class is reasonable. It definitely feels like a crash course, but I'd rather this than have to take individual classes on each of the modules. Having 4 midterms in a summer is brutal, but the amount of material on each is not overwhelming and the exams were mostly fair (I had some issues with the supply chain one). I'm not 100% sure of the rational to keep them closed book - I would benefit much more from a beautiful set of well-organized notes that I could refer to again, as opposed to cramming for exams and then forgetting everything immediately after. The simulations are pretty fun, too.\n\nI think all the professors did a good job bringing their expertise to their respective modules. Prof. Flury is a standout, and I'm sad we didn't get to take his module in the summer class, as it's the one I was most interested in (we can complete independently). He is excellent at addressing common student misconceptions, one of the better communicators when it comes to making sure we knew dates, expectations, etc. and very engaged on Piazza.\n\nOverall, while I have very little interest in business, I thought this class was helpful in learning some basics that I can apply in personal finance.",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_type": "review"
                    },
                    {
                        "id": "external-import-bad3f752-119e-4e40-b961-83c05a4c9c0b",
                        "difficulty": 3,
                        "_type": "review",
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-bad3f752-119e-4e40-b961-83c05a4c9c0b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "created": "2021-07-14T04:05:57Z",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester"
                        },
                        "body": " I maybe a minority here, but I have liked this course. I did not have business background to begin with.I am not sure how much of what I am learning will have any relevance to any analytical work but the course by itself is not bad. It does a good job of introducing the various modules :accounting, finance, supply chain and marketing. ( no strategy for summer). Prof Flurry was nice enough to have the accounting module take home test too. It is one of the very few courses that does live teaching ( not just office hours). It is important to listen and assimilate what is being said in the videos and weekly video conferences. A lot of questions in the exams come from that. Some of these things are not written in the slides. The problems are basic 10th standard arithmetics. Overall a good course by itself. Just not sure about its relevance to OMSA. ",
                        "_createdAt": "2021-07-14T04:05:57Z",
                        "rating": 4
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "created": "2021-07-14T03:31:20Z",
                        "body": "I may update this further after the last exam, but I have to agree with some of the other reviews. This course is disappointing, discombobulated, and should not be core course for the degree. It feels like a wasted class, and I'd much prefer to have had another stats class. Knowing some of the finance and accounting stuff in the first 2 units may have some practical use for me at some point. But with the way the course is designed, it really encourages memorizing for the exam, and then dumping that memory for the next unit.",
                        "_createdAt": "2021-07-14T03:31:20Z",
                        "workload": 15,
                        "rating": 1,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "difficulty": 4,
                        "id": "external-import-03ca097f-ed94-4ded-80a8-cbf474b1964e",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-03ca097f-ed94-4ded-80a8-cbf474b1964e",
                        "_type": "review"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 1,
                        "id": "external-import-80dc543c-476f-4aa9-9e0f-5fd1a2209272",
                        "created": "2021-07-10T00:11:43Z",
                        "_type": "review",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFQTVJ",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2021-2",
                            "_updatedAt": "2022-07-22T00:46:09Z",
                            "startDate": "2021-05-17"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_createdAt": "2021-07-10T00:11:43Z",
                        "rating": 1,
                        "workload": 5,
                        "_id": "external-import-80dc543c-476f-4aa9-9e0f-5fd1a2209272",
                        "body": "This class has been a huge waste of my time and money.\n\nI disagree with the premise of this course, which assumes there are two kinds of students out there - those with complete business backgrounds and those that are complete business newbies - and that everyone needs some surface level exposure to all of these topics.\n\nIn my opinion, there should be separate accounting/finance, supply chain, and marketing classes, and students should be allowed to take whichever they are interested in (or none and have to option to do a different elective). There is no point in forcing material on people for whom it will never be useful.\n\nFor those with no accounting/finance knowledge I do think the material is relatively well taught (although it's a lot to digest in just a few weeks). I have some experience in accounting/finance and didn't learn anything new from these modules.\n\nThe supply chain professor is enthusiastic, but I found the module a little bit all over the place, and thought test was poorly written (I still got an A, so this isn't sour grapes).\n\nThe market module has significant room for improvement - it could be much more concise and better organized. This is a direct quote from a marketing lecture: \"Marketing strategy and marketing strategy planning means finding opportunities in developing profitable marketing strategies that the company can use to capitalize on the opportunities they provide.\" I also found the marketing prof off putting and felt significantly less interested in marketing by the end of the module.\n\nThere have been things taught that were flat out wrong - when one was brought up on Slack, a student from a prior semester pointed out that they'd had the same conversation in Piazza the previous semester and that he was disappointed nothing was done to correct the error.\n\nThere have also been errors / regraded questions on each of the first three exams: everything from the correct answer not even being included as an option to questions that are very ambiguously written leading to multiple answers being accepted.\n\nProf Flury is very engaged in running the class (he is active on Piazza and holds weekly office hours which are required because some material is only presented in office hours). He makes an effort and should get credit for that. But he needs to clean up the sloppiness on exams.\n\nI found the class to be fairly easy and not require very much time beyond that spent watching lectures and weekly office hour calls and limited exam prep."
                    },
                    {
                        "difficulty": 2,
                        "_createdAt": "2021-05-30T19:53:50Z",
                        "_type": "review",
                        "rating": 1,
                        "created": "2021-05-30T19:53:50Z",
                        "_id": "external-import-6d60cbc3-bb11-4357-a802-5c64d1dadd6f",
                        "body": "I have taken 6 courses in this program and so far this is the least favorite course for me.\n\nThe topics are not hard, but this is a 'hard to get A' course for me. Many people said they did bad in the first 2 exams (accounting and finance), I'm the opposite, I was fine in the first 2 which has more calculation, but not so good on the later 3 which are more memory and words. This course won't be as easy as you thought if you don't have strong business background and very good English (to memory all the materials).\n\nOverall, I agree with others, this course has too many 'unrelated' sections. 5 professors with 5 different teaching styles. The things I dislike the most are 1. there is no textbook to reference (believe me, sometime you would prefer to read a textbook than watching videos) 2. too much added materials in office hour (these things were not covered in lecture videos and are extra topics that's been taught live during office hours. Even though OH are recorded, but professors are not seem well prepared for some of the topics. I got lost all the time, due to missing slides on PPT and/or wrong numbers on PPT, etc. And those new topics are very important, they are all in the exam! )  \n\nOut of the 5 sections, I like accounting part the most because there are little new topics for this section, and professor's logic is clear. I like finance the least (yes, I did fine in the exam but I don't like the section at all), I wish there were a textbook that I can refer to hundreds of times while studying this section. Professor is not clear at all which does not help with studying... I like the supply chain section a lot, least boring in all 5. I thought I got it all, but due to the new topics and missing slides in the PPT, I didn't do well in the exam. I was also taking MGT 6203 the same semester, later on I found that he covered the exact same topic in 6203. The topics took 5 weeks in 6203, and only 3 weeks in 8803. And that's how I found there are missing slides in 8803 OH ppt document. \n\nDr. Flury is very responsible. But I believe this course need a lot of improvement. I do suggest to re-record some videos and include those necessary topics. And I also doubt if it's a good idea to squeeze so much information into this short amount of time.",
                        "workload": 8,
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "id": "external-import-6d60cbc3-bb11-4357-a802-5c64d1dadd6f",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null
                    },
                    {
                        "id": "external-import-47af7d44-2820-4eb5-8b75-1ba2e648f11b",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_createdAt": "2021-05-05T21:19:48Z",
                        "body": "Caveat before reading this course: I have withdrawn from it before in my first semester and retook it as my 8th course of the program. \n\n\nI'm not a big fan of this class for the OMSA program, especially for those pursuing the Computational or Analytics tracks. I withdrew from it previously because I tried to pair it with a class with high workload and I honestly wasn't very interested in the material. Having taken it again...\n\n\nI confirm that this class is not related to analytics (MAYBE the marketing section is very loosely) but you get a breath of business-related knowledge that could be helpful in the future. But that's the problem: this class is five intro business courses mixed into one semester!\n\nThere are five modules: Accounting, Finance, Marketing, Supply Chain, and Business Strategy. Material is crammed into each and each corresponds to an exam. And the accounting and finance module especially have a very large workload for little payoff in my view...\n\nProfessor Flury is very involved and he does care about student engagement and learning. But again, my main problem is that this course is 5 subjects fit into one and the 5 subjects do not relate to my masters' degree track. We are not doing an MBA.\n",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 3,
                        "_type": "review",
                        "created": "2021-05-05T21:19:48Z",
                        "rating": 1,
                        "course": null,
                        "workload": 10,
                        "_id": "external-import-47af7d44-2820-4eb5-8b75-1ba2e648f11b",
                        "semester": {
                            "_id": "external-import-2021-1",
                            "_updatedAt": "2022-07-22T00:46:19Z",
                            "startDate": "2021-01-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HBkw",
                            "_type": "semester",
                            "term": "spring"
                        }
                    },
                    {
                        "id": "external-import-1d3c270b-5ed9-47a5-92ab-11e06efcf51c",
                        "created": "2021-04-25T20:39:58Z",
                        "_createdAt": "2021-04-25T20:39:58Z",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_id": "external-import-1d3c270b-5ed9-47a5-92ab-11e06efcf51c",
                        "workload": 6,
                        "difficulty": 3,
                        "_type": "review",
                        "rating": 5,
                        "course": null,
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "body": "Contrary to popular opinion I thought this course was great. It's a business fundamentals course and it delivered on that really well. \nIf you have an undergrad in business, skip it.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W"
                    },
                    {
                        "_createdAt": "2021-03-02T22:50:45Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_id": "external-import-e1733012-e3c3-407c-ab37-21490664c87b",
                        "body": "Cleared due to OMSCentral Owner being greedy.",
                        "created": "2021-03-02T22:50:45Z",
                        "rating": 1,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2021-3",
                            "_updatedAt": "2022-07-22T00:46:01Z",
                            "startDate": "2021-08-23",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0Gdwt"
                        },
                        "difficulty": 3,
                        "_type": "review",
                        "id": "external-import-e1733012-e3c3-407c-ab37-21490664c87b",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 10
                    },
                    {
                        "workload": 2,
                        "_id": "external-import-8b30cb50-b319-491b-9d54-5663b8f6503a",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "difficulty": 5,
                        "_type": "review",
                        "id": "external-import-8b30cb50-b319-491b-9d54-5663b8f6503a",
                        "created": "2021-01-12T18:37:12Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "body": "I have an MBA. This course should have been cake. Nope. This course is heavy memorization. VERY heavy memorizarion. Opt out if you can.",
                        "course": null,
                        "_createdAt": "2021-01-12T18:37:12Z",
                        "rating": 1
                    },
                    {
                        "created": "2020-12-29T05:04:38Z",
                        "_id": "external-import-1f90ac04-ae52-4604-9cca-ed9fe31becfc",
                        "course": null,
                        "difficulty": 3,
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-12-29T05:04:38Z",
                        "id": "external-import-1f90ac04-ae52-4604-9cca-ed9fe31becfc",
                        "body": "This class achieves the goal of providing the fundamentals of the core areas of business. I very much enjoyed the course content and appreciated that the professors and TAs were engaged and kind throughout the course. Professor Flury was very available to answer any questions or clarifications that students had. \nThere is a massive amount of content that leaves you little room to reinforce the material overtime, which led to a lot of mindless memorization to do well on the exam - this is especially true for the multiple choice theory questions on the exams and for the marketing and business strategy modules.\nAlthough this is not a difficult course, do not underestimate how much time it takes, especially around exam time.",
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "semester": {
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z"
                        },
                        "rating": 4,
                        "workload": 15
                    },
                    {
                        "created": "2020-12-08T19:41:46Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "rating": 3,
                        "course": null,
                        "_id": "external-import-2585b0ed-6dc5-4f5e-8732-79efd054f2be",
                        "body": "Overall, not a particularly challenging class. Tons of memorization is required for exams, especially early in the semester. Later material such as marketing and supply chain is as common-sense as it gets. \n\nThe midterms were a bit challenging, especially finance and accounting related problems, but there is a substantial amount of practice material that suffices. The exam questions were modeled very similarly to those provided in the self-assessments so no student should be taken by surprise on the difficulty of them.\n\nIf I were to have a favorite section, I'd say Accounting was the most organized and well-defined and go with that. Parts of the Finance module were useful as well, such as beta risk.",
                        "id": "external-import-2585b0ed-6dc5-4f5e-8732-79efd054f2be",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "workload": 3,
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "_createdAt": "2020-12-08T19:41:46Z"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "_type": "review",
                        "body": "Though I took this class 1 year ago, I was surprised by all the hate it gets and felt I needed to express my opinion. This class is intended as a business foundation for those who have no business background. I recall the professor stating this many times during the first week of the class and encouraging anyone with MBA or sufficient business background to opt out. Therefore, I don't understand comments regarding not learning anything new from this class. I came from an engineering background, and therefore, learned a lot in this course. \nThe knowledge I gained from the accounting, finance, and SCM was priceless. I do agree though that the last two modules are kind of dry, but I didn't think they were as bad as some describe them. Also, I do agree that they should allow for a cheat sheet, since there is no point in memorizing formulas you will forget once you are done with the class. \nI also liked the style of homework that help you prepare for the exams, and thought that the group projects were fun. ",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "workload": 14,
                        "_id": "external-import-e7c8f59c-0902-48e9-b017-6645eb4f46b1",
                        "difficulty": 3,
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19"
                        },
                        "_createdAt": "2020-11-27T18:46:44Z",
                        "id": "external-import-e7c8f59c-0902-48e9-b017-6645eb4f46b1",
                        "created": "2020-11-27T18:46:44Z",
                        "rating": 4
                    },
                    {
                        "_type": "review",
                        "workload": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LY5W",
                        "course": null,
                        "_id": "external-import-84a6558a-e8c0-41fd-94e3-a4c016194203",
                        "_updatedAt": "2022-07-11T19:08:20Z",
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN14Is",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2020-3",
                            "_updatedAt": "2022-07-22T00:46:29Z",
                            "startDate": "2020-08-17"
                        },
                        "body": "The class should be improved in several aspects. Accounting was fine, the most organized section with clearly defined outcomes. It was somewhat challenging from a content load but it lays the foundation of how financial statements are structured. Finance's material was ok but the lectures were dry. This is unfortunate since I find basic financial concepts have a lot of applicability outside of a career in finance. Strategy was not helpful. Learning empty shells of Porter's 5,  SWOT, etc. has very little value unless practiced. The best way to learn strategy, in my opinion, is via strategic analysis as a project, not in a group setting but as an individual assignment so that one can analyze and write their logic defending what they think and why. The strategy module has over 50% overlap with the marketing module. They should be combined. Operations is ok though I did not like the professor's approach to the lectures (that's was more of a style preference, not a remark on the professor's knowledge of the subject). One area in ops that can be improved are the notes. They are taken straight from the professor's talking during the lectures and contain a LOT of repeated words, such as \"like\", \"um\", \"you know?\", \"makes sense\"...they can be way more structured and cleaned. One praise to the strategy section is that the notes were far better and more organized. The module quizzes are also very helpful in setting the tone for the exams and are very similar to the questions one gets on the exam. Exams - no surprises there, though, as I mentioned before, there is a lot of mindless memorization and very little practical questions which were mostly concentrated in the first 2 modules - finance and accounting.\n\nOverall, I can see people's frustrations described below boiling down to the lack of connection of this class with the degree and agree that this class should not be mandatory. If you intend to keep it, I recommend putting emphasis on the actual analysis - via case studies, excel sheets, even basic R usage and asking the students to explain why they picked an answer, analyze the answer through business lenses. Exams require a lot of mindless memorization of the material and questions that can be forgotten 5 min after the exam. This class is an accumulation of undergrad-level material and the only thing that makes it a master's level is that you take 5 into 1. All in all, not a class for this program in its current format. ",
                        "id": "external-import-84a6558a-e8c0-41fd-94e3-a4c016194203",
                        "created": "2020-11-21T22:43:17Z",
                        "_createdAt": "2020-11-21T22:43:17Z",
                        "difficulty": 2
                    },
                    {
                        "created": "2020-10-08T01:29:48Z",
                        "_type": "review",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_createdAt": "2020-10-08T01:29:48Z",
                        "course": null,
                        "workload": 8,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester"
                        },
                        "id": "external-import-524bda77-c395-44d0-b644-61e0d4d93e94",
                        "rating": 1,
                        "_id": "external-import-524bda77-c395-44d0-b644-61e0d4d93e94",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "body": "I do not understand how Professor Alan Flury maintains employment as a professor at a reputable university. Flury is a toxic individual who calls himself a professor but really just likes a captive audience. He degrades students whom he perceives to disagree with him, whether or not he was even a part of the discussion in the first place. He trolls Piazza and imposes his personal and political ideologies on students. When he wants to shut a student down but can't come up with an argument or Breitbart article, he will gaslight students and appeal to the authority granted to him by having earned millions of dollars in consulting. If you can opt out of this class, do so. If you can't, do yourself a favor and do not read his Piazza posts.",
                        "difficulty": 3
                    },
                    {
                        "_createdAt": "2020-08-19T22:44:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-146248ef-584b-416f-95ae-0564e721cd62",
                        "created": "2020-08-19T22:44:18Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "course": null,
                        "difficulty": 3,
                        "body": "Originally started this class Fall 2019, but withdrew after failing the midterm.  Took it again in Summer 2020- still failed the midterm but decided to see if I could salvage my grade.  Ended up getting a 96% on the final somehow and B overall.\n\nIn summer they take out a lot of material- the entire Business Strategy section as well as the ratios section of Accounting and no group project.  Only 3 homeworks (2 of which are essentially video games that require no knowledge of the lecture material- supply chain & marketing), and a non-cumulative final. Hours and Hours of painful lectures, I never attended the \"conference calls\" live.\n\nAccounting is straight up memorization- just need to memorize each category (i.e. land-> assets).  I literally have no idea what Marketable Securities or Treasury Stock are, but I know which category the fall into.\n\nFinance is just a lot of math.  Really just basic addition and subtraction.\n\nSupply Chain was easy (I am ISYE undergrad) and the lectures are actually exciting.  Just memorize the equations- there are only a few of them (EOQ, newsvendor, etc.)\n\nMarketing is incredibly easy- just memorization and common sense.\n\nOverall it was just OK.  I don't really think I'll remember any of it in the long term.  Curve was ~5% at the end of the term which was nice.",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "workload": 10,
                        "rating": 2,
                        "_id": "external-import-146248ef-584b-416f-95ae-0564e721cd62"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "rating": 1,
                        "id": "external-import-1d50aae2-21e2-4fd4-8915-39f120d89b71",
                        "created": "2020-08-12T17:37:25Z",
                        "_createdAt": "2020-08-12T17:37:25Z",
                        "_id": "external-import-1d50aae2-21e2-4fd4-8915-39f120d89b71",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 3,
                        "body": "I gave this class a medium mostly because of the first half of the class, which requires a tremendous amount of memorization. What ends up happening, is that you spend so much time on memorization that you don't really learn the material (especially the accounting and finance sections). Additionally, the lectures in the first two topics are way too long and poorly presented.\n\nAfter the first midterm things get much better with the supply chain and marketing sections, which are better presented and more interesting. I thought that Bob Myers did a great job presenting the supply chain information, and gave good examples to help with understanding the information. \n\nThe final was much easier, and really helped pull people's grades up. Be prepared to put in more time that you would think for this class. ",
                        "workload": 7,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        }
                    },
                    {
                        "created": "2020-08-04T02:12:34Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "workload": 3,
                        "semester": {
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z"
                        },
                        "_id": "external-import-f86bb971-2055-48fc-b226-29a6b82ed2a4",
                        "course": null,
                        "id": "external-import-f86bb971-2055-48fc-b226-29a6b82ed2a4",
                        "difficulty": 2,
                        "_createdAt": "2020-08-04T02:12:34Z",
                        "rating": 4,
                        "body": "Overall the course is good but should not be a required course as its content is not directly relevant to analytics except for supply chain module maybe. Marketing module can be improved by focusing on analytics related topics such as A/B testing, Multi-arm bandit testing, etc.",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review"
                    },
                    {
                        "_createdAt": "2020-08-02T05:19:08Z",
                        "id": "external-import-5de4c51f-d886-452d-86a6-312c435a7bf5",
                        "created": "2020-08-02T05:19:08Z",
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_id": "external-import-5de4c51f-d886-452d-86a6-312c435a7bf5",
                        "course": null,
                        "body": "This course is a combination of a introduction level of 4-year undergraduate business courses.  \n**This course needs to be removed.** If school officials can read my review, please considerate remove this course and introduce more CS style courses.  \n**If you are qualified to opt out this course, do without any hesitation**",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 1,
                        "difficulty": 4,
                        "_type": "review",
                        "workload": 5
                    },
                    {
                        "id": "external-import-ab1f32f9-8504-496f-bce8-0421e93d8bf5",
                        "difficulty": 3,
                        "_createdAt": "2020-07-30T08:37:53Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 3,
                        "created": "2020-07-30T08:37:53Z",
                        "workload": 14,
                        "semester": {
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "body": "**TLDR; even if you have an academic background in business, this class will be quite time consuming and challenging. I chose to set the difficulty to \"Medium\" because of the sheer quantity of details to memorize in several business areas. Take notes in all modules!**\n\nAs I took the class in summer, business strategy was cancelled, hence four modules Accounting, Finance, Supply Chain Management and Marketing remained. Although some will disagree the modules provide a good and compact insight into various business aspects - Honestly, it was (mostly) quite clear what the students should take away from the lectures.\n\n*Note that there was and probably will be a lot of whining in piazza - my advice, do your thing and ignore the posts.*\n\n**Accounting**: This is A LOT and took most of the time to learn. There are many videos that do provide a lot of information - take notes!\n\n**Finance**: In addition to the accounting module, Finance provides a good match in order to obtain a full picture of finance. There are quite a few calculation problems for which you really need to get the tricky parts. Also, finance refers to accounting many times so imo you need to get the idea of accounting.\n\n**Supply Chain Management and Operations**: If you don't love Bob Myers teaching style something's wrong with you. I haven't really expected much from this module and it turned out to be my favorite. Material is quite interesting and easy to remember - as it is interesting and fun, this module seems far less time consuming than the other modules. Don't miss office hours!\n\n**Marketing**: Well, not my favorite. The prof did a good job to go through many aspects, however to me it is an endless repetition of made up words. In the first videos you will be explained that the main objective in marketing is to give you an idea and provide the main concepts.\nTo me it sounded like it should be enough to understand the basic idea, however there really is the need to memorize many details (e.g. questions like \"Which of the following 5 points is not true for ..\" are being asked). So be prepared to memorize bullet points, many.\n\n\n**Homework**: 30% of the grade, really ok. One finance HW where you need to construct a balance sheet and handle some accounting questions. Two simulations (SCM and Marketing) that may be subject to \"competitive grading\" - so do well or hope for weak class mates. But to be clear, the simulations are both fun and make sense.\n\n**Mid-Term**: This is 40% of the grade and **really is the tough part!** There were many complaints, however most of them not really justified to be honest. Finance & Accounting is a lot, but there are no surprises at the exam. Be prepared to be capable of doing ALL calculations you've seen in this class it feels like they pick 10 out of possible 10.\n\n**Final exam**: 30% of the grade, **flash card alert**. This one requires a lot of memorizing, especially for marketing. This is pretty much a vocabulary check and more than half of the points come from marketing.\n\n**Ungraded Self Assessments**: Do them, perfect preparation for the exams.",
                        "_id": "external-import-ab1f32f9-8504-496f-bce8-0421e93d8bf5"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 10,
                        "_id": "external-import-ceb828bd-f2d2-45ff-968e-303877a4ef71",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 2,
                        "_createdAt": "2020-07-29T13:25:56Z",
                        "body": "Even though the summer course cuts out 1-2 modules and the group assignments, this class just tries to cram in way too much information. Besides some non-intuitive finance formulas, the material is easy - the 10 hours per week is from dedicating 30-60 min to note taking per video + practice. \n\nIt’s mostly just a test of how much information you can memorize and deliver on exam day - create flashcards early on, practice self assessments over and over, and read Piazza/watch the conference calls for a few “gotchas”. \n\nDefinitely not my favorite class, but the supply chain module was surprisingly interesting and enjoyable. ",
                        "id": "external-import-ceb828bd-f2d2-45ff-968e-303877a4ef71",
                        "created": "2020-07-29T13:25:56Z",
                        "course": null,
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_type": "review",
                        "rating": 2
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 1,
                        "course": null,
                        "workload": 20,
                        "_id": "external-import-70775ec5-2ff6-47bf-83a5-20e9e868f218",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "body": "tl;dr: Wait until OMSA overhauls this class to sign up\n\nFor a class that is titled, marketed, and meant to be a fundamentals class it is exceptionally challenging and requires an inordinate amount of time each week to complete.\n\nFirst, it is a 3 credit class but somehow there are 6+ hours of lecture each week. Office hours are not optional, they are required additional lecture time where you go over material you will be tested on. The pre-recorded lectures are also very long, regularly surpassing 2.5 hours each week. Prepare yourself, they are dense. \n\nFor the summer term, there are 4 modules: Accounting, Finance, Supply Chain, and Marketing.\nAccounting and Finance are killers - tons of memorization of arcane accounting formulas, terminology, etc. The things you learn in 3 weeks are akin to what an accounting student is expected to know. Which is great if you're interested in accounting, but maybe not necessary for analytics/CS students... The professors for Accounting and Finance seemed to not care that the material wasn't accessible and regularly would refuse to answer theoretical questions because we might be tested on some concept. \n\nThe professors for Supply Chain and Marketing were great. They really tried to make the material accessible and would have discussions with students about the material and how to apply it. \n\nThe assignments were fine. The homework takes a lot of time, but if you sink the hours you'll get a good grade. The simulations they use are deterministic and there is no randomness inserted into the sim. So, as long as you track your inputs and outputs you can game the system to get an A on those homeworks. Again, you have to sink the time in. \n\nExams are ridiculous. The questions are all very similar to self assessments, but always the most confusing they can manage. Couple that with not being able to copy/paste into excel means you're bound to lose points on typos.\n\nThe students who seemed to be most successful in this class were those with an MBA or who worked regularly with finance/business data. The main skill I learned was rote memorization of terms or Excel formulas I will never use again. \n\nThis class shouldn't be required, except maybe for Business Track students. There is no clear objective - it is a poorly designed survey course at best.",
                        "difficulty": 5,
                        "_createdAt": "2020-07-28T17:23:57Z",
                        "id": "external-import-70775ec5-2ff6-47bf-83a5-20e9e868f218",
                        "created": "2020-07-28T17:23:57Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review"
                    },
                    {
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 1,
                        "body": "This class had 4 modules this term - accounting, finance, supply chain and marketing. Some things that are common to all of these that I liked:\n\n* They give examples of how real companies rely on these concepts\n\n* They make how large companies work and why they do the things they do a bit more transparent\n\n* The professors and TAs interact with students and most of them are quite nice and responsive.\n\nThings that are common to more than one module that I didn't like:\n\n* Tons of rote memorization and terminology/definitions that don't necessarily track with your ability to understand and make decisions using the core concepts\n* \"Simulation\" assignments which are actually deterministic, meaning that your performance in them has nothing to do with how well you understand the concepts or how you'd perform in a real situation and more to do with meticulous tracking of inputs and outputs in repeated \"simulation runs\" (not to mention you have to buy a $90 course pack to access them)\n* Can't copy/paste exam questions into excel, so for the accounting/finance module a significant portion of the exam was manually typing in dozens of cells and quadruple-checking that you didn't typo anything\n\nAnd specific to the modules:\n\n* Marketing had really long lecture videos with no clear emphasis on core concepts, just tons of definitions and reading from a script/powerpoint slide. Questions or criticisms were often responded to defensively.\n\n* Accounting was interesting because now I can read financial statements and understand them, but remembering how to classify accounts without notes or internet is not a useful skill and that was the emphasis\n\n* Finance was fine because you learn about basically how to quantitatively evaluate projects\n\n* Supply chain was by far the best module because of Professor Myers, he had enthusiasm for the topic, emphasized core concepts, didn't read off a script and was helpful and responsive to questions/criticism\n\nGenerally speaking, this class should not be required, and if it is there should be a clear central objective rather than a mishmash of business topics. Additionally, the \"remake\" seemed to be recording new lecture videos without emphasizing online learning best practices (short videos, visual learning, knowledge checks and activities). The assignments/exams were sometimes poorly designed, ambiguous or unfair (some of this is due to the nature of the material).\n",
                        "difficulty": 4,
                        "created": "2020-07-25T15:42:51Z",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2"
                        },
                        "_id": "external-import-598fb0a4-33e2-43d6-9b24-e84bfd3e8e1a",
                        "_createdAt": "2020-07-25T15:42:51Z",
                        "id": "external-import-598fb0a4-33e2-43d6-9b24-e84bfd3e8e1a"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_type": "review",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5"
                        },
                        "body": "I'm taking this class about halfway through the OMSA program, and I thought it was pretty good. I knew very little about business coming in, so I had a lot to learn. My goal was to make a B, and that's probably where I'll end up (got Covid-19 this summer!).  \n\nProfessors and TAs were very responsive on Piazza. You were expected to do some research on your own (look up terms sometimes), which I think it completely appropriate for a grad level class. There is no programming required for this class (unless you count Excel).\n\nFor the summer, they removed the Business Strategy unit and the team marketing assignment. That was nice because they didn't try to cram all the content of a 16-week course into the summer.  Appreciated.\n\nThe weekly conference calls contain additional content but also allow time for actual Q&A with professors, so I appreciate that extra attention.\n\nYes, the exams are memorization based, which is not ideal. But I survived.  I think the course accomplished its goal for me: a broad survey of business topics; enough to give me an overview so that I am aware of these ideas going into a data analysis field.  But I'll definitely be glad to get back to math.",
                        "id": "external-import-f5650bd3-7590-43c1-894b-358f1131dc43",
                        "created": "2020-07-20T23:30:56Z",
                        "difficulty": 3,
                        "_createdAt": "2020-07-20T23:30:56Z",
                        "_id": "external-import-f5650bd3-7590-43c1-894b-358f1131dc43",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 4,
                        "workload": 8
                    },
                    {
                        "id": "external-import-98e70720-8ed6-40d2-bed1-a91281feab9e",
                        "_type": "review",
                        "body": "Easily one of the worst courses I've ever taken. The exams rely entirely on memorization and little on core concepts/theory. The course expects you to have a solid finance background (which I would say I have a \"decent\" one) but I honestly feel for the people who haven't even touched finance. The course needs to be revamped immediately from the OMS Analytics program. Prof Flury seems confrontational in his tone and the way he posts things to the forums. Students often ask very good questions and end up getting derailed in his responses. The other instructors often make mistakes on their lectures and have to put \"notes\" at the end detailing their mathematical mistakes which puts a strain on learning and reviewing for the exams. The material is bland and is not explained very well. Overall the course is extremely dull, the exams are abysmal, and the main professor is very confrontational. Any complaints about this course are always ignored and probably due to the tenure of the main professor if I had to guess.",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 4,
                        "rating": 1,
                        "workload": 12,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HiC5",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2020-2",
                            "_updatedAt": "2022-07-22T00:46:39Z",
                            "startDate": "2020-05-11"
                        },
                        "_id": "external-import-98e70720-8ed6-40d2-bed1-a91281feab9e",
                        "created": "2020-06-17T14:09:04Z",
                        "_createdAt": "2020-06-17T14:09:04Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "course": null
                    },
                    {
                        "id": "external-import-e1259d78-ccd2-4ef7-b800-995cc2b23ba4",
                        "created": "2020-05-11T22:35:10Z",
                        "course": null,
                        "rating": 4,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester"
                        },
                        "difficulty": 2,
                        "_type": "review",
                        "workload": 5,
                        "_id": "external-import-e1259d78-ccd2-4ef7-b800-995cc2b23ba4",
                        "_createdAt": "2020-05-11T22:35:10Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "I won't go into too many details on the course structure itself as there are many reviews that do that.  The course was very well organized and the professors and TAs were helpful and responsive.  I thought the first half of the course (accounting, finance, and supply chain topics) was good and useful, particularly the finance section.  However, the last half (marketing and business strategy) was not all that great.  The marketing content in particular was done very poorly.  He decided to throw everything at you and presented it like he was reading from a textbook.  I didn't get anything out of the marketing section.  The business strategy part was pretty interesting, just unnecessarily long and verbose.  Overall I'd say it's a good course, but I wish they'd drop the marketing section or revise it.  ",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "rating": 1,
                        "id": "external-import-a55414dc-2911-4ca5-bcd1-97f283270d39",
                        "created": "2020-05-06T02:10:29Z",
                        "body": "This course is too broad, trying to cover too many topics in one semester. I would not characterize what I learned as very meaningful or valuable. \n\nThe course would be better condensed and instead of difficulty in breadth, more effort could be placed on teaching the material in a way that what is learned can be transitioned to actual projects in the workplace. Applied business analytics would be much more useful. \n\nAlso, some group members didn't participate in the group projects. It is hard to enforce equitable grading there. ",
                        "workload": 15,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "_id": "external-import-a55414dc-2911-4ca5-bcd1-97f283270d39",
                        "_createdAt": "2020-05-06T02:10:29Z",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "id": "external-import-af016bad-630a-43fa-9feb-79446d4927d0",
                        "created": "2020-05-02T17:25:00Z",
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "course": null,
                        "body": "They need to reduce the length of the office hours, drop the marketing module, and reorganize the business strategy module to make it more coherent in terms of contents...... The fact that this class is mandatory is a bit strange to me.",
                        "difficulty": 3,
                        "semester": {
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z"
                        },
                        "_id": "external-import-af016bad-630a-43fa-9feb-79446d4927d0",
                        "_createdAt": "2020-05-02T17:25:00Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "workload": 8
                    },
                    {
                        "body": "My undergraduate is in econ and I work as a business analyst. I think this is the second semester during the revamp and there are still a lot of problems with it. I got an A in this course so it's not just sour grapes.\n\nI see the importance of this class as someone who works with data scientists often - you need to be grounded in the goals of the business and your work needs to be relevant and impactful so you should understand how the business works. The execution of this class is really poor though. Prof Flury seems quite kind and reactive so it's not really a personal problem with any professors, but the structure of the class leaves a lot to be desired.\n\nThere's a lot of people who complain about this class because they come into it thinking that it's a blow off class and useless so I want to emphasis that I think the idea behind it is good. It will be very difficult to cram for this course, so you need to be mindful of that.\n\nThe course is organized into 5 modules that are taught by 5 different professors and the quality of learning in these videos really varies depending on the professor. They are Accounting, Finance, Supply Chain, Marketing, and Business Strategy. There are non-cumulative two exams, both of which account for 35% of the final grade. \n\nThere's a couple of problems with this course:\n\n- Lack of understanding of how online learning differs from in person learning: there's a couple of videos (especially in the marketing module) that are just 20 minutes long without a clear topic separation from the rest of the videos. It really does not feel like anyone who knows anything about pedagogy was involved in making these videos. Very hard to parse out what were the important takeaways in the second half of the course.\n\n- In the first part of the course there's not a lot of intuition building, it relied a lot on memorization. This was fine with me since the goal of the accounting module was basically just 'Build a balance sheet and a cash flow statement'. The finance module was learning to solve a series of project investment problems. The second part of the course has the opposite problem - not very clear what the takeaways of each video should be.\n\n- Very USA Centric: I know that we need a point of view so I understand why the accounting module was US focused, but throughout the course almost all of the examples referenced are US companies and there's not any attempt on understanding that not all students are coming from the same perspective. I saw that a student said they had to google the relationship between a taco and a tortilla.\n\n- HW assignments: (1) TAs do not provide a lot of feedback I know there are a lot of team but we got like one sentence and it wasn't clear what we did wrong. (2) Rubrics are not clear for team assignments -> after the fact, we were given some ideas about how the TAs provided grades.\n\nPros of the course: \n\nProvides an important baseline for the business. Working in consistent teams lets us build relationships with other people in the course in a large class.",
                        "course": null,
                        "rating": 2,
                        "workload": 10,
                        "_id": "external-import-8f64078d-39af-404a-83ca-8025935f231b",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "id": "external-import-8f64078d-39af-404a-83ca-8025935f231b",
                        "_createdAt": "2020-04-29T22:43:59Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_type": "review",
                        "created": "2020-04-29T22:43:59Z"
                    },
                    {
                        "workload": 6,
                        "body": "An overall excellent class and one that's very well managed. The content is less technical than the other classes in the program, and some of the STEM folk may not like some of the modules, as they pertain more to business theory and may require memorisation.\n\nThe TAs and the teaching team are excellent and very responsive. And each of the lecturers will personally reply to queries about their own module. Prof. Flury was particularly good in this regard, as he is the lead instructor.\n\nThe content is divided into five modules: Accouting, Finance, Supply Chain, Marketing, and Business Strategy. Accounting and Finance are more practical, while the Marketing and Business Strategy are full-on just business theory. Supply Chain sits somewhere in the middle in terms of practical vs. theoretical content.\n\nThe marketing module's lectures can get a little boring at times, and that'd be my only complaint about the class. That's not to say they're bad, though. Just that the delivery could be improved somewhat. The other lectures, even the theoretical parts of the Strategy and Supply Chain (Dr. Myers is definitely very enthusiastic about his stuff!) modules were very good and give a good insight into business in general.\n\nThere are two exams, both of which account for 35% of the final grade. These are also non-cumulative (i.e., the modules you're tested on during the midterm won't be examined again during the final), which I really liked! They also have a curve built-in (e.g., the midterm has a total 107 marks but if you got a 97/107, that'd count as 97%).\n\nFor the Accounting section, you'll be asked to draft financial statements and compute financial ratios. For Finance, the questions are generally calculating things like free cash flows, net present values, and the like. (I really liked this module's content, in particular). Supply Chain focuses on theory as well as some calculations for reorder quantities and the like. Marketing and Business Strategy questions are all theoretical.\n\nThe remaining 30% comes from assignments. The Accounting and Supply Chain assignments are worth 10% each. You draft financial statement and use solver to optimise a supply chain in each of these, respectively. Marketing has 2 assignments, each worth 5%. The simulation assignment in marketing was a lot of fun, as well.\n\n**Verdict:** A great class to take! The low ratings here are extremely undeserved!",
                        "_type": "review",
                        "course": null,
                        "difficulty": 1,
                        "_createdAt": "2020-04-27T13:09:42Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2020-1",
                            "_updatedAt": "2022-07-22T00:46:49Z",
                            "startDate": "2020-01-06",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0HxAi",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "id": "external-import-84fd2aa0-dbef-4185-a293-b85d931280d5",
                        "created": "2020-04-27T13:09:42Z",
                        "_id": "external-import-84fd2aa0-dbef-4185-a293-b85d931280d5",
                        "rating": 5
                    },
                    {
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-92ce048a-6164-48be-8e95-d13caee62c16",
                        "rating": 4,
                        "_createdAt": "2020-03-24T15:53:27Z",
                        "_id": "external-import-92ce048a-6164-48be-8e95-d13caee62c16",
                        "body": "I liked the content, but not as much as some of the more code and math heavy courses.\n\nThis course covers 5 different topics in survey style classes: Accounting, Finance, Supply Chain, Marketing and Business Strategy.  The overall style is lectures followed by weekly non-graded quizzes, exams and 3 projects (including a simulation).  A bunch of papers from HBR and Business schools is also included, but tend to be optional reads (worth reading in the rare times you have some down time).\n\nThis is very lecture and content heavy course.  You will spend around 3-4 hours a week just going over video lectures and probably another 1-2 hours on other types of content.  The toughest times will be around exams or the 3 projects mentioned.  The 3 projects included a Excel heavy optimization problem, a marketing simulation on a online dashboard (mostly educated guessing) and a case study that used a moderate amount of Excel.\n\nReview per topic:\n\nAccounting  \nBasic accounting rules with lots of information about exceptions and strange rules.  Can be a bit dry at times, but interesting.\n\nFinance \nUnderstanding how cashflow works and how it ties to stock market overall.  Interesting topic.  Probably one of the more fun sections, though can get quiet arithmetic heavy.\n\nSupply Chain\nVery concise and interesting lectures/slides.  Math heavy at times, but not too bad.  Project focused on optimization is fun.  Only issue is I wish we could dive deeper into these topics.  This and Finance are the most fun modules.\n\nMarketing\nThis is a concept heavy set of lectures.  Lots of frameworks and ways of thinking about targeting people.  If you review the lectures a 2nd time, it will make sense on a higher level.  Projects focused on simulation and case study are ok.  \n\nStrategy\nThis section easily has 2-3 times the length of lectures compared to any other module.  Content overall is easier to follow than marketing and somewhat interesting.\n\nIf you have taken business classes, this will probably be easier class for you.  You do need to do some arithmetics and be comfortable with Excel or be willing to learn more advanced features on the fly.  A lot of your time will be spent in video lectures.  Your skill will mostly be correlated with memorization of different details and to some degree your ability to calculate some rather arithmetic heavy things in Excel.  Overall good course, but not a reflection of the rest of the program so far.\n",
                        "_type": "review",
                        "course": null,
                        "created": "2020-03-24T15:53:27Z",
                        "workload": 8,
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "_updatedAt": "2022-07-11T19:08:19Z"
                    },
                    {
                        "created": "2019-12-19T16:50:21Z",
                        "rating": 4,
                        "course": null,
                        "semester": {
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-e0de52fb-6d5e-4e23-a8d7-b1f3b0b028c1",
                        "body": "I enjoyed this course far more than I had expected, given the prior reviews.  I found that the Accounting/Finance modules, while sometimes dry in presentation, were actually super useful as I had never seen all these business elements put together into a cohesive structure.  White-collar crime makes so much more sense to me now! :)  This was also my first exposure to Supply Chain concepts and I similarly found those to be engaging, particularly from an analytics perspective.  I was less enthused by the Marketing module, which had the longest, most numerous, and most powerpoint-happy lectures despite having some pretty intuitive content.  Case in point: I accidentally took one of the ungraded self-assessments before watching the hours of associated marketing lectures, and despite my confusion at why I couldn't recall seeing any of this before, still managed to get 16/18 right, just using common sense.  The Strategy module was fine.\n\nI really appreciated that the professors were all very accessible and personally engaged with students.  The tests were fair, included some bonus points for extra credit, and were not cumulative.  The professors also released study guides that let you know exactly what content would be included on the exams, which was really helpful to winnow down the overwhelming volume of content to the essentials.  The two small group projects were fine, but honestly felt like an afterthought and would have been simple enough to complete independently.\n\nI spent a lot more time on this class than I anticipated.  Some weeks were only a couple hours, while others were upward of 20 -- though this was largely due to my personal preference for extensive note-taking by hand, and a mild-but-chronic state of being about a week behind in the lecture schedule.",
                        "id": "external-import-e0de52fb-6d5e-4e23-a8d7-b1f3b0b028c1",
                        "_type": "review",
                        "workload": 12,
                        "difficulty": 2,
                        "_createdAt": "2019-12-19T16:50:21Z",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC"
                    },
                    {
                        "workload": 7,
                        "difficulty": 3,
                        "id": "external-import-9bf30394-7249-4c69-9558-bfd19c57021a",
                        "created": "2019-12-16T05:56:49Z",
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2019-3",
                            "_updatedAt": "2022-07-22T00:46:58Z",
                            "startDate": "2019-08-19",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0I7mi"
                        },
                        "_id": "external-import-9bf30394-7249-4c69-9558-bfd19c57021a",
                        "_updatedAt": "2022-07-11T19:08:19Z",
                        "rating": 3,
                        "_createdAt": "2019-12-16T05:56:49Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LXPC",
                        "body": "I enjoyed the first part of the course, which was Accounting and Finance. I had not taken any business courses before (Engineering background), so I learned a lot and enjoyed the problem solving portions. My main frustration was the amount of memorization. It's hard for me to see the value in memorizing a bunch of ratios and formulas that I will quickly forget and can easily Google if ever needed in real life. The test was tough but fair, and I felt the lecture / practice problems were adequate to prepare.\n\nThe second part of the course...whew. For Marketing and Business Strategy, there was so much content, and it felt like 90% of it was just common sense concepts with fancy wording and acronyms that make it easy to get tripped up on a test question. I ended up only watching about half the lecture videos and decided to guess my way through those parts of the final, and I ended up doing well on it. I really don't think I would have gained much (in value or in exam points) if I had spent hours watching and studying these parts. I can't overstate what a waste of time those sections felt like. My spouse is very happy that I'm done and am no longer complaining about them all the time. I ended up with a high A, so the criticism isn't coming from anything personal.\n\nOverall, it ended up being a bigger time commitment and perhaps a little more difficult than I expected (the exams are each worth a big chunk of your grade, so there's definitely some pressure there), but at least you have the ability to work/study ahead and plan around vacations.\n\nThe instructors and TAs are great and are very helpful, despite my thoughts on the content of the latter modules.",
                        "_type": "review",
                        "course": null
                    },
                    {
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_id": "external-import-18e67956-c7fe-42f8-b1ca-78fd8763d62f",
                        "difficulty": 2,
                        "_createdAt": "2019-08-12T18:03:10Z",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "workload": 2,
                        "body": "This course is alright.  I've heard a lot of bad stuff about the marketing module, which was thankfully skipped in the Summer 2019 version of the course.  I enjoyed the more mathematical parts of the class- NPV, IRR, etc. in the finance modules.  Accounting was mostly memorizing what goes on the balance sheet/income statement and what's an asset/liability etc.  I wasn't as big of a fan of the business strategy parts that we covered.  If you're good at memorization, this should be an easy class.  I got an \"A\" working less than 2 hours a week.  Honestly the most annoying part of the class was that there was a small amount of additional content in the weekly Bluejeans call that was not covered in the class videos.  This made the weekly bluejeans calls somewhat mandatory (even if watching after the fact).  This posed a bit of a problem, because the prof can be a bit long winded and we had someone in the class who asked a million questions (many off topic).  This made many of the calls >2 hours long.  Being so disjointed with all the questions, it made it really hard to find the required material in the recordings.",
                        "id": "external-import-18e67956-c7fe-42f8-b1ca-78fd8763d62f",
                        "created": "2019-08-12T18:03:10Z",
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review"
                    },
                    {
                        "_id": "external-import-76f8a071-f0bb-44ff-9bc4-6e8fefa0462b",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_createdAt": "2019-08-08T01:08:53Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "difficulty": 3,
                        "workload": 8,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-76f8a071-f0bb-44ff-9bc4-6e8fefa0462b",
                        "created": "2019-08-08T01:08:53Z",
                        "body": "This course was different from other OMSA courses in that there was a lot of memorizing terms, particularly in the second half.  The first half consisted of work involving balance sheets, and other aspects of financial accounting.  We also touched on managerial accounting and things like cost variances, materials variances.  The entrepreneurial finance section focused on valuation of companies and involved net present values.  I really enjoyed the strategy section where we studied several companies including Tesla, JetBlue, Amazon, and Walmart.  I didn’t think I’d like the strategy stuff, but it was interesting.  I’ve found the class very helpful in understanding my current company, and the terminology (jargon) actually has come in handy.  They are revamping the class for fall 2019, so future students will likely have a different experience.  Personally, I’d recommend the course packs...  they helped me tremendously in the strategy sections in particular!",
                        "_type": "review",
                        "rating": 4
                    },
                    {
                        "created": "2019-07-29T20:28:17Z",
                        "_id": "external-import-97c58ebc-21b0-49e0-a512-60009763a3be",
                        "body": "Considering I came from an engineering background my closest experience with financial materials were the property evaluation course that i had in undergrad which was similar to a very tiny part of the course. \nThere are a lot of materials covered in the class , up to the midterm a big chunk of the problems are actually solving financial management problem, which is logical and I enjoy the math so it was easy. The last part of the course (strategic management) has a lot of theoretical parts. It is very important to attend the video conference calls or at least watch the videos because they cover the important sections. I did not buy the course packs they recommended , and I guess if you watch the videos and take notes and understand the self assessment problem you will be ok. I dedicated on average 10 hrs per week (some weeks less), since the summer semester was short, and it was very easy to manage. \nThe professors and TAs are great , you get the answers to your questions almost immediately.",
                        "course": null,
                        "workload": 12,
                        "rating": 4,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-07-29T20:28:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-97c58ebc-21b0-49e0-a512-60009763a3be",
                        "difficulty": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1gYI",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2019-2",
                            "_updatedAt": "2022-07-22T00:47:06Z",
                            "startDate": "2019-05-13"
                        },
                        "_type": "review"
                    },
                    {
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester"
                        },
                        "_type": "review",
                        "rating": 4,
                        "workload": 6,
                        "id": "external-import-90f14116-bb2d-4db9-af02-d732b52f5326",
                        "created": "2019-05-01T19:52:07Z",
                        "_id": "external-import-90f14116-bb2d-4db9-af02-d732b52f5326",
                        "difficulty": 2,
                        "body": "I have never taken a business class before, so I learned a lot in this class. If you have taken a business class before, you probably won't learn much new as this class goes only knee deep into a fairly large number of topics. The content is not something of which I would be making much use in my job, but still good to know (e.g. understanding financial statements, costing, company valuation, etc.). So the knee-deep content was great for me.\n\nHomework and exams were not particularly difficult. Watch all the lectures, attend all the weekly office hours (or at least watch the recordings), do all the self-assessments and practice problems, and that A is perfectly attainable.",
                        "_createdAt": "2019-05-01T19:52:07Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "created": "2019-04-30T04:04:56Z",
                        "difficulty": 5,
                        "rating": 1,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07"
                        },
                        "body": "I marked the course as 'Very Hard' not because of the content, but because if the structure of the assignments. You are given lots of material and very few practice tasks and problems. So you can't memorise and understand by doing and you have to just memorise instead.\n\nIf you can opt-out, you definitely should do so, most of the course isn't worth time and money.\n\nBelow are some examples of test assignments that I consider to be bad practice:\n- You need to select which one of US-based fast food chains has a different strategy, and most of these chains are unknown outside of the US\n- BMW is considered to be the brand the emphasises Quality in Marketing module, and Product Features in Strategy module\n- Sometimes you will need to select an argument not mentioned during the video lectures\n- All answer options for computational problems are a bit off, so you are never sure (answer options are calculated with rounding to 2-nd digit on every step)\n\nP.S. Finance was the only part that was really interesting and seems to be useful in the future.",
                        "_createdAt": "2019-04-30T04:04:56Z",
                        "course": null,
                        "id": "external-import-36896212-137a-4a66-b6ad-4c2ea29a5452",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "workload": 3,
                        "_type": "review",
                        "_id": "external-import-36896212-137a-4a66-b6ad-4c2ea29a5452",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS"
                    },
                    {
                        "body": "I want to split my review into 2 parts:\n\n1) \nThe accounting and finance sections of this class are pretty good. There are lots of fundamental concepts here that everyone graduating with an analytics degree should know. Importantly, there's actual math and clearly defined right/wrong answers. The fact that we had to memorize formulas instead of having a formula sheet was a minor annoyance. The ideal version of this course focuses *only* on these sections.\n\n2) \nThe marketing and business strategy sections are as bad as the worst reviews here would suggest. If you've seen Silicon Valley (or any other comedy that satirizes business leaders' obsession with nonsensical posters/jargon/babble)... Hollywood doesn't even begin to scratch the surface here. There is just *zero* substance to the dozens of hours of lectures in these sections. Instead, we need to memorize random lists, flowcharts, and acronyms that are arbitrarily assigned to common-sense business tactics. I really can't stress my disappointment in these sections enough.\n\nI will say that the saving grace here is that success on the final *only* requires memorization and regurgitation (albeit on a very large scale). While this runs counter to the principles that make up a \"good\" class, it at least means that an A is achievable by pretty much anyone.\n\nRequiring the finance sections is a great idea; requiring the marketing/business sections is not. If I wanted to pretend I was smart by parroting arbitrary flowcharts and acronyms, I would have gotten an MBA.",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM"
                        },
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 2,
                        "workload": 6,
                        "id": "external-import-45f6ffdc-9ca3-432e-92af-c8ac6dbf8a2b",
                        "created": "2019-04-28T16:09:32Z",
                        "_createdAt": "2019-04-28T16:09:32Z",
                        "_id": "external-import-45f6ffdc-9ca3-432e-92af-c8ac6dbf8a2b"
                    },
                    {
                        "workload": 10,
                        "rating": 1,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "body": "God, this course is a disaster. Video lectures seem to drone on, I have such a difficult time finding tangible things to hold onto and store into my brain. Instead, I struggle to just get through them and choke them down.  \n  \nOffice hours are embarrassing. People join the room and their microphone were automatically set \"ON\" and the professor had to keep asking people to turn their microphones off every 5 minutes. \n\nI ended up dropping this exam after the mid-term. I had zero accounting experience before this course and they require you to memorize all the equations for the exam while dumping almost 3 undergraduate courses worth of accounting/finance information in little over a month. This seems like a ridiculous requirement for working professionals who are also enrolled in another class (which had an exam during THE SAME TIME PERIOD!!).   \n\nAdditionally, I think this is the only time I've every prayed for a textbook. You have to scower hours of video lecture to get nuggets of information. It would've been so much nicer to have a companion book to help you obtain the overall topics.\n\nThe program can do better than this, it's really left a bad taste in my mouth and made me question staying in the program. If you have to force people to memorize equations for an exam, then you are teaching the material incorrectly.  \n\nI strongly do not recommend this course.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-04-11T00:42:49Z",
                        "semester": {
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_type": "review",
                        "course": null,
                        "id": "external-import-af1e5421-9e58-489e-b2bf-cd4681acae02",
                        "created": "2019-04-11T00:42:49Z",
                        "_id": "external-import-af1e5421-9e58-489e-b2bf-cd4681acae02",
                        "difficulty": 4
                    },
                    {
                        "body": "I ended up dropping this class right before the withdrawal deadline once it was announced the OMSA program is going to reformat the class. I honestly can't say much worse than what has already been said. The fact that the professor giving the weekly video conference lecture wasn't in charge of the button that muted everyone's microphone meant every lecture included ten minutes of \"could everyone please mute their microphones. I'm getting an echo. Please mute your microphones.\"\n\nThe course is designed to be artificially difficult, throwing every possible business case at you and expecting you to store everything in memory (banning the use of notes during exams).\n\nThe videos are old, with at least one teacher referencing \"the upcoming 2016 general election.\"\n\nI'm planning on retaking this in the Fall, and am holding out hope that the mountain of negative reviews caused the School of Management to have their feet held to the fire to force them to make improvements. I've had frustrations with other OMSA classes, but this class actually made me reconsider the value of a degree from Georgia Tech.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "id": "external-import-49f9a7b4-09cc-4a49-928a-84dd526d430d",
                        "created": "2019-03-25T19:21:27Z",
                        "_type": "review",
                        "course": null,
                        "workload": 2,
                        "_id": "external-import-49f9a7b4-09cc-4a49-928a-84dd526d430d",
                        "_createdAt": "2019-03-25T19:21:27Z",
                        "semester": {
                            "_id": "external-import-2019-1",
                            "_updatedAt": "2022-07-22T00:47:13Z",
                            "startDate": "2019-01-07",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0ILeM",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "rating": 2
                    },
                    {
                        "difficulty": 5,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "_createdAt": "2019-03-16T14:56:43Z",
                        "rating": 1,
                        "_id": "external-import-f23c610d-8de0-4217-acd5-871ee08f9aeb",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "id": "external-import-f23c610d-8de0-4217-acd5-871ee08f9aeb",
                        "created": "2019-03-16T14:56:43Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_type": "review",
                        "course": null,
                        "workload": 5,
                        "body": "Terrible, useless course. Required for who knows why. If you want to be an accountant, financial manager, or small business owner, this class is for you. Otherwise, it is a complete waste of time. Unfortunately JOEL SOKOL has made this course required; he did not think this decision through. Hopefully someone will figure out that this course should not be required. This course is filled with arbitrary business lingo, poorly taught lectures, and an attempt at making this course difficult is made by making you memorize these arbitrary minutiae.\n\nI have taken all the other courses in the OMSA program; for me this was by far the most difficult course in the program because it is so poorly taught and irrelevant. \n\nJOEL SOKOL if you are reading this, remove this course from the curriculum immediately."
                    },
                    {
                        "workload": 7,
                        "body": "A lot of material, but none of it was too difficult. Taught as a sort of 'cliffnotes' MBA, with units in Accounting, Finance, Marketing, and Business Strategy. Clearly meant to give Analytics student a basic understanding of business in case they ultimately end up in the business analytics field and need to know how various departments work.\n\nExams were a little frustrating. Many questions were worded in such a way as to imply one thing, so it often felt like I lost points over semantics. They also required you to use on screen calculators, which is inconvenient if you've built a comfort with the layout of another calculator. Homeworks were very simple, with many questions basically mirroring example exercises with just a few numbers replaced. Not a highly technical class, but I would say there is a fair bit of \"flashcard\" style memorization needed.\n\nNote: Does not expect any background in Analytics or CS, so take it the soonest time convenient.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "difficulty": 3,
                        "rating": 4,
                        "id": "external-import-596b72e4-0468-49c3-ab2a-c225e2149dfb",
                        "created": "2019-01-26T07:52:22Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "_createdAt": "2019-01-26T07:52:22Z",
                        "_id": "external-import-596b72e4-0468-49c3-ab2a-c225e2149dfb",
                        "_type": "review"
                    },
                    {
                        "_id": "external-import-b9d903fb-87df-4acb-be0b-712425fef568",
                        "created": "2019-01-08T00:26:17Z",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_createdAt": "2019-01-08T00:26:17Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "rating": 4,
                        "body": "The course was not as bad as some reviews suggest.  I actually enjoyed it maybe because I use all topics covered.  \n\nI have taken 5 courses in the OMSA programs (two CSE, two MGT, and one ISYE).  This was the most professionally run.  The professor was teaching and leading the office hours.   He monitored Piazza and addressed questions personally.  All expectations were communicated upfront and clearly.   The lectures, self-check questions, homework, and office hours were consistent in delivering the learning required and prepared students for the exams.  There was no surprise.  A lot of thought went into the design and execution of the course.     \n\nCan the course be improved? Absolutely. \n\nI can see why the content could be dry to some students, especially if they have not used any of it in real life.   I agree that it was very condensed.   If the concepts were used by the students, little memorization would be required.  They should make intuitive sense.   But many students didn’t have the management background.  I think the course could be improved by cutting some materials and provide real life contexts and examples to help students understand why it’s important to know.\n\nIf you plan to become a manager leading an organization, I recommend that you take this opportunity to spend more time really understanding the content of this course.",
                        "_type": "review",
                        "id": "external-import-b9d903fb-87df-4acb-be0b-712425fef568",
                        "workload": 8,
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "difficulty": 3
                    },
                    {
                        "id": "external-import-8d8f8d32-379e-4697-bd26-d89d4974f61a",
                        "created": "2019-01-04T14:51:19Z",
                        "difficulty": 2,
                        "_type": "review",
                        "semester": {
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "rating": 3,
                        "_id": "external-import-8d8f8d32-379e-4697-bd26-d89d4974f61a",
                        "body": "Easy class. Just don't fall behind.",
                        "_updatedAt": "2022-07-11T19:08:18Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LWtS",
                        "_createdAt": "2019-01-04T14:51:19Z",
                        "course": null,
                        "workload": 5
                    },
                    {
                        "workload": 4,
                        "_id": "external-import-f784d6a6-1eac-4bda-a729-3a4584104b31",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-12-26T15:01:38Z",
                        "rating": 3,
                        "body": "As others have mentioned, this course contains no analytics. It's a survey of some concepts covered in a MBA. The financial portions of the course are helpful and important to understand in the business world. The lectures are a ton of videos to watch on edX, and the office hours consist of a brief review of material followed by Q&A. I recommend watching both the lectures and office hours (at a later date) at 2x speed. Take some notes or use some notes from previous semesters and review those for the exams -- this will save a lot of time compared to going back through the videos. The first exam was harder than the second, it contained a good amount of finance formulas that you will need to memorize. Overall, the course could be improved a lot (more project/case based work) but it's not too difficult if you stay on top of the content.",
                        "difficulty": 2,
                        "id": "external-import-f784d6a6-1eac-4bda-a729-3a4584104b31",
                        "created": "2018-12-26T15:01:38Z",
                        "course": null,
                        "semester": {
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3"
                        },
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2018-12-26T09:38:52Z",
                        "workload": 3,
                        "id": "external-import-191afa20-78a4-4855-b651-1dddd451195e",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "body": "It wasn't too bad. The content breadth is pretty huge, and need a lot of memorization for the exam. However, the professor, Dr. Flury, was one of the most responsive faculty that I've seen, and most of our questions were effectively covered by him or the TAs. I also have the same sentiment on the lack of connection to analytics, but overall is a watered down & crammed version of MBA, which allowed me to see the things that I could not see before. A great introduction to the world of business, albeit rather unrelated to analytics by itself. Prof. Flury also announced some planned changes, so look forward to it.",
                        "rating": 4,
                        "_id": "external-import-191afa20-78a4-4855-b651-1dddd451195e",
                        "created": "2018-12-26T09:38:52Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "difficulty": 2,
                        "_type": "review"
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 1,
                        "id": "external-import-9c7e94fd-5c4f-4851-a70d-d92fcccaf8b1",
                        "created": "2018-12-17T17:17:30Z",
                        "_type": "review",
                        "workload": 6,
                        "semester": {
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer"
                        },
                        "_createdAt": "2018-12-17T17:17:30Z",
                        "body": "(I took this class in Fall 2018, but the option is not available.) I thought the negative reviews of previous students were exaggerated; I found they weren’t. It’s not that the material is not interesting; the grounding in Financial and Management topics would be very useful. The problem is that this course is way too ambitious regarding breath (too many topics), coupled with sub-standard course delivery. Concepts are explained superficially, very difficult to grasp even if you watch the lectures repeatedly. Once a week there will be a very lengthy phone conference with the class director who tries to make up for the lousy lectures; but it doesn’t work, because the lectures are not good in the first place. (One positive note: Dr. Flury is very responsive on Piazza, and he seems to care about student’s success.) I’m happy with my B because I was close to a C, and I was just so happy when it was finally over!  This is my 6th class in the OMSA programme, and it is by far the worst. I am very disappointed and consider it an utter waste of time.  One advice: Don’t take this class; opt out if you can.",
                        "course": null,
                        "_id": "external-import-9c7e94fd-5c4f-4851-a70d-d92fcccaf8b1",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3
                    },
                    {
                        "body": "First and foremost, I should say that this class isn't ***hard*** -- I got an A in the class without too much effort, BUT, the format of the class sucks.\n\nNext, I should lead by saying that I can't fault Prof. Flury: he was very responsive, worked hard, and explained the material clearly.\n\nHowever, as others have stated, this is ***at least*** 5 (or more, 7 total modules) distinct classes rolled into one. Yet, for whatever reason, 80% of your grade is constituted over two exams: a mid-term, and a final. There's just way too damn much material tested on each.\n\nGiven that all of the grading was done electronically, a far more effective strategy would've been to have a test/quiz/exam **per topic**. That way, the student can focus 100% on going in-depth on each respective topic / subject matter. Instead, you're tested on your memorization skills related to (on the order of) ~50 hours of video content per test, some of which comes from random \"passing comments\" in the lectures, memorizing bulleted lists or the ordering of sequence of steps (eg. \"what was the 3rd step in...\"), etc...\n\nThis was actually the first class I took as part of the OMSA program, and in addition to seriously making me reconsider whether or not I wanted to continue with the program, I decided ahead of time that, if for whatever reason I had to take this course again, I would've sooner dropped out than had to suffer through this class a second time.\n\n**TL;DR**: This class isn't hard and the material is midly interesting, but there's ***so*** much subject matter covered per exam that... well, get ready for two \"mad dashes\" to memorize it all in preparation for the exams.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "workload": 3,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20"
                        },
                        "id": "external-import-03845da5-6848-4e1c-a9dd-a7edf9c2a4ee",
                        "created": "2018-12-13T21:50:49Z",
                        "rating": 1,
                        "_id": "external-import-03845da5-6848-4e1c-a9dd-a7edf9c2a4ee",
                        "_createdAt": "2018-12-13T21:50:49Z",
                        "course": null
                    },
                    {
                        "_type": "review",
                        "rating": 4,
                        "semester": {
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "_id": "external-import-89519a38-56e2-463d-98b2-6fce97edbc5b",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-12-12T13:43:21Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "difficulty": 2,
                        "workload": 6,
                        "body": "# Strengths\n\n**(1) On class coordination** -- Professor Flury and the TAs were very responsive on Piazza, engaging via videoconferences, and gave good updates and feedback on Piazza/Canvas as needed.\n\nI felt that we were well taken care of and that Prof. Flury was really invested in making the class an organized, engaging one despite being done virtually. Kudos to Prof. Flury and the TAs!\n\n**(2) On content** -- I learned a lot of new stuff from all of the professors. I liked how they showed expertise in their own fields and answered questions from students well.\n\n# Weaknesses\n**(1) On content relevance** -- As part of the OMSA core curriculum, there's a lot the course can improve on to be more relevant to Analytics students. There has been some attempts (e.g., via the \"Digital Marketing podcast\" under Marketing module) but the integration could be more explicit across the different modules.\n\n**(2) On content delivery** -- OK in general (via video lessons and video conferences), but I found module 5 (Marketing) in particular to be very jargon-heavy and sometimes redundant. Similarly, most of the self-assessment questions and final exam questions on Marketing favor a rote memorization type of learning, which isn't helpful since we'll forget them in the long-run anyway.",
                        "id": "external-import-89519a38-56e2-463d-98b2-6fce97edbc5b",
                        "_createdAt": "2018-12-12T13:43:21Z"
                    },
                    {
                        "_type": "review",
                        "rating": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-0824e44b-b9db-403c-82e5-3c0232cb8745",
                        "course": null,
                        "semester": {
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2018-3",
                            "_updatedAt": "2022-07-22T00:47:27Z",
                            "startDate": "2018-08-20",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IOTT"
                        },
                        "_id": "external-import-0824e44b-b9db-403c-82e5-3c0232cb8745",
                        "body": "Required course without a connection to analytics. I found it a bit boring because I wasn't very interested in the concepts covered (accounting, corporate finance, marketing, business strategy) but seems to give you a good introduction to these topics. Professor Flury was very accessible and I thought all the assignments/exams were fair. A couple tips:\n\n1. Don't buy the course packs, all the exam questions are covered in lecture or the weekly videoconferences.\n2. The videoconferences dragged well past an hour quite often. I recommend skipping them and instead downloading to listen at 1.5x+ speed later.\n3. There was only one homework after the midterm so it's super easy to stop watching lectures for awhile but then it becomes a real slog to get through them before the final. Try to keep up with the pace the professor recommends or at least not get too far behind it. \n4. Make flashcards using a system like Anki as you watch lectures so you can do a few a day and cut down on cramming before exams.",
                        "created": "2018-12-11T18:00:43Z",
                        "workload": 8,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 2,
                        "_createdAt": "2018-12-11T18:00:43Z"
                    },
                    {
                        "rating": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_id": "external-import-e4750e9b-8531-4bc7-9a4f-c3a51285306b",
                        "created": "2018-12-07T15:05:22Z",
                        "_createdAt": "2018-12-07T15:05:22Z",
                        "course": null,
                        "workload": 6,
                        "body": "There are two distinct phases of this class:\n\nPre-mid-term: Homeworks and mid-term consist of extremely detailed implementation of financial statements, managerial accounting, and financial analysis. There is math and memorization of equations.\n\nPost-mid-term: No homeworks, just a final exam that consists of regurgitation of dozens of hours of recorded lecture, along with \"office hours\" which are an extension of the lecture. No math and memorization of phrases.\n\nIf there was anything that would improve the course, it would be an individual project that integrates the 5 different instructors into one cross-cutting application.\n\nIn the absence of that, you have 5 courses condensed into one, assessed using multiple choice.",
                        "difficulty": 3,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-e4750e9b-8531-4bc7-9a4f-c3a51285306b"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "workload": 8,
                        "_id": "external-import-267b0d30-354b-47f7-9ad3-e4c4ace81a6a",
                        "created": "2018-08-06T14:09:22Z",
                        "_createdAt": "2018-08-06T14:09:22Z",
                        "rating": 3,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "course": null,
                        "body": "I took this class on its own in a condensed summer term, and I found that worked well. I even took about 2 weeks off after the midterm and was still able to manage the material.\n\nCourse Work Format: Lots of weekly video lectures, plus weekly office hour sessions (live or recorded) that review the material and answer questions; 3 multiple choice (but problem based) homeworks before the midterm; a midterm (2.5 hours, 40% of grade) and a final (2.5 hours, 40% of grade). Final is not cumulative. Exams generally have a buffer of about 8% extra credit (aka max score is 108/100), so the curve in the class is nothing or minimal (2-3%).\n\nRecommendations: 1) Don't get behind with the videos; they're not the most interesting, and there are A LOT of them. However, if you watch 3-4 hours per week, you'll easily stay on schedule and feel less overwhelmed at the end; 2) Make notecards, either as you go or as a review tool when you're studying.\n\nOverall thoughts: The class requires quite a bit of memorization in order to do well on the exams, but overall is fairly easy and the exam questions are generally reasonable. (The exception to this being some of the calculation questions on the midterm... make sure you know how to do long term present value calculations quickly on your simple computer calculator- you can open a text file to write out the calculation and copy and paste into the calculator). The material could be interesting if it went more in depth, but because it is at a surface level it can be hard to understand the \"why/how\", and you end up just memorizing everything. If you can, place out of this class. If you can't, I recommend taking it as a single class over the summer, or paired with a more homework or project-based class; keep on top of the videos and memorize as you go and you'll be fine. Not the most interesting class, but it's required and it's not awful.",
                        "id": "external-import-267b0d30-354b-47f7-9ad3-e4c4ace81a6a"
                    },
                    {
                        "workload": 7,
                        "id": "external-import-6f0f41b7-ed1b-473b-8836-dbae31916223",
                        "created": "2018-08-03T17:04:34Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 2,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 4,
                        "semester": {
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z"
                        },
                        "body": "If you have some background in business, I would definitely recommend you ask to substitute. The material is very crammed, and since there are only 4 HWs which make up a chunk of your grade, there is very little opportunity to go wrong. There is a lot of memorization for the final and if you are not good at that, then this course may not be for you.",
                        "_createdAt": "2018-08-03T17:04:34Z",
                        "course": null,
                        "_id": "external-import-6f0f41b7-ed1b-473b-8836-dbae31916223"
                    },
                    {
                        "course": null,
                        "_id": "external-import-7f47286f-8a43-4fdd-83bf-156db6de5408",
                        "body": "I enjoyed this class.  I was apprehensive about taking this class as the reviews on OMS Central aren't great.  However, I found the class to be interesting and engaging.  I also believe that Professor Flury did a great job explaining concepts and answering questions on the forum.  The material *can* be a little dense since you're compressing an introduction of Accounting, Financial Analysis, Strategy & Innovation, and Marketing into a single semester.  However, I actually enjoyed the subject matter.  I would recommend this course.",
                        "difficulty": 2,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 4,
                        "workload": 10,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-7f47286f-8a43-4fdd-83bf-156db6de5408",
                        "created": "2018-08-03T14:03:46Z",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        },
                        "_createdAt": "2018-08-03T14:03:46Z"
                    },
                    {
                        "_id": "external-import-deb126e6-ba34-4597-b01a-370b0d88d5a7",
                        "body": "Course Modules - Many hours of video to watch. Make sure you get the information the first time or you will be watching it all over again preparing for the tests.\n\nTest - As long as you give it the college try and put in a solid effort (~1-2 day) study for each exam, it is reasonable to land an A. That doesn't change the fact that because the exams are 80% of total grade, they are pretty high stress running up to taking the test.\n\nAssignments - Pretty light workload. For the first half, there are only (3) assignments which will take 1-2 hours. Because the assignments count for 20% of your grade, you will spend more time checking your work 5 times over to insure you didn't make a silly mental error than actually doing the assignment. There are no assignments the second half of the course. One could theoretically just cram for the final for a couple days at the end and (maybe) end up fine, although that would be one hella weekend.\n\n\nFull disclosure: I received an A in the course and thought it was OK, material wise. Would have much rather taken a more analytical elective over this course, because...you know, MS Analytics. Therefore, if you have any remote academic knowledge in the business field, I would recommend you attempt to Opt out and replace with something else.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "created": "2018-08-02T15:49:51Z",
                        "_createdAt": "2018-08-02T15:49:51Z",
                        "_type": "review",
                        "rating": 3,
                        "workload": 5,
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "id": "external-import-deb126e6-ba34-4597-b01a-370b0d88d5a7",
                        "difficulty": 2,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14"
                        }
                    },
                    {
                        "_id": "external-import-a1f58c11-eea0-4c18-8cab-b3b07574c744",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 3,
                        "_createdAt": "2018-08-02T13:31:09Z",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "course": null,
                        "created": "2018-08-02T13:31:09Z",
                        "semester": {
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester",
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "workload": 3.5,
                        "rating": 3,
                        "body": "This course was a lot of information being dumped on you that you are expected to regurgitate for exams. While some of the info was good to know, the teaching modality didn't facilitate effective learning. There were 3 homeworks before the first exam and then none after. If you aren't keeping up with the multitude of lecture videos then you will fall behind. Exam questions have a tendency to be poorly written.",
                        "id": "external-import-a1f58c11-eea0-4c18-8cab-b3b07574c744"
                    },
                    {
                        "rating": 2,
                        "course": null,
                        "workload": 4,
                        "id": "external-import-c16b449c-085b-4c23-8dac-0de0fe65965e",
                        "created": "2018-07-30T15:33:53Z",
                        "_id": "external-import-c16b449c-085b-4c23-8dac-0de0fe65965e",
                        "difficulty": 2,
                        "_type": "review",
                        "body": "This course is a very basic intro/survey to business concepts. This was lower quality than any OMSA course I have taken so far. It felt like a free MOOC - watch precorded video, answer multiple choice questions, repeat.\n\nThe course instructor is definitely very available and communicates clearly. If you wanted to dig deeper and ask questions, he would make time to engage with you and discuss. However, the course assignments/lack of projects cause this course to be mostly an exercise in how well you can retain info from a video rather than using critical thinking. \n\nI did not experience an excessive amount of memorization that others have commented on. However, it may be that I just had an easier time remembering the different concepts from the videos.\n\nThe course did not require much time, which prevented it from being too frustrating. The main disappointment was that this felt like a credit hour filler that could have been replaced with another meaty technical elective.",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_createdAt": "2018-07-30T15:33:53Z",
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z"
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "rating": 4,
                        "difficulty": 2,
                        "_id": "external-import-2074c853-7e27-4ab7-bb1a-56da55a3d9a2",
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 12,
                        "semester": {
                            "term": "summer",
                            "_id": "external-import-2018-2",
                            "_updatedAt": "2022-07-22T00:47:38Z",
                            "startDate": "2018-05-14",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "3eqo578hxQNJIGFal0IQGu",
                            "_type": "semester"
                        },
                        "body": "There are a lot of poor reviews for this class, and while I agree with some of the critiques, I did not find this the horrible course it has a reputation for being.  There was a tremendous amount of subject matter to learn, unquestionably.  Each of the modules could have been a full course in its own right.  Also, it IS true that the course does not directly make the connections to analytics.  However, it provides a really solid framework to a lot of business topics that you need baseline information about in order to be effective.  My primary critique is that the material is not always laid out in the best possible way for students to make connections and really tie the information together into a cohesive whole.  Additionally, the sheer number of lectures is pretty painful to get through - if the material is optimized, it might not require so many.",
                        "_createdAt": "2018-07-28T19:02:26Z",
                        "_type": "review",
                        "id": "external-import-2074c853-7e27-4ab7-bb1a-56da55a3d9a2",
                        "created": "2018-07-28T19:02:26Z",
                        "course": null
                    },
                    {
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "rating": 4,
                        "course": null,
                        "_createdAt": "2018-05-23T16:41:17Z",
                        "_id": "external-import-ab8fe747-1389-429d-b587-7bed94e3714f",
                        "difficulty": 2,
                        "_type": "review",
                        "workload": 6,
                        "body": "Personally, I didn't think this course was nearly as bad as most other people.  I did an economics minor during my undergrad, took a few other business courses, and work for an insurance company so perhaps that made the material seem a little more interesting and applicable to me.  A lot of the information about marketing and strategy is very helpful for understanding why the company I work for makes certain decisions.\n\nThe homework assignments seemed fairly easy and the most difficult exam questions would be very similar.  Some of the exam questions would be asked about small unimportant details, which was annoying, but each exam had an opportunity for extra credit so it seemed somewhat fair.",
                        "semester": {
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "id": "external-import-ab8fe747-1389-429d-b587-7bed94e3714f",
                        "created": "2018-05-23T16:41:17Z"
                    },
                    {
                        "created": "2018-05-11T18:26:31Z",
                        "workload": 6,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08"
                        },
                        "_id": "external-import-6a6e3806-d850-4a42-abe8-a265b74293bf",
                        "difficulty": 4,
                        "body": "This course is so bad that I am struggling to decide where to start. I have an MBA from a top B-School outside of US. I was eager to experience the US B-School education and hence, mistakenly, did not apply for a waiver. Getting into the course, I had lofty expecations. However the reality was very depressing. It seems the person who put together the syllabus decided that stitching together hundreds of 20 minutes rambling by a mix of uninterested professors from Accounting, Marketing, Finance and Strategy is enough to make OMSA students fork out a thousand dollars for this course. On top of that, they will make you buy study packs to line the pockets of the professors (do not buy them, you will not miss anything). There is no rhyme or reason on why certain topics were included or emphasized (quick example: Venture Capital investments, dilutions etc.). I pity the on-campus MBA students who have to endure such torture after paying 50 grands per year. \n\nThe grading system is designed to penalize the students. All the emphasis is on 2 big ones: mid-term and end-term. If you mess up any one, you are toast. There is no project, no case study to work on and no analytic assignment. At least they should try to be honorable and stop the blatant cheating: Pls. remove the term \"for Analytics\" from \"Business Fundamentals for Analytics\".\n\nIn short, try not to take this course and apply for waiver. If you cannot, avoid taking this at the start of your association with Gatech. Else you will lose respect for US education. I only retained my sanity since I was also pursuing an interesting course from ISYE. Godspeed!",
                        "id": "external-import-6a6e3806-d850-4a42-abe8-a265b74293bf",
                        "_createdAt": "2018-05-11T18:26:31Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "course": null,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "_type": "review",
                        "rating": 1
                    },
                    {
                        "id": "external-import-6da20cb9-5bd9-4b71-8478-100609b30918",
                        "created": "2018-04-30T14:43:41Z",
                        "_id": "external-import-6da20cb9-5bd9-4b71-8478-100609b30918",
                        "rating": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "workload": 5,
                        "semester": {
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester",
                            "term": "spring"
                        },
                        "difficulty": 2,
                        "_createdAt": "2018-04-30T14:43:41Z",
                        "course": null,
                        "body": "Disclaimer: I am pursuing the Business Analytics Track and I had exceedingly low expectations based on past reviews. \n\nThough it was boring at points and clearly not tailored at all to the OMSA program/students, I really enjoyed this course. I had no previous business coursework and learned a lot. I was affirmed in my decision to pursue the business analytics track and found most of the concepts intuitive.  I also appreciated how little time I had to spend on the material each week.\nHowever, I can definitely see why so many students ripped on it from last semester, and If you are not accostomed to the more route memorization style of class then your may be frustrated in this course.\n\nHomeworks were challenging, but fun and I liked getting to see and get familiar with real-world financial statements. It is very possible to get 100% on all of the homeworks. \n\nThe tests on the other hand are super tricky. I got all of the computational, high point value questions corrrect, but the low-value multiple choice questions are killer and landed me with a 75% on the Midterm (yet to take the final). However, 75% was the average score and if I retained/recalled 75% of the insane amount of material we covered then I am happy.\n\nDr. Flurry though short and salty at times, but overall nice. He is SUPER responsive and over communicates so that there is no confusion about expectations, deadlines, etc. This was refreshing as none of my other course professors have been this involved and accessible.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review"
                    },
                    {
                        "_id": "external-import-c18d641c-471f-426e-bec0-e7a0cf3e43bf",
                        "difficulty": 4,
                        "_rev": "Gng42kcwkgwKuUtBk2LW7q",
                        "body": "This class is incredibly poor. The material is basically a frankenstein of business undergrad core classes in managerial & financial accounting, marketing, finance, entrepreneurship and management. If you enjoy long, dry videos, powerpoints with clipart diagrams and a punishing method of grade distribution, this is the course for you.  \n\nWhile the material may be uninspiring, the course structure is something the instructors could easily fix. There are 6 opportunities to earn points throughout the entire semester, which leaves very little room for error. Additionally the exam questions are full of opaque wording and seemingly arbitrary distinctions. Some questions ask you to select all the potentially correct answers from a list many options with no credit for partially correct answers, a decision which is truly baffling to me. \n\nThe instructor is responsive on Piazza at least, however that doesn't make up for the fact that the course is bad. Take your vitamins and power through it if possible. Make sure you're on top of your game on the homeworks and especially the two tests since they account for 80% of your grade, or else you may get a second crack at it when retaking the course.",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "rating": 1,
                        "workload": 5,
                        "course": null,
                        "semester": {
                            "term": "spring",
                            "_id": "external-import-2018-1",
                            "_updatedAt": "2022-07-22T00:47:47Z",
                            "startDate": "2018-01-08",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "hYpuG860ZzKHD47MHFRHKv",
                            "_type": "semester"
                        },
                        "id": "external-import-c18d641c-471f-426e-bec0-e7a0cf3e43bf",
                        "created": "2018-04-28T22:58:10Z",
                        "_createdAt": "2018-04-28T22:58:10Z"
                    },
                    {
                        "id": "external-import-34f84e19-b75b-471f-9624-f2edd0cc9f70",
                        "created": "2018-04-03T22:32:47Z",
                        "_type": "review",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 8,
                        "_id": "external-import-34f84e19-b75b-471f-9624-f2edd0cc9f70",
                        "body": "The overall presentation of this course left much to be desired. The professors could have been replaced with books and supplementary powerpoints and the course would have been more effective. Instead, we have topics consisting of a string of 20-minute videos of powerpoint readers that, on average, contained the efficacy of prescription-strength Ambien on a warm summer day. Few, if any, of the topics had anything really to do with Analytics as we can expect to use it in real life, and caused students to wonder who was paid off to make the class required. Towards the end of the class I found myself both 1) not learning anything and 2) just trying to score enough points to finish the class...which brings me to grading. \n\nOn grading, there were questions present on homeworks and exams that could have been based on information that wasn't in the printed notes, but touched on during lecture for about five seconds. When lectured on in detail, some of the presentation methods could be construed to be contradictory (or flat-out wrong in a couple of cases) and required confirmation in the human-led sessions. When it came time for the exam (or sometimes even the homeworks), god forbid if your flashcards or whatever memorization method failed you in that time period you immediately lost 1-4% from your final grade. \n\nOne could argue that every part of the class design achieved the needs and objectives, and full disclosure the final score was a mid-B. But looking back, I've completely forgotten some 80% of the course material and paid some good money only to have for three credit hours and traumatic memories to show for it. If Dr. Jayaraman's argument of a happy customers being the most important part of a business's survival holds true, this class needs a complete overhaul to deliver a more positive, conducive learning experience.",
                        "rating": 1,
                        "course": null,
                        "_createdAt": "2018-04-03T22:32:47Z",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        },
                        "difficulty": 4
                    },
                    {
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 4,
                        "_createdAt": "2017-12-19T15:17:38Z",
                        "_type": "review",
                        "body": "This class is terrible.  For one, the material is way too dense, and the professors (there are multiple professors) think shoving in a lot of videos every week will suffice.  Also, there's a textbook and these Harvard course packs listed on the syllabus which come out to $150.  We were told later that they weren't needed.  But since  this is a business course, the professors of course would love to line up their pockets for material that they sell (Prof. Flury is the author of the textbook).  \n\nMoving on to TAs.  They were terrible.  They never answered the questions at hand.  It's as if they simply sought to get credit for answering questions in a perfunctory fashion, not elaborating on the answers beyond what was mentioned in class.  \n\nExams were tough in the sense that they required VERY specific memorization.  You couldn't miss an iota of information to get a decent score.  And the exams did NOT allow for partial credit, despite questions in the form of \"select the options below that...\"  So, if you don't know the 4 correct ambiguous answer choices, you don't get any credit.  \n\nThis course embodies not practicing what they preach:  A chunk of the course focuses on \"Strategy & Innovation\" and they preach about companies who couldn't adapt.  Well, this course simply tries to shoehorn conventional in person education into an online format.  It just doesn't work.  \n\nFor full disclosure, I received a B (86%).  I'm not really bitter about my grade.  Sure, an A would've been nice.  But I simply stopped caring towards the end.  I was just eager to finish the course.\n\nThis course left a bad taste in my mouth for GATech's program overall.",
                        "created": "2017-12-19T15:17:38Z",
                        "_id": "external-import-4bccd85d-cf12-4a18-af4a-eebaee160ad3",
                        "course": null,
                        "workload": 10,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "semester": {
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z"
                        },
                        "id": "external-import-4bccd85d-cf12-4a18-af4a-eebaee160ad3",
                        "rating": 1
                    },
                    {
                        "id": "external-import-f9f436f9-bcb3-49c1-8631-b9480bae3228",
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        },
                        "_id": "external-import-f9f436f9-bcb3-49c1-8631-b9480bae3228",
                        "difficulty": 5,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "workload": 10,
                        "created": "2017-12-17T02:34:48Z",
                        "_createdAt": "2017-12-17T02:34:48Z",
                        "_type": "review",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "rating": 1,
                        "body": "Alot of people seem to be discussing the class, but that is only half of what is completely wrong with this course. The other half is the head instructor. Dr. Alan Flury is most likely the biggest jack-ass you will ever meet. He is unable to admit fault with himself, even when he is clearly wrong. He is basically what would happen if you had Donald Trump run a business class. The OMSA program and Georgia Tech should all do themselves a favor and just fire this man.  He is toxic. He is disgustingly rude. He is about as personable as the Ebola Virus. If you misunderstand any concept that is ambiguous in the class, it cannot possibly be his problem, it must be that the students are morons. Or the students just are not getting it. But it is never his issue, it is always ours. If we do have the audacity to say he has done something wrong, instead of admitting his error, he will double down on his wrongness. He gets unnecessarily defensive. I am in complete awe of how a man with such a disgusting behavior is any where close to an academic institution. This man is a disgrace and an embarrassment to Georgia Tech. He runs the class like a prison. He thinks it is better for the homeworks to be these all-or-nothing multiple choice questions that do not help with learning, but test what you have learned through the videos. I feel like he made this class unnecessarily difficult, purposefully. I think he has some deep-rooted Napoleonic Complex that he needs to get checked out by a psychologist. I could go on, but this man is just awful, pure and simple."
                    },
                    {
                        "created": "2017-12-15T20:33:05Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        },
                        "_createdAt": "2017-12-15T20:33:05Z",
                        "course": null,
                        "id": "external-import-56694ac1-3abc-426e-b107-9a2c3d097e0f",
                        "_type": "review",
                        "rating": 1,
                        "workload": 4,
                        "_id": "external-import-56694ac1-3abc-426e-b107-9a2c3d097e0f",
                        "difficulty": 3,
                        "body": "OMS Analytics Admin - If you are reading this, please, for the sake of the program and even for Georgia Tech as a school, do not offer this course in its current state, ever again. It is a disgrace to student taking time away from busy life and want to learn something useful. \n\nI hated this class with a passion. I got an A out of this class so this is nothing personal. But boy was I disappointed.       \n\nThis is going to be long. Here’s the tl;dl: If you hold a business degree in either undergrad or MBA, definitely absolutely opt-out of it. You won’t learn anything new. If you can’t opt-out, perhaps wait until they rework this class. With the numerous negative reviews I think/hope they will have to do something about it.        \n\nHere we go…       \n\nFirst I should say I don't have a problem with learning accounting, costing, finance, marketing, strategy. In fact I still consider the very existence of business classes in the curriculum to be one of the highlights of Georgia Tech’s analytics degree program. But this class is just horrible. It has “Analytics” in the name, is one of the few (3?) classes created specifically for the analytics program (all others are existing classes from other majors). But throughout the class the professors hadn’t mentioned it even once, except perhaps the couple of times when they referred to us. They did not even attempt to relate the material to analytics at all. And it shouldn’t be difficult. I don’t expect them going into much detail on the “how” – that’s for the next class, but it should be very easy to at least mention areas of application. For example, in valuation there was this comparable method, in marketing there was market segmentation and evaluation of advertising. All have obvious links to analytics. They could have just spent a minute linking them to analytics concepts like clustering, design of experiment, etc. But nope there was none of that.        \n\nAnd then there was the teaching itself, which was a complete opposite of the awesome ISYE6501 where the videos were concise, to the point and easy to follow. This class had long (10-15 mins) videos where the professors were just reading from the scripts. A couple professors at least make some better PowerPoints slides, but the last professor would put a whole paragraph of text on the slide while he talk on and on. On the forum the professors (mostly just the main one since he was the one who interacted with us) were not exactly helpful. They could get impatient and defensive really fast. They probably thought we were either asking stupid question or trying to be smartasses. Their attitude really discourage learning. They could even get borderline rude. There was this one time when a student asked for clarification on one of the frameworks, and he would say, and I quote: \"Why don’t you google John Kotter read more about his approach\". Go figure.        \n\nEven worse was the homework and exams. For machine grading purposes, just about everything was multiple choice, with no chance of partial credits. You would be asked to do multi-step problems that involved creating a balance sheet or multi-year NPV calculation (by hand In exams!). If you made one single mistake you would lose all points – it could amount to a whole point (homework) or even 3 points (exam) on your *course* grade. Other non-math problem tended to ask about the tiniest detail of the material. There were also select-all-true (and sometime all-false! Better be careful!) from 5-10 boxes and again they were all-or-nothing. All of these made the homework and exams very stressful.        \n\nAgain, my grade turned out ok. But I just hated wasting 3 credit hours on this class when there are so many interesting electives out there. Avoid it at all costs unless/until you hear better reviews in the future."
                    },
                    {
                        "_id": "external-import-8515a140-d9d3-4d9e-9c96-ed36f26ebbfd",
                        "body": "This course is an amalgamation of 5/6 semesters of undergrad business administration courses -- Financial Accounting, Managerial Accounting, Corporate Finance, Marketing, and Strategy.  Videos were long, un-engaging, and not interconnected between sections.  Overall though grading is fairly generous and workload is very light.  If you have a Business Admin undergrad or MBA, I'd highly suggest seeing if you can opt-out.",
                        "difficulty": 2,
                        "semester": {
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall"
                        },
                        "id": "external-import-8515a140-d9d3-4d9e-9c96-ed36f26ebbfd",
                        "created": "2017-12-13T16:11:13Z",
                        "course": null,
                        "workload": 5,
                        "rating": 2,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "_type": "review",
                        "_createdAt": "2017-12-13T16:11:13Z",
                        "_updatedAt": "2022-07-11T19:08:17Z"
                    },
                    {
                        "id": "external-import-614195be-8299-47ec-b44f-0ab23dda55e4",
                        "created": "2017-12-12T21:21:59Z",
                        "_createdAt": "2017-12-12T21:21:59Z",
                        "_id": "external-import-614195be-8299-47ec-b44f-0ab23dda55e4",
                        "body": "As a graduate of OMSCS and someone who is a good ways through the new OMSA program, I can say this is, by a wide margin, the worst course I have taken as a graduate student on all metrics. The lectures are twenty minute sleeping pills where a menagerie of different professors read slides verbatim and provide long, rambling, and excessive examples to the point of further confusion. The course content is all over the place and seems hastily assembled, as if someone just concatenated four standard-length courses into a Frankenstein's monster of business school intro courses. Grades are few and far between (the two exams count for 70% of the grade), and the professor (the one of four presumably in charge) seems to have little if any grasp on online quiz structure, having involved, high point value multi-step questions for which there is no partial credit (e.g. \"Select the correct eight of these fifteen possible answers\"), and incorrect responses that seem to want to actively trick students into wrong answers instead of guiding the learning process. On Piazza, when the professor chooses to make an appearance, he is usually combative and seems to often resent the sheer audacity of those who may want to actually learn this material. The course would be a poor refresher for those pursuing an MBA, and seems especially inappropriate for those pursuing a degree in computational analytics. Towards the end it became clear that at no point would any of the material actually tie into analytics, making it even further baffling that this course is foundational for the analytics program at Georgia Tech.\n\nFor those considering taking this course, I can simply suggest you put it off as long as possible, in hopes the course will be reworked or removed altogether.\n\nFor those responsible for building and administering OMS programs, I can only say this course is an embarrassment and actively damages the reputation of the OMS community.",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "difficulty": 4,
                        "_type": "review",
                        "rating": 2,
                        "workload": 10,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        }
                    },
                    {
                        "workload": 6,
                        "id": "external-import-63ed1450-b47f-4381-bad3-db91e071c66c",
                        "created": "2017-12-12T08:44:47Z",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review",
                        "rating": 2,
                        "_id": "external-import-63ed1450-b47f-4381-bad3-db91e071c66c",
                        "_createdAt": "2017-12-12T08:44:47Z",
                        "body": "As someone with zero business background from undergrad, I did feel like 6754 crammed in a wide-ranging survey of business topics that gave me a good feel for the terrain. The content was quite enlightening for me in that sense. Do I now know what's in a corporation's financial statement and what the parts of a balance sheet mean? Yes. How to carefully break down product costs? Yep. How VCs generally work and how they'd value a startup? Check. How marketers focus on segmentation, targeting, positioning, and those famous 4 P's? Right. What the heck business strategy consultants think about? Roger. None of which I knew before. For that I'm grateful.\n\nHowever, the presentation was extremely dry (like a video textbook, as another reviewer put it) and spent far too much time on minutiae instead of exploring big concepts, applying them on our own (which is how I really learn), or connecting them to analytics. I was expecting at least to do one project-type assignment, such as creating a mock business strategy or marketing plan, but no, that kind of deeper/applied thinking counted squat toward your grade. Instead, to satisfy the gradebook, you had to subject yourself to a merciless grind that I can only describe as memorizing shuffled decks of cards and hand-calculating answers to story problems that combine 7th grade math with financial jargon.",
                        "course": null,
                        "semester": {
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21"
                        },
                        "difficulty": 3,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI"
                    },
                    {
                        "difficulty": 3,
                        "course": null,
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_createdAt": "2017-12-11T19:15:35Z",
                        "body": "This class is terrible.  I hated it and every week regretted trying not to get a course waiver for it.  I have my undergrad in business, but I am always hesitant to skip courses as I feel that you can always learn something.  In the end, I learned very little in this class.  There are two major issues with this class, one the professors have no clue how to teach an online course in this format and two, the content of the class is too generic.  The clearest example of that is their videos.  The videos are basically just one hour lectures broken up into smaller segments.  The videos are too long and inefficient and some of them (strategy and marketing) end up sounding as if the professor is just reading out of a text book.  The videos are generally long and rambling.  It makes them hard to rewatch if you need to brush up on concepts.  There is very little in the way of graded assignments and no homework assignments that cover marketing or strategy.  When I finished the second finance homework (the last homework of the semester) is was Halloween and I didn't touch this class again for almost a month.   The exams are fine.  The no partial credit thing is brutal on the exams.  So many of the questions are of the \"Pick all that apply\" type and to miss one and get zero credit is dumb.  There are high point value finance questions that are quite involved where one small error could torpedo your answer and materially impact your grade.  On the final 28 of the last 108 points of the exam were tied up in four fairly involved financial calculations that you are doing with an on screen calculator (set aside the fact that only an idiot would not do this in excel or without a financial calculator).  \n\nThe content of this class also needs a rework.  This class is so generic that you could require it in ANY non business graduate program and the class would not need to be changed in any way.  Analytics is NEVER mentioned.  Even when you're in the marketing module where it is obvious that a detailed discussion of analytics could add value, it doesn't happen. The content goes way too far into the weeds.  I am studying to be an analytics professional not get an MBA.  Far too much time in finance and accounting was spent on how to low level detail calculations for things like NPV, weighted average cost of capital and activity based costing .  I can see needing to know what these are and how they are used, but I will never be asked to take this down to this level.  \n\nThe content of the course just reeks of laziness honestly. Either the business school doesn't understand how to do online education or they don't care.",
                        "created": "2017-12-11T19:15:35Z",
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "workload": 3,
                        "semester": {
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z",
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester"
                        },
                        "_id": "external-import-99df5810-f49b-4d61-ad68-e912ddd2f786",
                        "_type": "review",
                        "rating": 1,
                        "id": "external-import-99df5810-f49b-4d61-ad68-e912ddd2f786"
                    },
                    {
                        "semester": {
                            "startDate": "2017-08-21",
                            "_createdAt": "2022-07-05T23:07:36Z",
                            "_rev": "ZekwWJQOMa6mGjNYSN1o6U",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "external-import-2017-3",
                            "_updatedAt": "2022-07-22T00:47:57Z"
                        },
                        "difficulty": 4,
                        "_rev": "6dNgvzjgwH6OT4iz0DRwmI",
                        "created": "2017-12-11T02:10:23Z",
                        "_createdAt": "2017-12-11T02:10:23Z",
                        "workload": 10,
                        "course": null,
                        "_id": "external-import-5d1444bd-3801-41f5-86df-cefead59063c",
                        "body": "This class is in need of a top-to-bottom overhaul. Let's start from the top: a class called \"Business Fundamentals for Analytics\" should, at some point, mention \"Analytics\" somewhere. They didn't even try to connect it with the subject that 100% of its students came to study.\n\nInstead, this is a hodge-podge of (way, way too many) business concepts crammed together, taught with no connection to one another in four batches by four professors. The first lecturer, teaching business accounting, was absolutely atrocious. He clearly was just winging his way through his lectures, rambling with maybe a loose outline in front of him. Editing the transcripts into some semblance of a coherent study tool, it was possible to edit out 40-70% of the text without any loss of information, so redundant and bloated was the text. The second lecturer was marginally better, but his handwriting in the few problems we were given as examples was atrocious, and he would throw out acronyms without explanation.\n\nThere were far too few checks for understanding and practice problems, and then the homework and exams were brutally unforgiving. Accounting problems that would take 10-20 minutes to complete would have single, graded all-or-nothing multiple-choice submissions (and sometimes, fill-in-the-blank, better-get-it-exactly-right-the-first-time fields). All of the other choices were gotchas based on common errors you may have made because the inadequate teaching you received hadn't prepared you to do it exactly right. \n\nAnd then abruptly midway through the course, the graded homework stopped, replaced by a torrent of lectures -- nearly 100 more videos crammed full of micro-topics with no indication as to what was important, what would be tested on, what was intended to ground larger important concepts. The practice problems were absolutely all over the place, making it totally unclear as to what we could expect on the final. \n\nStaff didn't seem to care about student's concerns when these were voiced. Flury's most common response to students worried about their grade was that the grades overall were adequate. When students said concepts weren't clear, the typical response was essentially that, yes, they were. Oh, sorry, our bad, I guess.\n\nThis was my fourth online class through Georgia Tech and by far the worst. I thoroughly enjoyed the other three, and look forward to the rest of the program. Had MGT 6754 been the first I took, I would not have returned. The contrast is about what I would expect from a school with a top-ten-rated analytics program and a business school described by the Financial Times as \"third-tier.\"",
                        "rating": 1,
                        "id": "external-import-5d1444bd-3801-41f5-86df-cefead59063c",
                        "_updatedAt": "2022-07-11T19:08:17Z",
                        "_type": "review"
                    }
                ],
                "name": "Special Topics: Business Fundamentals for Analytics",
                "codes": [
                    "MGT-8803"
                ],
                "_type": "course",
                "_createdAt": "2022-07-05T23:23:15Z",
                "created": "2022-07-05T23:23:15Z",
                "tags": [],
                "programs": [
                    {
                        "acronym": "AN"
                    }
                ],
                "isFoundational": true,
                "rating": 2.442105263157895,
                "difficulty": 2.9473684210526314,
                "workload": 7.973684210526316
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "special-topics-business-fundamentals-for-analytics"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "isExperimentalCompile": true,
    "gsp": true,
    "scriptLoader": []
}