{
    "props": {
        "pageProps": {
            "course": {
                "slug": "special-topics-geopolitics-of-cybersecurity",
                "name": "Special Topics: Geopolitics of Cybersecurity",
                "_id": "bf855b15-bbfe-4fad-85e3-adab10efda1b",
                "syllabusUrl": null,
                "created": "2022-08-19T21:55:53Z",
                "creditHours": 3,
                "isFoundational": false,
                "isDeprecated": false,
                "_rev": "vLev53Cwnp4JOI2CCHqWOW",
                "programs": [
                    {
                        "acronym": "CY"
                    }
                ],
                "_updatedAt": "2022-08-24T17:44:35Z",
                "reviews": [
                    {
                        "authorId": "faps+IdSlP8Ef/qs7Sr0IQ==",
                        "workload": 6,
                        "difficulty": 2,
                        "rating": 5,
                        "id": "j07GwiPkUVDQQ5A5oHTMJO",
                        "_createdAt": "2023-12-17T14:04:19Z",
                        "course": null,
                        "_rev": "j07GwiPkUVDQQ5A5oHTMHc",
                        "created": "2023-12-17T14:04:19Z",
                        "body": "Overall great course! Took it as my 5th course along with Computer Networks (6th). I took it the first semester that it was open as an elective for OMSCS. \n\nThe material is super interesting material and the merging of International Relations and Cybersecurity was great. If you have any interest in geopolitics or gaining exposure to political theory through a CS curriculum, this is it. If you don't want it, skip. As someone in the defense industry, this was perfect for me.\n\nNot a difficult course; I'd say it is more difficult than the Digital Marketing class, but not by much. Course is divided into 4 modules, which have individual and group assignments due every 3-4 weeks. Easy A if you write well and READ THE RUBRIC so you dont lose silly points.\n\nOverall, no quizzes or tests, just writing assignments.\n\nThere are multiple readings that are done through Perusall which require you to read sometimes 100-200 pages in a browser and prevents file downloads to read offline/print. They are also documents about government, war, or strategy and not anything technical. Generally dry material but relevant for your writing assignments. (2-5 hrs per module)\n\nWriting assignments are shorts essays answering 3-4 questions about the topics discussed in the lecture modules. Typically 1 question per lecture section per module.  Took about 4-6 hrs each module to do and provide responses to other people's essays. \n\nThere is a group project the entire semester where you research a cyber attack and discuss its background, general methods, and strategy within the framework of the course. This is a non-technical paper by nature. You do it with 3-4 others and have 4 project assignments to do together. Like all groups, depends on the team effort. Divide and conquer, but ensure everyone pulls their weight. With a good team, everything is easy to manage. We had 5 group teams meetings to complete everything (1-1.5 hrs each meeting). Assignments are:\n\n1) 1 page summary of the attack and its relevance (3hr)\n2) a bibliography/timeline paper where you research the attack and collect & summarize sources (8hrs)\n3) a video presentation where you discuss methods and strategy (use ppt and record, then parse vids together. Or use MS teams and record) (5hr each member + time to rehearse and record)\n4) final 5000 word paper on the attack. (10hrs per person)\n\nOverall, if geopolitics and policy are interesting to you, use an elective and one of your 2 non-CS/CSE courses. It's easily paired with another course and worth the time for an interesting course. Skip if you value technical classes.",
                        "semester": {
                            "_createdAt": "2023-08-12T05:26:25Z",
                            "_rev": "Ge7QFtjd7Oo12iAJ8d1HFr",
                            "_type": "semester",
                            "term": "fall",
                            "_id": "fb19b4f4-c1e2-4848-b1c1-910e16d5267a",
                            "_updatedAt": "2023-08-12T05:26:25Z",
                            "startDate": "2023-08-21"
                        },
                        "_id": "j07GwiPkUVDQQ5A5oHTMJO",
                        "_updatedAt": "2023-12-17T14:04:19Z",
                        "_type": "review"
                    }
                ],
                "_createdAt": "2022-08-19T21:55:53Z",
                "id": "bf855b15-bbfe-4fad-85e3-adab10efda1b",
                "codes": [
                    "PUBP-8823"
                ],
                "_type": "course",
                "rating": 5,
                "difficulty": 2,
                "workload": 6
            }
        },
        "__N_SSG": true
    },
    "page": "/courses/[slug]/reviews",
    "query": {
        "slug": "special-topics-geopolitics-of-cybersecurity"
    },
    "buildId": "Vx7FtzSKkcCEIM1Zaf-DC",
    "isFallback": false,
    "gsp": true,
    "scriptLoader": []
}